<?xml version="1.0" encoding="ISO-8859-1" ?>

<!-- Simple schema for FreeBSD Project news.

     Divide time in to <year>, <month>, and <day> elements, each of which 
     has a <name>.

     each <day> element contains one or more <event> elements.

     Each <event> contains an optional <title>, and then a <p>.  <p> elements
     can contain <a> anchors.  Within the "href" attribute of the anchor
     $base will be replaced with the base URI necessary to reach the FreeBSD
     document root, and should always be used to start URLs at www.FreeBSD.org
     or one of the mirrors.

     Use the <title> element if the <p> content is lengthy.  When generating
     synopses of this information (e.g., for syndication using RDF files), 
     the contents of <title> will be preferred over <p>.
-->

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.10

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
-->

<news>
  <cvs:keywords xmlns:cvs="http://www.FreeBSD.org/XML/CVS" version="1.0">
    <cvs:keyword name="freebsd">
      $FreeBSD$
    </cvs:keyword>
  </cvs:keywords>

  <year>
    <name>2002</name>

    <month>
      <name>Avril</name>

      <day>
        <name>26</name>

        <event>
          <title>Mises &#224; jour des ports GNOME2 avec GNOME2 version beta4</title>

          <p>Tous les composants de la Plate-forme GNOME2 d&#233;j&#224; port&#233;s sur	
            FreeBSD ont &#233;t&#233;s mis &#224; jour avec les derni&#232;res versions incluses dans
            la distribution officielle de GNOME2 beta4.</p>
        </event>
      </day>

      <day>
        <name>6</name>

        <event>
          <title>Mises &#224; jour des ports GNOME2 avec GNOME2 version beta3</title>

          <p>Tous les composants de la Plate-forme de D&#233;veloppement GNOME2 d&#233;j&#224; port&#233;s sur 
            FreeBSD ont &#233;t&#233;s mis &#224; jour avec les derni&#232;res versions incluses dans
            la distribution officielle de GNOME2 beta3.</p>
        </event>
      </day>

      <day>
        <name>5</name>

        <event>
          <title>Joe Clarke devient committer</title>

          <p><a href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a> est
            maintenant committer (c'est &#224; dire qu'il a maintenant un acc&#232;s direct au d&#233;p&#244;t
            cvs). Sa principale pr&#233;occupation en tant que committer sera GNOME
            sous FreeBSD, aussi on peut s'attendre &#224; ce que les divers probl&#232;mes soient r&#233;solus encore plus rapidement qu'avant.
            Il est &#233;galement pr&#233;vu qu'il devrait r&#233;activer le port de GNOME2, 
            un peu en sommeil pour l'instant. Bienvenue &#224; bord, Joe!!!</p>
        </event>
      </day>
    </month>

    <month>
      <name>Mars</name>

      <day>
        <name>12</name>

        <event>
          <title>Sortie de Mozilla 0.9.9</title>

          <p>Mozilla 0.9.9 est disponible. Il apporte de nombreuses corrections de bugs ainsi que des nouvelles fonctionnalit&#233;s. 
            Le port FreeBSD a &#233;galement &#233;t&#233; mis &#224; jour. Cette nouvelle version est fortement
            recommand&#233;e &#224; tous les utilisateurs.</p>
        </event>
      </day>        

      <day>
        <name>11</name>

        <event>
          <title>Mises &#224; jour des ports GNOME2 avec GNOME2 version beta2</title>

          <p>Tous les composants de la Plate-forme de d&#233;veloppement GNOME2 d&#233;j&#224; port&#233;s sous
            FreeBSD ont &#233;t&#233; mis &#224; jour avec les derni&#232;re versions incluses dans la
            distribution officielle de GNOME2 beta2. Merci &#224;
            <a href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a> pour
            son aide.</p>
        </event>
      </day>
    </month>

    <month>
      <name>F&#233;vrier</name>

      <day>
        <name>10</name>

        <event>
          <title>D&#233;but du port de la plate-forme GNOME2 sur FreeBSD</title>

          <p>L'&#233;quipe de GNOME pour FreeBSD a commenc&#233; le travail initial pour faire
            fonctionner les diff&#233;rents composants de GNOME2 sous FreeBSD. Cela devrait prendre 
	    beaucoup de temps, cela dit une premi&#232;re s&#233;rie de ports
            concernant le noyau de la plate-forme GNOME2 devrait &#234;tre incluse
            dans les ports FreeBSD d&#232;s que possible.</p>
        </event>
      </day>
    </month>

    <month>
      <name>Janvier</name>

      <day>
	<name>31</name>

	<event>
	  <title>Le nouveau site web du projet GNOME pour FreeBSD est en place</title>

          <p>Le tout nouveau site du projet GNOME pour FreeBSD est en place. Nos plus grands remerciements
            &#224; toutes les personnes qui ont rendu cela possible, et en particulier &#224; <a
            href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a>
            et <a
            href="mailto:john_m_cooper@yahoo.com">John Merryweather Cooper</a>.
            </p>
        </event>

      </day>

      <day>
        <name>29</name>

        <event>
          <title>Ade est de retour !</title>

          <p>Le fameux <a href="mailto:ade@FreeBSD.org">Ade Lovett</a>, qui a &#233;t&#233;
            un des principaux fondateurs du projet GNOME pour FreeBSD, mais
            qui pour diverses raisons avait quitt&#233; l'&#233;quipe du projet GNOME pour FreeBSD en Juin 2001
            a d&#233;cid&#233; d'&#234;tre &#224; nouveau des notres. C'est une excellente nouvelle car nous
            avons encore beaucoup de choses &#224; faire et son aide associ&#233;e &#224; sa grande
            exp&#233;rience dans ce domaine sera tr&#232;s utile.</p>
        </event>

      </day>
        

      <day>
	<name>28</name>

	<event>
	  <title>Mises &#224; jour de plusieurs composants du noyau de GNOME</title>

          <p>Plusieurs ports concernant le noyau de GNOME ont &#233;t&#233; mis &#224; jour avec les derni&#232;res versions
            (gnomelibs, gnomecore, glade etc.). Veuillez suivre les <a
            href="docs/faq.html#q4">instructions</a> habituelles pour mettre &#224; jour votre syst&#232;me.
            </p>
        </event>

      </day>

    </month>
  </year>
</news>



