<!-- $FreeBSD$ -->
<!-- The FreeBSD Spanish Documentation Project -->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook FreeBSD Articles Entity Set//ES">
%articles.ent;
]>

<article lang=es>
  <articleinfo>
    <title>Qu&eacute; es BSD</title>

    <author>
      <firstname>Greg</firstname>
      <surname>Lehey</surname>

      <affiliation>
        <address><email>grog@FreeBSD.org</email></address>
      </affiliation>
    </author>

    <abstract>
      <para>En el mundo del c&oacute;digo abierto la palabra 
        <quote>Linux</quote> suele ser utilizada como sin&oacute;nimo de
        <quote>Sistema Operativo</quote> pero no es el &uacute;nico sistema 
         operativo libre &unix;.  En Abril de 1.999 el  
        <ulink
         url="http://www.leb.net/hzo/ioscount/data/r.9904.txt">Internet
          Operating System Counter</ulink> reflejaba que el 31'3% de 
          los sistemas que ofrec&iacute;an alg&uacute;n servicio en Internet 
          usaban Linux y el 14'6% usaban BSD &unix;.  Alguna de las empresas 
          m&aacute;s grandes de Internet, como por ejemplo <ulink  


          url="http://www.yahoo.com/">Yahoo!</ulink>, usan BSD.  El servidor 
        de FTP con m&aacute;s carga en 1999 (ahora desaparecido) , <ulink
          url="ftp://ftp.cdrom.com/">ftp.cdrom.com</ulink>, transfer&iacute;a 
        1'4TB diariamente usando BSD.  Es f&aacute;cil suponer que no se trata 
        de un nicho de mercado: BSD es un secreto bien guardado.</para>

      <para>&iquest;As&iacute; que cu&aacute;l es el secreto?   &iquest;Por 
        qu&eacute; BSD no es m&aacute;s conocido?   &Eacute;ste 
        art&iacute;culo trata sobre esa y otras cuestiones.</para> 

      <para>A lo largo de &eacute;ste art&iacute;culo ser&aacute;n destacadas 
        de <emphasis>&eacute;ste modo</emphasis>.</para>
         &trans.es.bazcar;
    </abstract>
  </articleinfo>

  <sect1>
    <title>&iquest;Qu&eacute; es BSD?</title>

    <para>BSD son las siglas de <quote>Berkeley Software Distribution</quote>. 
      As&iacute; se llam&oacute; a las distribuciones de c&oacute;digo fuente 
      que se hicieron en la Universidad de Berkeley en California y que en 
      origen eran extensiones del sistema operativo &unix; de 
      AT&amp;T Research. Varios proyectos de sistemas 
      operativos de c&oacute;digo abierto tienen su origen en una 
      distribuci&oacute;n de &eacute;ste c&oacute;digo conocida como 
      4.4BSD-Lite. A&ntilde;aden adem&aacute;s un buen n&uacute;mero de 
      paquetes de otros proyectos de C&oacute;digo Abierto, incluyendo de 
      forma destacada al proyecto GNU.  El sistema operativo completo 
      incluye:</para> 

    <itemizedlist>
      <listitem>
        <para>El kernel BSD, que se encarga de la programaci&oacute;n 
          del tiempo de ejecuci&oacute;n de los procesos,
          la gesti&oacute;n de memoria, el multiproceso 
          sim&eacute;trico (SMP), los controladores de dispositivos, 
          etc.</para>

        <para><emphasis>A diferecia del kernel Linux existen varios 
            kernel BSD con diversas funciones.</emphasis></para>
      </listitem>

      <listitem>
        <para>La biblioteca C, la API base del sistema.</para>
          
        <para><emphasis>La biblioteca C de BSD est&aacute; basada en 
            c&oacute;digo procedente de Berkeley no del proyecto 
            GNU.</emphasis></para>
      </listitem>
          
      <listitem>
        <para>Aplicaciones como las distintas shells, aplicaciones de 
        gesti&oacute;n de ficheros, compiladores y enlazadores.</para>
        
        <para><emphasis>Algunas de las aplicaciones derivan del proyecto 
            GNU, otras no.</emphasis></para>
      </listitem>

      <listitem>
        <para>El sistema X Window, que gestiona el entorno 
          gr&aacute;fico.</para>

        <para>El sistema X Window que se usa en la mayor&iacute;a de 
          versiones de BSD es producto de un proyecto aparte, el 
          <ulink url="http://www.XFree86.org/">Proyecto XFree86</ulink>.
          Se usa el mismo c&oacute;digo que en Linux.  BSD por lo general 
          no predetermina un <quote>gestor de ventanas</quote> como KDE o 
          GNOME, aunque &eacute;stos y otros muchos esten 
          disponibles.</para>
      </listitem>

      <listitem>
        <para>Muchos otros programas y utilidades.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  
  <sect1>
    <title>Entonces &iquest;es un UNIX verdadero?</title>

    <para>Los sistemas operativos BSD no son clones sino derivados 
      de c&oacute;digo abierto del sistema operativo de 
      AT&amp;T Research, el cual es a su vez ancestro 
      del moderno UNIX System V.  &Eacute;sto puede sorprenderle.  
      &iquest;C&oacute;mo puede haber sucedido esto si 
      AT&amp;T jam&aacute;s ha liberado su c&oacute;digo?</para>

    <para>Cierto es que AT&amp;T UNIX no es c&oacute;digo abierto y que en 
      un sentido estricto de copyright BSD no es 
      <emphasis>en absoluto</emphasis> UNIX,  pero por otra parte 
      AT&amp;T ha inclu&iacute;do fuentes de otros proyectos, teniendo 
      como caso notable el Computer Sciences Research Group de la 
      Universidad de Berkeley, California.  En 1.976 el CSRG 
      comienza a distribuir su software en cintas, d&aacute;ndoles 
      la denominaci&oacute;n <emphasis>Berkeley Software 
      Distribution</emphasis>, o <emphasis>BSD</emphasis>.</para> 

    <para>Las primeras distribuciones BSD consist&iacute;an 
      principalmente en aplicaciones de entorno de usuario 
      (<quote>userland</quote>) pero la situaci&oacute;n cambi&oacute; 
      de modo dr&aacute;stico cuando el CSRG firm&oacute; un 
      contrato con la Agencia de Investigaci&oacute;n de Proyectos 
      Avanzados (DARPA) para mejorar los protocolos de comunicaci&oacute;n 
      en su red ARPANET.  A los nuevos protocolos se les dio el 
      nombre de <emphasis>Internet Protocols</emphasis>, y m&aacute;s 
      adelante <emphasis>TCP/IP</emphasis>, que m&aacute;s tarde se 
      habr&iacute;an de covertir en los protocolos m&aacute;s importantes.  
      La primera implementaci&oacute;n ampliamente distribu&iacute;da 
      lo fue como parte de 4.2BSD, en 1.982.</para>
 
    <para>Durante la d&eacute;cada de los 80 comienzan a surgir 
      compa&ntilde;&iacute;as que ofrec&iacute;an estaciones de trabajo.  
      La mayor&iacute;a opt&oacute; por adquirir licencias de UNIX en 
      lugar de desarrollar sistemas operativos ellos mismos.  En 
      particular Sun Microsystems adquiri&oacute; una licencia de UNIX 
      e implement&oacute; una versi&oacute;n de 4.2BSD, 
      a la que llamaron SunOS.  Cuando la propia AT&amp;T fue 
      autorizada para vender UNIX iniciaron una implementaci&oacute;n 
      un tanto rudimentaria llamada System III, seguida 
      r&aacute;pidamente por System V.  El c&oacute;digo base de System V 
      no inclu&iacute;a capacidad de trabajo en redes,  de manera que todas 
      sus implementaciones hab&iacute;an de usar software de BSD, incluyendo 
      TCP/IP, as&iacute; como aplicaciones como la shell <emphasis>csh
      </emphasis> y el editor <emphasis>vi</emphasis>.  En conjunto esas 
      inclusiones fueron conocidas como las <emphasis>Berkeley 
      Extensions</emphasis>.</para>

    <para>Las cintas BSD conten&iacute;an c&oacute;digo fuente de AT&amp;T y 
      en consecuencia requer&iacute;an una licencia de c&oacute;digo UNIX.  
      Hacia 1.990 al CSRG se le retiran los fondos y se enfrenta al cierre.  
      Algunos de los miembros del grupo deciden distribuir el 
      c&oacute;digo BSD, que era C&oacute;digo Abierto, sin el c&oacute;digo 
      propiedad de AT&amp;T.  Finalmente esto sucede con la 
      <emphasis>Networking Tape 2</emphasis>, m&aacute;s conocida como 
      <emphasis>Net/2</emphasis>. Net/2 no era un sistema operativo 
      completo: faltaba aproximadamente un 20% del c&oacute;digo del 
      kernel.  Uno de los miembros del CSRG, William F. Jolitz, 
      escribi&oacute; el c&oacute;digo restante y lo distribuy&oacute; 
      a comienzos de 1.992 como <emphasis>386BSD</emphasis>.  Al mismo  
      tiempo otro grupo de antiguos miembros del CSRG fundaron 
      una empresa llamada <ulink 
      url="http://www.bsdi.com/">Berkeley Software Design Inc.</ulink>
      y distribuy&oacute; una versi&oacute;n beta de un sistema operativo 
      llamado <ulink 
      url="http://www.bsdi.com/">BSD/386</ulink>, que se basa en las mismas 
      fuentes.  El sistema operativo pas&oacute; a denominarse BSD/OS.</para> 

    <para>386BSD jam&aacute;s lleg&oacute; a ser un sistema operativo 
      estable.  En lugar de ello dos proyectos surgen de &eacute;l en 
      1.993:
      <ulink url="http://www.NetBSD.org/">NetBSD</ulink> y  
      <ulink url="../../../../index.html">FreeBSD</ulink>.  Ambos proyectos 
      se forman gracias a la falta de paciencia que origina la espera de 
      mejoras en 386BSD: el proyecto NetBSD comenz&oacute; a primeros de 
      a&ntilde;o y la primera versi&oacute;n de FreeBSD no estuvo lista 
      hasta finales del mismo.  En ese proceso el c&oacute;digo base 
      tom&oacute; caminos diferentes hasta tal punto que se hizo 
      dif&iacute;cil de mezclar.  Adem&aacute;s los proyectos tienen 
      objetivos diferentes, como veremos m&aacute;s adelante.  En 1.996 
      otro proyecto, <ulink  
      url="http://www.OpenBSD.org/">OpenBSD</ulink>, se separa de 
      NetBSD.</para>
  </sect1>
  
  <sect1>
    <title>&iquest;Por qu&eacute; BSD no se conoce mejor?</title>
    
    <para>Existen diversas razones por las que BSD es relativamente 
         desconocido:</para>
    
    <orderedlist>
      <listitem>
        <para>Los desarrolladores de BSD con frecuencia est&aacute;n 
          m&aacute;s interesados en depurar su c&oacute;digo que en 
          promocionarlo.</para>
      </listitem>

      <listitem>
        <para>La mayor parte de la popularidad de Linux se debe a factores 
          externos a los proyectos Linux, como la prensa y las 
          compa&ntilde;&iacute;as que ofrecen servicios relacionados con 
          Linux.  Hasta hace poco los BSD de fuente abierta carec&iacute;an de 
          tales abogados.</para>
      </listitem>

      <listitem>
        <para>Los desarrolladores de BSD suelen estar m&aacute;s 
          experimentados que los de Linux y ponen menos de su parte a la 
          hora de hacer el sistema f&aacute;cil de usar.  Los reci&eacute;n 
          llegados suelen sentirse m&aacute;s c&oacute;modos con Linux.</para>
      </listitem>

      <listitem>
        <para>En 1.992 AT&amp;T denunci&oacute; a <ulink
          url="http://www.bsdi.com/">BSDI</ulink>,
          el distribuidor de BSD/386, alegando que el producto 
          conten&iacute;a c&oacute;digo propiedad de AT&amp;T.  El caso 
          fu&eacute; sobrese&iacute;do en 1.994 pero la huella del litigio 
          perdura.  A&uacute;n en Marzo de 2.000 en un art&iacute;culo 
          publicado en la web se aseguraba que el caso hab&iacute;a sido 
          <quote>resuelto hace poco</quote>.</para>  

        <para>Un detalle que el proceso judicial aclar&oacute; fue el de la 
          nomenclatura: en los 80 BSD era conocido como <quote>BSD UNIX
          </quote>.  Tras la eliminaci&oacute;n del &uacute;ltimo vestigio 
          de c&oacute;digo de AT&amp;T, BSD perdi&oacute; el derecho a 
          llamarse UNIX.  Es por esto que es posible encontrar 
          t&iacute;tulos de libros referentes a <quote>the 4.3BSD UNIX  
          operating system</quote> y <quote>the 4.4BSD operating 
            system</quote>.</para>
      </listitem>

      <listitem>
        <para>Existe la creencia de que los proyectos BSD est&aacute;n 
         fragmentados y enfrentados entre s&iacute;.  El <ulink 
          url="http://interactive.wsj.com/bin/login?Tag=/&amp;URI=/archive/retrieve.cgi%253Fid%253DSB952470579348918651.djm&">Wall Street
            Journal</ulink> habl&oacute; de la <quote>balcanizaci&oacute;n
         </quote> de los proyectos BSD.  Como en el caso del pleito, esa 
          creencia se fundamenta en historia antigua.</para> 
      </listitem>
    </orderedlist>
  </sect1>

  <sect1>
    <title>Comparemos BSD y Linux</title>

    <para>De manera que, &iquest;cu&aacute;l es la diferencia entre, 
      digamos, Debian Linux y FreeBSD?   Para el usuario avanzado la 
      diferencia es sorprendentemente pequeña: ambos son sistemas operativos 
      tipo UNIX.  Ambos son desarrollados por proyectos no comerciales 
      (esto, por supuesto, no es aplicable a la mayor&iacute;a del 
      resto de distribuciones de Linux).  En el siguiente apartado tomaremos 
      BSD como punto de partida y lo compararemos con Linux.  La 
      descripci&oacute;n se ajusta m&aacute;s a FreeBSD, que posee 
      aproximadamente el 80% de los sistemas BSD instalados, pero las 
      diferencias con NetBSD y OpenBSD son peque&ntilde;as.</para> 

    <sect2>
      <title>&iquest;Qui&eacute;n posee BSD?</title>

      <para>Ninguna persona o empresa posee BSD.  Su creaci&oacute;n 
        y distribuci&oacute;n es obra de una comunidad de voluntarios 
        altamente cualificados y comprometidos a lo largo y ancho del mundo.  
        Algunos de los componentes de BSD son proyectos de C&oacute;digo 
        Abierto que cuentan con responsables ajenos al proyecto BSD.</para> 
    </sect2>

    <sect2>
      <title>&iquest;C&oacute;mo se desarrolla y actualiza BSD?</title>

      <para>Los kernel BSD son desarrollados y actualizados siguiendo el 
        modelo de desarrollo de C&oacute;digo Abierto.  Cada proyecto 
        mantiene un <emphasis>&aacute;rbol de fuentes</emphasis> accesible 
        p&uacute;blicamente mediante un <ulink 
        url="http://www.sourcegear.com/CVS/"><quote>Sistema Concurrente de 
          Versiones</quote></ulink> (Concurrency Versions System, CVS), 
        que contiene todos los ficheros fuente del proyecto, 
        incluidos los de la documentaci&oacute;n y otros ficheros 
        relacionados.  CVS permite a los usuarios <quote>hacer un check
        out</quote> (en otras palabras, extraer una copia) de los ficheros 
        que componen la versi&oacute;n elegida del sistema.</para>

      <para>Un gran n&uacute;mero de desarrolladores de muy diversas partes 
        del mundo contribuye con mejoras a BSD.  Estan divididos en tres 
        categor&iacute;as:</para> 

      <itemizedlist>
        <listitem>
          <para><firstterm>Contributors</firstterm> son aquellos que escriben 
            c&oacute;digo o documentaci&oacute;n.  No se les permite 
            <quote>hacer commit</quote> (es decir, a&ntilde;adir 
            c&oacute;digo) directamente al &aacute;rbol de fuentes.  Para que 
            su c&oacute;digo sea incluido en el sistema debe ser 
            revisado y probado por un desarrollador registrado o  
            <emphasis>committer</emphasis>.</para>
        </listitem>

        <listitem>
          <para><firstterm>Committers</firstterm> son desarrolladores que 
            disponen de acceso de escritura en el &aacute;rbol de fuentes.  
            Para convertirse en committer es necesario demostrar habilidad en 
            el &aacute;rea en la cual &eacute;l o ella trabaja.</para>

          <para>
            Depende del criterio individual de cada committer cu&aacute;ndo 
            pedir autorizaci&oacute;n antes de hacer cambios en el 
            &aacute;rbol de fuentes.  En general un committer experimentado 
            puede incluir cambios que son obviamente correctos sin 
            necesidad de consenso.  Por ejemplo, un/a committer que 
            trabaje en un  proyecto de documentaci&oacute;n puede corregir 
            errores tipogr&aacute;ficos o gramaticales sin necesidad de 
            revisi&oacute;n.  Por otra parte, se espera de desarrolladores 
            que pretendan realizar cambios de gran calado o complicados que 
            env&iacute;en sus cambios para que sean revisados antes de ser 
            incluidos.  En casos extremos un miembro del 
            <quote>core team</quote> con una funci&oacute;n como la del 
            Principal Architect puede pedir que los cambios sean retirados 
            del &aacute;rbol; es lo que llamamos <firstterm>backing 
            out</firstterm>.  Todos los/las committers reciben un correo 
            electr&oacute;nico acerca de cada cambio concreto en el 
            &aacute;rbol de fuentes as&iacute; que no es posible hacerlo 
            en secreto.</para> 
        </listitem>

        <listitem>
          <para>El <firstterm>Core team</firstterm>.  Tanto FreeBSD 
            como NetBSD disponen de un <quote>core team</quote> que 
            coordina el proyecto.  Los <quote>core team</quote> dirigen 
            el rumbo de los proyectos pero sus funciones no siempre 
            est&aacute;n claras.  No es necesario ser desarrollador para 
            ser un miembro de un <quote>core team</quote> pero suele ser 
            lo habitual.  Las normas de un <quote>core team</quote> 
            var&iacute;an de un proyecto a otro pero en general tienen 
            m&aacute;s influencia sobre la direcci&oacute;n del 
            proyecto.</para> 
        </listitem>
      </itemizedlist>

      <para>&Eacute;te sistema difiere del de Linux en algunos 
            aspectos:</para>

      <orderedlist>
        <listitem>
          <para>Nadie posee el principio de autoridad.  En la 
            pr&aacute;ctica eso es muy relativo, puesto que el 
            <quote>Chief Architect</quote> puede solicitar que cierta 
            entrada del &aacute;rbol de fuentes sea eliminada e incluso 
            en el proyecto Linux a ciertas personas les est&aacute; 
            permitido hacer cambios.</para> 
        </listitem>

        <listitem>
          <para>Por otra parte <emphasis>hay</emphasis> un repositorio 
            central, un &uacute;nico lugar donde encontrar las fuentes del 
            sistema operativo &iacute;ntegro, incluyendo todas las versiones 
            anteriores.</para>
        </listitem>

        <listitem>
          <para>Los BSD mantienen el <quote>Sistema 
             Operativo</quote> completo, no &uacute;nicamente el 
            kernel.  &Eacute;sta distinci&oacute;n es v&aacute;lida 
            &uacute;nicamente como definici&oacute;n puesto que ni BSD ni
            Linux son &uacute;tiles sin aplicaciones:  las aplicaciones que 
            se usan en BSD suelen ser las mismas que las que se usan en 
            Linux.</para>
        </listitem>

        <listitem>
          <para>Como resultado del mantenimiento estructurado de un 
            &uacute;nico &aacute;rbol de fuentes mediante CVS el desarrollo 
            de BSD es limpio y es posible acceder a cualquier 
            versi&oacute;n del sistema por su n&uacute;mero de 
            versi&oacute;n o por la fecha.  Del mismo modo CVS permite 
            actualizaciones incrementales del sistema: por ejemplo el 
            repositorio de FreeBSD es actualizado en torno a 100 veces 
            al d&iacute;a, aunque la mayor&iacute;a de esos cambios son 
            peque&ntilde;os.</para> 
        </listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Versiones de BSD</title>

      <para>Cada proyecto BSD pone a disposici&oacute;n 
        p&uacute;blica tres <quote>releases</quote> (versiones) 
        distintas.  Igual que en Linux, las <quote>releases
         </quote> tienen asignado un n&uacute;mero como por 
        ejemplo 1.4.1 &oacute; 3.5.  Adem&aacute;s el n&uacute;mero 
        de versi&oacute;n tiene un sufijo que indica su 
        prop&oacute;sito:</para>

      <orderedlist>
        <listitem>
          <para>La versi&oacute;n de desarrollo del sistema recibe 
            el nombre de 
            <firstterm>CURRENT</firstterm>.  FreeBSD asigna un 
            n&uacute;mero a CURRENT, por ejemplo FreeBSD 5.0-CURRENT.  
            NetBSD utiliza un sistema ligeramente diferente y a&ntilde;ade 
            un sufijo compuesto por una &uacute;nica letra que indica 
            cambios en las interfaces internas, por ejemplo NetBSD 1.4.3G.  
            OpenBSD no asigna ning&uacute;n n&uacute;mero 
            ("OpenBSD-current").  &Eacute;sta rama es la que incluye todo 
            el desarrollo.</para>
        </listitem>

        <listitem>
          <para>A intervalos regulares, entre dos y cuatro veces al 
            a&ntilde;o, los proyectos liberan una versi&oacute;n 
            <firstterm>RELEASE</firstterm> del sistema, que est&aacute; 
            disponible en CD-ROM y mediante FTP para su descarga 
            gratu&iacute;ta, por ejemplo OpenBSD 2.6-RELEASE o 
            NetBSD 1.4-RELEASE.  
            La versi&oacute;n RELEASE est&aacute; dirigida al usuario 
            final y es la versi&oacute;n <quote>est&aacute;ndar
             </quote> del sistema.  NetBSD tambi&eacute;n dispone de 
            <emphasis>patch releases</emphasis> que incluyen un tercer 
            d&iacute;gito, como por ejemplo NetBSD 1.4.2.</para> 
        </listitem>

        <listitem>
          <para>A medida que se van encontrando errores en la versi&oacute;n 
            RELEASE son corregidos y las soluciones son incluidas en 
            el &aacute;rbol CVS.  En FreeBSD la versi&oacute;n resultante se 
            denomina versi&oacute;n <firstterm>STABLE</firstterm>, mientras 
            que en NetBSD y OpenBSD contin&uacute;a siendo la versi&oacute;n 
            RELEASE.  Nuevas caracter&iacute;sticas m&aacute;s peque&ntilde;as 
            pueden ser a&ntilde;adidas en esta rama tras un 
            per&iacute;odo de pruebas en la rama CURRENT.</para> 
        </listitem>
      </orderedlist>

      <para><emphasis>Linux, en cambio, mantiene dos &aacute;rboles de 
          c&oacute;digo separados:  la versi&oacute;n estable y la 
          versi&oacute;n de desarrollo.  Las versiones estables 
          a&ntilde;aden un n&uacute;mero par de versi&oacute;n,  
          como 2.0, 2.2 &oacute; 2.4.  Las versiones de desarrollo 
          a&ntilde;aden un n&uacute;mero impar, como en 2.1,  
          2.3 &oacute; 2.5.  En ambos casos a ese n&uacute;mero se le 
          a&ntilde;ade otro m&aacute;s que indica la versi&oacute;n 
          exacta.  Por si fuera poco cada distribuidor a&ntilde;ade 
          sus propios programas y aplicaciones de entorno de usuario, 
          as&iacute; que el n&uacute;mero de versi&oacute;n es 
          importante.  Cada distribuidor adem&aacute;s asigna 
          n&uacute;meros de versi&oacute;n a la distribuci&oacute;n, 
          as&iacute; pues la descripci&oacute;n completa podr&iacute;a 
          ser algo como <quote>TurboLinux 6.0 with kernel
           2.2.14</quote></emphasis></para>  
    </sect2>

    <sect2>
      <title>&iquest;Cu&aacute;ntas versiones de BSD existen?</title>

      <para>A diferencia de las numerosas distribuciones de Linux tan 
        s&oacute;lo hay tres BSD libres.  Cada proyecto BSD mantiene su 
        propio &aacute;rbol de fuentes y su propio kernel.  En la 
        pr&aacute;ctica, sin embargo, las diferencias en el entorno de 
        usuario (<quote>userland</quote>) entre los distintos BSD son menores 
        que las que hay en Linux.</para>

      <para>Es dif&iacute;cil enumerar los objetivos de cada proyecto 
        puesto que las diferencias son muy subjetivas.  En general,</para>

      <itemizedlist>
        <listitem>
          <para>FreeBSD tiene como meta ofrecer alto rendimiento y 
            facilidad de uso al usuario final y es uno de los favoritos 
            entre proveedores de contenidos web.  Funciona en PC y en 
            procesadores Alpha de Compaq.  El proyecto FreeBSD cuenta 
            con un n&uacute;mero de usuarios significativamente mayor 
            que los otros proyectos.</para> 
        </listitem>

        <listitem>
          <para>NetBSD tiene como meta la Portabilidad: No en vano su lema 
            es <quote>of course it runs NetBSD</quote> (que podr&iacute;a 
            traducirse como <quote>claro que funciona con NetBSD</quote>).  
            Funciona en m&aacute;quinas que abarcan desde PDAs a grandes 
            servidores e incluso ha sido usado por la NASA en misiones 
            espaciales.  Es una excelente elecci&oacute;n para utilizar 
            viejo hardware no Intel.</para> 
        </listitem>

        <listitem>
          <para>OpenBSD tiene como meta la seguridad y la integridad del 
            c&oacute;digo: combina del concepto de c&oacute;digo abierto 
            y una revisi&oacute;n rigurosa del c&oacute;digo que dan como 
            fruto un sistema muy correcto, elegido por instituciones preocupadas 
            por la seguridad como bancos, entidades de cambio y departamentos 
            gubernamentales de los EEUU.  Al igual que NetBSD funciona en 
            gran variedad de plataformas.</para> 
        </listitem>
      </itemizedlist>

      <para>Existen dos sistemas operativos BSD m&aacute;s que no son de 
        c&oacute;digo abierto, BSD/OS y el MacOS X de Apple:</para>

      <itemizedlist>
        <listitem>
          <para>BSD/OS es el derivado m&aacute;s ant&iacute;guo de 
            4.4BSD.  No es c&oacute;digo abierto pero es posible 
            conseguir licencias de su c&oacute;digo fuente a un precio 
            relativamente bajo.  Se parece a FreeBSD en muchos 
            aspectos.</para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.apple.com/macosx/server/">Mac OS
              X</ulink> es la &uacute;ltima versi&oacute;n del sistema 
              operativo para la gama Macintosh de <ulink 
              url="http://www.apple.com/">Apple Computer Inc.  </ulink>
              El n&uacute;cleo BSD Unix de &eacute;ste sistema operativo,
              <ulink
              url="http://developer.apple.com/darwin/">Darwin</ulink>,
              est&aacute; libremente disponible como sistema operativo 
              de fuente abierto totalmente funcional para arquitecturas 
              x86 y PPC.  El sistema gr&aacute;fico Aqua/Quartz y la 
              mayor&iacute;a de las dem&aacute;s aspectos 
              caracter&iacute;sticos de Mac OS X son c&oacute;digo 
              cerrado.  Varios desarrolladores de Darwin son tambi&eacute;n 
              <quote>committers</quote> de FreeBSD y viceversa.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    
    <sect2>
      <title>&iquest;Qu&eacute; diferencias hay entre la licencia BSD 
        y la licencia p&uacute;blica GNU? </title>
      
      <para>Linux est&aacute; disponible bajo la <ulink
        url="http://www.fsf.org/copyleft/gpl.html">GNU General Public
          License</ulink> (GPL), que fue dise&ntilde;ada para 
        evitar el software cerrado.  M&aacute;s concretamente, cualquier 
        trabajo derivado de un producto con licencia GPL debe suministrar 
        el c&oacute;digo fuente si es requerido.  En contraste, la <ulink  
        url="http://www.opensource.org/licenses/bsd-license.html">licencia 
          BSD</ulink> es menos restrictiva: permite la distribuci&oacute;n 
          en forma exclusivamente binaria.  Este aspecto es 
          especialmente atractivo para aplicaciones empotradas.</para> 
    </sect2>

    <sect2>
      <title>&iquest;Qu&eacute; m&aacute;s deber&iacute;a saber?</title>

      <para>Dado que existen menos aplicaciones para BSD que para Linux 
        los desarrolladores de BSD han creado un paquete de compatibilidad con 
        Linux que permite hacer funcionar programas de Linux bajo BSD.  El 
        paquete contiene tanto modificaciones del kernel, con el fin de 
        gestionar correctamente las llamadas al sistema de Linux, como 
        ficheros necesarios para la compatibilidad con Linux como la 
        Biblioteca C.  No hay diferencias notables en velocidad de 
        ejecuci&oacute;n entre una aplicaci&oacute;n de Linux 
        ejecut&aacute;ndose en un sistema Linux y una aplicaci&oacute;n Linux 
        ejecut&aacute;ndose  en un sistema BSD de la misma velocidad.</para>  

      <para>El modelo <quote>todo del mismo proveedor</quote> de BSD implica 
        que las actualizaciones son mucho m&aacute;s sencillas de gestionar 
        de lo que con frecuencia son en Linux.  BSD maneja las actualizaciones 
        de versiones de bibliotecas suministrando m&oacute;dulos de 
        compatibilidad para versiones anteriores, de modo que es posible 
        ejecutar binarios con varios a&ntilde;os de antiguedad sin 
        problemas.</para> 
    </sect2>

    <sect2>
      <title>Entonces &iquest;Qu&eacute; deber&iacute;a usar, BSD 
        o Linux?</title>

      <para>&iquest;Qu&eacute; significa realmente esa pregunta?   
        &iquest;Qui&eacute;n deber&iacute;a utilizar BSD y qui&eacute;n 
        Linux?.</para>
      
      <para>&Eacute;sta es una pregunta muy dif&iacute;cil de 
        responder.  He aqu&iacute; varias pautas:</para>
      
      <itemizedlist>
        <listitem>
          <para><quote>Si no est&aacute; roto no lo arregles</quote>: 
            Si ya usa un sistema operativo de c&oacute;digo abierto y 
            est&aacute; satisfecho con &eacute;l, probablemente no hay 
            ninguna buena raz&oacute;n para cambiar.</para> 
        </listitem>
        
        <listitem>
          <para>Los sistemas BSD, especialmente FreeBSD, pueden proporcionar 
            un rendimiento notablemente superior que Linux, pero esto 
            no es una ley inmutable.  En muchos casos no hay diferencia de 
            rendimiento o esta es muy peque&ntilde;a.  En algunos 
            casos Linux podr&iacute;a tener un rendimiento mejor que 
            FreeBSD.</para>
        </listitem>

        <listitem>
          <para>En general los sistemas BSD gozan de una mejor 
            reputaci&oacute;n en cuanto a disponibilidad, principalmente 
            por la mayor madurez de su c&oacute;digo base.</para>
        </listitem>

        <listitem>
          <para>La licencia BSD puede resultar m&aacute;s atractiva 
             que la GPL.</para>
        </listitem>

        <listitem>
          <para>BSD puede ejecutar c&oacute;digo de Linux, mientras que 
            Linux no puede hacer lo propio con c&oacute;digo de BSD.  Como 
            resultado de esto hay una mayor cantidad de software 
            disponible para BSD que para Linux.</para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>&iquest;Qui&eacute;n ofrece soporte, servicios y 
         formaci&oacute;n orientada a BSD?</title>
      
      <para>BSDi siempre ha ofrecido soporte para BSD/OS y en fechas 
        recientes anunci&oacute; contratos de soporte para FreeBSD.</para>

      <para>Adem&aacute;s cada uno de los proyectos tiene una lista de 
        consultores:
        <ulink url="../../../../commercial/consulting_bycat.html">FreeBSD</ulink>,
        <ulink url="http://www.netbsd.org/gallery/consultants.html">NetBSD</ulink>,
        y <ulink url="http://www.openbsd.org/support.html">OpenBSD</ulink>.</para>
    </sect2>
  </sect1>
</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
