Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/geom-class/_index.po
Languages: es, pt_br, ru

source: The name "softc" is a legacy term for "driver private data". The name most probably comes from the archaic term "software control block". In GEOM, it is a structure (more precise: pointer to a structure) that can be attached to a geom instance to hold whatever data is private to the geom instance. Most GEOM classes have the following members:
es: El nombre "softc" es un término heredado para"driver private data" (datos privados del controlador). El nombre probablemente proviene del término arcaico "software control block" (bloque de control software). En GEOM, es una estructura (para ser más precisos: un puntero a una estructura) que se puede adjuntar a una instancia de geom para mantener cualquier información que sea privada para dicha instancia. La mayoría de las clases de GEOM tienen los siguientes elementos:
pt_br: O nome "softc" é um termo legado para "dados privados do driver". O nome provavelmente vem do termo arcaico "bloco de controle de software". No GEOM, é uma estrutura (mais precisamente, um ponteiro para uma estrutura) que pode ser anexada a uma instância geom para manter quaisquer dados que sejam privados à instância geom. A maioria das classes GEOM tem os seguintes membros:
ru: "softc" - это устаревший термин для "приватных данных драйвера" ("driver private data"). Название вероятней всего происходит от устаревшего термина "software control block". В системе GEOM softc это структура (точнее: указатель на структуру) которая может быть присоединена к экземпляру geom и может содержать приватные данные экземпляра. У большинства классов GEOM есть следующие члены:

source: `struct g_provider *provider` : The "provider" this geom instantiates
es: `struct g_provider *provider` : El "provider" que instancia este geom
pt_br: `struct g_provider *provider`: Instância geom criada a partir do provider correspondente
ru: `struct g_provider *provider` : "поставщик geom" предоставляемый данным экземпляром geom

source: `uint16_t n_disks` : Number of consumer this geom consumes
es: `uint16_t n_disks` : Número de consumidores que consume este geom
pt_br: `uint16_t n_disks`: Número de consumidores que esta instância geom consome
ru: `uint16_t n_disks` : Количество потребителей geom ("consumer"), обслуживаемых данным экземпляром geom

source: `struct g_consumer \**disks` : Array of `struct g_consumer*`. (It is not possible to use just single indirection because struct g_consumer* are created on our behalf by GEOM).
es: `struct g_consumer \**disks` : Array de `struct g_consumer*`. (No es posible utilizar un sólo nivel de indirección porque los struct g_consumer* los crea GEOM en nuestro nombre).
pt_br: `struct g_consumer \**disks`: Array de `struct g_consumer*`. (Não é possível usar apenas uma única indireção porque os `struct g_consumer*` são criados em nosso nome pelo GEOM).
ru: `struct g_consumer \**disks` : Массив `struct g_consumer*`. (Невозможно обойтись одинарным указателем, потому что система GEOM создает для нас структуры struct g_consumer).

source: The `softc` structure contains all the state of geom instance. Every geom instance has its own softc.
es: La estructura `softc` contiene el estado completo de la instancia geom. Cada instancia geom tiene su propio softc.
pt_br: A estrutura `softc` contém todo o estado da instância geom. Cada instância geom tem sua própria estrutura `softc`.
ru: Структура `softc` содержит состояние экземпляра geom. У каждого экземпляра есть свой softc.

source: Metadata
es: Metadatos
pt_br: Metadados
ru: Метаданные

source: Format of metadata is more-or-less class-dependent, but MUST start with:
es: El formato de los metadatos es más o menos dependiente de la clase, pero DEBE comenzar por:
pt_br: O formato dos metadados é mais ou menos dependente da classe, mas DEVE começar com:
ru: Формат метаданных в той или иной мере зависит от конкретного класса, но _обязан_ начинаться с:

source: 16 byte buffer for null-terminated signature (usually the class name)
es: Un buffer de 16 bytes para la firma terminada en null (normalmente el nombre de la clase)
pt_br: Buffer de 16 bytes para uma assinatura de terminação nula (geralmente o nome da classe)
ru: 16-байтного буфера для подписи - строки с завершающим нулем (обычно это имя класса)

source: uint32 version ID
es: ID de la versión del tipo uint32
pt_br: ID da versão uint32
ru: uint32 идентификатора версии

source: It is assumed that geom classes know how to handle metadata with version ID's lower than theirs.
es: Se supone que las clases de geom saben cómo manejar los metadatos con ID de versión menores que los suyos.
pt_br: Assume-se que as classes geom sabem como lidar com metadados com ID de versão menores que os deles.
ru: Подразумевается, что классы geom знают как обращаться с метаданными с идентификаторами версий ниже, чем их собственные.

source: Metadata is located in the last sector of the provider (and thus must fit in it).
es: Los metadatos se encuentran en el último sector del proveedor (y, por lo tanto, deben encajar en él).
pt_br: Os metadados estão localizados no último setor do provedor (e, portanto, devem caber nele).
ru: Метаданные размещаются в последнем секторе поставщика geom (поэтому обязаны целиком умещаться в нем).

source: (All this is implementation-dependent but all existing code works like that, and it is supported by libraries.)
es: (Todo depende de la implementación, pero todo el código existente funciona así, y es compatible con las bibliotecas.)
pt_br: (Tudo isso depende da implementação, mas todo o código existente funciona assim, e é suportado por bibliotecas.)
ru: (Все это зависит от реализации, но весь существующий код работает подобно описанному и поддерживается библиотеками.)

source: Labeling/creating a GEOM
es: Etiquetar/crear un GEOM
pt_br: Rotulando/criando um GEOM
ru: Маркирование/создание экземпляра geom

source: The sequence of events is:
es: La secuencia de eventos es:
pt_br: A sequência de eventos é:
ru: Последовательность событий следующая:

source: user calls man:geom[8] utility (or one of its hardlinked friends)
es: El usuario invoca la utilidad man:geom[8] (o alguno de sus amigos que están enlazados)
pt_br: O usuário chama o utilitário man:geom[8] (ou um comandos alternativos para o mesmo utilitário)
ru: пользователь запускает служебную программу man:geom[8]

source: the utility figures out which geom class it is supposed to handle and searches for [.filename]#geom_CLASSNAME.so# library (usually in [.filename]#/lib/geom#).
es: la utilidad averigua qué clase geom se supone que tiene que manejar y busca la librería [.filename]#geom_CLASSNAME.so# (que está normalmente en [.filename]#/lib/geom#).
pt_br: O utilitário determina qual classe geom ele deve manipular e procura pela biblioteca [.filename]#geom_CLASSNAME.so# (geralmente em [.filename]#/lib/geom#).
ru: программа решает каким классом geom ей придется управлять и ищет библиотеку [.filename]#geom_CLASSNAME.so# (которая обычно находится в [.filename]#/lib/geom#).

source: it man:dlopen[3]-s the library, extracts the definitions of command-line parameters and helper functions.
es: usa man:dlopen[3] para cargar la librería y extrae las definiciones de los parámetros de línea de comandos y de las funciones de apoyo.
pt_br: O utilitário utiliza a função man:dlopen[3] para carregar dinamicamente a biblioteca, extrair as definições dos parâmetros de linha de comando e funções auxiliares.
ru: она открывает библиотеку при помощи man:dlopen[3], извлекает вспомогательные функции и определения параметров командной строки.

source: In the case of creating/labeling a new geom, this is what happens:
es: En el caso de crear/etiquetar un nuevo geom, esto es lo que sucede:
pt_br: No caso da criação/rotulação de um novo geom, isso é o que acontece:
ru: Вот так происходит создание/маркирование нового экземпляра geom:

source: man:geom[8] looks in the command-line argument for the command (usually `label`), and calls a helper function.
es: man:geom[8] busca el comando (normalmente `label`) en los argumentos de línea de comando y llama a la función de apoyo.
pt_br: O comando man:geom[8] procura na linha de comando pelo comando (geralmente `label`) e chama uma função auxiliar correspondente.
ru: man:geom[8] ищет команду в аргументах командной строки (обычно это `label`) и вызывает вспомогательную функцию.

source: The helper function checks parameters and gathers metadata, which it proceeds to write to all concerned providers.
es: La función auxiliar comprueba los parámetros y recopila los metadatos, que procede a escribir a todos los proveedores interesados.
pt_br: A função auxiliar verifica parâmetros e reúne metadados, que são gravados em todos os provedores envolvidos.
ru: Вспомогательная функция проверяет параметры и собирает метаданные, которые записываются во все вовлеченные поставщики geom.

source: This "spoils" existing geoms (if any) and initializes a new round of "tasting" of the providers. The intended geom class recognizes the metadata and brings the geom up.
es: Esto "echa a perder" los geoms existentes (si los hubiera) e inicializa una nueva ronda de "pruebas" de los proveedores. La clase geom reconoce los metadatos y levanta el geom.
pt_br: Isso "anula" os geoms existentes (se houver) e inicializa uma nova rodada de "degustação" dos providers. A classe geom pretendida reconhece os metadados e coloca o geom em funcionamento.
ru: Это "повреждает (spoil)" существующие экземпляры geom (если они были) и порождает новый виток "тестирования" поставщиков geom. Целевой класс geom опознает метаданные и активирует экземпляр geom.

source: (The above sequence of events is implementation-dependent but all existing code works like that, and it is supported by libraries.)
es: (La secuencia de eventos anterior depende de la implementación, pero todo el código existente funciona así, y es compatible con las bibliotecas.)
pt_br: (A sequência de eventos acima é dependente da implementação, mas todo o código existente funciona assim, e é suportado pelas bibliotecas.)
ru: (Приведенная выше последовательность событий зависит от конкретной реализации, но весь существующий код работает подобно описанному и поддерживается библиотеками.)

source: GEOM Command Structure
es: Estructura del comando GEOM
pt_br: Estrutura do Comando GEOM
ru: Структура команд geom

source: The helper [.filename]#geom_CLASSNAME.so# library exports `class_commands` structure, which is an array of `struct g_command` elements. Commands are of uniform format and look like:
es: La librería de apoyo [.filename]#geom_CLASSNAME.so# exporta la estructura `class_commands` que es un array de elementos de tipo `struct g_command`. Los comandos tienen un formato uniforme que se parece a:
pt_br: A biblioteca auxiliar [.filename]#geom_CLASSNAME.so# exporta a estrutura `class_commands`, que é um array de elementos `struct g_command`. Os comandos têm um formato uniforme e se parecem com:
ru: Вспомогательная библиотека [.filename]#geom_CLASSNAME.so# экспортирует структуру `class_commands`, которая является массивом элементов `struct g_command`. Эти команды одинакового формата и выглядят следующим образом:

source: Common verbs are:
es: Los verbos comunes son:
pt_br: Verbos comuns são:
ru: Общими командами являются:

source: label - to write metadata to devices so they can be recognized at tasting and brought up in geoms
es: label — para escribir metadatos en los dispositivos para que puedan ser reconocidos en la prueba y creados en geoms
pt_br: label - para escrever metadados nos dispositivos para que possam ser reconhecidos durante o processo de "tasting" e trazidos à tona em geoms
ru: label - записать метаданные в устройства, чтобы они могли быть опознаны в процессе тестирования и использованы в соответствующих экземплярах geom

source: destroy - to destroy metadata, so the geoms get destroyed
es: destroy — para destruir los metadatos, de forma que se destruyen los geoms
pt_br: destroy - para destruir metadados, fazendo com que os geoms sejam destruídos
ru: destroy - разрушить метаданные, за которым последует разрушение экземпляров geom

source: Common options are:
es: Las opciones comunes son:
pt_br: Opções comuns são:
ru: Общие опции:

source: `-v` : be verbose
es: `-v` : sé verboso
pt_br: `-v` : ser verboso (mostrar mais informações)
ru: `-v` : детальный вывод

source: `-f` : force
es: `-f` : forzar
pt_br: `-f` : forçar
ru: `-f` : принудить

source: Many actions, such as labeling and destroying metadata can be performed in userland. For this, `struct g_command` provides field `gc_func` that can be set to a function (in the same [.filename]#.so#) that will be called to process a verb. If `gc_func` is NULL, the command will be passed to kernel module, to `.ctlreq` function of the geom class.
es: Muchas acciones, como etiquetar y destruir los metadatos, se pueden hacer en espacio de usuario. Para esto, `struct g_command` proporciona el campo `gc_func` al que se puede asignar una función (en el mismo [.filename]#.so#) que será llamada para procesar un verbo. Si `gc_func` es NULL, el comando se pasará al módulo del kernel, a la función `.ctlreq` de la clase geom.
pt_br: Muitas ações, como rotular e destruir metadados, podem ser executadas no espaço de usuário. Para isso, `struct g_command` fornece o campo `gc_func`, que pode ser definido como uma função (no mesmo arquivo [.filename]#.so#) que será chamada para processar um verbo. Se `gc_func` for NULL, o comando será passado para o módulo do kernel, para a função `.ctlreq` da classe geom.
ru: Некоторые операции, к примеру маркирование метаданными и разрушение метаданных могут быть выполнены из пространства пользовательских процессов. Для этого, структура `g_command` содержит поле `gc_func`, которое может быть установлено на функцию (в том-же [.filename]#.so#), которая будет вызвана для обработки команды. В случае, когда `gc_func` равно NULL, команда будет передана модулю ядра: функции `.ctlreq` класса GEOM.

source: Geoms are instances of GEOM classes. They have internal data (a softc structure) and some functions with which they respond to external events.
es: Los geoms son instancias de clases GEOM. Tienen datos internos (una estructura softc) y algunas funciones con las que responden a eventos externos.
pt_br: Os Geoms são instâncias das classes GEOM. Eles têm dados internos (uma estrutura softc) e algumas funções com as quais eles respondem a eventos externos.
ru: У экземпляров классов GEOM есть внутренние данные, которые хранятся в структурах softc, а также есть некоторые функции, посредством которых они реагируют на внешние события.

source: The event functions are:
es: Las funciones del evento son:
pt_br: As funções de evento são:
ru: Функции событий:

source: `.access` : calculates permissions (read/write/exclusive)
es: `.access` : calcula permisos (read/write/exclusive)
pt_br: `.access` : calcula as permissões (leitura/escrita/exclusiva)
ru: `.access` : просчитывает права доступа (чтение/запись/исключительный доступ)

source: `.dumpconf` : returns XML-formatted information about the geom
es: `.dumpconf` : devuelve información sobre el geom en formato XML
pt_br: `.dumpconf` : uma função que retorna informações formatadas em XML sobre o geom
ru: `.dumpconf` : возвращает информацию о экземпляре geom; формат XML

source: `.orphan` : called when some underlying provider gets disconnected
es: `.orphan` : llamada cuando algún proveedor subyacente se desconecta
pt_br: `.orphan` : chamado quando algum provedor subjacente é desconectado
ru: `.orphan` : вызывается, когда отсоединяется любой из низлежащих поставщиков geom

source: `.spoiled` : called when some underlying provider gets written to
es: `.spoiled` : llamada cuando se escribe en algún proveedor subyacente
pt_br: `.spoiled` : chamado quando algum provedor subjacente é escrito
ru: `.spoiled` : вызывается, когда производится запись в низлежащий поставщик geom

source: `.start` : handles I/O
es: `.start` : maneja E/S (I/O)
pt_br: `.start` : lida com operações de entrada/saída (I/O)
ru: `.start` : обрабатывает ввод/вывод

source: These functions are called from the `g_down` kernel thread and there can be no sleeping in this context, (see definition of sleeping elsewhere) which limits what can be done quite a bit, but forces the handling to be fast.
es: Estas funciones se llaman desde el hilo `g_down` del kernel y no puede haber inactividad en este contexto, (consulta la definición de inactividad en otra parte) lo que limita un poco lo que se puede hacer, pero obliga a que el manejo sea rápido.
pt_br: Essas funções são chamadas a partir da thread do kernel `g_down` e não é permitido dormir nesse contexto (consulte a definição de dormir em outro lugar), o que limita bastante o que pode ser feito, mas força o tratamento a ser rápido.
ru: Эти функции вызываются из ядерного потока `g_down` и в этом контексте не может быть блокировок (поищите определение "блокировка" в других источниках), что немного ограничивает свободу действий, но способствует быстроте обработки.

source: Of these, the most important function for doing actual useful work is the `.start`() function, which is called when a BIO request arrives for a provider managed by a instance of geom class.
es: De estas funciones, la más importante para realizar un trabajo útil real es la función `.start`() , que se llama cuando una solicitud BIO llega a un proveedor administrado por una instancia de la clase geom.
pt_br: A função mais importante para realizar trabalho útil é a função `.start()`, que é chamada quando uma solicitação BIO chega para um provider gerenciado por uma instância de classe geom.
ru: Из вышеупомянутых, наиболее важной и выполняющей полезную работу функцией является `.start`(), которая вызывается всякий раз, когда поставщику geom, управляемому экземпляром класса, приходит запрос BIO.

source: GEOM Threads
es: Hilos de GEOM
pt_br: Threads GEOM
ru: Потоки выполнения системы geom

source: There are three kernel threads created and run by the GEOM framework:
es: Hay tres hilos del kernel creados y ejecutados por el framework GEOM:
pt_br: Existem três threads de kernel criados e executados pelo framework GEOM:
ru: Системой GEOM в ядре ОС создаются и используются три потока выполнения (kernel threads):

source: `g_down` : Handles requests coming from high-level entities (such as a userland request) on the way to physical devices
es: `g_down` : Maneja las peticiones que vienen de entidades de nivel superior (como una petición de espacio de usuario) hacia los dispositivos físicos
pt_br: `g_down` : responsável por lidar com solicitações vindas de entidades de alto nível (como uma solicitação do espaço do usuário) a caminho de dispositivos físicos
ru: `g_down` : Обрабатывает запросы, приходящие от высокоуровневых сущностей (таких, как запросы из пространства пользовательских процессов) на пути к физическим устройствам

source: `g_up` : Handles responses from device drivers to requests made by higher-level entities
es: `g_up` : Maneja respuestas de los controladores de dispositivos a las peticiones hechas por entidades de nivel superior
pt_br: `g_up` : Lida com as respostas dos drivers de dispositivo às solicitações feitas por entidades de nível superior
ru: `g_up` : Обрабатывает ответы от драйверов устройств на запросы, выполненные высокоуровневыми сущностями

source: `g_event` : Handles all other cases: creation of geom instances, access counting, "spoil" events, etc.
es: `g_event` : Maneja los demás casos: creación de instancias geom, contadores de acceso, eventos "spoil", etc.
pt_br: `g_event` : lida com todos os outros casos: criação de instâncias de geom, contagem de acesso, eventos de "spoil", etc.
ru: `g_event` : Отрабатывает в остальных случаях, как-то создание экземпляра geom, просчитывание прав доступа, события "повреждения" и т.п.

source: When a user process issues "read data X at offset Y of a file" request, this is what happens:
es: Cuando un proceso de usuario realiza una petición de tipo "lee el dato X en el offset Y de un fichero", esto es lo que sucede:
pt_br: Quando um processo do usuário emite uma solicitação para "ler dados X no deslocamento Y de um arquivo", o seguinte acontece:
ru: Когда пользовательский процесс запрашивает "прочитать данные X по смещению Y файла", происходит следующее:

source: The filesystem converts the request into a struct bio instance and passes it to the GEOM subsystem. It knows what geom instance should handle it because filesystems are hosted directly on a geom instance.
es: El sistema de archivos convierte la solicitud en una instancia de struct bio y lo transmite al subsistema GEOM. Sabe qué instancia geom debería encargarse porque los sistemas de archivos se alojan directamente en una instancia geom.
pt_br: O sistema de arquivos converte o pedido em uma instância struct bio e o transmite para o subsistema GEOM. Ele sabe o que a instância geom deve manipular porque os sistemas de arquivos são hospedados diretamente em uma instância geom.
ru: Файловая система преобразует запрос в экземпляр структуры bio и передает его системе GEOM. Файловая система "знает", что экземпляр geom должен обработать запрос, так как файловые системы размещаются непосредственно над экземпляром geom.

source: The request ends up as a call to the `.start`() function made on the g_down thread and reaches the top-level geom instance.
es: La solicitud termina como una llamada a la función `.start`() realizada en el hilo g_down y llega a la instancia de geom de nivel superior.
pt_br: A requisição termina como uma chamada para a função `.start`() feita para a thread g_down e atinge a instância geom de nível superior.
ru: Запрос завершается вызовом функции `.start`() в потоке g_down и достигает верхнего экземпляра geom.

source: This top-level geom instance (for example the partition slicer) determines that the request should be routed to a lower-level instance (for example the disk driver). It makes a copy of the bio request (bio requests _ALWAYS_ need to be copied between instances, with `g_clone_bio`()!), modifies the data offset and target provider fields and executes the copy with `g_io_request`()
es: Esta instancia de nivel superior (por ejemplo el particionador) determina que la petición se debería dirigir a una instancia de nivel inferior (por ejemplo el controlador del disco). Hace una copia de la petición bio (¡las peticiones bio _SIEMPRE_ se tienen que copiar entre instancias, con `g_clone_bio`()!), modifica los campos para el offset de los datos y el proveedor objetivo y ejecuta la copia con `g_io_request`()
pt_br: Esta instância geom de nível superior (por exemplo, o "partition slicer") determina que a solicitação deve ser encaminhada para uma instância de nível inferior (por exemplo, o driver de disco). Ela faz uma cópia da solicitação bio (solicitações bio PRECISAM SEMPRE ser copiadas entre instâncias, com `g_clone_bio`()!), modifica o deslocamento dos dados e os campos do provider de destino e executa a cópia com `g_io_request`()
ru: Верхний экземпляр geom (например, это секционировщик разделов (partition slicer)) определяет, что запрос должен быть переадресован нижестоящему экземпляру geom (к примеру, драйверу диска). Вышестоящий экземпляр geom создает копию запроса bio (запросы bio _ВСЕГДА_ копируются при передаче между экземплярами geom при помощи `g_clone_bio`()!), изменяет поля смещения и целевого поставщика geom и запускает на обработку копию при помощи функции `g_io_request`()
