<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY date "$FreeBSD: www/fr/applications.sgml,v 1.5 2004/08/05 20:29:38 stephane Exp $">
<!ENTITY title "Les applications pour FreeBSD">
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.26

   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Olivier Cherrier <Olivier.Cherrier@cediti.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
   Version francaise (mise a jour) : Antoine Brodin <antoine.brodin@laposte.net>
-->

<html>
    &header;

    <h1>FreeBSD vous offre de nombreuses possibilit&eacute;s</h1>

    <blockquote>
      <p>FreeBSD saura accomplir quasiment toutes les t&acirc;ches que
      vous pouvez attendre d'une station &unix;, et bien plus encore :</p>
    </blockquote>

    <hr align="left" noshade="noshade" width="100%"><font
      color="#FF0000"><font size="+1">FreeBSD est un v&eacute;ritable syst&egrave;me
      ouvert accompagn&eacute; de l'int&eacute;gralit&eacute; de son code source.</font></font>


    <blockquote>
      <p>Cela ne fait plus aucun doute, les syst&egrave;mes ouverts sont
	<i>indispensables</i> pour les applications informatiques actuelles.
	Aucune solution commerciale n'est plus ouverte qu'une solution qui
	met &agrave; disposition de l'utilisateur l'integralit&eacute;
	du code source, y compris pour le noyau, les serveurs syst&egrave;mes,
	les programmes et les utilitaires. Vous pouvez modifier n'importe
	quelle partie de FreeBSD afin qu'il s'adapte &agrave; vos exigences
	personnelles ou professionnelles.</p>

       <p>Gr&acirc;ce aux <a
	  href="&base;/copyright/freebsd-license.html"> fondements de sa
	  licence</a>, vous pouvez utiliser FreeBSD comme base pour
	toutes vos applications libres <i> ou commerciales</i>.</p>
    </blockquote>

    <hr align="left" noshade="noshade" width="100%"><font
      color="#FF0000"><font size="+1">FreeBSD est capable de faire fonctionner
      des milliers d'applications.</font></font>

    <blockquote>
      <p>FreeBSD &eacute;tant bas&eacute; sur 4.4BSD, une version standard
	d'UNIX, il est facile de compiler et d'utiliser
	des programmes. FreeBSD inclu &eacute;galement une vaste
	  <a href="&base;/where.html">collection de paquetages</a>
	   et de <a href="&base/ports/index.html">ports</a>
	qui apportent des logiciels pr&eacute;compil&eacute;s et faciles &agrave; mettre en
	place pour votre ordinateur personnel ou votre serveur d'entreprise. De
	plus en plus de <a
	  href="&base;/commercial/commercial.html">logiciels commerciaux</a>
	 sont &eacute;galement &eacute;crits pour FreeBSD.</p>

      <p>Quelques exemples d'utilisations de FreeBSD :</p>

      <ul>
	<li><b>Internet. </b>De nombreux fournisseurs d'acc&egrave;s Internet (dits ISP ou FAI)
     apr&eacute;cient FreeBSD et l'utilisent pour le web, les news Usenet, le FTP, l'Email et
	  d'autres services. FreeBSD &eacute;tant en mesure de faire fonctionner des
	  logiciels comme le serveur web <a href="http://www.apache.org/">Apache</a>
	  ou encore le serveur FTP Wu-ftpd, il est facile de mettre en place un
	  FAI communautaire ou commercial. Evidemment, les imbattables <a
	    href="&base;/internet.html">performances r&eacute;seaux</a> de
	  FreeBSD permettront &agrave; tous vos utilisateurs de b&eacute;n&eacute;ficier de
	  services fiables et rapides.</li>

	<li><b>Station de travail X Window. </b>Que ce soit pour
	  un terminal X modeste ou une station X avanc&eacute;e, FreeBSD
	  est parfaitement adapt&eacute;. La version libre de X, (<a
	    href="http://www.xfree86.org/">XFree86</a>&trade;) est livr&eacute;e
	  avec le syst&egrave;me. <a href="http://www.xig.com/">Xi
	    Graphics</a> propose &eacute;galement un logiciel X acc&eacute;l&eacute;r&eacute; pour
	  les mat&eacute;riels graphiques haute performance (Matrox par exemple),
	  ainsi que les librairies standard Motif&reg; et OpenGL&reg;.</li>

	<li><b>Le r&eacute;seau. </b>Que ce soit pour le filtrage de paquets,
	  le routage ou les serveurs de noms, FreeBSD peut transformer
	  n'importe quel PC en pare-feu Internet, en serveur de mail, en
	  serveur d'impression, en serveur PC/NFS et bien plus encore.</li>

	<li><b>D&eacute;veloppement de logiciels.</b> Toute une suite de
	  logiciels de d&eacute;veloppement sont inclus avec FreeBSD comme le compilateur GNU
	  C/C++ et son debogueur ainsi que le langage de script Perl. Le
	  d&eacute;veloppement en &java; et Tcl/Tk est &eacute;galement possible. Les
	  &eacute;diteurs c&eacute;l&egrave;bres comme XEmacs et des langages de programmation plus
	  &eacute;sot&eacute;riques comme Icon fonctionnent aussi parfaitement sous
	  FreeBSD. Et Les librairies partag&eacute;es sous FreeBSD ont toujours &eacute;t&eacute; faciles &agrave;
	  d&eacute;velopper et &agrave; utiliser.</li>

	<li><b>Surfer sur le net.</b> Une v&eacute;ritable station UNIX a
	  toujours &eacute;t&eacute; une plate-forme de choix pour surfer sur
	  Internet, et la version BSD de <a
     href="http://home.netscape.com/comprod/products/communicator/index.html">Netscape
     Navigator</a> avec support Java fonctionne sous FreeBSD. Explorez le web,
     publiez vos propres pages web, lisez les news Usenet, envoyez et recevez
     vos courriers &eacute;lectroniques gr&acirc;ce &agrave; votre ordinateur de bureau FreeBSD.</li>

	<li><b>Recherche et &eacute;ducation.</b> &nbsp;FreeBSD est une
	excellente plate-forme pour la recherche car il est livr&eacute; avec son
   code source complet. Les &eacute;tudiants et les chercheurs en
	informatique tireront sans aucun doute un grand profit
	de ce syst&egrave;me ouvert et bien document&eacute;.</li>

	<li><b>Et bien plus. </b>Comptabilit&eacute;, jeux d'action, bases de
	donn&eacute;es, visualisation de donn&eacute;es scientifiques, vid&eacute;o-conf&eacute;rence,
	discussions sur Internet (IRC), automatisation domestique,
	jeux de donjons multi-joueurs (MUDs), BBS, digitalisation d'images...
	sont autant d'utilisations possibles de
	FreeBSD aujourd'hui.</li>
      </ul>
    </blockquote>

    <hr align="left" noshade="noshade" width="100%"><font
      color="#FF0000"><font size="+1">FreeBSD est un syst&egrave;me d'exploitation qui
	s'adaptera &agrave; vos besoins.</font></font>

    <blockquote>
      <p>Bien que FreeBSD soit un logiciel libre et gratuit, c'est aussi un logiciel
      <i>support&eacute; par ses utilisateurs</i>. Toutes vos questions peuvent &ecirc;tre pos&eacute;es aux
      centaines de d&eacute;veloppeurs et utilisateurs de FreeBSD en &eacute;crivant &agrave; la liste de diffusion &eacute;lectronique <a
	  href="mailto:freebsd-questions@FreeBSD.org">freebsd-questions@FreeBSD.org</a>.</p>

      <p>FreeBSD est sans cesse am&eacute;lior&eacute; et document&eacute; par de nombreux
	d&eacute;veloppeurs de part le monde. Le support de
	nouveaux p&eacute;riph&eacute;riques et l'ajout de nouvelles fonctions sont sans
   cesse d&eacute;velopp&eacute;s et l'&eacute;quipe garde toujours une attention toute
	particuli&egrave;re aux probl&egrave;mes pouvant affecter la stabilit&eacute; du
	systeme. Les utilisateurs de FreeBSD sont fiers non seulement
	de la rapidit&eacute; mais &eacute;galement de la fiabilit&eacute; de leur syst&egrave;me.</p>
    </blockquote>

    <h2>Paroles d'expert . . .</h2>

    <blockquote>

      <p><i>"FreeBSD g&egrave;re de fa&ccedil;on excellente [notre] forte charge r&eacute;seau, c'est tout
	  simplement incroyable. Salutations &agrave; toute l'&eacute;quipe FreeBSD."</i></p>

      <div align="right"><p>---Mark Hittinger, administrateur chez WinNet
	  Communications, Inc.</p></div>
    </blockquote>

      &footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
