<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY date "$FreeBSD: www/fr/features.sgml,v 1.4 2005/10/06 12:56:02 blackend Exp $">
<!ENTITY title "A propos des particularit&eacute;s technologiques de FreeBSD">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.19

   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Olivier Cherrier <Olivier.Cherrier@cediti.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
    &header;

    <h2>FreeBSD dispose de nombreuses caract&eacute;ristiques avanc&eacute;es.</h2>

      <p>Quelque soit son utilisation, vous souhaitez que votre mat&eacute;riel
        soit utilis&eacute; &agrave; son plein potentiel. Les caract&eacute;ristiques sophistiqu&eacute;es
        de FreeBSD vous permettent de profiter au mieux de toute la puissance
        de votre machine.</p>
    
    <h2>Un syst&egrave;me d'exploitation complet bas&eacute;
	sur 4.4BSD.</h2>
	
	  <p>Les bases de FreeBSD proviennent des derniers d&eacute;veloppements	<b>BSD</b>
   r&eacute;alis&eacute;s par le Groupe de Recherche sur les Syst&egrave;mes Informatiques ("Computer Systems Research Group") &agrave;
   l'universit&eacute; de Berkeley en Californie. Le livre <i>Conception et Impl&eacute;mentation du Syst&egrave;me 4.4BSD ("The Design and
	Implementation of 4.4BSD Operating System")</i>, &eacute;crit par les
	concepteurs m&ecirc;me du syst&egrave;me 4.4BSD, d&eacute;crit donc en d&eacute;tail de nombreux
	aspects de FreeBSD.</p>

      <p>Gr&acirc;ce au talent et &agrave; l'exp&eacute;rience de nombreux d&eacute;veloppeurs
	volontaires &agrave; travers le monde, le Projet FreeBSD a
	&eacute;tendu les possibilit&eacute;s offertes par le syst&egrave;me
	d'exploitation 4.4BSD. Chaque nouvelle version de FreeBSD
	est ainsi plus stable, plus rapide et offre de nouvelles
        fonctionnalit&eacute;s attendues par les utilisateurs.</p>
    
    <h2>FreeBSD fournit de hautes performances,
      une excellente compatibilit&eacute; avec d'autres syst&egrave;mes d'exploitation et ne demande
      qu'une faible maintenance.</h2>
    
      <p>Les d&eacute;veloppeurs de FreeBSD se sont attaqu&eacute;s &agrave; de nombreux probl&egrave;mes inh&eacute;rents aux
      syst&egrave;mes d'exploitation et vous permettent de b&eacute;n&eacute;ficier des innovations suivantes :</p>

      <ul>
	<li><b>La m&eacute;moire virtuelle et le cache du syst&egrave;me de fichier sont confondus</b>
   et ajustent constamment la taille de la m&eacute;moire allou&eacute;e aux programmes et au
   cache disque. Gr&acirc;ce &agrave; ceci, les programmes b&eacute;n&eacute;ficient d'une excellente gestion de la
	  m&eacute;moire et d'acc&egrave;s disques performants, sans que l'administrateur
	  n'ait &agrave; r&eacute;gler manuellement la taille des caches disques.</li>

	<li>Des <b>modules de Compatibilit&eacute; (Compatibility modules)</b> permettent aux programmes con&ccedil;us pour d'autres syst&egrave;mes
       d'exploitations de fonctionner sous FreeBSD. Cela permet notamment
       d'utiliser des programmes Linux, SCO UNIX, NetBSD et BSD/OS.</li>

	<li>Les <b>files d'attentes du noyau (Kernel Queues)</b> permettent aux programmes de r&eacute;pondre plus efficacement
   &agrave; divers &eacute;v&eacute;nements asynchrones comme des entr&eacute;es/sorties sur des fichiers ou des sockets,
	    augmentant alors les performances du syst&egrave;me et de l'application.</li>

	<li>Les <b>"Filtres d'Acc&egrave;s" (Accept Filters)</b> permettent aux applications r&eacute;seaux intensives,
   tel que les serveurs web, de placer une partie de leurs fonctions au coeur du noyau
   ce qui permet d'am&eacute;liorer les performances.</li>

	<li>Les <b>"mises &agrave; jour &eacute;volu&eacute;es" (Soft Updates)</b> autorisent des performances
   accrues du syst&egrave;me de fichiers sans perdre ni en s&ucirc;ret&eacute; ni en fiabilit&eacute;.
   Le syst&egrave;me analyse les op&eacute;rations portant sur les meta-data du syst&egrave;me de fichiers de fa&ccedil;on &agrave; &eacute;viter d'avoir
	&agrave; r&eacute;aliser toutes ces op&eacute;rations de mani&egrave;re synchrone.
	Au lieu de cela, il conserve en interne l'&eacute;tat des op&eacute;rations sur les meta-data
   qui sont en attente et utilise cette information pour mettre en cache les meta-data,
   r&eacute;&eacute;crire les op&eacute;rations sur les meta-data de fa&ccedil;on &agrave; regrouper les op&eacute;rations
   concernant les m&ecirc;mes fichiers et r&eacute;ordonne les op&eacute;rations sur les meta-data
   de mani&egrave;re &agrave; les g&eacute;rer plus efficacement.</li>

	<li>Le <b>support pour IPsec et IPv6</b> permet d'accro&icirc;tre la s&eacute;curit&eacute; des
   r&eacute;seaux et rend disponible le Protocole Internet de nouvelle g&eacute;n&eacute;ration,
   IPv6.</li>

      </ul>

      <p>Les travaux en cours portent sur le syst&egrave;me de verrouillage fin dans les noyaux
        multiprocesseurs assurant de meilleures performances sur ce type de machines,
        sur les Activations de Planification (Scheduler Activations) permettant une r&eacute;elle gestion parall&egrave;le
        des applications utilisant les threads. Ils portent aussi sur les instantan&eacute;s de syst&egrave;mes de
        fichiers, sur le d&eacute;marrage du syst&egrave;me sans v&eacute;rification du syst&egrave;me de fichiers par fsck, sur des
        optimisations r&eacute;seaux comme des sockets zero-copy et des entr&eacute;es/sorties sockets pilot&eacute;es par &eacute;v&eacute;nements,
        sur le support de l'ACPI (Interface de Configuration Avanc&eacute;e et de gestion de l'Energie) et sur
        des fonctionnalit&eacute;s de s&eacute;curit&eacute; avanc&eacute;es comme le Contr&ocirc;le d'Acc&egrave;s Obligatoire (MAC).</p>

      &footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
