<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY date "$FreeBSD: www/fr/y2kbug.sgml,v 1.3 2004/08/05 20:29:38 stephane Exp $">
<!ENTITY title "Compatibilit&eacute; An 2000 (bug de l'an 2000)">
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.45

   Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Nicolas Lecapitaine <Nicolas.Lecapitaine@chirec.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Antoine Brodin <antoine.brodin@laposte.net>
-->

<html>
    &header;

    <p>A mesure que les d&eacute;cideurs prennent conscience du probl&egrave;me de l'an 2000 (bug de
      l'an 2000), de plus en plus de soci&eacute;t&eacute;s r&eacute;clament un avis
      officiel de la part de leurs fournisseurs de mat&eacute;riels et de logiciels sur
      le passage &agrave; l'an 2000 de leurs produits.</p>

    <p>Les organisations qui utilisent des syst&egrave;mes &unix; ou tr&egrave;s proche d'Unix tel que
      FreeBSD ne sont pas concern&eacute;es par ce probl&egrave;me. FreeBSD conservera
      un temps correct bien apr&egrave;s le passage de l'an 2000.</p>

    <h2>Informations g&eacute;n&eacute;rales</h2>

    <p><i>(Cette section est bas&eacute;e sur le texte de la <a
	  href="http://www.linux.org.uk/mbug.html">page consacr&eacute;e &agrave; la
	  compatibilit&eacute; de Linux avec l'an 2000</a>)</i></p>

    <p>Comme avec tous les syst&egrave;mes Unix et tr&egrave;s proche d'Unix, les heures et les dates dans
      FreeBSD sont repr&eacute;sent&eacute;es de fa&ccedil;on interne par le nombre de secondes &eacute;coul&eacute;es depuis le
      1er Janvier 1970 ("l'Epoque" Unix). Actuellement, ce chiffre est
      stock&eacute; dans un entier 32 bits, ce qui lui permet d'&ecirc;tre valide jusqu'en 2038. Avant
      cette date, nous devrions (si tout va bien) utiliser un compteur sur 64 bits (ou plus)
      qui devrait &ecirc;tre valide jusqu'&agrave; la fin de l'univers.</p>

    <p>Notez bien qu'un syst&egrave;me d'exploitation compatible An 2000 ne pourra pas corriger les applications mal &eacute;crites
      qui ne sont pas compatibles An 2000.</p>

    <p>Notez aussi que le syst&egrave;me d'exploitation s'attends &agrave; lire la date et l'heure courante depuis
      l'horloge CMOS de votre ordinateur. Certains de ces p&eacute;riph&eacute;riques ne g&egrave;rent pas
      correctement l'an 2000. Nous vous recommandons de tester chaque plate-forme
      individuellement pour vous assurer que l'horloge de votre mat&eacute;riel se comporte correctement
      lorsqu'elle passe de l'ann&eacute;e 1999 &agrave; l'ann&eacute;e 2000 et qu'elle interpr&egrave;te correctement l'ann&eacute;e 2000
      comme une ann&eacute;e bissextile.</p>

    <h2>Ce que vous pouvez faire</h2>

    <p>FreeBSD continuera de maintenir un temps correct lors du si&egrave;cle
      prochain. Certaines applications tierces peuvent cependant poser probl&egrave;me. Votre meilleure
      d&eacute;fense contre les probl&egrave;mes li&eacute;s &agrave; l'an 2000 est l'attaque. Ecouter les
      histoires clamant la disparition prochaine du monde tel que nous le connaissons
      <strong>n'est pas</strong> la meilleure fa&ccedil;on de r&eacute;soudre le bug de l'an 2000. Attendre la
      derni&egrave;re minute non plus. Le projet FreeBSD recommande pour votre
      organisation d'appliquer les principes de l'administration syst&egrave;me &agrave; mesure
      que le nouveau mill&eacute;naire approche.</p>

    <h2>Avis officiel concernant FreeBSD et l'an 2000</h2>

    <blockquote>
      <p>"Apr&egrave;s des tests et des analyses approfondis, nous pensons que FreeBSD est
	100% compatible An 2000. Dans le cas improbable o&ugrave; quelque chose aurait &eacute;t&eacute;
	oubli&eacute;, nous ferons de notre mieux pour y rem&eacute;dier dans les plus brefs d&eacute;lais."</p>

      <p align="right">David Greenman<br>Architecte principal, Projet FreeBSD</p>
    </blockquote>

    <h2>Probl&egrave;mes r&eacute;solus</h2>

    <p>Les probl&egrave;mes suivants li&eacute;s &agrave; l'an 2000 ont &eacute;t&eacute; identifi&eacute;s et r&eacute;solus dans
      FreeBSD.</p>

    <dl>
      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=1380">misc/1380</a></dt>

      <dd>Plusieurs programmes ont un "19%d" cod&eacute; en dur pour l'ann&eacute;e.
	Les programmes affect&eacute;s inclus : yacc, ftpd, et make. [Correction : yacc v1.2
	18/01/1999; ftpd v1.7 05/08/1996; make v1.4 06/10/1996; corrections incluses
	dans FreeBSD 2.2 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=1382">conf/1382</a></dt>

      <dd>Le script sed dans /etc/rc.local qui construit la ligne identifiant l'h&ocirc;te/noyau
	pour le message du jour suppose que l'ann&eacute;e ne d&eacute;passe pas 1999.
	[Correction v1.21 24/10/1996; corrections incluses dans FreeBSD 2.2 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=3465">misc/3465</a></dt>

      <dd>La commande etc/namedb/make-localhost g&eacute;n&egrave;re le num&eacute;ro de s&eacute;rie DNS
	sous la forme YYMMDD. En l'an 2000, il sera g&eacute;n&eacute;r&eacute; sous la forme
	1YYMMDD. [Correction v1.2 11/08/1997; corrections incluses dans FreeBSD 2.2.5 et
	sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=4930">gnu/4930</a> et
	  <a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=8321">gnu/8321</a></dt>

      <dd>Les macros groff tmac ont cod&eacute; en dur 19 pour la g&eacute;n&eacute;ration de certaines dates.
	[Correction : tmac.e v1.3 06/12/1998; doc-common v1.10 19/01/1999; corrections incluses
	dans FreeBSD 3.1 et sup&eacute;rieur]</dd>


      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9323">bin/9323</a></dt>

      <dd>Dans sa forme obsol&egrave;te, touch ne traite pas correctement les ann&eacute;es donn&eacute;es avec seulement
        2 chiffres. Les ann&eacute;es 00 &agrave; 68 sont trait&eacute;es
        comme 1900 &agrave; 1968 au lieu de 2000 &agrave; 2068. [Correction v1.7 05/01/1999; corrections incluses dans
        FreeBSD 3.1 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://cvsweb.FreeBSD.org/src/usr.sbin/xntpd/parse/util/dcfd.c">xntpd/parse/util/dcfd.c</a></dt>

      <dd>Le calcul du nombre de jours dans l'ann&eacute;e pour les ann&eacute;es bissextiles et la
	conversion du temps DCF77 en secondes depuis l'Epoque &eacute;taient fausses. Ces
	erreurs affectaient toutes les ann&eacute;es. [Correction v1.6 12/01/1999; corrections incluses dans
	FreeBSD 3.1 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://cvsweb.FreeBSD.org/src/gnu/usr.bin/tar/getdate.y">tar/getdate.y</a></dt>

      <dd>La fonction Convert() &eacute;taient cod&eacute;es en dur pour les ann&eacute;es en 2 chiffres de 70 &agrave; 99.
	D&eacute;sormais corrig&eacute;e pour permettre les ann&eacute;es en 2 chiffres de 1970 &agrave; 2069. La fonction
	ne permet pas les ann&eacute;es s&eacute;culaires non bissextiles - alerte pour 2100 ! [Correction v1.4
	12/01/1999; corrections incluses dans FreeBSD 3.1 et sup&eacute;rieur]
      </dd>

      <dt><a
	  href="http://cvsweb.FreeBSD.org/src/usr.bin/fetch/http.c">fetch/http.c</a></dt>

      <dd>Le protocole HTTP inclut un format de date obsol&egrave;te qui utilise une
	ann&eacute;e en 2 chiffres. Les versions pr&eacute;c&eacute;dentes de fetch interpr&egrave;teraient de telles
	dates comme &eacute;tant dans les ann&eacute;es 19xx; apr&egrave;s cette r&eacute;vision, le pivot d&eacute;crit
	dans <a href="ftp://ftp.cdrom.com/pub/internet/rfc/rfc2068.txt">RFC
	  2068</a> est utilis&eacute;, ce qui permet aux ann&eacute;es en 2 chiffres d'&ecirc;tre interpr&eacute;t&eacute;es
	comme appartenant toujours au si&egrave;cle courant sauf si elles sont situ&eacute;es 50 ans ou
	plus dans le futur. Comme les serveurs HTTP qui utilisent ce
	format ne sont plus tr&egrave;s r&eacute;pandus, cela ne devrait pas avoir un
	impact significatif. [Correction v1.24 15/01/1999; corrections incluses dans FreeBSD 3.1
	et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9500">misc/9500</a></dt>

      <dd>Le script `edithook' dans le r&eacute;pertoire CVSROOT utilise un tm_year "brut"
	et affichera par cons&eacute;quent 01/01/100 pour 2000-JAN-01. [Correction v1.2
	17/01/1999; non applicable aux versions de FreeBSD]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9501">bin/9501</a></dt>

      <dd>Plusieurs fichiers cvs ne sont pas compatibles An 2000. Les scripts log.pl et
	sccs2rcs.csh ajoutent "19" &agrave; l'ann&eacute;e ce qui provoque l'affichage
	de 19100 pour 2000. Le script log_accum.pl utilise &agrave; un endroit une ann&eacute;e en
	2 chiffres et suppose &agrave; un autre endroit que le tm_year est l'ann&eacute;e dans le
	si&egrave;cle au lieu du nombre d'ann&eacute;es depuis 1900. [Correction : log.pl v1.2 15/01/1999;
	sccs2rcs.csh v1.3 15/01/1999; corrections incluses dans FreeBSD 3.1 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9502">bin/9502</a></dt>
      <dd>Le num&eacute;ro de registre 'yr' de groff est assign&eacute; depuis un (struct
	tm).tm_year et repr&eacute;sente par cons&eacute;quent le nombre d'ann&eacute;es depuis 1900
	et non pas l'ann&eacute;e dans le si&egrave;cle (voir d&eacute;finition dans troff/input.cc).
	[Correction, maintenant mis &agrave; modulo 100, troff/input.cc V1.2 03/06/1999; corrections
	incluses dans FreeBSD 3.3]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9503">bin/9503</a></dt>

      <dd>simple_httpd de PicoBSD utilise un tm_year "brut" et affichera par cons&eacute;quent
	01/01/100 pour 2000-JAN-01. [Correction v1.2 16/01/1999; corrections incluses dans
	FreeBSD 3.1 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9505">bin/9505</a></dt>

      <dd>Adduser utilise un tm_year "brut" et affichera par cons&eacute;quent un 100/01/01 pour
	2000-JAN-01. [Correction v1.42 15/01/1999; corrections incluses dans FreeBSD 3.1 et
	sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9506">bin/9506</a></dt>

      <dd>Cron utilise un tm_year "brut" et affichera par cons&eacute;quent 100 pour 2000.
	[Correction v1.7 16/01/1999; corrections incluses dans FreeBSD 3.1 et sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=9507">bin/9507</a></dt>

      <dd>tcpslice(8) utilise un tm_year "brut" et affichera par cons&eacute;quent
	100y01m01d... pour 2000-JAN-01. Pour des raisons de compatibilit&eacute;, utiliser une ann&eacute;e en 2 chiffres
	jusqu'&agrave; l'an 2000. [Correction v1.8 20/01/1999; corrections incluses dans FreeBSD 3.1 et
	sup&eacute;rieur]</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=14472">bin/14472</a></dt>

      <dd>La commande Date ne prend pas les chiffres des milliers/centaines. [Correction v1.31 10/11/1999]
	</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=14511">misc/14511</a></dt>

      <dd>Chpass pose probl&egrave;me lorsqu'on utilise 00 comme ann&eacute;e d'expiration.
	</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=15852">bin/15852</a> et
	  <a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=16045">gnu/16045</a> et
	  <a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=16207">bin/16207</a>
	  </dt>

      <dd>La cha&icirc;ne pr&eacute;d&eacute;finie \*(DT [\*(td] de Groff a un bug An 2000. [Corrig&eacute; avec la mise &agrave; jour de la
        version 1.15 12/01/2000]
	</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=15872">bin/15872</a></dt>

      <dd>at(1) pose probl&egrave;me avec des d&eacute;finitions de temps correctes si tm_year vaut 100,
      signale un `garbled time' (temps tronqu&eacute;).
	</dd>

      <dt><a
	  href="http://www.FreeBSD.org/cgi/query-pr.cgi?pr=16238">misc/16238</a></dt>

      <dd>L'installation de KerberosIV ne fonctionne pas correctement &agrave; cause d'une date d'expiration
	fix&eacute;e au 31/12/99 cod&eacute;e en dur dans la source Kerberos du 'ticket
	granter'. [Correction v1.24 19/09/1999]
	</dd>
    </dl>

    <h2>Plus d'informations</h2>

    <p>Si vous avez des questions suppl&eacute;mentaires &agrave; propos de la compatibilit&eacute; An 2000 de FreeBSD ou
      si vous avez d&eacute;couvert une application fonctionnant sous FreeBSD qui n'est pas compatible
      An 2000, veuillez contacter le projet &agrave; l'adresse <a
	href="mailto:freebsd-bugs@FreeBSD.org">freebsd-bugs@FreeBSD.org</a>.</p>

      &footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
