Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/trademarks/_index.po
Languages: pt_br, ru

source: Guidelines for trademarks in the FreeBSD Documentation Project
pt_br: Diretrizes para marcas registradas no Projeto de Documentação do FreeBSD
ru: Руководство по использованию товарных знаков в Документационном проекте FreeBSD

source: Chapter 14. Trademarks
pt_br: Chapter 14. Marcas Registradas
ru: Глава 14. Товарные знаки

source: Trademarks
pt_br: Marcas Registradas
ru: Товарные знаки

source: For all documents on the FreeBSD Documentation Project, citing registered trademarks is necessary and other trademarks is customary, and that is a requirement for every writer and contributor.
pt_br: Para todos os documentos do Projeto de Documentação do FreeBSD, é necessário citar as marcas registradas e os outros tipos são habituais, e isso é um requisito para todo escritor e colaborador.
ru: Для всех документов в рамках проекта FreeBSD Documentation Project необходимо указывать зарегистрированные товарные знаки, а также принято указывать другие товарные знаки, и это является требованием для каждого автора и участника.

source: Trademark Symbols
pt_br: Símbolos de Marca Registrada
ru: Символы товарных знаков

source: Append a trademark symbol ((TM), (R), or other) to the first occurrence of the trademarked name, and always when using logos. Use the extref:{fdp-primer}/writing-style/#writing-style-special-characters[equivalent ASCII sequence], which will be rendered as the actual Unicode character. Also, write the trademarked name following its trademark guidelines.
pt_br: Acrescente um símbolo de marca registrada ((TM), (R) ou outros símbolos) na primeira ocorrência do nome da marca e sempre ao usar logotipos. Use a extref:{fdp-primer}/writing-style/#writing-style-special-characters[sequência ASCII equivalente], que será renderizada como o caractere Unicode real. Além disso, escreva o nome da marca registrada seguindo as diretrizes da marca registrada.
ru: Добавьте символ товарного знака ((TM), (R) или другой) к первому упоминанию зарегистрированного названия и всегда при использовании логотипов. Используйте extref:{fdp-primer}/writing-style/#writing-style-special-characters[эквивалентную ASCII-последовательность], которая будет отображаться как соответствующий символ Юникода. Также пишите зарегистрированное название в соответствии с его правилами использования товарного знака.

source: When in doubt, research the trademark owner's website, the product's website, and or the link:https://www.uspto.gov/trademarks[United States Patent and Trademark Office trademark search website].
pt_br: Em caso de dúvida, pesquise o site do proprietário da marca registrada, o site do produto e/ou o site link:https://www.uspto.gov/trademarks[United States Patent and Trademark Office trademark search].
ru: Если сомневаетесь, изучите сайт владельца товарного знака, сайт продукта и/или сайт link:https://www.uspto.gov/trademarks[Ведомства по патентам и товарным знакам США для поиска товарных знаков].

source: Trademark Citing
pt_br: Citação de Marca Registrada
ru: Цитирование товарных знаков

source: The FreeBSD Documentation Project provides a template for citing trademarks, which also avoids duplicating trademarks in the documents.
pt_br: O Projeto de Documentação do FreeBSD fornece um modelo para citar marcas registradas, o que também evita a duplicação de marcas registradas nos documentos.
ru: Проект документации FreeBSD предоставляет шаблон для указания товарных знаков, что также позволяет избежать их дублирования в документах.

source: First, look for the trademark in the link:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[Copyright section in the project's template], then add it to the trademarks tag on the `Front Matter` section of the document, located at the beginning of each document.
pt_br: Primeiro, procure a marca registrada na link:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[Seção de direitos autorais no modelo do projeto] e adicione-a às tags de marcas registradas na seção 'Front Matter' do documento, localizada no início de cada documento.
ru: Сначала найдите товарный знак в разделе link:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[Copyright в шаблоне проекта], затем добавьте его в тег `trademarks` в разделе `Front Matter` документа, который расположен в начале каждого документа.

source: The following is an example of the `Front Matter` of the extref:{contributing}[Contributing to FreeBSD] article:
pt_br: O seguinte é um exemplo de `Front Matter` do artigo extref:{contributing}[Contribuindo com o FreeBSD]:
ru: Вот пример `Front Matter` из статьи extref:{contributing}[Вклад в FreeBSD]:

source: The trademark tags `freebsd`, `ieee`, and `general` will be automatically rendered when building the document like this:
pt_br: As tags de marca registrada `freebsd`, `ieee` e `general` serão renderizadas automaticamente ao compilar o documento, ficando desta forma:
ru: Товарные знаки `freebsd`, `ieee` и `general` будут автоматически отображаться при сборке документа следующим образом:

source: If a trademark is not present in the project's template, it must be submitted. Any developer or contributor can update the trademarks.
pt_br: Caso a marca não esteja presente no template do projeto, ela deve ser submetida. Qualquer desenvolvedor ou colaborador pode atualizar as marcas registradas.
ru: Если товарный знак отсутствует в шаблоне проекта, его необходимо предоставить. Любой разработчик или участник может обновлять товарные знаки.

source: The `freebsd` and `general` trademark tags are usually present in all documents.
pt_br: As tags de marca registrada `freebsd` e `general` geralmente estão presentes em todos os documentos.
ru: Теги товарных знаков `freebsd` и `general` обычно присутствуют во всех документах.
