<!--
     The FreeBSD Documentation Project


     The FreeBSD Spanish Documentation Project


     %SOURCE% en_US.ISO8859-1/books/handbook/install/chapter.sgml
     %SRCID%    1.390


$FreeBSD$
$FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/install/chapter.sgml,v 1.5 2004/10/08 18:48:47 jesusr Exp $


-->

<chapter id="install">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Reestructurado, reorganizado y con 
	  algunas partes reescritas por </contrib>
      </author>
    </authorgroup>

    <authorgroup>
      <author>
	<firstname>Randy</firstname>
	<surname>Pratt</surname>
	<contrib>El recorrido por sysinstall, las capturas de 
	  pantalla y el texto original son obra de </contrib>
      </author>
    </authorgroup>
    <!-- January 2000 -->
  </chapterinfo>

  <title>Instalaci&oacute;n de &os;</title>

  <sect1 id="install-synopsis">
    <title>Sinopsis</title>

    <indexterm><primary>instalaci&oacute;n</primary></indexterm>

    <para>&os; dispone de un programa en modo texto muy f&aacute;cil de 
      usar llamado <application>sysinstall</application>.  Es el programa 
      de instalaci&oacute;n por omisi&oacute;n en &os;, pero quien decida 
      distribuir &os; tiene todo el derecho de facilitar un sistema de 
      instalaci&oacute;n propio si as&iacute; lo desea.  Este cap&iacute;tulo 
      trata sobre c&oacute;mo usar <application>sysinstall</application> 
      para instalar &os;</para>

    <para>Tras leer este cap&iacute;tulo sabr&aacute; usted:</para>

    <itemizedlist>
      <listitem>
	<para>C&oacute;mo crear los discos de instalaci&oacute;n de 
          &os;</para>
      </listitem>
      
      <listitem>
        <para>C&oacute;mo interpreta (y subdivide) &os; sus discos 
          duros.</para>
      </listitem>

      <listitem>
	<para>C&oacute;mo arrancar <application>
          sysinstall</application>.</para>
      </listitem>

      <listitem>
        <para>Qu&eacute; preguntas le har&aacute; <application>
          sysinstall</application>, qu&eacute; significan y c&oacute;mo 
          responderlas.</para> 
      </listitem>
    </itemizedlist>

    <para>Antes de leer este cap&iacute;tulo deber&iacute;a usted:</para>

    <itemizedlist>
      <listitem>
	<para>Leer la lista de hardware soportado que se suministra con la 
	  con la versi&oacute;n de &os; que va a instalar y verificar que su 
	  hardware est&aacute; en dicha lista.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>En general &eacute;stas instrucciones de instalaci&oacute;n 
        han sido escritas para computadoras de arquitectura &i386; 
	(&laquo;PC compatible&raquo;).  En algunos puntos concretos 
	se dar&aacute;n instrucciones espec&iacute;ficas para otras 
	plataformas (por ejemplo Alpha).  A pesar de que esta gu&iacute;a 
	se intenta mantener todo lo al d&iacute;a que es posible 
	puede que se encuentre con peque&ntilde;as diferencias entre el 
	programa de instalaci&oacute;n y lo que aqu&iacute; se le 
	muestra.  Le sugerimos que use este cap&iacute;tulo como una 
	gu&iacute;a general m&aacute;s que como un manual literal de 
	instalaci&oacute;n.</para>
    </note>

  </sect1>

   <sect1 id="install-hardware">
    <title>Requisitos de hardware</title>

    <sect2 id="install-hardware-minimal">
      <title>Configuraci&oacute;n m&iacute;nima</title>

      <para>La configuraci&oacute;n m&iacute;nima para instalar &os;
        var&iacute;a seg&uacute;n la versi&oacute;n de &os; y la arquitectura
	de hardware.</para>

      <para>Tiene informaci&oacute;n sobre la confuraci&oacute;n
        m&iacute;nima en las Notas de Instalaci&oacute;n que encontrar&aacute;
	en la secci&oacute;n de <ulink
	url="http://www.FreeBSD.org/releases/index.html">Informaci&oacute;n de
	Releases</ulink> del sitio web de &os;.  En la siguiente
	secci&oacute;n se facilita un resumen de dicha informaci&oacute;n.  
	Dependiendo de cu&aacute;l sea el m&eacute;todo de instalaci&oacute;n
	que elija para instalar &os; necesitar&aacute; un floppy, un lector de
	CDROM que pueda utilizar con &os; o quiz&aacute;s un adaptador de
	red.  Todo esto se explica en la <xref
	linkend="install-floppies">.</para>

      <sect3>
	<title>&os;/&arch.i386; y &os;/&arch.pc98;</title>

	<para>Tanto &os;/&arch.i386; como &os;/&arch.pc98; necesitan
	  un procesador 486 o superior y un m&iacute;nimo de
	  24&nbsp;MB de RAM.  Necesitar&aacute; tambi&eacute;n al menos
	  150&nbsp;MB de espacio libre en disco, que es lo que necesita
	  la instalaci&oacute;n m&iacute;nima.</para>

	<note>
	  <para>En sistemas muy antiguos la mayor&iacute;a de las veces
	    ser&aacute; de mucha m&aacute;s ayuda conseguir m&aacute;s
	    RAM y espacio de disco que un procesador m&aacute;s
	    r&aacute;pido.</para>
	</note>
      </sect3>

      <sect3>
	<title>&os;/&arch.alpha;</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Para instalar &os;/&arch.alpha; necesitar&aacute; una
	  plataforma que est&eacute; soportada
	  (consulte <xref linkend="install-hardware-supported">) y un
	  disco duro dedicado a &os;.  En este momento no es posible
	  compartir un disco con otro sistema operativo.  Este disco
	  debe estar necesariamente conectado a una controladora SCSI
	  que est&eacute; soportada por el firmware SRM, o si se trata
	  de un disco IDE el SRM de su m&aacute;quina debe permitir el
	  arranque desde discos IDE.</para>

	<indexterm><primary>ARC</primary></indexterm>
	<indexterm><primary>Alpha BIOS</primary></indexterm>
	<indexterm><primary>SRM</primary></indexterm>

	<para>Necesitar&aacute; el firmware de la consola SRM de
	  su plataforma.  En ciertos casos es posible pasar del
	  firmware AlphaBIOS (o ARC) al SRM.  En otros casos
	  no habr&aacute; m&aacute;s remedio que descargar un nuevo
	  firmware desde el sito web del fabricante.</para>

	<note>
	  <para>A partir de &os;&nbsp;7.0 no hay soporte para
	    Alpha.  La serie &os;&nbsp;6.<replaceable>X</replaceable>
	    es la &uacute;ltima que ofrece soporte para esta
	    arquitectura.</para>
	</note>

      </sect3>

      <sect3>
	<title>&os;/&arch.amd64;</title>

	<para>Hay dos tipos de procesadores capaces de ejecutar
	  &os;/&arch.amd64;.  La primera son los procesadores AMD64,
	  entre los que est&aacute;n los &amd.athlon;64,
	  &amd.athlon;64-FX, &amd.opteron; y los modelos
	  superiores.</para>

	<para>La segunda categor&iacute;a de procesadores que
	  pueden usar &os;/&arch.amd64; es la de los procesadores
	  de arquitectura EM64T de &intel;, por ejemplo las familias
	  de procesadores &intel;&nbsp;&core;&nbsp;2 Duo, Quad, y Extreme,
	  y la secuencia de procesadores &intel;&nbsp;&xeon; 3000, 5000 y
	  7000.</para>

	<para>Si tiene una m&aacute;quina basada en una nVidia nForce3
	  Pro-150 <emphasis>tendr&aacute; que usar la configuraci&oacute;n
	  de la BIOS</emphasis> para deshabilitar IO ACPI.  Si no tiene la
	  opci&oacute;n de hacerlo tendr&aacute; que deshabilitar ACPI.  Hay
	  errores en el chipset Pro-150 para los que no hemos encontrado
	  a&uacute;n una soluci&oacute;n.</para>
      </sect3>


      <sect3>
	<title>&os;/&arch.sparc64;</title>

	<para>Para instalar &os;/&arch.sparc64; necesita una plataforma que
	  est&eacute; soportada (consulte la <xref
	  linkend="install-hardware-supported">).</para>

	<para>Necesitar&aacute; un disco dedicado a &os;/&arch.sparc64;.  De
	  momento es imposible compartir un disco duro con otro sistema
	  operativo.</para>
      </sect3>
    </sect2>

    <sect2 id="install-hardware-supported">
      <title>Hardware soportado</title>

      <para>Cada versi&oacute;n de &os; incluye una lista de hardware
        soportado en las &laquo;&os; Hardware Notes&raquo;.  Este
	documento suele estar en un fichero llamado
	<filename>HARDWARE.TXT</filename>, que est&aacute; en el
	directorio raiz del CDROM o distribuci&oacute;n FTP, o en el
	men&uacute; de documentaci&oacute;n de
	<application>sysinstall</application>.  En este documento se
	listan los dispositivos de hardware que se sabe que funcionan
	con cada versi&oacute;n de &os; y para qu&eacute;
	arquitectura.  En la p&aacute;gina de <ulink
	url="http://www.FreeBSD.org/releases/index.html">Informaci&oacute;n
	de Releases</ulink> del sitio web de &os; encontrar&aacute;
	copias de esta lista para diversas releases y arquitecturas.</para>
    </sect2>
  </sect1>




  <sect1 id="install-pre">
    <title>Tareas anteriores a la instalaci&oacute;n</title>

    <sect2 id="install-inventory">
      <title>Inventario de su sistema</title>

      <para>Antes de instalar &os; en su sistema deber&iacute;a hacer
	un inventario de los componentes de su computadora.  El sistema
	de instalaci&oacute;n de &os; le mostrar&aacute; los componentes
	(discos duros, tarjetas de red, unidades de CDROM, etc.) con sus
	datos de modelo y fabricante.  &os; tratar&aacute; tambi&eacute;n
	de determinar la configuraci&oacute;n correcta para dichos
	dispositivos, lo que incluye informaci&oacute;n sobre las IRQ y
	el uso de puertos IO.  A causa de la ingente variedad de hardware
	para PC este proceso no siempre se puede culminar con &eacute;xito
	y es posible que deba corregir las decisiones de &os; retocando
	la configuraci&oacute;n.</para>

      <para>Si ya dispone de otro sistema operativo instalado (como
	&windows; o Linux) puede usar los recursos que dicho o dichos
	sistemas operativos le faciliten para determinar exactamente
	qu&eacute; hardware tiene y c&oacute;mo est&aacute; configurado.  
	Si tiene del todo claro qu&eacute; configuraci&oacute;n est&aacute;
	usando una tarjeta de expasi&oacute;n concreta es posible que
	pueda encontrar esos datos impresos en la propia tarjeta.  Es muy
	habitual el uso de las IRQ 3, 5 y 7 y las direcciones de los
	puertos IO suelen representarse con n&uacute;meros hexadecimales,
	como 0x330.</para>

      <para>Le recomendamos imprimir o tomar nota de todos esos datos
	antes de instalar &os;.  Una tabla como esta puede serle de mucha 
	ayuda:</para>

      <table pgwide="1" frame="none">
	<title>Ejemplo de inventario de dispositivos

	<tgroup cols="4">
          <colspec colwidth="2*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">
	  <thead>
	    <row>
	      <entry>Nombre de dispositivo</entry>

	      <entry>IRQ</entry>

	      <entry>Puerto(s) IO</entry>

	      <entry>Notas</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry>Primer disco duro</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>40&nbsp;GB, fabricado por Seagate, primer maestro IDE </entry>
	    </row>

	    <row>
	      <entry>CDROM</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Primer esclavo IDE</entry>
	    </row>

	    <row>
	      <entry>Segundo disco duro</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>20&nbsp;GB, fabricado por IBM, segundo maestro IDE</entry>
	    </row>

	    <row>
	      <entry>Primera controladora IDE</entry>

	      <entry>14</entry>

	      <entry>0x1f0</entry>

	      <entry></entry>
	    </row>

	    <row>
	      <entry>Tarjeta de red</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&intel; 10/100</entry>
	    </row>

	    <row>
	      <entry>M&oacute;dem</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&tm.3com; 56K faxmodem, en COM1</entry>
	    </row>

	    <row>
	      <entry>&hellip;</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>




      <para>Una vez termine el inventorio de componentes de su sistema
        debe comprobar si aparecen en la lista de hardware soportado de
	la versi&oacute;n de &os; que vaya a instalar.</para>
    </sect2>

    <sect2>
      <title>Haga una copia de seguridad de sus datos</title>
      
      <para>Si la m&aacute;quina en la que va a instalar &os; contiene
	datos que desea conservar por alg&uacute;n motivo
	aseg&uacute;rese de haber hecho una copia de seguridad de los
	mismos y de que esa copia es de fiar antes de instalar &os;.  
	El sistema de instalaci&oacute;n de &os; le mostrar&aacute; una
	advertencia antes de modificar datos en su disco pero una vez
	que el proceso ha comenzado no hay manera de dar marcha
	atr&aacute;s.</para>
    </sect2>

    <sect2 id="install-where">
      <title>Decida d&oacute;nde instalar &os;</title>

      <para>Si quiere que &os; use todo su disco duro puede saltar
	tranquilamente a la siguiente secci&oacute;n.</para>

      <para>Si por el contrario necesita que &os; coexista con otros
	sistemas operativos tendr&aacute; que comprender c&oacute;mo
	se almacenan los datos en el disco duro y c&oacute;mo le afecta
	esto.</para>

      <sect3 id="install-where-i386">
	<title>Esquemas de disco en &os;/&i386;</title>



      <para>Un disco de PC puede dividirse en varias partes.  Estas partes
        reciben el nombre de <firstterm>partitions</firstterm>.  Dado
	que &os; internamente tambi&eacute;n tiene particiones la
	nomenclatura puede ser confusa muy r&aacute;pidamente, as&iacute;
	que estas partes del disco reciben el nombre de &laquo;disk
	slices&raquo; o sencillamente &laquo;slices&raquo; 
	(&laquo;rebanadas de disco&raquo;y &laquo;rebanadas&raquo;
	respectivamente).  Por ejemplo, la versi&oacute;n de
	<command>fdisk</command> que usar&aacute; &os; con las particiones
	de disco de PC usa la palabra &laquo;slices&raquo; en lugar de
	&laquo;partitions&raquo;.  Debido a limitaciones de dise&ntilde;o
	la plataforma PC s&oacute;lo admite cuatro particiones por disco.  Dichas
	particiones reciben el nombre de <firstterm>particiones
	primarias</firstterm>.  Esta limitaci&oacute;n puede sortearse
	(y de ese modo disponer de m&aacute;s de cuatro particiones)
	gracias a que se cre&oacute; un nuevo tipo de partici&oacute;n,
	las <firstterm>particiones extendidas</firstterm>.  Un disco puede
	contener una &uacute;nica partici&oacute;n extendida.  Dentro de ella
	pueden crearse particiones especiales, que reciben el nombre de
	<firstterm>particiones l&oacute;gicas</firstterm>.</para>

      <para>Cada partici&oacute;n tiene un <firstterm>identificador de
	partici&oacute;n</firstterm> (o  <firstterm>partition ID</firstterm>),
	que es un n&uacute;mero que se usa para identificar el tipo de datos que
	alberga la partici&oacute;n.  Las particiones &os; tienen como
	identificador de partici&oacute;n <literal>165</literal>.</para>

      <para>Normalmente cada sistema operativo que vaya a utilizar
	identificar&aacute; las particiones de un modo propio.  Por ejemplo
	DOS (y sus descendientes,  como &windows;) asignan a cada
	partici&oacute;n primaria y l&oacute;gica una
	<firstterm>letra de unidad</firstterm> a partir de
	<devicename>C:</devicename>.</para>

      <para>&os; debe instalarse en una partici&oacute;n primaria.  &os;
	puede albergar todos los datos que necesita, incluyendo cualquier
	fichero que pueda usted crear, en esta partici&oacute;n.  Si tiene
	usted varios discos duros puede crear particiones para que &os; las
	use en todos ellos o en algunos nada m&aacute;s.  Al instalar &os;
	debe usar al menos una partici&oacute;n.  Puede usar una
	partici&oacute;n vac&iacute;a que haya preparado o puede usar
	tambi&eacute;n una partici&oacute;n que contenga datos que no desea
	conservar.</para>

      <para>Si est&aacute; usando todas las particiones de todos sus discos
	tendr&aacute; que dejar libre una de ellas para &os; usando las
	herramientas del otro sistema operativo que est&eacute; usando
	(por ejemplo <command>fdisk</command> en DOS o en
	&windows;).</para>

      <para>Si tiene una partici&oacute;n sobrante puede usarla, pero puede
	verse en la necesidad de reducir una o m&aacute;s de las particiones
	que est&aacute; usando.</para>

      <para>Una instalaci&oacute;n m&iacute;nima de &os; cabr&iacute; en
	s&oacute;lo 100&nbsp;MB de disco pero tenga en cuenta que apenas
	quedar&iacute;a espacio para los ficheros que quiera crear.  Un
	m&iacute;nimo m&aacute;s realista ser&iacute;a de 250&nbsp;MB si no
	pretende usar entorno gr&aacute;fico y 350&nbsp;MB o m&aacute;s si
	quiere usar un interfaz gr&aacute;fico de usuario.  Si quiere instalar
	gran cantidad de software para usarlo en &os; sin duda 
	necesitar&aacute; m&aacute;s espacio.</para>

       <para>Para ello puede usar herramientas comerciales como
        <application>&partitionmagic;</application> o libres como
	<application>GParted</application> para redimensionar sus
	particiones y hacer sitio para &os;.  El directorio
	<filename>tools</filename> directory del CDROM de instalaci&oacute;n
	contiene dos herramientas libres con las que puede hacer hacer
	esta redimensi&oacute;n:
	<application>FIPS</application> y
	<application>PResizer</application>.  En el mismo directorio
	encontrar&aacute; documentaci&oacute;n de ambas.  
	<application>FIPS</application>,
	<application>PResizer</application> y
	<application>&partitionmagic;</application> pueden redimensionar
	particiones <acronym>FAT16</acronym> y <acronym>FAT32</acronym>,
	que pueden encontrarse desde &ms-dos; hasta &windows; ME.  Tanto
	<application>&partitionmagic;</application> como
	<application>GParted</application> funcionan tambi&eacute;n en
	particiones <acronym>NTFS</acronym>.  <application>GParted</application>
	forma parte de diversas distribuciones de &laquo;Live CD&raquo; de Linux,
	como <ulink
	 url="http://www.sysresccd.org/">SystemRescueCD</ulink>.</para>


      <para>Hay informes de problemas redimensionando particiones de
        &microsoft; Vista.  Le recomendamos tener a mano un disco de
	instalaci&oacute;n de Vista cuando intente hacer esto.  Lo dicho
	para cualquier otra tarea de mantenimiento de discos es v&aacute;lido
	aqu&iacute;: tenga una copia de seguridad <emphasis>fiable</emphasis>
	y reciente a mano.</para>

      <warning>
	<para>El uso incorrecto de estas herramientas puede borrar datos
	  de su disco duro.  Recuerde, aseg&uacute;rese de disponer de
	  copias de seguridad recientes y utilizables antes de
	  usarlas.</para>
      </warning>

      <example>
	<title>Uso de una partici&oacute;n sin cambiar nada</title>

	<para>Supongamos que tiene una m&aacute;quina con un s&oacute;lo
	  disco de 4&nbsp;GB que ya tiene una versi&oacute;n de &windows;
	  instalada y que ese disco est&aacute; dividido en dos unidades,
	  <devicename>C:</devicename> y <devicename>D:</devicename>, cada
	  una de las cuales tiene un tama&ntilde;o de  2&nbsp;GB.  Tiene
	  1&nbsp;GB de datos en <devicename>C:</devicename> y 0.5&nbsp;GB de
	  datos en <devicename>D:</devicename>.</para>

	<para>Esto significa que su disco duro tiene dos particiones, una
	  por cada letra de unidad.  Copie todos sus datos de 
	  <devicename>D:</devicename> en <devicename>C:</devicename>; de
	  este modo vaciar&aacute; la segunda partici&oacute; y podr&aacute;
	  usarla con &os;.</para>
      </example>

      <example>
	<title>Reducir una partici&oacute;n existente</title>

	<para>Suponga que tiene una m&aacute;quina con un s&oacute;lo disco
	  de 4&nbsp;GB que contiene una versi&oacute;n de &windows; instalada.  
	  Cuando instal&oacute; &windows; cre&oacute; una gran
	  partici&oacute;n, lo que le di&oacute; como resultado una unidad
	  <devicename>C:</devicename> de 4&nbsp;GB.  Est&aacute; usando
	  1.5&nbsp;GB de espacio y quiere que &os; tenga  2&nbsp;GB de
	  espacio.</para>

	<para>Para poder instalar &os; tendr&aacute; que realizar una de
	  las siguientes tareas:</para>

	<orderedlist>
	  <listitem>
	    <para>Haga una copia de sus datos de &windows; y despu&eacute;s
	    reinstale &windows;, eligiendo una partici&oacute;n de 2&nbsp;GB
	    en el momento de la instalaci&oacute;n.</para>
	  </listitem>

	  <listitem>
	    <para>Utilice alguna herramienta del estilo de
	      <application>&partitionmagic;</application> que se han
	      descrito antes para reducir el tama&ntilde;o de su
	      partici&oacute;n de &windows;.</para>
	  </listitem>
	</orderedlist>
      </example>

      </sect3>

      <sect3>
	<title>Estructura de discos en Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Tendr&aacute; que dedicar un disco de su sistema
	  para usar &os; puesto que de momento es imposible compartir
	  un disco con otro sistema operativo.  Dependiendo de la
	  la m&aacute;quina Alpha que tenga el disco podr&aacute; ser
	  SCSI o IDE en la medida en que sea posible arrancar desde
	  tales discos.</para>

	<para>Siguiendo las normas de los manuales de Digital / Compaq
	  todos los datos suministrados a SRM se muestran en
	  may&uacute;sculas.  SRM no distingue entre may&uacute;sculas y
	  min&uacute;sculas.</para>

	<para>Use <literal>SHOW DEVICE</literal> en la consola de SRM
	  para saber qu&eacute; tipo de discos hay en su sistema:</para>

	<screen>&gt;&gt;&gt;<userinput>SHOW DEVICE</userinput>
dka0.0.0.4.0               DKA0           TOSHIBA CD-ROM XM-57  3476
dkc0.0.0.1009.0            DKC0                       RZ1BB-BS  0658
dkc100.1.0.1009.0          DKC100             SEAGATE ST34501W  0015
dva0.0.0.0.1               DVA0
ewa0.0.0.3.0               EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0            PKC0                  SCSI Bus ID 7  5.27
pqa0.0.0.4.0               PQA0                       PCI EIDE
pqb0.0.1.4.0               PQB0                       PCI EIDE</screen>

	<para>Este ejemplo es de una Digital Personal Workstation
	  433au y muestra tres discos instalados en el sistema.  
	  El primer disco es una unidad CDROM llamada
	  <devicename>DKA0</devicename> y los otros dos reciben los nombres
	  de <devicename>DKC0</devicename> y <devicename>DKC100</devicename>
	  respectivamente.</para>

	<para>Los discos con nombres tipo  <devicename>DKx</devicename>
	  son discos SCSI.  Por ejemplo <devicename>DKA100</devicename>
	  se refiere a un disco SCSI con el &laquo;target ID 1&raquo; en
	  el primer bus SCSI (A), mientras que <devicename>DKC300</devicename>
	  es un disco SCSI con un ID 3 en el tercer bus SCSI (C).  
	  Los nombres de dispositivo <devicename>PKx</devicename> son para
	  adaptadores de bus SCSI.  Como hemos visto en la salida de
	  <literal>SHOW DEVICE</literal> las unidades CDROM SCSI son
	  consideradas iguales a otros discos duros SCSI.</para>

	<para>Los discos IDE tienen nombres similares a <devicename>
	  DQx</devicename>, mientras que <devicename>PQx</devicename> es la
	  controladora IDE asociada.</para>

      </sect3>
    </sect2>

    <sect2>
      <title>Recopile los datos de la configuraci&oacute;n 
	de la red</title>

      <para>Si pretende conectarse a alguna red durante la instalaci&oacute;n
	de &os; (por ejemplo si pretende hacerlo desde un sitio FTP o mediante
	un servidor NFS) tendr&aacute; que conocer la configuraci&oacute;n de
	su red.  Durante la instalaci&oacute;n se le pedir&aacute;n esos datos
	para que &os; pueda conectarse a la red y realizar la
	instalaci&oacute;n.</para>

      <sect3>
	<title>Conexi&oacute;n a una red Ethernet o a un m&oacute;dem
	  Cable/DSL</title>

	<para>Necesitar&aacute; la siguiente informaci&oacute;n si va a 
	  conectarse a una red Ethernet o si tiene una conexi&oacute;n a 
	  Internet a trav&eacute;s de una adaptador Ethernet via cable o 
	  DSL:</para>

	<orderedlist>
	  <listitem>
	    <para>Direcci&oacute;n IP</para>
	  </listitem>

	  <listitem>
	    <para>Direcci&oacute;n IP de la pasarela (&laquo;gateway&raquo;,
	      &laquo;puerta de enlace&raquo;)</para>
	  </listitem>

	  <listitem>
	    <para>Nombre del sistema (&laquo;hostname&raquo;)</para>
	  </listitem>

	  <listitem>
	    <para>Direcci&oacute;n IP del servidor DNS</para>
	  </listitem>

	  <listitem>
	    <para>M&aacute;scara de subred</para>
	  </listitem>
	</orderedlist>

	<para>Si no conoce estos datos p&oacute;ngase en contacto con su
	  administrador de sistemas o con su proveedor de servicios.  Es
	  que le digan que tal informaci&oacute;n se asigna
	  autom&aacute;ticamente mediante <firstterm>DHCP</firstterm>.  
	  Si es as&iacute;, an&oacute;telo.</para>
      </sect3>

      <sect3>
	<title>Conexi&oacute;n mediante m&oacute;dem</title>

	<para>Si usted se conecta con su ISP mediante un m&oacute;dem 
	  tradicional sigue pudiendo instalar &os; a trav&eacute;s de 
	  Internet; el problema es que tardar&aacute; mucho m&aacute;s
	  que por otros medios.</para>

	<para>Necesitar&aacute; saber:</para>

	<orderedlist>
	  <listitem>
	    <para>El n&uacute;mero de tel&eacute;fono de su ISP a 
	       trav&eacute;s del que acceder&aacute; a Internet</para>
	  </listitem>

	  <listitem>
	    <para>El COM: el puerto al que est&aacute; conectado su
	      m&oacute;dem</para>
	  </listitem>

	  <listitem>
	    <para>Su nombre de usuario y su contrase&ntilde;a de acceso
	      a Internet</para>
	  </listitem>
	</orderedlist>
      </sect3>
    </sect2>
    <sect2>
      <title>Consulte &laquo;&os; Errata&raquo;</title>
      
      <para>A pesar de que el proyecto &os; hace todo lo humanamente posible
	para asegurarse de que cada &laquo;release&raquo; de &os; es todo
	lo estable posible a veces alg&uacute;n error logra entrar en
	escena.  En contad&iacute;simas ocasiones esos errores llegan a
	afectar al proceso de instalaci&oacute;n.  Cuando esos errores son
	ubicados y corregidos aparecen  en lo que llamamos la
	<ulink url="http://www.FreeBSD.org/releases/&rel.current;R/errata.html">FreeBSD Errata</ulink>,
	que encontrar&aacute; en el sitio web de &os;.  Deber&iacute;a consultar
	este texto antes de la instalaci&oacute;n para asegurarse de que
	no hay problemas de &uacute;ltima hora de los que deba
	preocuparse.</para>

      <para>Tiene informaci&oacute;n sobre las &laquo;releases&raquo;,
	incluyendo la &laquo;errata&raquo; de cada una de ellas, en la
	<ulink
	url="http://www.FreeBSD.org/releases/index.html">secci&oacute;n de
	informaci&oacute;n de &laquo;releases&raquo; </ulink> del 
	<ulink
	  url="http://www.FreeBSD.org/index.html">sitio web de &os;</ulink>.</para>
    </sect2>

    <sect2>
      <title>Obtenci&oacute;n de los ficheros de instalaci&oacute;n de
	&os;</title>

      <para>El proceso de instalaci&oacute;n de &os; permite instalar &os;
	desde ficheros ubicados en cualquiera de los siguientes
	sitios:</para>

      <itemizedlist>
	<title>Medios locales</title>
	
	<listitem>
	  <para>Un CDROM o DVD</para>
	</listitem>

	<listitem>
	  <para>Una partici&oacute;n DOS en la propia computadora</para>
	</listitem>

	<listitem>
	  <para>Una cinta SCSI o QIC</para>
	</listitem>

	<listitem>
	  <para>Discos floppy</para>
	</listitem>
      </itemizedlist>

      <itemizedlist>
	<title>Red</title>

	<listitem>
	  <para>Un sitio FTP, saliendo a trav&eacute;s de un cortafuegos o
	    usando un proxy HTTP si fuera necesario</para>
	</listitem>

	<listitem>
	  <para>Un servidor NFS</para>
	</listitem>

	<listitem>
	  <para>Una conexi&oacute;n serie o a trav&eacute;s de una cable
	    paralelo</para>
	</listitem>
      </itemizedlist>

      <para>Si ha adquirido &os; en CD o DVD ya tiene todo lo que
	necesitar&aacute;, puede pasar a la siguiente secci&oacute;n:
	(<xref linkend="install-floppies">).</para>

      <para>Si no dispone de los ficheros de instalaci&oacute;n de &os;
	deber&iacute;a consultar la 
	<xref linkend="install-diff-media">, donde se explica c&oacute;mo 
	preparar la instalaci&oacute;n de &os; desde cualquiera de los 
	medios listados anteriormente.  Tras leer esa secci&oacute;n puede 
	volver aqu&iacute; y leer la
	<xref linkend="install-floppies">.</para>
    </sect2>

    <sect2 id="install-floppies">
      <title>Preparaci&oacute;n del medio de arranque</title>
      
      <para>El proceso de instalaci&oacute;n de &os; comienza por arrancar
	su sistema mediante el instalador de &os;: no es un programa que
	pueda ejecutar desde otro sistema operativo.  Su sistema suele
	arrancar usando el sistema operativo que est&aacute; instalado en
	su disco duro pero puede tambi&eacute;n ser configurado para que
	lo haga desde un floppy &laquo;arrancable&raquo;.  Las computadoras
	m&aacute;s modernas pueden tambi&eacute;n arrancar desde un CDROM
	introducido en la unidad CDROM.</para>

      <tip>
	<para>Si tiene &os; en CDROM o DVD (por haberlo comprado o haberlo
	  preparado por usted) y su sistema puede arracar desde
	  CDROM o DVD (suele ser una opci&oacute;n de BIOS llamada
	  &laquo;Boot Order&raquo; o algo similar) puede saltarse esta
	  secci&oacute;n.  Las im&aacute;genes de CDROM o DVD de &os;
	  permiten arrancar desde ellas y pueden emplearse para instalar
	  &os; sin ninguna preparaci&oacute;n especial.</para>
      </tip>
    
      <para>Siga estos pasos para crear las im&aacute;genes que le
	permitir&aacute;n arrancar desde floppy:</para>

      <procedure>
	<step>
	  <title>Consiga las im&aacute;genes de arranque desde 
	    floppy</title>
	  
	  <para>Los discos de arranque se encuentran en el directorio
	    <filename>floppies/</filename> del medio de instalaci&oacute;n
	    o pueden descargarse desde el directorio correspondiente de
	    <literal>ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/<replaceable>&lt;arch&gt;</replaceable>/<replaceable>&lt;version&gt;</replaceable>-RELEASE/floppies/</literal>.  
	    Reemplace <replaceable>&lt;arch&gt;</replaceable> y
	    <replaceable>&lt;version&gt;</replaceable> con la
	    arquitectura y la versi&oacute;n de &os; que quiera instalar.  
	    Por ejemplo, las im&aacute;genes de arranque desde floppy para
	    &os;&nbsp;&rel.current;-RELEASE para &i386; est&aacute;n en
	    from <ulink url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/floppies/"></ulink>.</para>

	  <para>Las im&aacute;genes de floppy tienen la extensi&oacute;n
	    <filename>.flp</filename>.  El directorio
	    <filename>floppies/</filename> contiene diferentes im&aacute;genes
	    y las que usted necesitar&aacute; depender&aacute;n de la
	    versi&oacute;n de &os; que vaya a instalar y, en algunos casos,
	    del hardware en el que lo va a instalar.  En la mayor&iacute;a de
	    de los casos solamente usar&aacute; dos ficheros:
	    <filename>kern.flp</filename> y
	    <filename>mfsroot.flp</filename>.  La instalaci&oacute;n en
	    algunos sistemas concretos requerir&aacute; controladores de
	    dispositivo adicionales, que se encuentran en la imagen
	    <filename>drivers.flp</filename>.  Consulte
	    <filename>README.TXT</filename> en el propio directorio,
	    ah&iacute; encontrar&aacute; la informaci&oacute;n m&aacute;s
	    reciente sobre las im&aacute;genes.</para>

	  <important>
	    <para>Su programa de FTP debe usar <emphasis>modo
	      binario</emphasis> para descargar las im&aacute;genes.  
	      Algunos navegadores web suelen usar el modo
	      <emphasis>texto</emphasis> ( o <emphasis>ASCII</emphasis>).  
	      He aqu&iacute; lo primero a comprobar si no puede arrancar desde
	      los disquetes que ha creado.</para>
	  </important>
	</step>

	<step>
	  <title>Preparaci&oacute;n de los discos floppy</title>
	  
	  <para>Tendr&aacute; que preperar un disquete por cada imagen que
	    descargue.  Es imprescindible que esos discos carezcan de
	    errores.  La forma m&aacute;s sencilla de asegurarlo es
	    formatearlos usted.  No conf&iacute;e en disquetes
	    preformateados.  La herramienta de formateo de &windows; no le
	    advertir&aacute; del hallazgo de bloques defectuosos,
	    si encuentra alguno sencillamente lo marcar&aacute; como
	    &laquo;defectuoso&raquo; y lo ignorar&aacute;.  Le recomendamos
	    que use disquetes nuevos si decide usar este procedimiento de
	    instalaci&oacute;n.</para>

	  <important>
	    <para>Si instenta instalar &os; y el programa de
	      instalaci&oacute;n falla, se queda congelado o sucede alguna
	      otra cat&aacute;strofe uno de las primeras cosas de las que
	      sospechar son los disquetes.  Vuelque los ficheros
	      de imagen en discos nuevos e int&eacute;ntelo de nuevo.</para>
	  </important>
	</step>

	<step>
	  <title>Escriba los ficheros de imagen en discos floppy (&laquo;
	    disquetes&raquo;)</title>

	  <para>Los ficheros <filename>.flp</filename> <emphasis>
	    no</emphasis> son ficheros normales que puedan copiarse
	    a disco.  Son im&aacute;genes del contenido completo de los
	    discos.  Esto significa que <emphasis>no puede</emphasis>
	    simplemente copiar esos ficheros de un disco a otro.  Debe
	    usar herramientas especializadas para escribir esas
	    im&aacute;genes directamente al disco correspondiente.</para>

	  <indexterm><primary>DOS</primary></indexterm>
	  <para>Si va a crear los disquetes de arranque en un sistema en
	    el que se est&aacute; ejecutando &ms-dos;/&windows; utilice
	    la herramienta <command>fdimage</command>.</para>

	  <para>Si las im&aacute;genes est&aacute;n en el CDROM y su
	    CDROM es la unidad <devicename>E:</devicename> ejecute lo
	    siguiente:</para>

	  <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\kern.flp A:</userinput></screen>

	  <para>Repita el proceso con cada fichero <filename>.flp</filename>
	    reemplazando cada vez el disco y recuerde etiquetarlos
	    con el nombre del fichero que ha copiado en cada uno.  Modifique
	    la l&iacute;nea del comando donde sea necesario, adapt&aacute;ndola
	    al lugar donde tenga usted los ficheros <filename>.flp</filename>.  
	    Puede descargar <command>fdimage</command> desde el directorio <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/tools/"><filename class="directory">tools</filename>
	   </ulink> del sitio FTP de &os;.</para>
	  
	  <para>Si va a crear los disquetes en un sistema &unix; (por ejemplo
	    otro sistema &os;) puede utilizar &man.dd.1; para volcar las
	    im&aacute;genes a los discos.  En &os; puede ejecutar algo 
	    como:</para>
	  
	  <screen>&prompt.root; <userinput>dd if=kern.flp of=/dev/fd0</userinput></screen>

	  <para>En &os; <filename>/dev/fd0</filename> es la primera
	    unidad de disquetes (la unidad
	    <devicename>A:</devicename>).  <filename>/dev/fd1</filename> 
	    ser&iacute;a la unidad <devicename>B:</devicename> y as&iacute; 
	    sucesivamente.  Otras versiones de &unix; pueden asignar 
	    nombres diferentes a las unidades de disquetes; consulte la 
	    documentaci&oacute;n de su sistema.</para>
	</step>
      </procedure>

      <para>Ya podemos instalar instalar &os;.</para>
    </sect2>
  </sect1>

  <sect1 id="install-start">
    <title>Inicio de la instalaci&oacute;n</title>

    <important>
      <para>La instalaci&oacute;n no efect&uacute;a ning&uacute;n
	cambio en su disco o discos duros hasta la aparici&oacute;n del
	siguiente mensaje:</para>

      <literallayout class="monospaced">Last Chance: Are you SURE you want continue the installation?

If you're running this on a disk with data you wish to save then WE
STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding!

We can take no responsibility for lost disk contents!</literallayout>

	<para>Es decir:</para>
     <literallayout class="monospaced">&Uacute;ltima oportunidad: &iquest;Seguro que quiere seguir adelante con la instalaci&oacute;n? 

&iexcl;Si est&aacute; ejecutando este programa en un disco que contenga datos
que quiera conservar LE RECOMENDAMOS ENCARECIDAMENTE QUE HAGA
COPIAS DE SEGURIDAD FIABLES antes de proseguir!

&iexcl;No podemos responsabilizarnos de datos perdidos!</literallayout>


      <para>El proceso de instalaci&oacute;n puede abandonarse en cualquier
	momento antes de la advertencia final sin efectuar cambios en el
	contenido del disco duro.  Si advierte que ha configurado algo
	de forma incorrecta basta con que apague su sistema y no
	estropear&aacute; nada.</para>
    </important>

    <sect2 id="install-starting">
      <title>El arranque</title>

      <sect3 id="install-starting-i386">
        <title>El arranque en &i386;</title>

      <procedure>
	<step>
	  <para>Comience con su sistema apagado.</para>
	</step>

	<step>
	  <para>Arranque el sistema.  Durante el arranque deber&iacute;
	    mostrarse la opci&oacute;n para entrar en la BIOS, normalmente
	    mediante las teclas <keycap>F2</keycap>, <keycap>F10</keycap>,
	    <keycap>Del</keycap>, o
	    <keycombo action="simul">
	      <keycap>Alt</keycap>
	      <keycap>S</keycap>
	    </keycombo>.  Utilice la tecla o combinaci&oacute;n de las mismas
	    que se le indique en pantalla.  En algunos casos el sistema puede
	    mostrar un gr&aacute;fico durante el arranque.  Pulsar
	    <keycap>Esc</keycap> suele disminuir en esos casos el
	    tama&ntilde;o del gr&aacute;fico y le permitir&aacute; ver
	    los mensajes del arranque.</para>
	</step>

	<step>
	  <para>Encuentre el par&aacute;metro que controla desde qu&eacute;
	    dispositivos arranca el sistema.  Normalmente se llama
	    &laquo;Boot Order&raquo; y suele presentarse como una lista
	    de dispositivos, como <literal>Floppy</literal>,
	    <literal>CDROM</literal>, <literal>First Hard Disk</literal>,
	    etc.</para>

	  <para>Si necesita disquetes de arranque aseg&uacute;rese de que
	    selecciona la unidad correspondiente.  Si va a arrancar desde
	    CDROM, seleccione la unidad CDROM.  En caso de duda consulte el
	    manual que ven&iacute;a con su computadora y/o el de su placa
	    base.</para>

	  <para>Haga los cambios necesarios, guarde los cambios y salga.  
	    El sistema deber&iacute;a reiniciarse.</para>
	</step>

	<step>
	  <para>Si ha elegido arrancar desde disquete, tal y como se describe
	    en <xref linkend="install-floppies">, uno de ellos ser&aacute;
	    el primer disco de arranque, probablemente el que contiene
	    <filename>kern.flp</filename>.  Introduzca ese disco en su
	    unidad de disquetes.</para>

	  <para>Si va a arrancar desde CDROM tendr&aacute; que arrancar el
	    sistema e introducir el CDROM en cuanto tenga
	    ocasi&oacute;n.</para>

	  <para>Si su sistema arranca normalmente y carga el sistema
	    operativo que ya est&aacute; instalado puede ocurrir alguna
	    de estas cosas:</para>

	  <orderedlist>
	    <listitem>
	      <para>Los discos no se introdujeron lo suficientemente pronto
		en el proceso de arranque.  D&eacute;jelos insertados y
		reinicie su sistema.</para>
	    </listitem>

	    <listitem>
	      <para>Los cambios que hizo en la BIOS no han funcionado.  
		Deber&iacute;a repetir los pasos previos hasta que d&eacute;
		con la opci&oacute;n correcta.</para>
	    </listitem>

	    <listitem>
	      <para>Su BIOS en concreto no admite el arranque el arranque
		desde el medio que ha elegido.</para>
	    </listitem>
	</orderedlist>
	</step>
    
	<step>
	  <para>&os; comenzar&aacute; a arrancar.  Si est&aacute; arrancando
	    desde CDROM deber&iacute;a ver algo parecido a esto (se ha omitido
	    la informaci&oacute;n de n&uacute;mero de versi&oacute;n):</para>
	  
	  <screen>Verifying DMI Pool Data ........
Boot from ATAPI CD-ROM :
 1. FD 2.88MB  System Type-(00)
Uncompressing ... done

BTX loader 1.00 BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive B: is disk1
BIOS drive C: is disk2
BIOS drive D: is disk3
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

|
Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>
	
	  <para>Si arranca desde floppy ver&aacute; algo parecido a esto
	    (se ha omitido la informaci&oacute;n de n&uacute;mero de
	    versi&oacute;n):</para>
	
	  <screen>Verifying DMI Pool Data ........

BTX loader 1.00  BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive C: is disk1
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

Please insert MFS root floppy and press enter:</screen>

	  <para>Siga las instrucciones y extraiga el disco
	    <filename>kern.flp</filename> disc, inserte el disco
	    <filename>mfsroot.flp</filename> y pulse
	    <keycap>Intro</keycap>.</para>
	</step>

	<step>
	  <para>Tanto si arranca desde disquete como CDROM el proceso
	    de arranque llegar&aacute; a este punto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>

	  <para>Dicho y hecho: espere diez segundos o pulse
	    <keycap>Enter</keycap>.  Esto lanzar&aacute; el men&uacute; de
	    configuraci&oacute;n del kernel.</para>
	</step>
      </procedure>

      </sect3>
      <sect3>
        <title>Arranque en Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

      <procedure>
	<step>
	  <para>Comience con su sistema apagado.</para>
	</step>

	<step>
	  <para>Encienda su computadora y espera un mensaje de arranque
	    en el monitor.</para>
        </step>

	<step>
	  <para>Si va a arrancar desde disquetes, tal y como se describe en la
	    <xref linkend="install-floppies">, uno de ellos ser&aacute; el
	    primer disco de arranque, probablemente el que contiene
	    <filename>kern.flp</filename>.  Ponga este disco en la unidad de
	    disquetes y escriba el siguiente comando para lanzar el arranque
	    desde el disco (corrija el nombre de su unidad de disquetes si
	    fuera necesario):</para>

	  <screen>&gt;&gt;&gt;<userinput>BOOT DVA0 -FLAGS '' -FILE ''</userinput></screen>

	  <para>Si va a arrancar desde CDROM introduzca el CDROM en la
	    unidad y escriba el siguiente comando para iniciar la
	    instalaci&oacute;n (corrija el nombre de la unidad correcta de
	    CDROM si fuera necesario):</para>

          <screen>&gt;&gt;&gt;<userinput>BOOT DKA0 -FLAGS '' -FILE ''</userinput></screen>
	</step>
    
	<step>
	  <para>&os; comenzar&aacute; a arrancar.  Si est&aacute; arrancando
	    desde disquete llegado un cierto punto ver&aacute; usted este
	    mensaje:</para>

	  <screen>Please insert MFS root floppy and press enter:</screen>

	  <para>Siga las instrucciones del programa de instalaci&oacute;n y
	     retire el disco <filename>kern.flp</filename>, inserte el
	    disco <filename>mfsroot.flp</filename>y pulse
	    <keycap>Intro</keycap>.</para>
	</step>

	<step>
	  <para>Tanto si arranc&oacute; desde disquete como desde CDROM
	    el proceso de arranque llegar&aacute; a este punto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>

	  <para>Dicho y hecho: Espere diez segundos o pulse
	    <keycap>Enter</keycap>.  Esto iniciar&aacute; el men&uacute;
	    de configuraci&oacute;n del kernel.</para>
	</step>
      </procedure>

      </sect3>

      <sect3>
	<title>Arranque en &sparc64;</title>

	<para>La mayor&iacute;a de sistemas &sparc64; est&aacute;n
	  configurados para arrancar autom&aacute;ticamente desde
	  disco.  Si quiere instalar &os; tendr&aacute; que arrancar
	  por red o desde un CDROM, lo que requiere que acceda a la
	  PROM (OpenFirmware).</para>

	<para>Reinicie el sistema y espere hasta que aparezca el mensaje
	  de arranque.  Depende del modelo, pero deber&iacute;a parecerse
	  a este:</para>

    <screen>Sun Blade 100 (UltraSPARC-IIe), Keyboard Present
Copyright 1998-2001 Sun Microsystems, Inc.  All rights reserved.
OpenBoot 4.2, 128 MB memory installed, Serial #51090132.
Ethernet address 0:3:ba:b:92:d4, Host ID: 830b92d4.</screen>

	<para>Si en este punto su sistema arranca desde el disco
	  pulse
	  <keycombo action="simul"><keycap>L1</keycap><keycap>A</keycap></keycombo>
	  o
	  <keycombo action="simul"><keycap>Stop</keycap><keycap>A</keycap></keycombo>,
	  o env&iacute;e un<command>BREAK</command> desde la consola serie
	  serial console (usando, por ejemplo, <command>~#</command> en
	  &man.tip.1; o &man.cu.1;) para as&iacute; recuperar el prompt de 
	  PROM.  Tiene este aspecto:</para>

	<screenco>
	  <areaspec>
	    <area id="prompt-single" coords="1 5">
	    <area id="prompt-smp" coords="2 5">
	  </areaspec>

	  <screen><prompt>ok     </prompt>
<prompt>ok {0} </prompt></screen>

	  <calloutlist>
	    <callout arearefs="prompt-single">
	      <para>Este es el prompt que ver&aacute; en sistemas con una sola
		CPU.</para>
	    </callout>

	    <callout arearefs="prompt-smp">
	      <para>Este prompt se usa en sistemas SMP; el d&iacute;gito
		indica el n&uacute;mero de la CPU activa.</para>
	    </callout>
	  </calloutlist>
	</screenco>

	<para>Ponga el CDROM dentro de la unidad y tecl&eacute;e
	  <command>boot cdrom</command> en el prompt
	  de la PROM.</para>

      </sect3>

    </sect2>



    <sect2 id="view-probe">
      <title>Revisi&oacute;n de los resultados de la prueba de dispositivos</title>

      <para>Es posible revisar los &uacute;ltimos cientos de l&iacute;neas que
        se han mostrado en pantalla, pues se almacenan en un b&uacute;fer con ese
	prop&oacute;sito.</para>

      <para>Pulse <keycap>Bloq Despl</keycap> (<keycap>Scroll Lock</keycap>) y ya
        puede revisar el b&uacute;fer. Para moverse use las flechas o 
	<keycap>ReP&aacute;g</keycap> y <keycap>AvP&aacute;g</keycap>
	(<keycap>PageUp</keycap> y <keycap>PageDown</keycap> respectivamente).  Pulse
	de nuevo <keycap>Bloq Despl</keycap> (<keycap>Scroll Lock</keycap>) cuando
	quiera salir del b&uacute;fer.</para>

      <para>Pru&eacute;belo, revise el texto que ha generado el kernel al probar
        los dispositivos del sistema.  Ver&aacute; un texto muy similar al de la
	<xref linkend="install-dev-probe">, aunque en su caso concreto se
	mostrar&aacute;n los dispositivos que tenga su sistema.</para>

      <figure id="install-dev-probe">
	<title>Ejemplo de resultado de prueba de dispositivos</title>

	<screen>avail memory = 253050880 (247120K bytes) 
Preloaded elf kernel "kernel" at 0xc0817000.
Preloaded mfs_root "/mfsroot" at 0xc0817084.
md0: Preloaded image &lt;/mfsroot&gt; 4423680 bytes at 0xc03ddcd4

md1: Malloc disk
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard   
npx0: INT 16 interface   
pcib0: &lt;Host to PCI bridge&gt; on motherboard
pci0: &lt;PCI bus&gt; on pcib0
pcib1:&lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0
pci1: &lt;PCI bus&gt; on pcib1
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0
isa0: &lt;iSA bus&gt; on isab0
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0
ata0: at 0x1f0 irq 14 on atapci0
ata1: at 0x170 irq 15 on atapci0
uhci0 &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci
0
usb0: &lt;VIA 83572 USB controller&gt; on uhci0
usb0: USB revision 1.0
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr1
uhub0: 2 ports with 2 removable, self powered
pci0: &lt;unknown card&gt; (vendor=0x1106, dev=0x3040) at 7.3
dc0: &lt;ADMtek AN985 10/100BaseTX&gt; port 0xe800-0xe8ff mem 0xdb000000-0xeb0003ff ir
q 11 at device 8.0 on pci0
dc0: Ethernet address: 00:04:5a:74:6b:b5
miibus0: &lt;MII bus&gt; on dc0
ukphy0: &lt;Generic IEEE 802.3u media interface&gt; on miibus0
ukphy0: 10baseT, 10baseT-FDX, 100baseTX, 100baseTX-FDX, auto
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xec00-0xec1f irq 9 at device 10.
0 on pci0
ed0 address 52:54:05:de:73:1b, type NE2000 (16 bit)
isa0: too many dependant configs (8)
isa0: unexpected small tag 14
orm0: &lt;Option ROM&gt; at iomem 0xc0000-0xc7fff on isa0
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq2 on isa0
fdc0: FIFO enabled, 8 bytes threshold
fd0: &lt;1440-KB 3.5&rdquo; drive&gt; on fdc0 drive 0
atkbdc0: &lt;Keyboard controller (i8042)&gt; at port 0x60,0x64 on isa0
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq1 on atkbdc0
kbd0 at atkbd0
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0
psm0: model Generic PS/@ mouse, device ID 0
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x100 on isa0
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt;
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0
sio0: type 16550A
sio1 at port 0x2f8-0x2ff irq 3 on isa0
sio1: type 16550A
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
pppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
ppc0: FIFO with 16/16/15 bytes threshold
plip0: &lt;PLIP network interface&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master UDMA33
acd0: CD-RW &lt;LITE-ON LTR-1210B&gt; at ata1-slave PIO4
Mounting root from ufs:/dev/md0c
/stand/sysinstall running as init on vty0</screen>
      </figure>

      <para>Compruebe cuidadosamente que &os; haya encontrado todos los
        dispositivos que debe encontrar.  Si no se lista alg&uacute;n
	dispositivo significa que &os; no lo ha encontrado.  Un <link
	 linkend="kernelconfig">kernel personalizado</link> le permitir&aacute;
	agregar al sistema el soporte de dispositivos que no aparecen en el
	kernel<filename>GENERIC</filename>, que suele ser el caso de algunas
	tarjetas de sonido.</para>

      <para>En &os;&nbsp;6.2 y versiones siguientes ver&aacute; tras la
        prueba de dispositivos ver&aacute; lo que muestra la
	<xref linkend="config-country">.  Utilice las flechas del teclado
	para elegir pa&iacute;s, regi&oacute;n o grupo.  Cuando acabe pulse
	<keycap>Intro</keycap>, con lo que habr&aacute; elegido pa&iacute;s y
	esquema de teclado.  En cualquier momento puede salir de
	easily.  It is also easy to exit the
	<application>sysinstall</application> y volver a empezar.</para>

      <figure id="config-country">
	<title>Men&uacute; de selecci&oacute;n de pa&iacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/config-country" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <figure id="sysinstall-exit">
	<title>Salir de Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/sysinstall-exit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Para salir de <application>sysinstall</application> utilice
        las flechas del teclado para seleccionar
	<guimenuitem>Exit Install</guimenuitem> en el men&uacute; de la
	pantalla principal de instalaci&oacute;n.  Aparecer&aacute; el
	siguiente mensaje:</para>


      <screen>                      User Confirmation Requested 
         Are you sure you wish to exit? The system will reboot 
           (be sure to remove any floppies/CDs/DVDs from the drives).

                            [ Yes ]    No</screen>

      <para>Si pulsa &gui.yes; y no retira el CDROM durante el reinicio el
        programa de instalaci&oacute;n comenzar&aacute; de nuevo.</para>

      <para>Si est&aacute; arrancando desde disquetes tendr&aacute; que
        retirar el floppy
	<filename>boot.flp</filename> antes de reiniciar.</para>
    </sect2>

 </sect1>

  <sect1 id="using-sysinstall">
    <title>&iquest;Qu&eacute; es sysinstall?</title>

    <para><application>sysinstall</application> es la aplicaci&oacute;n que
      el Proyecto &os; cre&oacute; para la instalaci&oacute;n del sistema.  
      Est&aacute; orientada a consola y consta de diversos men&uacute;s y
      pantallas que podr&aacute; usar para configurar y ejecutar el
      proceso de instalaci&oacute;n.</para>

    <para>El sistema de men&uacute;s de <application>sysinstall</application>
      se controla mediante las flechas del teclado,
      <keycap>Intro</keycap>,el <keycap>tabulador</keycap>), <keycap>Espacio</keycap> y
      otras teclas.  Tiene una descripci&oacute;n detallada de todas esas teclas y
      qu&eacute; es lo que hacen en la informaci&oacute;n de uso de
      <application>sysinstall</application>.</para>

    <para>Si quiere consultarla seleccione
      <guimenuitem>Usage</guimenuitem> y aseg&uacute;rese de que el bot&oacute;n
      <guibutton>[Select]</guibutton> est&eacute; seleccionado (como se ven en la <xref
      linkend="sysinstall-main3">) y pulse <keycap>Intro</keycap>.</para>

    <para>Aparecer&aacute;n las instrucciones de uso del sistema de 
      men&uacute;s.  Una vez revisadas pulse  <keycap>Enter</keycap>
      y volver&aacute; al men&uacute; principal.</para>

    <figure id="sysinstall-main3">
      <title>Selecci&oacute;n de &laquo;Usage&raquo; en el men&uacute; principal de sysinstall</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/main1" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <sect2 id="select-doc">
      <title>Selecci&oacute;n del men&uacute; de documentaci&oacute;n</title>

      <para>Una vez en el men&uacute; principal seleccione <guimenuitem>Doc</guimenuitem>
	con las flechas del teclado y pulse
	<keycap>Enter</keycap>.</para>

      <figure id="main-doc">
	<title>Selecci&oacute;n del men&uacute; de documentaci&oacute;n</title>


	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-doc" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Esto mostrar&aacute; el men&uacute; de documentaci&oacute;n.</para>

      <figure id="docmenu1">
	<title>El men&uacute; de documentaci&oacute;n de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/docmenu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Es muy importante qeu lea la documentaci&oacute;n de sysinstall.</para>

      <para>Si quiere consultar un documento seleccionelo con las flechas
	y pulse <keycap>Intro</keycap>.  Cuando acabe pulse de nuevo
	<keycap>Intro</keycap> y volver&aacute; al men&uacute; de
	documentaci&oacute;n.</para>

      <para>Si desea regresar al men&uacute; principal de la instalaci&oacute;n
	seleccione <guimenuitem>Exit</guimenuitem> con las flechas
	y pulse <keycap>Intro</keycap>.</para>
    </sect2>

    <sect2 id="keymap">
      <title>Selecci&oacute;n del men&uacute; de esquemas de teclado</title>

      <para>Si quiere cambiar el esquema de teclado seleccione el que
	<guimenuitem>Keymap</guimenuitem> y pulse
	<keycap>Enter</keycap>.  Tendr&aacute; que hacer esto si su
	teclado no es el est&aacute;ndar en los EEUU.</para>

      <figure id="sysinstall-keymap">
	<title>Men&uacute; principal de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La selecci&oacute;n de un esquema de teclado se hace del siguiente
        modo: seleccione uno de la lista mediante las flechas arriba/abajo y pulse
	<keycap>Espacio</keycap>.  
	Si pulsa <keycap>Espacio</keycap> otra vez anular&aacute; la selecci&oacute;n.  
	Una vez que tenga clara su elecci&oacute;n use las flechas para seleccionar
	&gui.ok; y pulse <keycap>Intro</keycap>.</para>

      <para>En esta pantalla solamente se muestra una parte de la lista.  Seleccione
	&gui.cancel; usando el <keycap>tabulador</keycap> si ha decido seguir usando
	el esquema de teclado por omisi&oacute;n y regresar al men&uacute;
	principal de instalaci&oacute;n.</para>

      <figure id="sysinstall-keymap-menu">
	<title>Men&uacute; de esquemas de teclado de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

    </sect2>

    <sect2 id="viewsetoptions">
      <title>Pantalla de opciones de instalaci&oacute;n</title>

    <para>Seleccione <guimenuitem>Options</guimenuitem> y pulse
	<keycap>Intro</keycap>.</para>

    <figure id="sysinstall-options">
      <title>Men&uacute; principal de sysinstall</title>

      <mediaobject>
        <imageobject>
	  <imagedata fileref="install/main-options" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

      <figure id="options">
	<title>Opciones de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/options" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Los valores por omisi&oacute;n deber&iacute;an bastar para
        la mayor&iacute;a de usuarios.  El n&uacute;mero de
	&laquo;release&raquo; variar&aacute; seg&uacute;n sea la
	versi&oacute;n que se est&aacute; instalando.</para>

      <para>La descripci&oacute;n del elemento seleccionado aparecer&aacute;
        resaltada en azul en la parte baja de la pantalla.  Observe que una
	de las opciones es
	<guimenuitem>Use Defaults</guimenuitem>, que devuelve todos los valores
	a los asignados por omisi&oacute;n al principio del proceso de
	instalaci&oacute;n.</para>

      <para>Si pulsa <keycap>F1</keycap> podr&aacute; leer la pantalla de
        ayuda de las diversas opciones.</para>

      <para>Si pulsa <keycap>Q</keycap> volver&aacute; al men&uacute;
        principal de la instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="start-install">
      <title>Comenzar una instalaci&oacute;n est&aacute;ndar</title>

      <para>La instalaci&oacute;n est&aacute;ndar 
        (<guimenuitem>Standard</guimenuitem>) es la opci&oacute;n m&aacute;s
	adecuada para aquellas personas con poca o ninguna experiencia con
	&unix; o &os;.  Utilice las flechas para seleccionar
	<guimenuitem>Standard</guimenuitem> y pulse
	<keycap>Intro</keycap>; a partir de ah&iacute; comenzar&aacute;
	la instalaci&oacute;n.</para>

      <figure id="sysinstall-standard">
	<title>Comenzar una instalaci&oacute;n est&aacute;ndar</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-std" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-steps">
    <title>Asignaci&oacute;n de espacio en disco</title>

    <para>Lo primero que tiene que hacer es asignar espacio en disco a &os;
      para que <application>sysinstall</application> lo pueda dejar listo
      para su uso.  Para ello debe saber c&oacute;mo espera &os; encontrar
      la informaci&oacute;n en el disco.</para>

    <sect2 id="install-drive-bios-numbering">
      <title>Numeraci&oacute;n de unidades desde el punto de vista de la BIOS</title>

      <para>Antes de instalar y configurar &os; en su sistema hay una cosa m&aacute;s
        de la que ocuparse, especialmente si tiene m&aacute;s de un disco
	duro.</para>

      <indexterm><primary>DOS</primary></indexterm>
      <indexterm><primary>Microsoft Windows</primary></indexterm>
      <para>La BIOS es capz de abstraer el orden normal de los discos si hablamos
        de un PC en el que se est&aacute; ejecutando un sistema operativo
	"BIOS-dependiente" como 
	&ms-dos; o &microsoft.windows;, que admiten esos cambios sin problemas.  
	Tal cosa permite al usuario arrancar desde un disco duro distinto del
	llamado &laquo;maestro principal&raquo;.  Esto viene muy bien a los
	usuarios que tienen el &laquo;backup&raquo; del sistema m&aacute;s
	barato que existe, comprar un disco duro id&eacute;ntico al primero y
	copiar peri&oacute;dicamente la primera unidad en la segunda mediante
	<application><trademark class="registered">Ghost</trademark></application> o <application>XCOPY</application>.  
	De este modo si la primera unidad falla, sufre el ataque de un virus o
	sufre las consecuencias de un fallo del sistema operativo s&oacute;lo hay
	que decirle a la BIOS que interpole l&oacute;gicamente las unidades.  Es
	como intercambiar las conexiones de los discos sin tener que abrir
	la caja del sistema.</para>

      <indexterm><primary>SCSI</primary></indexterm>
      <indexterm><primary>BIOS</primary></indexterm>
      <para>en sistemas m&aacute;s caros a veces pueden encontrarse controladoras
        SCSI que incorporan extensiones BIOS, que permiten organizar hasta
	siete unidades SCSI de un modo muy similar.</para>

      <para>Cualquiera que est&eacute; acostumbrado a usar las t&eacute;cnicas
        descritas se llevar&aacute; una sorpresa al intentar usarlas en &os;.  
	&os; no usa la BIOS y no tiene en cuenta en absoluto la &laquo;notaci&oacute;n
	de unidades l&oacute;gicas desde el punto de vista de la BIOS&raquo;.  Esto
	puede dar lugar a situaciones bastante chocantes, especialmente cuando
	las unidades son f&iacute;sicamente id&eacute;nticas en geometr&iacute;a
	y han sido creadas como clones de datos la una de la otra.</para>

      <para>Si va a usar &os; recuerde siempre devolver a la BIOS a los
        valores de numeraci&oacute;n &laquo;natural&raquo; antes de la
	instalaci&oacute;n y dejarlos as&iacute;.  Si tiene que intercambiar
	unidades h&aacute;galo, pero a la vieja usanza: abra la caja, toque
	los &laquo;jumpers&raquo; y los cables todo lo que sea menester.</para>



<sidebar>
	<title>Veamos un instructivo ejemplo extra&iacute;do de Las
	  excepcionales aventuras de Pedro y Pablo:</title>
      
	<para>Pedro decide dedicar una vieja m&aacute;quina
	  &laquo;Wintel&raquo; para prepararle un sistema &os; a Pablo.  
	  Pedro le instala una sola unidad SCSI como
	  &laquo;unidad SCSI 0&raquo; e instala &os; en ella.</para>

	<para>Pablo comienza a usar el sistema pero a los pocos dias
	  advierte que esa vieja unidad SCSI est&aacute; mostrando
	  numerosos errores l&oacute;gicos, as&iacute; que informa del hecho
	  a Pedro.</para>

	<para>Dias despu&eacute;s Pedro decide solucionar el problema;
	  consigue un disco id&eacute;ntico al que instal&oacute; a Pablo.  
	  Le pasa un chequeo de superficie que da resultados satisfactorios,
	  as&iacute; que instala este disco como &laquo;unidad SCSI 4&raquo; y
	  hace una copia binaria de la unidad 0 (el primer disco) a la
	  reci&eacute;n instalada unidad 4.  Una vez que el nuevo disco
	  est&aacute; instalado Pedro decide que hay que empezar a usarlo,
	  as&iacute; que configura la BIOS SCSI para reorganizar las unidades
	  de disco para que el sistema arranque desde la unidad SCSI 4.  
	  &os; arranca desde dicha unidad y todo funciona perfectamente.</para>

	<para>Pablo sigue trabajando varios dias y no pasa mucho tiempo
	  antes de que Pedro y Pablo decidan que ya es hora de meterse en una
	  nueva aventura: actualizarse a la nueva vers&iacute;n de &os;.  
	  Bill retira la unidad SCSI 0 de la m&aacute;quina porque le parece
	  poco de fiar y la reemplaza por un disco que obtiene de su en
	  apariencia inagotable trastero.  Pedro instala la &uacute;ltima
	  versi&oacute;n de &os; en la nueva unidad SCSI mediante los
	  disquetes FTP m&aacute;gicos que Pablo ha bajado de Internet. La
	  instalaci&oacute;n se ejecuta sin problemas.</para>

	<para>Pablo utiliza la nueva versi&oacute;n de &os; durante unos
	  dias y comprueba que en efecto es lo bastante buena como para
	  usarla en el departamento de ingenier&iacute;a.  Ha llegado, por
	  tanto, el momento de copiar los datos que tiene en la versi&oacute;n
	  anterior de &os; a su nuevo alojamiento.  Pablo monta la unidad
	  SCSI 4 (la &uacute;ltima que instal&oacute; con la versi&oacute;n
	  anterior de &os;).  Pablo queda consternado al comprobar que en la
	  unidad SCSI 4 no hay ni rastro de sus preciados datos.</para>

	<para>&iquest;D&oacute;nde est&aacute;n los datos?</para>

	<para>Cuando Pedro hizo la copia binaria de la unidad SCSI 0
	  en la unidad SCSI 4, la unidad se convirti&oacute; en el
	  &laquo;el nuevo clon&raquo;.  Cuando Pedro reconfigur&oacute; la
	  BIOS SCSI para poder arrancar desde la unidad SCSI 4 tan
	  s&oacute;lo estaba enga&ntilde;&aacute;ndose a s&iacute; mismo
	  puesto que &os; segu&iacute;a arrancando desde la unidad SCSI
	  0.  Al hacer tal cambio en la BIOS causamos que parte del
	  c&oacute;digo de arranque y del cargador del sistema se copie de
	  una a otra unidad pero en cuanto los controladores del kernel de
	  &os; toman el control de la situaci&oacute;n el esquema de
	  nomenclatura de unidades de la BIOS es desestimado y &os; recupera
	  el esquema normal de nomenclatura.  En nuestro ejemplo el sistema
	  sigue funcionando desde la unidad SCSI 0 y ah&iacute; est&aacute;n
	  todos los datos de Pablo, no en la unidad SCSI 4.  El hecho de que
	  pareciera que el sistema estaba funcionando en la unidad SCSI 4 era
	  un producto de la imaginaci&oacute;n humana.</para>

	<para>Estamos encantados de decir que ni un solo byte fue
	  herido o maltratado durante el descubrimiento de este
	  fen&oacute;meno.  La vieja unidad SCSI 0 fu&eacute; recuperada del
	  mont&oacute;n de discos ca&iacute;dos en acto de servicio y
	  fue posible devolver todo el trabajo de Pablo a su
	  leg&iacute;timo due&ntilde;o.  Por si fuera poco, ahora Pedro sabe
	  con certeza que es capaz de contar hasta cero.</para>

	<para>En el ejemplo se han usado unidades SCSI pero los conceptos 
	  pueden aplicarse perfectamente a unidades IDE.</para>
      </sidebar>

    </sect2>

    <sect2 id="main-fdisk">
      <title>Creaci&oacute;n de &laquo;slices&raquo; con FDisk</title>


      <note>
	<para>A&uacute;n no ha hecho modificaciones en su disco duro.  
	  Si cree que ha cometido alg&uacute;n error y quiere comenzar de
	  nuevo puede hacerlo, salga de los men&uacute;s de
	  <application>sysinstall</application> e int&eacute;ntelo de nuevo
	  o pulse <keycap>U</keycap> para ejecutar la opci&oacute;n
	  <guimenuitem>Undo</guimenuitem> (deshacer).  Si se pierde o no
	  sabe c&oacute;mo salir siempre puede apagar su
	  sistema.</para>
      </note>

      <para>Si ha elegido iniciar una instalaci&oacute;n est&aacute;ndar 
	<application>sysinstall</application> le mostrar&aacute; el siguiente 
	mensaje:</para>

      <screen>                                 Message
 In the next menu, you will need to set up a DOS-style ("fdisk")
 partitioning scheme for your hard disk. If you simply wish to devote
 all disk space to FreeBSD (overwriting anything else that might be on
 the disk(s) selected) then use the (A)ll command to select the default
 partitioning scheme followed by a (Q)uit. If you wish to allocate only
 free space to FreeBSD, move to a partition marked "unused" and use the
 (C)reate command. 
                                [  OK  ] 

                      [ Press enter or space ]</screen>

     <para>Es decir:</para>
	
     <screen>                                 Mensaje
 En el siguiente men&uacute; tendr&aacute; que configurar un esquema de particionado
 estilo DOS ("fdisk") en su disco duro.  Si quiere dedicar todo el
 espacio de disco a FreeBSD (cosa que sobreescribir&aacute; cualquier cosa
 que contuviera el/los disco/s) use el comando (A)ll (Todo) para
 seleccionar el esquema de particiones por defecto y luego pulse
 (Q)uit (Salir).  Si quiere asignar a FreeBSD s&oacute;lamente el espacio
 libre en la unidad elija una partici&oacute;n que figure marcada como
 "unused" (sin usar) y ejecute el comando (C)reate (Crear).
                                [  OK  ]

                      [ Pulse Intro o Espacio ]</screen>



      <para>Pulse <keycap>Intro</keycap> tal y como se le dice.  Se le
	mostrar&aacute; una lista con todas las unidades de disco duro que el
	kernel ha econtrado al hacer el chequeo del sistema.  
	La <xref linkend="sysinstall-fdisk-drive1"> muestra un ejemplo de
	un sistema con dos discos IDE.  Reciben los nombres de
	<devicename>ad0</devicename> y <devicename>ad2</devicename>.</para>


      <figure id="sysinstall-fdisk-drive1">
	<title>Elija en qu&eacute; unidad usar FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Quiz&aacute;s est&eacute; preguntandose por qu&eacute;
        <devicename>ad1</devicename> no aparece por ning&uacute;n lado.  
	&iquest;Acaso hemos pasado algo por alto?</para>

      <para>Veamos qu&eacute; ocurrir&iacute;a si tuviera usted dos discos
        duros IDE, uno como maestro de la primera controladora IDE y el otro
	como maestro en la segunda controladora IDE.  Si &os; asignara
	n&uacute;meros de unidad en el orden en el que las encuentra en el
	ejemplo habr&iacute;amos visto
	<devicename>ad0</devicename> y
	<devicename>ad1</devicename> y todo funcionar&iacute;a sin
	mayor problema.</para>

      
      <para>Pero si tuviera usted que a&ntilde;adir un tercer disco, digamos
	como esclavo de la primera controladora IDE, tendr&iacute;a que
	llamarse <devicename>ad1</devicename> y el disco que antes era
	<devicename>ad1</devicename> pasar&iacute;a a llamarse
	<devicename>ad2</devicename>.  Los nombres de dispositivo (como
	por ejemplo <devicename>ad1s1a</devicename>) se usan para ubicar
	sistemas de ficheros, as&iacute; que podr&iacute;a encontrarse con
	que alguno de sus sistemas de ficheros no est&aacute; donde debiera
	y tendr&iacute;a que modificar la configuraci&oacute;n de su
	&os;.</para>
      
      <para>Para evitar este problema el kernel puede configurarse para
	asignar nombres a discos IDE bas&aacute;ndose en d&oacute;nde
	est&aacute;n en lugar de hacerlo por el orden en el que los
	encuentra.  Seg&uacute;n dicho esquema el disco maestro de la segunda
	contoladora IDE <emphasis>siempre</emphasis> ser&aacute;
	<devicename>ad2</devicename>, incluso si no existen dispositivos
	<devicename>ad0</devicename> o
	<devicename>ad1</devicename>.</para>


      <para>&Eacute;sta es la configuraci&oacute;n por omisi&oacute;n que
        incorpora el kernel de &os;, por lo que muestra las unidades 
	<devicename>ad0</devicename> y
	<devicename>ad2</devicename>.  La m&aacute;quina en la que se tomaron
	las capturas de pantalla tiene sendos discos IDE en ambos canales
	maestros de las dos controladoras y carece de discos en los
	canales esclavos.</para>

      <para>Seleccione el disco en el que desea instalar &os; y pulse
	&gui.ok;.  <application>FDisk</application> arrancar&aacute; y
	le mostrar&aacute; una pantalla similar a la que muestra la
	<xref linkend="sysinstall-fdisk1">.</para>

      <para>La pantalla de <application>FDisk</application> se divide en tres
	partes.</para>


      <para>La primera parte, que ocupa las dos primeras l&iacute;neas de la
	pantalla, muestra los detalles del disco que seleccionemos, el
	nombre que &os; le da, la geometr&iacute;a del disco y el
	tama&ntilde;o total del disco.</para>

      <para>La segunda parte muestra las &laquo;slices&raquo; que haya
	en el disco, d&oacute;nde comienzan y acaban, cu&acute;l es su
	tama&ntilde;o, qu&eacute; nombre les da &os;, su descripci&oacute;n
	y subtipo.  Este ejemplo muestra dos peque&ntilde;as
	&laquo;slices&raquo; sin usar; las &laquo;slices&raquo; (del
	ingl&eacute;s &laquo;rebanadas&raquo;) son un tipo de esquema
	estructural de los discos de PC.  Tambi&eacute;n muestra una gran
	&laquo;slice&raquo; <acronym>FAT</acronym>, que casi con total
	seguridad aparecer&aacute; como <devicename>C:</devicename> en
	&ms-dos; / &windows;, y una &laquo;slice&raquo; extendida, que
	podr&iacute;a contener otras letras de unidad de
	&ms-dos; / &windows;.</para>

      <para>La tercera parte muestra las &oacute;rdenes que pueden usarse en
	<application>FDisk</application>.</para>

      <figure id="sysinstall-fdisk1">
	<title>Un ejemplo de particionamiento t&iacute;pico con FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>




      <para>Lo que deba hacer a partir de ahora depender&aacute; mucho de 
	la forma en la que quiera distribuir su disco.</para>

      <para>Si desea usar &os; en el resto del disco (lo que implica borrar
	todos los datos que pudiera haber en el disco una vez que le
	confirme a <application>sysinstall</application> que desea seguir
	adelante con la instalaci&oacute;n) pulse <keycap>A</keycap>, que
	equivale a la opci&oacute;n <guimenuitem>Use Entire Disk</guimenuitem>
	(Utilizar el disco &iacute;ntegro).  Las &laquo;slices&raquo; que
	existieran se borrar&aacute;n y ser&aacute;n reemplazadas por un peque&ntilde;o
	&aacute;rea de disco marcado como <literal>sin usar</literal> (otro
	recurso de la estructura de disco de los PC) y tras &eacute;l una gran
	&laquo;slice&raquo; destinada a &os;.  Ahora marque la
	partici&oacute;n &os; que acaba de crear como arrancable: pulse
	<keycap>S</keycap>.  La pantalla que ver&aacute; ha de ser muy
	similar a la <xref linkend="sysinstall-fdisk2">.  Observe la
	<literal>A</literal> en la columna <literal>Flags</literal>: indica
	que la &laquo;slice&raquo; es <emphasis>activa</emphasis> y se
	arrancar&aacute; desde ella.</para>

      <para>Si desea borrar una &laquo;slice&raquo; para hacer m&aacute;s
	sitio a &os; selecci&oacute;nela mediante las flechas y pulse
	<keycap>D</keycap>.  Despu&eacute;s pulse <keycap>C</keycap> y
	ver&aacute; un mensaje en el que se le pedir&aacute; el
	tama&ntilde;o de la &laquo;slice&raquo; que va a crear.  
	Introduzca los datos apropiados y pulse <keycap>Intro</keycap>.  
	El valor por defecto en &eacute;sta pantalla es el de la
	&laquo;slice&raquo; m&aacute;s grande que pueda crear en el disco,
	que deber&iacute;a ser la mayor parte del disco que queda sin usar
	o el tama&ntilde;o del disco duro completo.</para>
      
      <para>Si ha hecho sitio para &os; (quiz&aacute;s con una herramienta 
	como <application>&partitionmagic;</application>) puede pulsar 
	press <keycap>C</keycap> y crear una nueva &laquo;slice&raquo;.  
	Ver&aacute; de nuevo un mensaje en el que se le pedir&aacute; que
	escriba el tama&ntilde;o de la &laquo;slice&raquo; que va a 
	crear.</para>

      <figure id="sysinstall-fdisk2">
	<title>Partici&oacute;n con FDisk usando el disco completo</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Cuando acabe pulse <keycap>Q</keycap>.  Sus cambios se guardar&aacute;n
	en <application>sysinstall</application>, pero de momento no se
	guardar&aacute;n en disco.</para>
    </sect2>

    <sect2 id="bootmgr">
      <title>Instalaci&oacute;n de un gestor de arranque</title>

      <para>Ha llegado el momento de instalar un gestor de arranque.  Elija
	el gestor de arranque de &os; si:</para>

      <itemizedlist>
	<listitem>
	  <para>Tiene m&aacute;s de un disco y ha instalado &os; en cualquiera
	    que no sea el primero.</para>
	</listitem>

	<listitem>
	  <para>Ha instalado &os; codo con codo con otro sistema operativo
	    y quiere poder elegir si arrancar &os; o ese otro sistema operativo
	    cuando arranque su sistema.</para>
	</listitem>
      </itemizedlist>

      <para>Si &os; va a ser el &uacute;nico sistema operativo en el
        sistema y va a instalarlo en el primer disco duro elija el
	gestor est&aacute;ndar (que, obviamente, est&aacute; en la
	opci&oacute;n <guimenuitem>Standard</guimenuitem>).  Elija
	<guimenuitem>None</guimenuitem> (ninguno) si va a usar alg&uacute;n
	otro gestor de arranque que sea capaz de arrancar &os;.</para>

      <para>Elija y pulse <keycap>Intro</keycap>.</para>

      <figure id="sysinstall-bootmgr">
	<title>Men&uacute; de gestores de arranque de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/boot-mgr" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La pantalla de ayuda, que puede consultar en cualquier momento
        pulsando <keycap>F1</keycap>, puede serle de mucha ayuda con los
	problemas que puede encontrarse al intentar compartir un disco duro
	entre varios sistemas operativos.</para>
    </sect2>

    <sect2>
      <title>Creaci&oacute;n de &laquo;slices&raquo; en otra unidad.</title>

      
      <para>Si hay m&aacute;s de una unidad de disco el programa de
	instalaci&oacute;n volver&aacute; a la pantalla
	&laquo;Select Drives&raquo; (&laquo;selecci&oacute;n de
	unidades&raquo;) una vez elegido el gestor de arranque.  Si quiere
	instalar &os; en m&aacute;s de un disco seleccione aqu&iacute; ese
	otro disco y repita el proceso con las &laquo;slices&raquo; mediante
	<application>FDisk</application>.</para>

      <important>
	<para>Si va a instalar &os; en una unidad que no sea la primera
	  tendr&aacute; que instalar el gestor de arranque de &os;
	  en ambas unidades.</para>
      </important>

      <figure id="sysinstall-fdisk-drive2">
	<title>Salir de la selecci&oacute;n de unidad</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>El <keycap>tabulador</keycap> se usa para hacer pasar el
        cursor entre &gui.ok, &gui.cancel;.</para>

      <para>Pulse <keycap>tabulador</keycap> para pasar el cursor a
	&gui.ok; y pulse
	<keycap>Enter</keycap> para proseguir con la
	instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="bsdlabeleditor">
      <title>Creaci&oacute;n de particiones con
	<application>Disklabel</application></title>
      
      <para>Tendr&aacute; que crear particiones dentro de las
        &laquo;slices&raquo; que haya creado.  Recuerde que cada
	partici&oacute;n est&aacute; asociada a una letra entre la
	<literal>a</literal> y la <literal>h</literal>y que las particiones
	<literal>b</literal>, <literal>c</literal> y
	<literal>d</literal> tienen significados heredados que tendr&aacute;
	que respetar.</para>

      
      <para>Ciertas aplicaciones pueden optimizar su rendimiento de un
	esquema de particiones concreto, sobre todo si hace particiones
	repartidas en m&aacute;s de un disco.  Si embargo si esta es su
	primera instalaci&oacute;n de &os; no necesita dedicarle demasiado
	tiempo a decidir c&oacute;mo partir el disco duro.  Es mucho
	m&aacute;s importante que instale &os; y empiece a aprender a
	usarlo.  Siempre est&aacute;a tiempo de reinstalar &os; y cambiar
	su esquema de particiones cuando est&eacute; m&aacute;s
	familiarizado con el sistema operativo.</para>

      <para>El siguiente esquema consta de cuatro particiones: una para la swap y
	tres para los sistemas de ficheros.</para>

      <table frame="none" pgwide="1">
	<title>Estructura de particiones del primer disco</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">

	  <thead>
	    <row>
	      <entry>Partici&oacute;n</entry>
	      
	      <entry>Sistema de ficheros</entry>

	      <entry>Tama&ntilde;o</entry>

	      <entry>Descripci&oacute;n</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>a</literal></entry>

	      <entry><filename>/</filename></entry>

	      <entry>512&nbsp;MB</entry>

	      
	      <entry>Este es el sistema de ficheros ra&iacute;z.  el resto
		de sistemas de ficheros se montar&aacute;n en alg&uacute;n
		punto de este sistema ra&iacute;z.  100&nbsp;MB es un
		tama&ntilde;o razonable para &eacute;l.  No es el mejor sitio
		para almacenar muchos datos y la instalaci&oacute;n de &os;
		escribir&aacute; cerca de 40&nbsp;MB de datos en ella.  
		El resto del espacio es para datos temporales y por si futuras
		versiones de &os; necesitan m&aacute;s espacio en
		<filename>/</filename>.</entry>
	    </row>

	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>2-3 x RAM</entry>

	       <entry><para>Esta partici&oacute;n es el espacio de memoria de
		  intercambio (o &laquo;swap&raquo;) del sistema.  La
		  elecci&oacute;n de la cantidad correcta de swap es
		  casi un arte en s&iacute; mismo.  Hay una regla
		  b&aacute;sica que es asignar a la swap el doble o el
		  triple de MB de los que haya en la memoria f&iacute;sica
		  (RAM) del sistema.  Deber&iacute;a tener
		  al menos 64&nbsp;MB de swap as&iacute; que si tiene
		  menos de 32&nbsp;MB de RAM as&iacute;gnele a su swap
		  64&nbsp;MB.</para><para>

		  Si tiene m&aacute;s de un disco puede poner espacio
		  swap en cada disco.  &os; usar&aacute; ambas swap con el
		  resultado de acelerar notablemente el intercambio de
		  p&aacute;ginas de memoria.  Calcule el total de swap que
		  necesita (por ejemplo 128&nbsp;MB) y divida esa cantidad
		  por el n&uacute;mero de discos que tenga (por ejemplo dos)
		  y ya tiene la cantidad de espacio que debe destinar a swap
		  en cada uno de sus discos. En nuestro ejemplo 64&nbsp;MB
		  de swap por disco.</para></entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry><filename>/var</filename></entry>

	      <entry>256&nbsp;MB to 1024&nbsp;MB</entry>

	      
	      <entry>El directorio <filename>/var</filename> contiene
		ficheros que est&aacute;n en continuo cambio, como
		&laquo;logs&raquo; y otros ficheros
		administrativos.  Muchos de esos ficheros son una
		consecuencia o son de gran ayuda para el correcto
		funcionamiento diario de &os;.  &os; ubica dichos ficheros
		en ese sistema de ficheros para optimizar el acceso a
		los mismos sin afectar a otros ficheros ni directorios que
		tienen similar patr&oacute;n de accesos.</entry>
	    </row>

	    <row>
	      <entry><literal>f</literal></entry>

	      <entry><filename>/usr</filename></entry>

	      <entry>Resto del disco(al menos 2&nbsp;GB)</entry>

	      <entry>El resto de sus ficheros pueden almacenarse en
		<filename>/usr</filename> y sus subdirectorios.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <warning>
	<para>Los valores que se han mostrado son simples ejemplos y
	  se recomienda su uso exclusivamente a usuarios experimentados.  
	  Recomendamos a los usuarios que utilicen la opci&oacute;n
	  <literal>Auto Defaults</literal>, que elegir&aacute; unas
	  proporciones adecuadas para el espacio que encuentre
	  disponible.</para>
      </warning>
      
      <para>Si va a instalar &os; en m&aacute;s de un disco puede crear
        particiones el las dem&aacute;s &laquo;slices&raquo; que haya
	creado.  La forma m&aacute;s f&aacute;cil de hacerlo es creando
	dos particiones en cada disco, una para la swap y la otra para los
	sistemas de ficheros.</para>

      <table frame="none" pgwide="1">
	<title>Esquema de particiones para varios discos</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="2*">
          <colspec colwidth="3*">

	  <thead>
	    <row>
	      <entry>Partici&oacute;n</entry>
	      
	      <entry>Sistema de ficheros</entry>

	      <entry>Tama&ntilde;o</entry>

	      <entry>Descripci&oacute;n</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>Ver descripci&oacute;n</entry>

	      <entry>Tal y como se ha explicado puede repartir su espacio swap
	        entre varios discos.  Aunque piense que la partici&oacute;n
		<literal>a</literal> est&aacute; libre la costumbre (y se dice que
		&laquo;las costumbres son leyes&raquo; dicta que el espacio
		swap reside en la partici&oacute;n
		<literal>b</literal>.</entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry>/disco<replaceable>n</replaceable></entry>

	      <entry>Resto del disco</entry>

	      
	      <entry>El resto del disco puede dejarse en una sola
		partici&oacute;n.  Esto podr&iacute;a ubicarse simplemente
		en la partici&oacute;n <literal>a</literal> en lugar de en
		la <literal>e</literal>.  Sin embargo la costumbre dice que
		la partici&oacute;n <literal>a</literal> de una
		&laquo;slice&raquo; est&aacute; reservada para el sistema de
		ficheros que ha de albergar el sistema de ficheros
		ra&iacute;z (<filename>/</filename>).  No tiene por qu&eacute;
		seguir la costumbre pero tenga en cuenta que
		<application>sysinstall</application> s&iacute; que lo hace,
		as&iacute; que si la sigue sabe que est&aacute; haciendo una
		instalaci&oacute;n m&aacute;s limpia.  Puede montar los
		sistemas de ficheros donde prefiera; este ejemplo le sugiere
		que los monte como directorios
		<filename>/disco<replaceable>n</replaceable></filename>, donde
		<replaceable>n</replaceable> es un n&uacute;mero que cambia en
		cada disco.  Por supuesto que puede usar el esquema que
		prefiera.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <para>Una vez que haya elegido el esquema de particiones creelo en
	<application>sysinstall</application>.  Ver&aacute; este
	mensaje:</para>

      <screen>                                 Message
 Now, you need to create BSD partitions inside of the fdisk
 partition(s) just created. If you have a reasonable amount of disk
 space (200MB or more) and don't have any special requirements, simply
 use the (A)uto command to allocate space automatically. If you have
 more specific needs or just don't care for the layout chosen by
 (A)uto, press F1 for more information on manual layout.  

                                [  OK  ]
                          [ Press enter or space ]</screen>

            <para>Es decir:</para>

      <screen>                                 Message
 Debe crear particiones BSD dentro de las 'particiones
 fdisk' que acaba de crear.  Si tiene una cantidad de espacio en
 disco razonablemente grande (200MB o m&aacute;s) y no tiene necesidades
 especiales puede simplemente usar el comando (A)uto para asignar
 el espacio autom&aacute;ticamente. Si tiene necesidades m&aacute;s concretas o
 simplemente no le gusta la estructura que le da (A)uto pulse
 F1 y obtendr&aacute; m&aacute;s informaci&oacute;n sobre la creaci&oacute;n manual de
 la estructura.

                                [  OK  ]
                          [ Pulse Intro o Espacio ]</screen>


      <para>Al pulsar <keycap>Intro</keycap> arrancar&aacute; el editor de
	particiones de &os;, <application>Disklabel</application>.</para>

      <para>La <xref linkend="sysinstall-label"> muestra lo que ver&aacute; cuando
	arranque <application>Disklabel</application>.  La pantalla se divide en
	tres secciones.</para>

      <para>Las primeras l&iacute;neas muestran el nombre del disco en el
	que estamos haciendo cambios y el de la &laquo;slice&raquo; que
	contiene  las particiones que estamos creando
	(<application>Disklabel</application> las muestra bajo
	<literal>Partition name</literal>
	(&laquo;nombre de partici&oacute;n&raquo;) en lugar de hacerlo
	como &laquo;slices&raquo;).  Vemos tambi&eacute;n ah&iacute; la
	cantidad de espacio libre en la &laquo;slice&raquo;, esto es, el
	espacio que hay asignado a la &laquo;slice&raquo; pero que
	a&uacute;n no ha sido asignado a ninguna partici&oacute;n.</para>

      <para>En la mitad de la pantalla se muestran las particiones que se
	han creado, el nombre de los sistemas de ficheros que contiene cada
	partici&oacute;n, sus tama&ntilde;os y algunas opciones relacionadas
	con la creaci&oacute;n de sistemas de ficheros.</para>

      <para>La tercera parte de la pantalla, la de m&aacute;s abajo, muestra
	los atajos de teclado que pueden usarse
	en <application>Disklabel</application>.</para>


      <figure id="sysinstall-label">
	<title>El editor Disklabel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para><application>Disklabel</application> puede crear autom&aacute;ticamente
        particiones y asignarles tama&ntilde;os por omisi&oacute;n.  Estos
	tama&ntilde;os se calculan con la ayuda de un algoritmo interno de
	dimensionamiento de particiones que analiza el tama&ntilde;o del
	disco.  Puede probarlo pulsando
	<keycap>A</keycap>.  Ver&aacute; una pantalla similar a la que aparece en
	la <xref linkend="sysinstall-label2">.  Dependiendo del tama&tilde;o del
	disco que est&eacute; usando los valores por omisi&oacute;n pueden o no
	ser los apropiados.  Esto no es algo de lo que deba preocuparse dado que
	no est&aacute; obligado a aceptar esos valores por omisi&oacute;n.</para>

	<note>
	  <para>En el esquema de particiones por omisi&oacute;n el directorio
	    <filename>/tmp</filename> tiene su propia partici&oacute;n en lugar
	    de formar parte de <filename>/</filename>.  Esto ayuda a evitar el
	    desbordamiento de <filename>/</filename> con ficheros
	    temporales.</para>
	</note>

      <figure id="sysinstall-label2">
	<title>Editor Disklabel con valores por omisi&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-auto" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>Si decide no usar los valores por defecto para las particiones
	y quiere reemplazar tales valores por los suyos use las flechas:
	elija la primera partici&oacute;n y pulse <keycap>D</keycap> para
	borrarla.  Repita el proceso para borrar todas las particiones que
	desee.</para>

      
      <para>Vamos a crear la primera partici&oacute;n
	(<literal>a</literal>, montada como <filename>/</filename>
	o ra&iacute;z).  Seleccione la &laquo;slice&raquo; adecuada y
	pulse <keycap>C</keycap>.  Aparecer&aacute; un di&aacute;logo
	pidi&eacute;ndole que escriba el tama&ntilde;o de la nueva
	partici&oacute;n (como se muestra en la
	in <xref linkend="sysinstall-label-add">).  Puede introducir
	el tama&ntilde;o expresado en bloques de disco o como un
	n&uacute;mero seguido de una <literal>M</literal> para expresarlo en
	megabytes, una <literal>G</literal> para usar gygabytes o una
	<literal>C</literal> si quiere expresarlo en cilindros.</para>


      <figure id="sysinstall-label-add">
	<title>Liberar espacio para la partici&oacute;n ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>El tama&ntilde;o por omisi&oacute;n que se muestra crear&aacute; una
	partici&oacute;n que ocupe el resto de la &laquo;slice&raquo;.  
	Si va a usar los tama&ntilde;os de partici&oacute;n que se daban
	en el ejemplo anterior borre el texto existente pulsando
	<keycap>Retroceso</keycap>; escriba <userinput>64M</userinput>, como
	se puede ver en la
	<xref linkend="sysinstall-label-add2">.  Despu&eacute;s pulse
	&gui.ok;.</para>

      
      <figure id="sysinstall-label-add2">
	<title>Edici&oacute;n del tama&ntilde;o de la partici&oacute;n ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Una vez elegido el tama&ntilde;o de la partici&oacute;n tendr&aacute;
        que elegir si esta partici&oacute;n ha de contener un sistema de
	ficheros o espacio swap y escribir lo que corresponda en una pantalla
	como la que se muestra en la
	<xref linkend="sysinstall-label-type">.  Esta primera partici&oacute;n
	contendr&aacute; un sistema de ficheros, as&iacute; que seleccionamos
	<guimenuitem>FS</guimenuitem> y pulsamos
	<keycap>Intro</keycap>.</para>

      <figure id="sysinstall-label-type">
	<title>Elegir el tipo de partici&oacute;n ra&iacute;z</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-fs" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
      
      <para>Para acabar, dado que est&aacute; creando un sistema de ficheros,
	tendr&aacute; que decirle a <application>Disklabel</application>
	d&oacute;nde hay que montarlo.  La pantalla se muestra en la
	<xref linkend="sysinstall-label-mount">.  El punto de montaje del sistema
	de ficheros ra&iacute;z es <filename>/</filename>, as&iacute; que
	tendr&aacute; que teclear <userinput>/</userinput>y luego pulsar
	<keycap>Intro</keycap>.</para>

      <figure id="sysinstall-label-mount">
	<title>Elegir el punto de montaje del sistema de ficheros ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La pantalla le mostrar&aacute; ahora la partici&oacute;n que
	acaba de crear.  Repita el procedimiento todas las veces que
	necesite con las dem&aacute;s particiones.  Cuando cree la
	partici&oacute;n swap no se le pedir&aacute; el punto de
	montaje puesto que las particiones swap nunca se montan como
	tales.  Cuando cree la &uacute;ltima partici&oacute;n
	<filename>/usr</filename>, puede dejar el tama&ntilde;o que se le
	sugiere, esto es, usar el resto del espacio en la
	&laquo;slice&raquo;.</para>

      <para>La &uacute;ltima pantalla del editor Disklabel ser&aacute; muy
	parecida a la <xref linkend="sysinstall-label4">, aunque los valores
	pueden ser diferentes.  Pulse <keycap>Q</keycap> para salir del
	editor.</para>


      <figure id="sysinstall-label4">
	<title>Editor Disklabel</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-choosing">
    <title>Elecci&oacute;n de qu&eacute; instalar</title>

    <sect2 id="distset">
      <title>Elecci&oacute;n del tipo de instalaci&oacute;n</title>

      <para>La elecci&oacute;n de qu&eacute; tipo de instalaci&oacute;n
	debe hacer depende enormemente del uso que se va a dar al sistema y
	del espacio de disco disponible.  El rango de opciones predefinidas
	est&aacute; entre hacer la instalaci&oacute;n m&aacute;s
	peque&ntilde;a posible o instalarlo todo.  Las personas con poco o ninguna
	experiencia en &unix; o &os; deber&aacute;n elegir alguna de las
	opciones predefinidas que se les ofrecen, a las que llamaremos
	distribuciones (de &laquo;distribution set&raquo;) tal y como
	aparecen en el men&uacute; de <application>sysinstall</application>.  
	Una instalaci&oacute;n a medida es algo m&aacute;s adecuado para
	para usuarios con m&aacute;s experiencia.</para>

      <para>Si pulsa <keycap>F1</keycap> podr&aacute; acceder a m&aacute;s
	informaci&oacute;n sobre las opciones de tipo de instalaci&oacute;n
	y qu&eacute; contiene cada distribuci&oacute;n.  Cuando acabe de
	consultar la ayuda pulse <keycap>Intro</keycap> y volver&aacute; al
	al men&uacute; de selecci&oacute;n de instalaci&oacute;n de
	distribuciones.</para>


      <para>Si tiene intenci&oacute;n de instalar un interfaz gr&aacute;fico de
        usuario tendr&aacute; que instalar una de las distribuciones cuyo
	nombre comienza por <literal>X</literal>.  La configuraci&oacute;n
	del servidor X y la selecci&oacute;n de un entorno de escritorio son
	algunas de las tareas que tendr&aacute; una vez instalado &os;.  Tiene
	m&aacute;s informaci&oacute;n sobre la configuraci&oacute;n de un
	servidor X en <xref
	linkend="x11">.</para>

      <para>La versi&oacute;n de X11 por omisi&oacute;n en &os; es
        <application>&xorg;</application>.</para>

      
      <para>Si preve compilar un kernel a medida selecciones la
	opci&oacute;n que incluye el c&oacute;digo fuente.  Para m&aacute;s
	informaci&oacute;n sobre las razones por las que debe compilarse
	un kernel a medida y sobre c&oacute;mo compilarlo
	consulte el <xref linkend="kernelconfig">.</para>

      <para>Evidentemente el sistema m&aacute;s vers&aacute;til es
	aqu&eacute;l que lo tiene todo.  Si dispone de espacio de disco
	suficiente seleccione <guimenuitem>All</guimenuitem>, como se
	muestra en la <xref linkend="distribution-set1">, usando las
	flechas y pulsando <keycap>Intro</keycap>.  Si el espacio en
	disco es limitado piense en usar alguna de las otras opciones.  
	No pierda con ello demasiado tiempo puesto que el resto de
	distribuciones pueden a&ntilde;adirse en cualquier momento tras
	la intalaci&oacute;n.</para>

      <figure id="distribution-set1">
	<title>Elecci&oacute;n de distribuciones</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>

    <sect2 id="portscol">
      <title>Instalaci&oacute;n de la colecci&oacute;n de ports</title>

      
      <para>Tras seleccionar la distribuci&oacute;n elegida se le
	presentar&aacute; la opci&oacute;n de instalar el &aacute;rbol
	de ports, o Colecci&oacute;n de Ports, de &os;.  Los ports son una
	forma f&aacute;cil y c&oacute;moda de instalar software.  El
	&aacute;rbol de ports no contiene el c&oacute;digo fuente necesario
	para compilar software; es una gran colecci&oacute;n de ficheros que
	automatiza la descarga, la compilaci&oacute;n y la instalaci&oacute;n
	de paquetes de software de todo tipo.  El
	<xref linkend="ports"> explica con detalle c&oacute;mo utilizar los
	ports.</para>

      <para>El programa de instalaci&oacute;n no comprueba si tiene espacio
	suficiente.  Seleccione esta opci&oacute;n si dispone de sitio
	en el disco.  En &os; &rel.current; los ports ocupan cerca de
	&ports.size; en disco.  Puede asumir tranquilamente que en
	las nuevas versiones del sistema ir&aacute;n ocupando m&aacute;s y
	m&aacute;s.</para>


<screen>                         User Confirmation Requested
 Would you like to install the FreeBSD ports collection? 

 This will give you ready access to over &os.numports; ported software packages,
 at a cost of around &ports.size; of disk space when "clean" and possibly much
 more than that if a lot of the distribution tarballs are loaded
 (unless you have the extra CDs from a FreeBSD CD/DVD distribution
 available and can mount it on /cdrom, in which case this is far less
 of a problem). 

 The Ports Collection is a very valuable resource and well worth having
 on your /usr partition, so it is advisable to say Yes to this option. 

 For more information on the Ports Collection &amp; the latest ports,
 visit: 
     http://www.FreeBSD.org/ports  

                              [ Yes ]     No</screen>

      
      <para>Es decir:</para>

<screen> Petici&oacute;n de confirmaci&oacute;n del usuario
 &iquest;Quiere instalar la colecci&oacute;n de ports de FreeBSD?

 Tendr&aacute; acceso inmediato a m&aacute;s de &os.numports; paquetes de software listos
 para usarse en &os;, aunque necesitar&aacute; cerca de &ports.size; de
 espacio en disco como m&iacute;nimo y posiblemente mucho m&aacute;s
 si descarga los 'tarballs' de c&oacute;digo fuente (aunque si tiene los CD
 extra de una versi&oacute;n de &os; en CD/DVD puede montarlos en /cdrom, de forma
 que esto dejar&iacute;a de ser un problema).

 La colecci&oacute;n de ports es un recurso extremadamente valioso y es muy
 recomendable que la instale en su partici&oacute;n /usr, as&iacute; que deber&iacute;a
 responder S&iacute; a la siguiente pregunta.

 Si quiere estar al tanto de las &uacute;ltimas novedades y las &uacute;ltimas
 entradas en la colecci&oacute;n de ports visite:
     http://www.FreeBSD.org/ports

                              [ Yes ]     No</screen>


      <para>Seleccione &gui.yes; con las flechas e instale los
	ports o &gui.no; para obviar la pregunta.  Pulse
	<keycap>Intro</keycap> para seguir con la instalaci&oacute;n.  
	Volvemos al men&uacute; de elecci&oacute;n de distribuciones.</para>



      <figure id="distribution-set2">
	<title>Confirmar la elecci&oacute;n de distribuciones</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Si ya ha elegido todo lo que necesita seleccione
	<guimenuitem>Exit</guimenuitem> con las flechas, aseg&uacute;rese de
	que &gui.ok; est&aacute; seleccionado tambi&eacute;n y pulse
	<keycap>Intro</keycap>.</para>

    </sect2>
  </sect1>

  <sect1 id="install-media">
    <title>Elecci&oacute;n del medio de instalaci&oacute;n</title>


    <para>Si va a instalar &os; desde CDROM o DVD seleccione
      <guimenuitem>Install from a FreeBSD CD/DVD</guimenuitem> con las
      flechas.  Una vez &gui.ok; est&aacute; seleccionado pulse
      <keycap>Intro</keycap> y siga adelante con la instalaci&oacute;n.</para>
    
    <para>Si quiere usar otro m&eacute;todo de instalaci&oacute;n seleccione
      la opci&oacute;n correspondiente y siga las instrucciones.</para>

    <para>Pulse <keycap>F1</keycap> si necesita acceder a la ayuda del
      medio de instalaci&oacute;n elegido.  Pulse <keycap>Intro</keycap> 
      para regresar al men&uacute; de selecci&oacute;n de medios.</para>


    <figure id="choose-media">
      <title>Choose Installation Media</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/media" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <note>
      <title>Tipos de instalaci&oacute;n desde FTP</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>network</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>
      
      <para>Hay tres tipos de instalaci&oacute;n por FTP entre las que
        puede elegir:  FTP activo, FTP pasivo o a trav&eacute;s de un
	proxy HTTP.</para>

      <variablelist>
	<varlistentry>
	  <term>FTP Activo: <guimenuitem>Install from an FTP
	      server</guimenuitem>, es decir:
	      &laquo;Instalar desde un servidor FTP&raquo;</term>
	  
	  <listitem>
	    <para>Esta opci&oacute;n har&aacute; que todas las
	      transferencias FTP usen el modo &laquo;Activo&raquo;.  
	      No funcionar&aacute; a trav&eacute;s de cortafuegos pero
	      seguramente funcionar&aacute; con viejos servidores FTP que
	      no soportan el modo pasivo.  Si su conexi&oacute;n se cuelga
	      cuando usa el modo pasivo (el modo por omisi&oacute;n) pruebe el
	      modo activo.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term>FTP Pasivo: <guimenuitem>Install from an FTP server through a
	      firewall</guimenuitem>, es decir
	      &laquo;Instalar desde un servidor FTP tras un
	      cortafuegos&raquo;.</term>
	  
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>modo pasivo</secondary>
	    </indexterm>

	    <para>Esta opci&oacute;n configura
              <application>sysinstall</application> para que use el
	      modo &laquo;Pasivo&raquo; para todas las operaciones
	      FTP.  Esto permite al usuario pasar a trav&eacute;s de
	      cortafuegos que no permiten conexiones entrantes a
	      puertos TCP aleatorios.</para>
	  </listitem>

	</varlistentry>
	
	<varlistentry>
	  <term>FTP via un proxy HTTP: <guimenuitem>Install from an FTP server
	      through a http proxy</guimenuitem>, es decir &laquo;Instalar
	      desde un un servidor FTP via un proxy HTTP&raquo;.</term>
	    
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>via a HTTP proxy</secondary>
	    </indexterm>
	    
	    <para>Esta opci&oacute;n configura <application>sysinstall</application>
	      para que use el protocolo HTTP (como si fuera un navegador web) para
	      conectarse a un proxy en todas las operaciones FTP.  El proxy
	      traducir&aacute; las peticiones del usuario de forma que pasar&aacute;n
	      a trav&eacute;s de un cortafuegos que no permita ning&uacute;n tipo de
	      conexiones FTP pero ofrezca un proxy HTTP.  Tendr&aacute; que configurar
	      los datos del proxy adem&aacute;s de los del servidor FTP.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
        <para>Si quiere usar un servidor proxy FTP tendr&aacute; que usar
	el nombre del servidor con el que realmente quiere conectar como
	nombre de usuario seguido de un signo &laquo;@&raquo;.  Veamos un
	ejemplo.  Quiere usted instalar desde
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> a trav&eacute;s del
	servidor proxy FTP
	<hostid role="fqdn">talycual.ejemplo.com</hostid>, que escucha en el
	puerto 1024.</para>
      
      <para>Vaya al men&uacute; opciones, ponga
	<literal>ftp@ftp.FreeBSD.org</literal> como nombre de usuario FTP,
	y su direcci&oacute;n de correo electr&oacute;nico como
	contrase&ntilde;a.  El medio de instalaci&oacute;n ser&aacute; FTP
	(o FTP pasivo si el proxy lo permite) y la URL
	<literal>ftp://talycual.ejemplo.com:1234/pub/FreeBSD</literal>.</para>

      <para>Dado accede al directorio <filename>/pub/FreeBSD</filename>
	de <hostid role="fqdn">ftp.FreeBSD.org</hostid> a trav&eacute;s
	del proxy <hostid role="fqdn">talycual.ejemplo.com</hostid> puede usted
	instalar desde <emphasis>&eacute;sta</emphasis> m&aacute;quina,
	que ir&aacute; descargando los ficheros que necesite desde
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> a medida que el
	proceso de instalaci&oacute;n los vaya requiriendo.</para> 
    </note>
  </sect1>

  <sect1 id="install-final-warning">
    <title>El punto sin retorno</title>



    <para>A partir de aqu&iacute; entramos en la instalaci&oacute;n propiamente
      dicha.  Esta es la &uacute;ltima oportunidad antes de empezar a escribir
      datos en el disco duro.</para>

    <screen>                       User Confirmation Requested
 Last Chance! Are you SURE you want to continue the installation? 

 If you're running this on a disk with data you wish to save then WE
 STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding! 

 We can take no responsibility for lost disk contents!  

                             [ Yes ]    No</screen>

    <para>Es decir:</para>

   <screen>   Petici&oacute;n de confirmaci&oacute;n del usuario
 &iexcl;&Uacute;ltima oportunidad!.  &iquest;SEGURO que quiere seguir con la instalaci&oacute;n?

 Si est&aacute; ejecutando este proceso en un disco que contenga datos que
 quiera coservar LE RECOMENDAMOS ENCARECIDAMENTE QUE HAGA COPIAS DE
 SEGURIDAD FIABLES antes de instalar.

 No podemos asumir nig&uacute;n tipo de responsabilidad por datos que pierda.

                             [ Yes ]    No</screen>


    <para>Seleccione &gui.yes; y pulse
      <keycap>Intro</keycap>.</para>


    <para>La instalaci&oacute;n tardar&aacute; m&aacute;s o menos
      tiempo seg&uacute;n la distribuci&oacute;n que haya elegido, el medio
      de instalaci&oacute;n  y la velocidad del sistema.  Se le
      ir&aacute;n mostrando mensajes durante el proceso para irle
      informando de c&oacute;mo van las cosas.</para> 
    
    <para>Cuando acabe la instalaci&oacute;n ver&aacute; un mensaje como
      este:</para>

    <screen>                               Message

Congratulations! You now have FreeBSD installed on your system.

We will now move on to the final configuration questions.
For any option you do not wish to configure, simply select No.

If you wish to re-enter this utility after the system is up, you may
do so by typing: sysinstall .  

                                 [ OK ] 

                      [  Press enter to continue  ]</screen>

    <para>Es decir:</para>

    <screen>                               Mensaje 

         &iexcl;Enhorabuena! Ha instalado &os; en su sistema.

Ahora terminaremos la configuraci&oacute;n del sistema.  Si hay alguna
opci&oacute;n que no quiere configurar bastar&aacute; con que elija No.

Si en alg&uacute;n momento quiere regresar a este programa escriba
sysinstall .

                                 [ OK ]

                      [  Pulse Intro  ]</screen>



    <para>Pulse <keycap>Intro</keycap>; pasaremos a acometer ciertas tareas
      posteriores a la instalaci&oacute;n.</para>


    <para>Si selecciona &gui.no; y pulsa <keycap>Intro</keycap>
      la instalaci&oacute;n se detendr&aacute; para evitar hacer
      m&aacute;s modificaciones en su sistema.  Ver&aacute; el
      el siguiente mensaje.</para>

    <screen>                                Message
Installation complete with some errors.  You may wish to scroll
through the debugging messages on VTY1 with the scroll-lock feature.
You can also choose "No" at the next prompt and go back into the
installation menus to retry whichever operations have failed.

                                 [ OK ]</screen>

    <para>Es decir:</para>

<screen>                                Mensaje
La instalaci&oacute;n ha finalizado con errores.  Puede moverse por la
pantalla de mensajes de depuraci&oacute;n de VTY1 tras pulsar la tecla
de Bloqueo de Pantalla.  Tambi&eacute;n puede elegir "No" en el pr&oacute;ximo
men&uacute; y volver a los men&uacute;s de instalaci&oacute;n y repetir cualquier
operaci&oacute;n que haya fallado.

                                 [ OK ]</screen>


    <para>Este mensaje se ha generado porque no se ha instalado nada.  
      Pulse <keycap>Intro</keycap> para volver al men&uacute;n
      principal y salir de la instalaci&oacute;n.</para>

  </sect1>

  <sect1 id="install-post">
    <title>Despu&eacute;s de la instalaci&oacute;n</title>

    
    <para>Para poder terminar una instalaci&oacute;n de &os; que merezca
      tal nombre debemos responder todav&iacute;a a unas cuantas preguntas.  
      Para ello debemos entrar en la 
      configuraci&oacute;n antes de entrar en el nuevo sistema &os; o
      una vez en dentro del sistema desde
      <command>sysinstall</command>, seleccionando
      <guimenuitem>Configure</guimenuitem>.</para>


    <sect2 id="inst-network-dev">
      <title>Network Device Configuration</title>

      <para>Si ha tenido que configurar PPP para poder instalar desde FTP
        esta pantalla no aparecer&aacute;.  Puede modificar la configuraci&oacute;n
	tal y como se ha explicado m&aacute;s arriba.</para>

      <para>Si necesita informaci&oacute;n sobre redes de &aacute;rea local
        y la configuraci&oacute;n de &os; necesaria para que haga de
	&laquo;gateway/router&raquo; consulte el
	<link linkend="advanced-networking">Advanced Networking</link>
	chapter.</para>

      <screen>                      User Confirmation Requested 
   Would you like to configure any Ethernet or SLIP/PPP network devices?

                             [ Yes ]   No</screen>

      <para>Si quiere configurar dispositivos de red seleccione
	&gui.yes; y pulse <keycap>Intro</keycap>.  Si no quiere
        seleccione &gui.no;.</para>

      <figure id="ed-config1">
	<title>Selecci&oacute;n de un dispositivo Ethernet</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione con las flechas el interfaz de red que desea
        configurar y pulse
	<keycap>Enter</keycap>.</para>

      <screen>                      User Confirmation Requested 
       Do you want to try IPv6 configuration of the interface?

                              Yes   [ No ]</screen>

      <para>En la red local del ejemplo el tipo de protocolo de Internet
	que hab&iacute;a (<acronym>IPv4</acronym>) parec&iacute;a m&aacute;s
	que suficiente, as&iacute; que se eligi&oacute; &gui.no;.</para>

      <para>Si puede conectar con alguna red
        <acronym>IPv6</acronym> mediante un servidor
	<acronym>RA</acronym> elija
	&gui.yes; y pulse <keycap>Intro</keycap>.  La b&uacute;squeda de
	servidores RA se har&aacute; en unos instantes.</para>

      <screen>                             User Confirmation Requested 
        Do you want to try DHCP configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Si no necesita DHCP seleccione &gui.no; con las flechas y pulse
	<keycap>Intro</keycap>.</para>

      <para>Si selecciona &gui.yes; ejecutar&aacute;
	<application>dhclient</application> y, si ha funcionado, completar&aacute;
	los datos de configuraci&oacute;n autom&aacute;ticamente.  Para
	m&aacute;s informaci&oacute;n consulte la
	<xref linkend="network-dhcp">.</para>

      <para>La siguiente ilustraci&oacute;n muestra la configuraci&oacute;n
        de un dispositivo Ethernet en un sistema que cumplir&aacute; las
	funciones de &laquo;gateway&raquo; en una red local.</para>

      <figure id="ed-config2">
	<title>Configuraci&oacute;n de ed0</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Use el <keycap>tabulador</keycap> para ir pasando de un campo al siguiente
        una vez que los vaya rellenando:</para>

      <variablelist>
	<varlistentry>
	  <term>Host</term>

	  <listitem>
	    <para>El nombre de la m&aacute;quina; por ejemplo, 
	      <hostid role="fqdn">k6-2.ejemplo.com</hostid>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Dominio</term>

	  <listitem>
	    <para>El nombre del dominio al que pertenece la m&aacute;quina, en
	      este caso <hostid role="domainname">ejemplo.com</hostid>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>&laquo;Gateway&raquo;IPv4</term>

	  <listitem>
	    <para>La direcci&oacute;n IP del sistema que reenvia paquetes a
	      destinos fuera de la red local. Debe rellenar este campo si
	      esta funci&oacute;n la realiza una m&aacute;quina que forme parte
	      de la red.  <emphasis>D&eacute;jelo en blanco</emphasis> si el
	      sistema es el enlace de su red con Internet.  El
	      &laquo;gateway&raquo; recibe tambi&eacute;n los nombres de
	      puerta de enlace o ruta por omisi&oacute;n.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Servidor de nombres</term>

	  <listitem>
	    <para>Direcci&oacute;n IP de su servidor local de DNS.  En la red
	      del ejemplo no hay servidor DNS local as&iacute; que se ha
	      introducido la direcci&oacute;n IP del servidor DNS del proveedor
	      de Internet:
	      <hostid role="ipaddr">208.163.10.2</hostid>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Direcci&oacute;n IPv4</term>

	  <listitem>
	    <para>En este interfaz se usar&aacute; la direcci&oacute;n IP 
	      <hostid role="ipaddr">192.168.0.1</hostid></para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>M&aacute;scara de red</term>

	  <listitem>
	    <para>En esta red local se usa un bloque de redes de Clase C
	      <hostid role="ipaddr">192.168.0.0</hostid> -
	      <hostid role="ipaddr">192.168.0.255</hostid>.  La
	      m&aacute;scara de red es, por tanto,
	      <hostid role="netmask">255.255.255.0</hostid>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Opciones adicionales de ifconfig</term>

	  <listitem>
	    <para>Cualquiera de las opciones que quiera agregar a su interfaz
	      mediante <command>ifconfig</command>.  En nuestro caso no
	      hab&iacute;a ninguna.</para>
	  </listitem>
	</varlistentry>

      </variablelist>

      <para>Utilice el <keycap>tabulador</keycap> para seleccionar &gui.ok;
	cuando haya acabado y pulse<keycap>Intro</keycap>.</para>


      <screen>                      User Confirmation Requested 
        Would you like to Bring Up the ed0 interface right now?

                             [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y pulse
	<keycap>Enter</keycap> si quiere conectar inmediatamente su
	sistema a la red mediante el o los interfaces que acaba de
	configurar, pero recuerde que a&uacute;n tendr&aacute; que
	reiniciar la m&aacute;quina.</para>
    </sect2>

    <sect2 id="gateway">
      <title>Configuraci&oacute;n del &laquo;gateway&raquo;</title>

      <screen>                       User Confirmation Requested 
       Do you want this machine to function as a network gateway?

                              [ Yes ]    No</screen>

      <para>Si el sistema har&aacute; de enlace de la red local y
        reenviar&aacute; paquetes entre otras m&aacute;quinas elija &gui.yes;
	y pulse <keycap>Intro</keycap>.  Si la m&aacute;quina es un
	nodo de una red elija &gui.no; y pulse
	<keycap>Intro</keycap>.</para>
    </sect2>

    <sect2 id="inetd-services">
      <title>Configuraci&oacute;n de servicios de internet</title>

      <screen>                      User Confirmation Requested
Do you want to configure inetd and the network services that it provides?

                               Yes   [ No ]</screen>


      <para>Si selecciona &gui.no; varios servicios de la m&aacute;quina,
	como <application>telnetd</application> y otros, no se
	activar&aacute;n.  Eso significa que los usuarios remotos no
	podr&aacute;n acceder al sistema mediante
	<application>telnet</application>.  Los usuarios locales, en cambio,
	podr&aacute;n acceder a sistemas remotos mediante
	<application>telnet</application>.</para>

      <para>Dichos servicios pueden activarse en cualquier momento
	editando <filename>/etc/inetd.conf</filename> con el editor de
	texto que prefiera.  Para m&aacute;s informaci&oacute;n
	consulte la
	<xref linkend="network-inetd-overview">.</para>

      <para>Seleccione &gui.yes; si desea configurar estos servicios
	durante la instalaci&oacute;n.  Se le mostrar&aacute; el
	siguiente mensaje:</para>


      <screen>                      User Confirmation Requested
The Internet Super Server (inetd) allows a number of simple Internet
services to be enabled, including finger, ftp and telnetd.  Enabling
these services may increase risk of security problems by increasing
the exposure of your system.

With this in mind, do you wish to enable inetd?

                             [ Yes ]   No</screen>

      <para>Select &gui.yes; to continue.</para>

      <screen>                      User Confirmation Requested
inetd(8) relies on its configuration file, /etc/inetd.conf, to determine
which of its Internet services will be available.  The default FreeBSD
inetd.conf(5) leaves all services disabled by default, so they must be
specifically enabled in the configuration file before they will
function, even once inetd(8) is enabled.  Note that services for
IPv6 must be separately enabled from IPv4 services.

Select [Yes] now to invoke an editor on /etc/inetd.conf, or [No] to
use the current settings.

                             [ Yes ]   No</screen>




      <para>Es decir:</para>

      <screen>      Petici&oacute;n de confirmaci&oacute;n del usuario
El Super Servidor de Internet (inetd) le permite activar diversos
servicios sencillos de Internet, como finger, ftp y telnetd.  Si
activa tales servicios puede sobreexponer su sistema al exterior, lo
que puede incrementar el riesgo de tener problemas de seguridad.

Dicho esto &iquest;desea activar inetd?

                             [ Yes ]   No</screen>


      <para>Si selecciona &gui.yes; podr&aacute; a&ntilde;adir servicios
	borrando caracteres <literal>#</literal> al comienzo de las
	l&iacute;neas correspondientes.</para>

      <figure id="inetd-edit">
	<title>Edici&oacute;n de <filename>inetd.conf</filename></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/edit-inetd-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Una vez que haya a&ntilde;adido los servicios que quiera en el
        sistema pulse  <keycap>Esc</keycap> y ver&aacute; un men&uacute; en el
	que se le preguntar&aacute; si quiere guardar los cambios.</para>

    </sect2>

    <sect2 id="ssh-login">
      <title>Activar el acceso al sistema mediante SSH</title>

      <indexterm>
	<primary>SSH</primary>
	<secondary>sshd</secondary>
      </indexterm>

      <screen>                      User Confirmation Requested
                  Would you like to enable SSH login?
                           Yes        [  No  ]</screen>

      <para>Si selecciona &gui.yes; activar&aacute; &man.sshd.8;, el
	d&aelig;mon de <application>OpenSSH</application>.  De este modo
	ser&aacute; posible el acceso remoto y seguro al sistema.  Para m&aacute;s
	informaci&oacute;n sobre <application>OpenSSH</application> visite <xref
	linkend="openssh">.</para>
    </sect2>

    <sect2 id="ftpanon">
      <title>FTP an&oacute;nimo</title>

      <indexterm>
	<primary>FTP</primary>
	<secondary>anonymous</secondary>
      </indexterm>

      <screen>                      User Confirmation Requested
 Do you want to have anonymous FTP access to this machine? 

                              Yes    [ No ]</screen>

      <sect3 id="deny-anon">
	<title>Rechazar el acceso al sistema mediante FTP an&oacute;nimo</title>
      
	<para>si acepta la respuesta por omisi&oacute;n (&gui.no;) y pulsa
	  <keycap>Intro</keycap> tenga en cuenta que los usuarios que tengan
	  cuenta en la m&aacute;quina podr&aacute;n seguir accediendo
	  al sistema.</para>
      </sect3>

      <sect3 id="ftpallow">
	<title>Aceptar el acceso al sistema mediante FTP an&oacute;nimo</title>

	<para>Si decide aceptar conexiones FTP an&oacute;nimas cualquiera
	  podr&aacute; conectarse al sistema.  Antes de activar esta
	  opci&oacute;n deber&iacute;a meditar sobre las implicaciones de
	  seguridad de esa decisi&oacute;n.  Para m&aacute;s informaci&oacute;n
	  sobre la seguridad y &os; consulte el <xref linkend="security">.</para>

	<para>Si ha decidido activar el FTP an&oacute;nimo seleccione con
	  las flechas &gui.yes; y pulse <keycap>Intro</keycap>.  Ver&aacute; la
	  siguiente pantalla (o una muy similar):</para>




	
	<screen>This screen allows you to configure the anonymous FTP user.

The following configuration values are editable:

UID:     The user ID you wish to assign to the anonymous FTP user.
         All files uploaded will be owned by this ID.

Group:   Which group you wish the anonymous FTP user to be in.

Comment: String describing this user in /etc/passwd


FTP Root Directory:

        Where files available for anonymous FTP will be kept.

Upload subdirectory:

        Where files uploaded by anonymous FTP users will go.</screen>

	<para>Es decir:</para>

<screen>En esta pantalla puede configurar el usuario de FTP
        an&oacute;nimo.

Puede editar los siguientes valores de la configuraci&oacute;n:

UID:     El ID del usuario que quiere asignar al usuario an&oacute;nimo de
         de FTP.  Todos los ficheros que se suban le  pertenecer&aacute;n.

Group:   El grupo al que pertenecer&aacute; el usuario FTP an&oacute;nimo.

Comment: La descripci&oacute;n del usuario en /etc/passwd


FTP Root Directory:

        D&oacute;nde se guardar&aacute;n contenidos para los usuarios an&oacute;nimos.

Upload subdirectory:

        D&oacute;nde se guardar&aacute;n los ficheros que suban los usuarios
	de FTP an&oacute;nimo.</screen>

	<para>Por omisi&oacute;n el directorio ra&iacute;z del ftp ser&aacute;
	  <filename>/var</filename>.  Si no hay sitio suficiente para
	  lo que prevea que va a necesitar puede usar
	  <filename>/usr</filename>; puede poner el Directorio Ra&iacute;z de
	  FTP en <filename>/usr/ftp</filename>.</para>

	<para>Cuando haya terminado con la configuraci&oacute;n pulse
	  <keycap>Intro</keycap>.</para>

	<screen>                          User Confirmation Requested
         Create a welcome message file for anonymous FTP users?

                              [ Yes ]    No</screen>

	<para>Si selecciona &gui.yes; y pulsa <keycap>Intro</keycap>
	  arrancar&aacute; autom&aacute;ticamente un editor y podr&aacute;
	  crear un mensaje que ver&aacute; los usuarios de FTP 
	  an&oacute;nimo al conectarse a la m&aacute;quina.</para>




	<figure id="anon-ftp4">
	  <title>Edici&oacute;n del mensaje de bienvenida de FTP</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon2" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Vemos en acci&oacute;n un editor de texto llamado <command>ee</command>.  
	  Puede modificar el mensaje ahora mismo o hacerlo en cualquier otro
	  momento con el editor de texto que prefiera.  Observe el fichero y
	  su ubicaci&oacute;n en la parte baja de la pantalla.</para>

	<para>Pulse <keycap>Esc</keycap>, aparecer&aacute; una ventana flotante
	  con la opci&oacute;n por omisi&oacute;n de
	  to <guimenuitem>a) leave editor</guimenuitem> (salir del editor).  Pulse
	  <keycap>Intro</keycap> si quiere salir y seguir con lo que estaba haciendo.  
	  Pulse <keycap>Intro</keycap> de nuevo para guardar los cambios que
	  hubiera hecho.</para>
      </sect3>
    </sect2>

    <sect2 id="nfsconf">
      <title>Configuraci&oacute;n de NFS</title>

      
      <para>NFS (&laquo;Network File System&raquo; (de Network File
        System, o Sistema de Ficheros en Red) le permitir&aacute; compartir
	ficheros a trav&eacute;s de una red.  Una m&aacute;quina puede
	configurarse como servidor, como cliente o ambos.  Para m&aacute;
	informaci&oacute;n consulte la
	<xref linkend="network-nfs">.</para>


      <sect3 id="nsf-server-options">
	<title>Servidor NFS</title>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS server? 

                              Yes    [ No ]</screen>

	<para>Si no tiene necesidad de usar un servidor NFS seleccione
	  &gui.no; y pulse
	  <keycap>Intro</keycap>.</para>

	<para>Si ha elegido &gui.yes; ver&aacute; un mensaje emergente
	  indicando que hay que crear el fichero 
	  <filename>exports</filename>.</para>

	<screen>                               Message
Operating as an NFS server means that you must first configure an
/etc/exports file to indicate which hosts are allowed certain kinds of
access to your local filesystems.
Press [Enter] now to invoke an editor on /etc/exports
                               [ OK ]</screen>

	<para>Es decir:</para>

	<screen>                               Mensaje
Hacer funcionar un servidor NFS implica que tendr&aacute; que configurar
un fichero /etc/exports para indicar qu&eacute; hosts estar&aacute;n autorizados a
acceder de qu&eacute; manera a sus sistemas de ficheros locales.
Pulse [Intro] para abrir /etc/exports en un editor
                               [ OK ]</screen>


	<para>Pulse <keycap>Intro</keycap> para seguir adelante.  Se
	  abrir&aacute; un editor de texto gracias al cual se podr&aacute;
	  editar y crear el fichero <filename>exports</filename>.</para>



	<figure id="nfs-server-edit">
	  <title>Edici&oacute;n de <filename>exports</filename></title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/nfs-server-edit" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	
	<para>Puede editar el fichero ahora mismo o m&aacute;s tarde con
	  el editor de texto que prefiera.  Observe que el nombre del
	  fichero y su ubicaci&oacute;n aparecen en la parte de abajo de
	  de la pantalla.</para>

	<para>Pulse <keycap>Escape</keycap>; aparecer&aacute; un mensaje
	  emergente que por omisi&oacute;n le ofrecer&aacute; 
	  <guimenuitem>a) leave editor</guimenuitem> (es decir, salir del
	  editor).  Pulse <keycap>Intro</keycap> para salir del editor y
	  seguir adelante.</para>
	
      </sect3>

      <sect3 id="nfs-client-options">
	<title>Cliente NFS</title>

	<para>El cliente NFS permite que su m&aacute;quina pueda acceder
	  a servidores NFS.</para>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS client? 

                              Yes   [ No ]</screen>

	<para>Utilice las flechas para elegir si quiere o no disponer de 
	  cliente NFS (respectivamente con &gui.yes; y
	  &gui.no; y pulse <keycap>Intro</keycap>.</para>
      </sect3>
    </sect2>

    <sect2 id="console">
      <title>Configuraci&oacute;n de la consola del sistema</title>

      <para>La consola del sistema tiene diversas opciones que puede usted
         adaptar a sus gustos o necesidades.</para>

      <screen>                      User Confirmation Requested 
       Would you like to customize your system console settings?

                              [ Yes ]  No</screen>

      <para>Si  quiere ver y modificar las opciones seleccione
	&gui.yes; y pulse <keycap>Intro</keycap>.</para>

      <figure id="saver-options">
	<title>Opciones de configuraci&oacute;n de la consola del sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>



      <para>Una opci&oacute;n que suele elegirse es el uso del
	salvapantallas.  Elija <guimenuitem>Saver</guimenuitem> y
	luego pulse <keycap>Intro</keycap>.</para>


      <figure id="saver-select">
	<title>Opciones del salvapantallas</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Despl&aacute;cese arriba y abajo con las flechas por la
	lista de salvapantallas y elija el que prefiera pulsando
	<keycap>Intro</keycap> sobre &eacute;l.  Se le mostrar&aacute;
	de nuevo el men&uacute; de configuraci&oacute;n de la consola.</para>

      <para>El intervalo por defecto es de 300 segundos.  Si quiere cambiarlo
	seleccione <guimenuitem>Saver</guimenuitem> otra vez.  Busque
	<guimenuitem>Timeout</guimenuitem> en el men&uacute; de opciones del
	salvapantallas y pulse <keycap>Intro</keycap>.  Aparecer&aacute; un
	mensaje en pantalla:</para>

      <figure id="saver-timeout">
	<title>Retardo del salvapantallas</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Asigne el retardo del salvapantallas a su gusto, seleccione
	&gui.ok; y pulse <keycap>Intro</keycap> para volver al men&uacute; de
	configuraci&oacute;n de la consola del sistema.</para>

      <figure id="saver-exit">
	<title>Salida del men&uacute; de configuraci&oacute;n de la consola del sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Exit</guimenuitem> y pulse
	<keycap>Intro</keycap> para seguir adelante con la configuraci&oacute;n
	necesaria tras la instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="timezone">
      <title>Configuraci&oacute;n de la zona horaria</title>



      <para>Si su sistema tiene correctamente configurada la zona
	horaria podr&aacute; corregir cualquier autom&aacute;ticamente
	cualquier cambio horario regional, as&iacute; como cumplir
	adecuadamente con otras funciones relacionadas con zonas
	horarias.</para>

      <para>El ejemplo que se muestra en las capturas de pantalla es
	de una m&aacute;quina ubicada en la zona horaria del Este de los
	EEUU.</para>

      <screen>                      User Confirmation Requested 
          Would you like to set this machine's time zone now?

                            [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y pulse
	<keycap>Intro</keycap>.  Vamos a configurar la zona horaria del
	sistema.</para>



      <para>Seleccione &gui.yes; y pulse
	<keycap>Intro</keycap>.</para>

      <screen>                       User Confirmation Requested
 Is this machine's CMOS clock set to UTC? If it is set to local time
 or you don't know, please choose NO here! 

                              Yes   [ No ]</screen>

      <para>Seleccione &gui.yes; o &gui.no; seg&uacute;n est&eacute;
	configurado el reloj del sistema y pulse <keycap>Intro</keycap>.</para>

      <figure id="set-timezone-region">
	<title>Elecci&oacute;n de regi&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija la zona adecuada mediante las flechas y pulse
	<keycap>Intro</keycap>.</para>

      <figure id="set-timezone-country">
	<title>Elecci&oacute;n de pa&iacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija el pa&iacute;s adecuado con las flechas y pulse
	<keycap>Intro</keycap>.</para>

      <figure id="set-timezone-locality">
	<title>Elecci&oacute;n de zona horaria</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija la zona horaria adecuada con las flechas y pulse
	<keycap>Intro</keycap>.</para>

      <screen>                            Confirmation 
            Does the abbreviation 'EDT' look reasonable?

                            [ Yes ]   No</screen>

      <para>Confirme si la abreviatura de la zona horaria es la correcta.  Cuando
        todo est&eacute; correcto pulse <keycap>Intro</keycap> y siga
	adelante.</para>
    </sect2>

    <sect2 id="linuxcomp">
      <title>Compatibilidad con &linux;</title>

      <screen>                      User Confirmation Requested 
          Would you like to enable Linux binary compatibility?

                            [ Yes ]   No</screen>

      <para>Si selecciona &gui.yes; y pulsa 
	<keycap>Intro</keycap> podr&aacute; ejecutar software &linux; en
	&os;.  La instalaci&oacute;n a&ntilde;adir&aacute; los paquetes
	necesarios para poder tener compatibilidad binaria con
	&linux;.</para>

      <para>Si realiza la instalaci&oacute;n por FTP la m&aacute;quina
	necesitar&aacute; conectarse a Internet.  A veces los servidores
	ftp no tienen todas las distribuciones, de forma que si no puede
	instalar la distribuci&oacute;n de compatibilidad con &linux; no se
	preocupe, puede probar con otro servidor o instalarla m&aacute;s
	tarde.</para>


    </sect2>

    <sect2 id="mouse">
      <title>Configuraci&oacute;n del rat&oacute;n</title>

      <para>Esta opci&oacute;n le permitir&aacute; cortar y pegar texto en
	consola y en otros programas mediante un rat&oacute;n de tres
	botones.  Consulte &man.moused.8 si usa uno de 2 botones, es posible
	emular ese tercer bot&oacute;n.  En el siguiente ejemplo veremos la
	configuraci&oacute;n de un rat&oacute;n &laquo;no USB&raquo; (es
	decir, PS/2 o de puerto COM):</para>

      <screen>                      User Confirmation Requested 
         Does this system have a PS/2, serial, or bus mouse?

                            [ Yes ]    No </screen>

      <para>Seleccione &gui.yes; si tiene un rat&oacute;n que no sea USB o por el
	contrario seleccione &gui.no; si tiene un rat&oacute;n USB.  Despu&eacute;s
	pulse <keycap>Intro</keycap>.</para>

      <figure id="mouse-protocol">
	<title>Elija el protocolo que usa el rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Type</guimenuitem> usando las flechas
	y pulse <keycap>Intro</keycap>.</para>

      <figure id="set-mouse-protocol">
	<title>Ajuste del protocolo del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>En el ejemplo se ha usado un rat&oacute;n PS/2, as&iacute; que
	<guimenuitem>Auto</guimenuitem> era correcto.  Para cambiar el
	protocolo use las flechas para moverse por el men&uacute; y elegir otra
	opci&oacute;n.  Para salir seleccione &gui.ok; y pulse
	<keycap>Intro</keycap>.</para>

      <figure id="config-mouse-port">
	<title>Configuraci&oacute;n del puerto del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Port</guimenuitem> y
	pulse <keycap>Intro</keycap>.</para>

      <figure id="set-mouse-port">
	<title>Configuraci&oacute;n del puerto del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>El sistema de ejemplo tiene un rat&oacute;na
        <guimenuitem>PS/2</guimenuitem>, de forma que
        la configuraci&oacute;n por omisi&oacute;n basta.  Si quiere modificarla
	utilice las flechas y despu&eacute;s pulse<keycap>Intro</keycap>.</para>

      <figure id="test-daemon">
	<title>Arranque del d&aelig;mon del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse5" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Por &uacute;ltimo, utilice las flechas para elegir
	<guimenuitem>Enable</guimenuitem>y pulse
	<keycap>Intro</keycap>; as&iacute; se activa y prueba el
	d&aelig;mon del rat&oacute;n.</para>


      <figure id="test-mouse-daemon">
	<title>Prueba del d&aelig;mon del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse6" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>Mueva el rat&oacute;n un poco por la pantalla hasta
	asegurarse de que el cursor responde adecuadamente.  Si todo
	es correcto seleccione &gui.yes; y pulse
	<keycap>Intro</keycap>.  Si hay algo que no funcione correctamente
	seleccione &gui.no; e int&eacute;ntelo con otras opciones de
	configuraci&oacute;n.</para>

      <para>Seleccione <guimenuitem>Exit</guimenuitem> y pulse
	<keycap>Intro</keycap> para volver a la configuraci&oacute;n
	del sistema.</para>

    </sect2>

    <sect2 id="packages">
    <title>Instalaci&oacute;n de &laquo;packages&raquo;</title>

      <para>Los &laquo;packages&raquo; son binarios precompilados; son una
        forma muy c&oacute;moda de instalar software.</para>

      <para>Veamos la instalaci&oacute;n de un &laquo;package&raquo;   Este
        es un buen momento para instalar &laquo;packages&raquo; si
	as&iacute; lo desea.  De todos modos una vez concluida la instalaci&oacute;n
	puede entrar cuando quiera a
	<command>sysinstall</command> e instalar lo que necesite.</para>

      <screen>                     User Confirmation Requested
 The FreeBSD package collection is a collection of hundreds of
 ready-to-run applications, from text editors to games to WEB servers
 and more. Would you like to browse the collection now? 

                            [ Yes ]   No</screen>

      <para>Elija &gui.yes; y pulse
	<keycap>Intro</keycap>: ver&aacute; la pantalla de
	selecci&oacute;n de paquetes:</para>

      <figure id="package-category">
	<title>Categor&iacute;as de &laquo;packages&raquo;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-cat" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>Los &laquo;packages&raquo; presentes en el medio de instalaci&oacute;n
	que est&eacute; accesible en cada momento son los &uacute;nicos que
	se pueden instalar.</para>

      <para>Todos los &laquo;packages&raquo; disponibles en el medio se
        mostrar&aacute;n al seleccionar la categor&iacute;a
	<guimenuitem>All</guimenuitem>.  Elija una categor&iacute;a y pulse
	<keycap>Intro</keycap>.</para>

      <para>Al seleccionar una categor&iacute;a aparecer&aacute; un
	men&uacute; con los paquetes disponibles existentes en la misma:</para>


      <figure id="package-select">
	<title>Selecci&oacute;n de &laquo;packages&raquo;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-sel" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>Hemos elegido la shell <application>bash</application>.  
	Seleccione tantos &laquo;packages&raquo; como quiera instalar y pulse
	<keycap>Espacio</keycap>.  Se mostrar&aacute; una breve 
	descripci&oacute;n de cada  &laquo;package&raquo; en la esquina inferior 
	izquierda de la pantalla.</para>

      <para>Pulsando el <keycap>Tabulador</keycap> desplazar&aacute; el
	cursor entre el &uacute;ltimo  &laquo;package&raquo; que haya seleccionado,
	&gui.ok; y &gui.cancel;.</para>

      <para>Cuando haya seleccionado todos los &laquo;packages&raquo; que quiera
	instalar pulse <keycap>Tabulador</keycap> una sola vez para que
	el cursor pase a &gui.ok; y pulse <keycap>Intro</keycap>, lo que
	le llevar&aacute; al men&uacute; de selecci&oacute;n de
	 &laquo;packages&raquo;.</para>

      <para>Las flechas &laquo;izquierda&raquo; y &laquo;derecha&raquo;
	 pueden usarse para mover el cursor entre &gui.ok; y &gui.cancel;.  
	 Use esto para seleccionar &gui.ok; y pulsar
	<keycap>Intro</keycap> para volver al men&uacute; de
	selecci&oacute;n de  &laquo;packages&raquo;.</para>


      <figure id="package-install">
	<title>Instalaci&oacute;n de &laquo;packages&raquo;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-install" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilice el <keycap>tabulador</keycap> y las flechas para seleccionar 
        <guibutton>[&nbsp;Install&nbsp;]</guibutton> y pulse
	<keycap>Intro</keycap>.  Se le pedir&aacute; que confirme que quiere
	instalar &laquo;packages&raquo;:</para>

      <figure id="package-install-confirm">
	<title>Confirmaci&oacute;n previa a la instalaci&oacute;n de &laquo;packages&raquo;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-confirm" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>Si selecciona &gui.ok; y pulsa <keycap>Intro</keycap>
	comenzar&aacute; la instalaci&oacute;n de &laquo;packages&raquo;.  Ir&aacute;n
	apareciendo mensajes relacionados con los diversos procesos de
	instalaci&oacute;n hasta que se cumplan todos.  Est&eacute; atento
	por si aparecieran mensajes de error.</para>


      <para>Tras la instalaci&oacute;n de &laquo;packages&raquo; nos 
	quedan unos toques finales a la configuraci&oacute;n.  Si no ha
	elegido ning&uacute;n &laquo;package&raquo; y quiere regresar
	al men&uacute; de configuraci&oacute;n seleccione
	<guibutton>Install</guibutton> de todos modos.</para>
    </sect2>

    <sect2 id="addusers">
      <title>A&ntilde;adir usuarios y grupos</title>

      
      <para>Deber&iacute; al menos a&ntilde;adir un usuario al sistema
	para poder usarlo para acceder al sistema una vez reiniciado sin
	tener que recurrir a <username>root</username>.  La partici&oacute;n
	ra&iacute;z suele ser peque&ntilde;a y ejecutar aplicaciones como
	<username>root</username> tiene a llenarla r&aacute;pidamente.  
	Pero hay un peligro mucho mayor:</para>

      <screen>                     User Confirmation Requested
 Would you like to add any initial user accounts to the system? Adding
 at least one account for yourself at this stage is suggested since
 working as the "root" user is dangerous (it is easy to do things which
 adversely affect the entire system). 

                            [ Yes ]   No</screen>

      <para>Es decir:</para>

      <screen>     Petici&oacute;n de confirmaci&oacute;n del usuario
 &iquest;Quiere a&ntilde;adir alg&uacute;n usuario al sistema? Le sugerimos que a&ntilde;ada al menos
 uno para usted puesto que trabajar como "root" es peligroso (es f&aacute;cil
 hacer algo con consecuencias en todo el sistema).

                            [ Yes ]   No</screen>



      <para>Seleccione &gui.yes; y pulse
	<keycap>Intro</keycap> para a&ntilde;adir un usuario.</para>

      <figure id="add-user2">
	<title>Selecci&oacute;n de &laquo;A&ntilde;adir un usuario&raquo;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>User</guimenuitem> con las flechas y
	y pulse<keycap>Intro</keycap>.</para>

      <figure id="add-user3">
	<title>A&ntilde;adir la informaci&oacute;n del usuario</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      
      <para>A medida que vaya seleccionando los campos ayud&aacute;ndose del
	<keycap>Tabulador</keycap> se le ir&aacute;n mostrando las siguientes
	descripciones en la parte baja de la pantalla:</para>

      <variablelist>
	<varlistentry>
	  <term>Login ID</term>

	  <listitem>
	    <para>El nombre del usuario (obligatorio).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>UID</term>
	
	  <listitem>
	    <para>El ID num&eacute;rico del usuario D&eacute;jelo
	      en blanco si quiere el que sistema lo asigne
	      autom&aacute;ticamente.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Group</term>

	  <listitem>
	    <para>El grupo al que pertenecer&aacute; el usuario.  D&eacute;jelo
	      en blanco si quiere que el sistema lo asigne
	      autom&aacute;ticamente.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Password</term>

	  <listitem>
	    <para>La contrase&ntilde;a del usuario. <emphasis>Rellene este campo con
	      mucho cuidado</emphasis>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Full name</term>

	  <listitem>
	    <para>El nombre completo del usuario (o un comentario 
	    descriptivo.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Member groups</term>

	  <listitem>
	    <para>Los grupos a los que este usuario pertenece, es decir, de los que
	      hereda sus derechos de acceso.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Home directory</term>

	  <listitem>
	    <para>El directorio &laquo;home&raquo; del usuario; d&eacute;jelo en
	      blanco si quiere que el sistema lo asigne
	      autom&aacute;ticamente.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Login shell</term>
	  <listitem>
	    <para>La shell con la que el usuario acceder&aacute; al
	      sistema.  D&eacute;jela en blanco si le sirve
	      <filename>/bin/sh</filename>, la shell por
	      omisi&oacute;n.</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>En nuestro ejemplo no se eligi&oacute;
        <filename>/bin/sh</filename> sino
	<filename>/usr/local/bin/bash</filename>, para lo cual hubo que
	instalar previamente la shell <application>bash</application>
	como &laquo;package&raquo;.  No intente usar una shell que no
	existe o no podr&aacute; acceder al sistema con ese usuario.  La
	shell m&aacute;s habitual en el mundo BSD es
	<filename>/bin/tcsh</filename>, la &laquo;C shell&raquo;.</para>

      <para>El usuario se a&ntilde;adi&oacute; tambi&eacute;n al grupo
        <groupname>wheel</groupname> para que pueda convertirse en
	superusuario con privilegios de
	<username>root</username>.</para>

      <para>Cuando haya terminado pulse &gui.ok; y volver&aacute; al men&uacute;
        de gesti&oacute;n de grupos y usuarios.</para>

      <figure id="add-user4">
	<title>Salir de la gesti&oacute;n de usuarios y grupos</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>


      <para>Los grupos tambi&eacute;n pueden a&ntilde;adirse en este
	momento si fuera necesario.  Tambi&eacute;n puede hacerse desde
	<filename>sysinstall</filename> una vez culminada la
	instalaci&oacute;n.</para>

      <para>Cuando haya acabado de a&ntilde;adir usuarios seleccione
	<guimenuitem>Exit</guimenuitem> con las flechas y pulse
	<keycap>Intro</keycap> y siga con la instalaci&oacute;n.</para>
    </sect2>


    <sect2 id="rootpass">
      <title>Asignar contrase&ntilde;a a<username>root</username> Password</title>

      <screen>                        Message
 Now you must set the system manager's password.  
 This is the password you'll use to log in as "root". 

                         [ OK ] 

               [ Press enter or space ]</screen>

      
      <para>Es decir:</para>

      <screen>                        Mensaje
 Debe asignar la contrase&ntilde;a del administrador del sistema.
 Esta es la contrase&ntilde;a que usar&aacute; cuando acceda al sistema como
 "root".

                         [ OK ]

                    [ Pulse Intro ]</screen>

      <para>Pulse <keycap>Intro</keycap> y as&iacute;gnele una
	contrase&ntilde;a a <username>root</username>.</para>

      <para>Tendr&aacute; que escribir la contrase&ntilde;a correctamente
	dos veces.  No hay necesidad de decirle que es importante que
	recuerde esa contrase&ntilde;a.</para>



      <screen>New password:
Retype new password :</screen>

      <para>La instalaci&oacute;n proseguir&aacute; una vez que introduzca
        la contrase&ntilde;a correctamente dos veces.</para>
    </sect2>

    <sect2 id="exit-inst">
      <title>Salir de la instalaci&oacute;n</title>

      <para>Si tiene que configurar <link linkend="network-services">servicios de
        red</link> o cualquier otra cosa, puede hacerlo ahora mismo
	o tras terminar la instalaci&oacute;n ejecutando
	<command>sysinstall</command>.</para>

      <screen>                     User Confirmation Requested
 Visit the general configuration menu for a chance to set any last
 options? 

                              Yes   [ No ]</screen>

      <para>Seleccione &gui.no; con las flechas
	y pulse <keycap>Intro</keycap> para volver al men&uacute;
	principal de la instalaci&oacute;n.</para>

      <figure id="final-main">
	<title>Salir de la instalaci&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mainexit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guibutton>[X Exit Install]</guibutton> con las flechas
	y pulse <keycap>Intro</keycap>.  Se le pedir&aacute; que confirme que
	quiere salir de la instalaci&oacute;n:</para>

      <screen>                     User Confirmation Requested
 Are you sure you wish to exit? The system will reboot (be sure to  
 remove any floppies/CDs/DVDs from the drives).

                            [ Yes ]   No</screen>

      
      <para>Es decir:</para>

      <screen>            Petici&oacute;n del Confirmaci&oacute;n al usuario
 &iquest;Seguro que quiere salir?  El sistema reiniciar&aacute; (compruebe que
 ha retirado los disquetes de la unidad).

                            [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y extraiga el disquete si ha arrancado desde
	floppy.  La unidad CDROM est&aacute; bloqueada hasta que la
	m&aacute;quina comience a reiniciarse.  La unidad CDROM se desbloquea
	y (actuando con agilidad felina) puede extraerse el CDROM.</para>

      <para>El sistema reiniciar&aacute;. Est&eacute; atento por si aparece
	alg&uacute;n mensaje de error.</para>
    <!--
    </sect2>
    -->
      <para>Seleccione &gui.yes; y extraiga el disquete si ha arrancado desde
	floppy.  La unidad lectora de CDROM est&aacute; bloqueada hasta que
	la m&aacute;quina comience a reiniciarse.  La unidad CDROM se
	desbloquea y (actuando con agilidad felina) puede extraerse el
	CDROM.</para>

      <para>Si apareciera alg&uacute;n error durante el arranque consulte la
	<xref linkend="freebsdboot">.</para>


    </sect2>

    <sect2 id="network-services">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Tom</firstname>
            <surname>Rhodes</surname>
            <contrib>Escrito por </contrib>
          </author>
        </authorgroup>
      </sect2info>
      <title>Configuraci&oacute;n de servicios de red</title>

      <para>La configuraci&oacute;n de servicios de red puede ser una
        tarea peliaguda para usuarios inexpertos si no tienen
	demasiados conocimientos en la materia.  Todo lo relacionado
	con las redes (y ah&iacute; entra Internet) tiene una
	importancia cr&iacute;tica en cualquier sistema operativo
	moderno y &os; no es una excepci&oacute;n.  Es por esta
	raz&oacute;n que le ser&aacute; muy &uacute;til saber un
	poco sobre la conectividad en general de &os; desde el momento
	mismo de la instalaci&oacute;n y los servicios de que puede
	disponer.</para>

      <para>Los servicios de red son programas que aceptan entradas de
        datos desde cualquier punto de la red.  Se pone mucho empe&ntilde;o
	en evitar que estos programas puedan ser &laquo;da&ntilde;inos&raquo;
	pero por desgracia los programadores no son perfectos y
	de tanto en cuanto aparecen errores en los servicios de red
	que algunos logran aprovechar para hacer maldades.  Es crucial
	que solamente active los servicios que sabe que va a necesitar.  
	Si tiene dudas con alguno lo mejor es que no lo active hasta
	que no sea evidente que lo necesita.  Puede activarlo cuando
	sea necesario ejecutando
	later by re-running <application>sysinstall</application> o
	utilizando el fichero <filename>/etc/rc.conf</filename> file.</para>

      <para>Si selecciona la opci&oacute;n <guimenu>Networking</guimenu> ver&aacute;
        un men&uacute; muy parecido a este:</para>

      <figure id="network-configuration">
	<title>Primer nivel de servicios de red</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La primera opci&oacute;n, <guimenuitem>Interfaces</guimenuitem>, la hemos
	visto en la <xref linkend="inst-network-dev">, as&iacute; que podemos
	ignorarla.</para>

      <para>Si selecciona la opci&oacute;n <guimenuitem>AMD</guimenuitem>
	a&ntilde;adir&aacute; al sistema la aplicaci&oacute;n montaje
	autom&aacute;tico de dispositivos de <acronym>BSD</acronym>.  Suele usarse
	junto con el protocolo <acronym>NFS</acronym> protocol (ver m&aacute;s
	adelante) para automatizar el montaje de sistemas de ficheros remotos.  
	No es necesario que configure nada.</para>

      <para>La siguiente opci&oacute;n es <guimenuitem>AMD Flags</guimenuitem>.  
        Si la selecciona ver&aacute; un men&uacute; emergente que le
	requerir&aacute; par&aacute;metros espec&iacute;ficos de
	<acronym>AMD</acronym>.  El men&uacute; dispone ya de un
	conjunto de opciones por omisi&oacute;n:</para>

      <screen>-a /.amd_mnt -l syslog /host /etc/amd.map /net /etc/amd.map</screen>

      <para>La opci&oacute;n <option>-a</option> fija el punto de montaje
        por omisi&oacute;n, en este caso
	<filename>/.amd_mnt</filename>.  La opci&oacute;n <option>-l</option>
	indica el <filename>log</filename> por omisi&oacute;, aunque si
	usa <literal>syslogd</literal> todos los datos de log se
	enviar&aacute;n al d&aelig;mon de logs del sistema.  El directorio
	<filename class="directory">/host</filename> se usa para montar
	sistemas de ficheros exportados desde una m&aacute;quina remota, mientras que
	el directorio <filename class="directory">/net</filename> se usa
	para montar sistemas de ficheros exportados desde una direcci&oacute;n
	<acronym>IP</acronym>.  El fichero
	<filename>/etc/amd.map</filename> define las opciones de exportaci&oacute;n
	que <acronym>AMD</acronym> exporta por omisi&oacute;n.</para>

      <indexterm>
	<primary>FTP</primary>
	<secondary>anonymous</secondary>
      </indexterm>

      <para>La opci&oacute;n <guimenuitem>Anon FTP</guimenuitem> permite
	conexiones <acronym>FTP</acronym> an&oacute;nimas.  Seleccione esta
	opci&oacute;n si quiere utilizar la m&aacute;quina como servidor
	servidor <acronym>FTP</acronym> an&oacute;nimo.  Tenga muy en cuenta
	los riesgos de seguridad que conlleva esta opci&oacute;n.  Se le
	ofrecer&aacute; otro men&uacute; en el que se explican en profundidad
	los riesgos de seguridad y la configuraci&oacute;n.</para>

      <para>El men&uacute; de configuraci&oacute;n <guimenuitem>Gateway</guimenuitem>
        preparar&aacute; la m&aacute;quina para que cumpla las funciones de
	pasarela, tal y como se ha explicado previamente.  Puede utilizarlo
	tambi&eacute;n para desactivar la opci&oacute;n
	<guimenuitem>Gateway</guimenuitem> si la seleccion&oacute;n sin querer
	durante la instalaci&oacute;n.</para>

      <para>La opci&oacute;n <guimenuitem>Inetd</guimenuitem> permite desactivar
        el d&aelig;mon &man.inetd.8;.</para>

      <para>La opci&oacute;n <guimenuitem>Mail</guimenuitem> se usa para configurar
	el <acronym>MTA</acronym> (de Mail Transfer Agent, agente de transferencia
	de correo) del sistema.  Si selecciona esta opci&oacute;n llegar&aacute;
	al siguiente men&uacute;:</para>

      <figure id="mta-selection">
	<title>Elegir el MTA del sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mta-main" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Aqu&iacute; se le pide que elija qu&eacute;
	<acronym>MTA</acronym> quiere instalar en su sistema.  
	Un <acronym>MTA</acronym> no es otra cosa que un servidor de correo
	que entrega correo electr&oacute;nico a los usuarios del sistema
	o los que acceden a trav&eacute;s de Internet.</para>

      <para>Si selecciona <guimenuitem>Sendmail</guimenuitem> instalar&aacute;
	el c&eacute;lebre <application>sendmail</application>, el
	<acronym>MTA</acronym> de &os; por omisi&oacute;n.  La opci&oacute;n
	<guimenuitem>Sendmail local</guimenuitem> har&aacute; que
	<application>sendmail</application> sea el
	<acronym>MTA</acronym> del sistema pero desactivar&aacute; la
	capacidad de recibir correo entrante desde Internet.  Las dem&aacute;s
	opciones,
	<guimenuitem>Postfix</guimenuitem> y
	<guimenuitem>Exim</guimenuitem> son en el fonodo similares a
	<guimenuitem>Sendmail</guimenuitem>.  Ambas aplicaciones gestionan
	correo aunque hay usuarios que los elegir&iacute;an como su
	 <acronym>MTA</acronym> antes que
	<application>sendmail</application>.</para>

      <para>Tras elegir un <acronym>MTA</acronym> (o si ha elegido
	no usar ninguno) el men&uacute; de configuraci&oacute;n de red nos muestra
	la siguiente opci&oacute;n:<guimenuitem>NFS client</guimenuitem>.</para>

      <para>La opci&oacute;n <guimenuitem>NFS client</guimenuitem>
	configura el sistema para comunicarse con servidores
	<acronym>NFS</acronym>.  Un servidor <acronym>NFS</acronym>
	permite que, mediante el uso del protocolo  <acronym>NFS</acronym>,
	otras m&aacute;quinas de la red puedan acceder a sus sistemas de
	ficheros.  Si no hay m&aacute;s m&aacute;quinas en su red puede dejar
	la opci&oacute;n sin seleccionar.  El sistema puede necesitar
	m&aacute;s configuraci&oacute;n; consulte la
	<xref linkend="network-nfs"> para m&aacute;s informaci&oacute;n sobre
	c&oacute;mo configurar el cliente y el servidor.</para>

      <para>La siguiente opci&oacute;n es <guimenuitem>NFS server</guimenuitem>,
	que le permitir&aacute; configurar su sistema como servidor
	<acronym>NFS</acronym>.  Con esta opci&oacute;n a&ntilde;adir&aacute;
	la informaci&oacute;n necesaria para el arranque de <acronym>RPC</acronym>,
	los servicios de llamada de procedimientos remotos.  
	<acronym>RPC</acronym> se usa para coordinar conexiones entre
	sistemas y programas.</para>

      <para>La siguiente opci&oacute;n es
      <para>La siguiente opci&oacute;n es <guimenuitem>Ntpdate</guimenuitem>,
	la sincronizaci&oacute;n de la hora.  Al seleccionarla ver&aacute; un
	men&uacute; como este:</para>

      <figure id="Ntpdate-config">
	<title>Configuraci&oacute;n de Ntpdate</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ntp-config" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija en el men&uacute; el servidor m&aacute;s cercano
        al lugar donde est&aacute; la m&aacute;quina.  De este modo
	la sincronozaci&oacute;n ser&aacute; m&aacute;s precisa, puesto
	que un servidor m&aacute;s lejano puede padecer de conexiones
	con m&aacute;s latencia.</para>

      <para>La siguiente opci&oacute;n es <acronym>PCNFSD</acronym>.  
	Esta opci&oacute;n instalar&aacute; el &laquo;package&raquo;
	<filename role="package">net/pcnfsd</filename> desde la colecci&oacute;n
	de Ports.  Es una aplicaci&oacute;n muy &uacute;til que da
	servicios de autentificaci&oacute;n <acronym>NFS</acronym> a
	sistemas que son incapaces de tenerlos por s&iacute; mismos,
	como por ejemplo el sistema operativo &ms-dos; de
	Microsoft.</para>

      <para>Si usa las flechas podr&aacute; ver m&aacute;s
	opciones:</para>

      <figure id="Network-configuration-cont">
	<title>Segundo nivel de configuraci&oacute;n de red</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Las aplicaciones &man.rpcbind.8;, &man.rpc.statd.8; y
	&man.rpc.lockd.8; utilities se utilizan en las llamadas de
	procesos remotos (<acronym>RPC</acronym>).  
	<command>rpcbind</command> gestiona la comunicaci&oacute;n
	entre servidores y clientes  <acronym>NFS</acronym>; los
	servidores <acronym>NFS</acronym> lo necesitan para poder
	funcionar correctamente.  El d&aelig;mon <application>rpc.statd</application>
	se comunica con el d&aelig;mon <application>rpc.statd</application>
	de otras m&aacute;quinas para facilitar seguimiento de estado.  La
	informaci&oacute;n de estado se deposita por omisi&oacute;n en
	<filename>/var/db/statd.status</filename>.  La siguiente opci&oacute;n
	que vemos es <guimenuitem>rpc.lockd</guimenuitem>; si se selecciona
        facilita servicios de bloqueo de ficheros.  Se suele usar conjuntamente
	con <application>rpc.statd</application> para monitorizar qu&eacute;
	m&aacute;quina pide bloqueos y con qu&eacute; frecuencia.  
	Si bien es cierto que estas dos &uacute;timas opciones son
	fant&aacute;sticas para depuraci&oacute;n, tambi&eacute;n lo es
	que no son necesarias para que clientes y servidores
	<acronym>NFS</acronym> funcionen correctamente.</para>

      <para>El siguiente elemento de la lista es
	<guimenuitem>Routed</guimenuitem>, un d&aelig;mon de encaminamiento.  
	&man.routed.8; gestiona tablas de rutas, encuentra
	&laquo;routers&raquo; multicast y, bajo petici&oacute;n, facilita
	una copia de la tabla de rutas a cualquier m&aacute;quina conectada
	f&iacute;sicamente a la red.  Suele usarse principalmente en
	m&aacute;quinas que hacen funciones de pasarela de una red
	local.  Si la selecciona ver&aacute; un men&uacute; en el que se
	le requerir&aacute; que indique la ubicaci&oacute;n de la
	aplicaci&oacute;n.  Por omisi&oacute;n ya est&aacute;
	configurada, as&iacute; que basta que la confirme pulsando
	<keycap>Intro</keycap> key.  Se le presentar&aacute; un men&uacute;
	m&aacute;s, pidiendole esta vez par&aacute;metros que quiera
	proporcionarle a <application>routed</application>.  Por omisi&oacute;n
	<option>-q</option> estar&aacute; ya dispuesto y deber&iacute;a
	aparecer as&iacute; en pantalla.</para>

      <para>La siguiente opci&oacute;n que aparece es 
        <guimenuitem>Rwhod</guimenuitem>; si la selecciona arrancar&aacute;
	el d&aelig;mon &man.rwhod.8; durante el arranque del sistema.  
	La aplicaci&oacute;n <command>rwhod</command> env&iacute;a mensajes
	del sistema (en broadcast) peri&oacute;dicamente a trav&eacute;s
	de la red, o si est&aacute; en modo &laquo;consumer&raquo; los
	va recogiendo.  Tiene m&aacute;s informaci&oacute;n en las
	p&aacute;ginas de manual de &man.ruptime.1; y &man.rwho.1;.</para>

      <para>La siguiente opci&oacute;n del men&uacute; est&aacute;
        relacionada con el d&aelig;mon &man.sshd.8;.  Se trata del
	servidor de shell segura de
	<application>OpenSSH</application> y le recomendamos encarecidamente
	su uso en lugar de los servidores <application>telnet</application>
	y <acronym>FTP</acronym>.  El servidor <application>sshd</application>
	se usa para crear una conexi&oacute;n segura de una m&aacute;quina a
	otra mediante conexiones cifradas.</para>

      <para>La &uacute;ltima opci&oacute;n es 
        <guimenuitem>TCP Extensions</guimenuitem>, que activa
	las extensiones <acronym>TCP</acronym> definidas en las
	<acronym>RFC</acronym>&nbsp;1323 y 
	<acronym>RFC</acronym>&nbsp;1644.  En algunas m&aacute;quinas puede
	acelerar conexiones, pero tambi&eacute;n puede haber conexiones que
	se pierdan.  No se recomienda su uso en servidores, pero puede ser
	de utilidad en m&aacute;quinas aisladas.</para>

      <para>Una vez configurados los servicios de red, vaya al principio del
        men&uacute; ( <guimenuitem>X Exit</guimenuitem>)a o vuelva a

	<application>sysinstall</application> seleccionando dos veces
	<guimenuitem>X Exit</guimenuitem> y despu&eacute;s <guibutton>[X
	Exit Install]</guibutton>.</para>

    </sect2>

    <sect2 id="freebsdboot">
      <title>El arranque de &os;</title>

      <sect3 id="freebsdboot-i386">
        <title>El arranque de &os;/&arch.i386;</title>

      <para>Si todo ha ido bien deber&iacute;a ver una pantalla de
        mensajes pasando frente a usted hasta que llegue a lo que
	llamamos un &laquo;login prompt&raquo;.  Puede volver a ver
	los mensajes del arranque pulsando <keycap>Bloq Deslp</keycap>
	y usando <keycap>ReP&aacute;g</keycap> y <keycap>AvP&aacute;g</keycap>.
	Pulsando <keycap>Bloq Despl</keycap> otra vez volver&aacute; al
	prompt.</para>

      <para>El mensaje del arranque no puede mostrarse completo debido
        a las limitaciones del b&uacute;fer, pero puede consultarse desde
	la shell mediante
	<command>dmesg</command>.</para>

      <para>Entre al sistema utilizando un nombre de usuario y
        contrase&ntilde;a que haya creado durante la instalaci&oacute;n
	(en nuestro ejemplo <username>rpratt</username>).  Evite entrar al
	sistema como <username>root</username> salvo en los casos en los que
	sea estrictamente necesario.</para>

      <para>Este es un t&iacute;pico mensaje de arranque (se ha eliminado
        la informaci&oacute;n de la versi&oacute;n):</para>

<screen>Copyright (c) 1992-2002 The FreeBSD Project. 
Copyright (c) 1979, 1980, 1983, 1986, 1988, 1989, 1991, 1992, 1993, 1994
        The Regents of the University of California. All rights reserved. 

Timecounter "i8254"  frequency 1193182 Hz
CPU: AMD-K6(tm) 3D processor (300.68-MHz 586-class CPU)
  Origin = "AuthenticAMD"  Id = 0x580  Stepping = 0
  Features=0x8001bf&lt;FPU,VME,DE,PSE,TSC,MSR,MCE,CX8,MMX&gt; 
  AMD Features=0x80000800&lt;SYSCALL,3DNow!&gt; 
real memory  = 268435456 (262144K bytes) 
config&gt; di sn0 
config&gt; di lnc0 
config&gt; di le0 
config&gt; di ie0 
config&gt; di fe0 
config&gt; di cs0 
config&gt; di bt0  
config&gt; di aic0 
config&gt; di aha0 
config&gt; di adv0 
config&gt; q 
avail memory = 256311296 (250304K bytes)
Preloaded elf kernel "kernel" at 0xc0491000. 
Preloaded userconfig_script "/boot/kernel.conf" at 0xc049109c. 
md0: Malloc disk 
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard 
npx0: INT 16 interface 
pcib0: &lt;Host to PCI bridge&gt; on motherboard 
pci0: &lt;PCI bus&gt; on pcib0 
pcib1: &lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0 
pci1: &lt;PCI bus&gt; on pcib1 
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11 
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0 
isa0: &lt;ISA bus&gt; on isab0 
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0 
ata0: at 0x1f0 irq 14 on atapci0 
ata1: at 0x170 irq 15 on atapci0 
uhci0: &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci0 
usb0: &lt;VIA 83C572 USB controller&gt; on uhci0 
usb0: USB revision 1.0 
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr 1 
uhub0: 2 ports with 2 removable, self powered 
chip1: &lt;VIA 82C586B ACPI interface&gt; at device 7.3 on pci0 
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xe800-0xe81f irq 9 at
device 10.0 on pci0 
ed0: address 52:54:05:de:73:1b, type NE2000 (16 bit) 
isa0: too many dependant configs (8) 
isa0: unexpected small tag 14 
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq 2 on isa0
fdc0: FIFO enabled, 8 bytes threshold 
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0 
atkbdc0: &lt;keyboard controller (i8042)&gt; at port 0x60-0x64 on isa0 
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq 1 on atkbdc0 
kbd0 at atkbd0 
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0 
psm0: model Generic PS/2 mouse, device ID 0 
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x1 on isa0 
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt; 
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0 
sio0: type 16550A 
sio1 at port 0x2f8-0x2ff irq 3 on isa0 
sio1: type 16550A 
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0 
ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode 
ppc0: FIFO with 16/16/15 bytes threshold 
ppbus0: IEEE1284 device found /NIBBLE
Probing for PnP devices on ppbus0: 
plip0: &lt;PLIP network interface&gt; on ppbus0 
lpt0: &lt;Printer&gt; on ppbus0 
lpt0: Interrupt-driven port 
ppi0: &lt;Parallel I/O&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master using UDMA33 
ad2: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata1-master using UDMA33 
acd0: CDROM &lt;DELTA OTC-H101/ST3 F/W by OIPD&gt; at ata0-slave using PIO4 
Mounting root from ufs:/dev/ad0s1a 
swapon: adding /dev/ad0s1b as swap device 
Automatic boot in progress... 
/dev/ad0s1a: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1a: clean, 48752 free (552 frags, 6025 blocks, 0.9% fragmentation)
/dev/ad0s1f: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1f: clean, 128997 free (21 frags, 16122 blocks, 0.0% fragmentation)
/dev/ad0s1g: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1g: clean, 3036299 free (43175 frags, 374073 blocks, 1.3% fragmentation)
/dev/ad0s1e: filesystem CLEAN; SKIPPING CHECKS 
/dev/ad0s1e: clean, 128193 free (17 frags, 16022 blocks, 0.0% fragmentation)
Doing initial network setup: hostname. 
ed0: flags=8843&lt;UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> mtu 1500
        inet 192.168.0.1 netmask 0xffffff00 broadcast 192.168.0.255
        inet6 fe80::5054::5ff::fede:731b%ed0 prefixlen 64 tentative scopeid 0x1
        ether 52:54:05:de:73:1b
lo0: flags=8049&lt;UP,LOOPBACK,RUNNING,MULTICAST&gt; mtu 16384 
        inet6 fe80::1%lo0 prefixlen 64 scopeid 0x8 
        inet6 ::1 prefixlen 128 
        inet 127.0.0.1 netmask 0xff000000 
Additional routing options: IP gateway=YES TCP keepalive=YES
routing daemons:. 
additional daemons: syslogd. 
Doing additional network setup:. 
Starting final network daemons: creating ssh RSA host key 
Generating public/private rsa1 key pair.
Your identification has been saved in /etc/ssh/ssh_host_key. 
Your public key has been saved in /etc/ssh/ssh_host_key.pub. 
The key fingerprint is: 
cd:76:89:16:69:0e:d0:6e:f8:66:d0:07:26:3c:7e:2d root@k6-2.example.com
 creating ssh DSA host key 
Generating public/private dsa key pair.
Your identification has been saved in /etc/ssh/ssh_host_dsa_key. 
Your public key has been saved in /etc/ssh/ssh_host_dsa_key.pub. 
The key fingerprint is: 
f9:a1:a9:47:c4:ad:f9:8d:52:b8:b8:ff:8c:ad:2d:e6 root@k6-2.example.com.
setting ELF ldconfig path: /usr/lib /usr/lib/compat /usr/X11R6/lib
/usr/local/lib 
a.out ldconfig path: /usr/lib/aout /usr/lib/compat/aout /usr/X11R6/lib/aout 
starting standard daemons: inetd cron sshd usbd sendmail.
Initial rc.i386 initialization:. 
rc.i386 configuring syscons: blank_time screensaver moused. 
Additional ABI support: linux. 
Local package initialization:. 
Additional TCP options:. 

FreeBSD/i386 (k6-2.example.com) (ttyv0)

login: rpratt 
Password:</screen>

      <para>La generaci&oacute;n de claves RSA y DSA puede llevar su
        tiempo en m&aacute;quinas lentas.  Esto solamente sucede en el
	primer arranque despu&eacute;s de la instalaci&oacute;n.  Los
	dem&aacute;s arranques ser&aacute;n m&aacute;s r&aacute;pidos.</para>

      <para>Si ya hay un servidor X configurado y ha elegido un escritorio
         por omisi&oacute;n puede arrancarlo tecleando
	<command>startx</command> en la shell.</para>

      </sect3>

      <sect3>
        <title>El arranque de &os;/&arch.alpha;</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Una vez acabado el proceso de instalaci&oacute;n
	  podr&aacute; arrancar &os; tecleando algo muy parecido
	  a esto en el prompt de SRM:</para>
        <para>Once the install procedure has finished, you will be
          able to start FreeBSD by typing something like this to the
          SRM prompt:</para>

	<screen>&gt;&gt;&gt;<userinput>BOOT DKC0</userinput></screen>
<para>Esto hace que el firmware arranque desde el disco especificado.  Para que &os; arranque autom&aacute;ticamente de ah&iacute; en adelante utilice lo siguiente:</para> 
	<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_OSFLAGS A</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_FILE ''</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOTDEF_DEV DKC0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET AUTO_ACTION BOOT</userinput></screen>

	<para>Los mensajes de arranque ser&aacute;n muy similares (aunque
	 no iguales) a los que aparecen durante el arranque de &os;
	en &i386;.</para>
      </sect3>
    </sect2>

    <sect2 id="shutdown">
      <title>El apagado de &os;</title>

      <para>Es importante apagar correctamente el sistema operativo.  No
        basta con darle al interruptor.  Lo primero que debe hacer
	es convertirse en superusuario tecleando en la shell
	<command>su</command> e introduciendo la contrase&ntilde;a de
	<username>root</username>.  Tenga en cuenta que esto funcionar&aacute;
	solamente si el usuario es miembro del grupo
	<groupname>wheel</groupname>.  Si no lo es siempre puede
	acceder al sistema como <username>root</username> y utilizar
	<command>shutdown -h now</command>.</para>

      <screen>The operating system has halted. 
Please press any key to reboot.</screen>

      <para>Una vez que vea el mensaje de &laquo;<emphasis>Please press any
        key to reboot</emphasis> &raquo; puede apagar la m&aacute;quina.  
	Si pulsa cualquier tecla en lugar de apagar la m&aacute;quina
	el sistema reiniciar&aacute;.</para>

      <para>Tambi&eacute;n puede usar la combinaci&oacute;n de teclas
        <keycombo action="simul">
	  <keycap>Ctrl</keycap>
	  <keycap>Alt</keycap>
	  <keycap>Supr</keycap>
	</keycombo>
	para reiniciar el sistema, aunque no le recomendamos que lo haga
	durante el funcionamiento normal del sistema.</para>

    </sect2>
  </sect1>

  <sect1 id="install-trouble">
    <title>Soluci&oacute;n de problemas</title>

    <indexterm>
      <primary>installation</primary>
      <secondary>troubleshooting</secondary>
    </indexterm>


    <para>Esta secci&oacute;n trata sobre la soluci&oacute;n de problemas
      habituales durante la instalaci&oacute;n que la comunidad de usuarios
      ha documentado.  Hay tambi&eacute;n unas cuantas preguntas y respuestas
      para quienes quieren poder elegir en el arranque entre &os; y
      &ms-dos;.</para>

    <sect2>
      <title>Qu&eacute; hacer si algo va mal</title>

      <para>A causa de las diversas limitaciones de la arquitectura PC es
	imposible hacer que nada funcione con un 100% de probabilidades, pero
	al menos hay unas cuantas cosas que pueden hacerse si algo
	va mal.</para>

      <para>Consulte la <ulink
        url="http://www.FreeBSD.org/releases/index.html">lista de hardware
	soportado</ulink> de su versi&oacute;n de &os; y aseg&uacute;rese de
	que su hardware deber&iacute;a funcionar con ella.</para>

      <para>Si su hardware est&aacute; soportado y sigue experimentando
	&laquo;cuelgues&raquo; u otro tipo de problemas tendr&aacute; que
	<link linkend="kernelconfig">compilar un kernel personalizado</link>.
	Esto le permitir&aacute; disponer de soporte que no est&aacute;
	incluido en el kernel <filename>GENERIC</filename>.  El kernel
	que se incluye en los discos de arranque est&aacute; configurado
	asumiendo que la mayor&iacute;a de los dispositivos
	van a funcionar con la configuraci&oacute;n por omisi&oacute;n
	de f&aacute;brica (en t&eacute;rminos de IRQ, direcciones IO y
	canales DMA).  Si su hardware ha sido reconfigurado quiz&aacute;s
	tendr&aacute; que usar el editor de configuraci&oacute;n para
	decirle a &os; d&oacute;nde encontrar cada cosa.</para>

      <para>Es posible tambi&eacute;n que la prueba de un dispositivo que
	no est&aacute; en el sistema cause problemas m&aacute;s tarde al probar
	un dispositivo que s&iacute; est&aacute; en la m&aacute;quina.  
	Si ese puede ser su caso desactive las pruebas de controladores
	conflictivos.</para>


      <note>
        <para>Algunos problemas de instalaci&oacute;n pueden evitarse o
	  al menos aliviarse actualizando el firmware de ciertos tipos de
	  hardware; esto es especialmente cierto en el caso de las placas
	  El firmware de las placas base se llama tambi&eacute;n
	  <acronym>BIOS</acronym> y la mayor&iacute;a de las placas base
	  y de los fabricantes de computadoras tienen un sitio web en el
	  que suelen encontrarse actualizaciones e informaci&oacute;n sobre
	  su uso.</para>

	<para>La mayor&iacute;a de los fabricantes recomienda que no se
	  actualice la <acronym>BIOS</acronym> de la placa base a menos que
	  tenga una buena raz&oacute;n para hacerlo, por ejemplo una 
	  actualizaci&oacute;n cr&iacute;tica.  El proceso de
	  actualizaci&oacute;n <emphasis>podr&iacute;a</emphasis> fallar,
          lo que puede acarrrear da&ntilde;os en el chip de la
	  <acronym>BIOS</acronym>.</para>
        </note>

    </sect2>
    
    <sect2>
      <title>Uso de sistemas de ficheros de &ms-dos; y &windows;</title>

      
      <para>No puede usar sistemas de ficheros comprimidos con
	<application>Double Space&trade;</application>.  Deber&aacute; por
	lo tanto descomprimir el sistema de ficheros antes de acceder a los
	datos desde &os;.  
	Ejecute el <application>Agente de compresi&oacute;n</application>
	desde <guimenuitem>Inicio</guimenuitem>&gt;
	<guimenuitem>Programas</guimenuitem> &gt;
	<guimenuitem>Herramientas del sistema</guimenuitem>.</para>


      <para>&os; puede usar sistemas de ficheros &ms-dos;.  
	&man.mount.msdos.8; inserta estos sistemas de ficheros en la
	jerarqu&iacute;a de directorios del sistema, haciendo posible
	el acceso a los datos.  &man.mount.msdos.8; no suele usarse
	directamente; el sistema lo utiliza debido a alguna entrada
	en <filename>/etc/fstab</filename> o porque &man.mount.8; lo
	invoque debido a que se le hayan dado los par&aacute;metros
	adecuados para ello.</para>

      <para>Veamos una de esas entradas en el fichero
      <filename>/etc/fstab</filename>:</para>


       <programlisting>/dev/ad0sN  /dos  msdosfs rw  0	0</programlisting>

        
      <para>El directorio <filename>/dos</filename> debe existir previamente
        o no funcionar&aacute;.  Tiene todos los detalles del formato correcto
	de las entradas en <filename>/etc/fstab</filename> en
	&man.fstab.5;.</para>


      <para>Veamos ahora un ejemplo de llamada de &man.mount.8; a un sistema
        de ficheros &ms-dos;:</para>

      <screen>&prompt.root; <userinput>mount_msdos /dev/ad0s1 /mnt</userinput></screen>

      <para>En el ejemplo el sistema de ficheros &ms-dos; est&aacute; en la
	primera partici&oacute;n del primer disco duro.  
	La situaci&oacute;n en su sistema puede ser diferente: compruebe la
	salida de <command>dmesg</command> y <command>mount</command>.  
	Deber&iacute;an darle suficiente informaci&oacute;n como para
	darle una idea completa de la estructura de particiones en la que
	est&aacute; trabajando.</para>

      <note><para>&os; suele numerar las las &laquo;slices&raquo; (que es como
        decir los sistemas de ficheros &ms-dos;) de un modo distinto al de
        otros sistemas operativos.  M&aacute;s concretamente, las particiones
	extendidas de &ms-dos; suelen tener un n&uacute;mero mayor de
	&laquo;slice&raquo; que las particiones primarias de &ms-dos;.  
	&man.fdisk.8; le ser&aacute; de ayuda a la hora de determinar 
	qu&eacute; &laquo;slices&raquo; pertenecen a &os; y cu&aacute;les
	a otros sistemas operativos.</para></note>
	
      <para>Las particiones NTFS se montan de una forma muy similar gracias a
	&man.mount.ntfs.8;.</para>
    </sect2>

    <sect2>
      <title>Preguntas y respuestas de la resoluci&oacute;n de problemas</title>

      <qandaset>
	<qandaentry>
	  <question>
	    <para>Mi sistema se &laquo;cuelga&raquo; durante el arranque,
	      o se comporta de modo extra&ntilde;o durante la instalaci&oacute;n,
	      o no llega a comprobar el funcionamiento del lector de
	      disquetes.</para>
	  </question>
	  <answer>
	    <para>&os; utiliza profusamente el servicio ACPI del sistema en las
	      plataformas i386, amd64 e ia64 con el fin de ayudar en
	      la configuraci&oacute;n del sistema durante la detecci&oacute;n
	      de hardware durante el arranque.  Por desgracia todav&iacute;a
	      hay errores tanto en el controlador ACPI como en algunas BIOS y
	      placas base.  Puede desactivar ACPI en la tercera fase del cargador
	      de arranque del sistema haciendo que
	      <literal>hint.acpi.0.disabled</literal> tenga el siguiente
	      valor:</para>

	    <screen><userinput>set hint.acpi.0.disabled="1"</userinput></screen>

	    <para>Tenga en cuenta que tendr&iacute;a que volver a hacerlo cada vez que
	      el sistema arranque, as&iacute; que a&ntilde;ada
	      <literal>hint.acpi.0.disabled="1"</literal> al fichero
	      <filename>/boot/loader.conf</filename>.  Tiene m&aacute;s
	      informaci&oacute;n sobre el cargador de arranque en
	      <xref linkend="boot-synopsis">.</para>
	  </answer>
	</qandaentry>
	<qandaentry>
	  <question>
	    <para>Cuando voy a arrancar &os; por primera vez despu&eacute;s
	      de la instalaci&oacute;n el kernel carga y prueba mi hardware,
	      pero se detiene y muestra mensajes como este:</para>

	    <screen>changing root device to ad1s1a panic: cannot mount root</screen>

	    <para>&iquest;Cu&aacute;l es el problema?</para>

	    <para>&iquest;Qu&eacute; es lo que significa este mensaje de 
	      <literal>bios_drive:interface(unit,partition)kernel_name</literal>
	      que aparece  en la ayuda del arranque?</para>
	  </question>
	  <answer>
	    <para>Hay un problema que ya lleva tiempo con nosotros
	      cuando el disco desde el que se arranca no es el primero
	      en el sistema.  La BIOS utiliza un esquema de numeraci&oacute;n
	      distinto al que usa &os; y a veces saber qu&eacute;
	      n&uacute;mero es el que corresponde a qu&eacute; resulta
	      un poco complicado.</para>

	    <para>Cuando el disco de arranque no sea el primer disco
	      del sistema &os; necesitar&aacute; un poco de ayuda para
	      poderlo encontrar.  Puede haber dos escenarios donde
	      suceda esto y en ambos hay que decirle a &os, d&oacute;nde
	      encontrar el sistema de ficheros ra&iacute;z.  Esto se
	      hace especificando el n&uacute;mero de disco seg&uacute;n
	      la BIOS, el tipo de disco y el n&uacute;mero de disco
	      que &os; le dar&aacute; a ese disco.</para>

	    <para>El primer caso es cuando hay dos discos IDE, ambos
	      configurados como maestros de sus respectivos buses IDE
	      y quiere usted arrancar desde el segundo disco.  La BIOS
	      dice que son el disco 0 y el disco 1, mientras que &os;
	      los ve como
	      <devicename>ad0</devicename> y
	      <devicename>ad2</devicename>.</para>

	    <para>&os; est&aacute; en el disco BIOS 1, de tipo
	      <literal>ad</literal> y el n&uacute;mero de disco &os; es
	      el 2, as&iacute; que habr&aacute; que decir lo
	      siguiente:</para>

	    <screen><userinput>1:ad(2,a)kernel</userinput></screen>

	    <para>Tenga en cuenta que si tiene un disco esclavo en
	      el bus primario esto no es necesario (de hecho es
	      un error hacerlo).</para>

	    <para>El segundo escenario es el arranque desde un disco
	      SCSI teniendo uno o m&aacute;s discos IDE en el sistema.  
	      En este caso el n&uacute;mero de disco &os; es m&aacute;s
	      bajo que el n&uacute;mero de disco BIOS.  Si tiene dos
	      discos IDE adem&aacute;s del disco SCSI, el disco SCSI
	      es el disco 2 de BIOS, del tipo
	      <literal>da</literal> y para &os; es el disco n&uacute;mero
	      disk number 0, so
	      0, as&iacute; que tendr&aacute; que usar</para>

	    <screen><userinput>2:da(0,a)kernel</userinput></screen>

	    <para>para decirle a &os; que quiere arrancar desde el
	      disco 2 de BIOS, que es el primer disco SCSI del sistema.  
	      Si solamente tiene un disco IDE tendr&aacute; que poner
	      <literal>1:</literal>.</para>

	    <para>Una vez que sabe con exactitud los valores que debe
	      usar p&oacute;ngalos exactamente como los ha tecleado
	      en <filename>/boot.config</filename> utilizando el
	      editor de texto que prefiera.  Salvo que se le diga lo
	      contrario &os; utilizar&aacute; el contenido de este
	      fichero decidir&aacute;el comportamiento por omisi&oacute;n
	      del prompt de <literal>boot:</literal> prompt.</para>
	  </answer>
	</qandaentry>
	<qandaentry>
	  <question>
	    <para>Cuando voy a arrancar desde disco duro por primera
	      vez tras la instalaci&oacute;n de &os; el prompt del gestor
	      de arranque muestra <literal>F?</literal> en el men&uacute;
	      de arranque y no pasa de ah&iacute;.</para>
	  </question>
	  <answer>
	    <para>La geometr&iacute;a del disco duro se configur&oacute;
	      mal cuando se utiliz&oacute; el editor de particiones
	      durante la instalaci&oacute;n.  Ejecute el editor de
	      particiones e introduzca la geometr&iacute;a del disco
	      correctamente.  Tendr&aacute; que reinstalar &os;
	      completamente dado que habr&aacute; cambiado la
	      geometr&iacute;a del disco.</para>

	    <para>Si no encuentra la manera de saber cu&aacute;l es
	      la geometr&iacute;a correcta pruebe con esto:
	      Cree una peque&ntilde;a partici&oacute;n DOS al principio
	      del disco e instale &os; en el espacio de disco inmediatamente
	      contiguo.  El programa de instalaci&oacute;n ver&aacute; la
	      partici&oacute;n DOS e intentar&aacute; deducir la
	      geometr&iacute;a correcta a partir de ah&iacute;; esto suele
	      funcionar.</para>

	    <para>Le mostramos otra sugerencia que, aunque no es recomendable
	      de seguir, se muestra para que sirva de referencia:</para>

	    <blockquote>
	      <para>Si lo que est&aacute; instalando es un servidor
	        o m&aacute;quina de escritorio dedicado a &os; y
		no le preocupa que en el futuro cercano tenga que
		mantener la convivencia con DOS, Linux u otro
		sistema operativo siempre tiene la opci&oacute;n de
		utilizar el disco entero
		(la opci&oacute;n <guimenuitem>A</guimenuitem> en
		el editor de particiones).  Es una opci&oacute;n no
		est&aacute;ndar gracias a la cual  &os; ocupa todo
		el disco, desde el primer sector al &uacute;ltimo.  
		De este modo nos olvidamos de todos los problemas
		relacionados con la geometr&iacute;a de disco, pero
		le obliga a no poder instalar ning&uacute;n otro
		sistema operativo aparte de &os; en ese disco.</para>
	    </blockquote>
	  </answer>
	</qandaentry>
	<qandaentry>
	  <question>
	    <para>El sistema encuentra mi tarjeta de red &man.ed.4; pero
	      me dan errores de &laquo;timeout&raquo;.</para>
	  </question>
	  <answer>
	    <para>Lo m&aacute;s probable es que su tarjeta est&eacute;
	      utilizando una IRQ distinta de la que deber&iacute;a
	      estar usando seg&uacute;n lo que aparece en
	      <filename>/boot/device.hints</filename> .  El controlador
	      &man.ed.4; no utiliza configuraci&oacute;n
	      does not use the &laquo;soft&raquo; por omisi&oacute;n
	      (es decir, valores que se le suministren mediante EZSETUP
	      bajo DOS) pero como casi todo en esta vida hay
	      soluci&oacute;n.  En este caso, de hecho, hay dos.</para>

	    <para>Ponga el &laquo;jumper&raquo; de la tarjeta en
	      una configuraci&oacute;n &laquo;dura&raquo; (es posible
	      que tenga que modificar la configuraci&oacute;n del
	      kernel debido a esto) o modifique el valor de la IRQ
	      con el valor <literal>-1</literal> del siguiente modo:
	      by setting the hint <literal>hint.ed.0.irq="-1"</literal>.  
	      As&iacute; le dir&aacute; al kernel que utilice la
	      configuraci&oacute;n &laquo;suave&raquo;.</para>

	    <para>Hay otra posibilidad, que es cuando su tarjeta
	      est&eacute; utilizando la IRQ 9, que suele compartir
	      funciones con la IRQ 2, circunstancia que es con
	      frecuencia causa de problemas (sobre todo cuando entra
	      en escena una tarjeta VGA que utiliza justamente la
	      IRQ 2).  Le recomendamos encarecidamente que haga todo
	      lo posible para no utilizar ni la IRQ 2 ni la IRQ 9.</para>
	  </answer>
	</qandaentry>
      </qandaset>
    </sect2>
  </sect1>

  <sect1 id="install-advanced">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Valentino</firstname>
	  <surname>Vaschetto</surname>
	  <contrib>Escrito por </contrib>
	</author>
	<!-- May 2001 -->
      </authorgroup>
    </sect1info>

    <title>Gu&iacute;a avanzada de instalaci&oacute;n</title>

    <para>This section describes how to install FreeBSD in exceptional
       cases.</para>

    <sect2 id="headless-install">
      <title>Instalaci&oacute;n de &os; en un sistema sin monitor o 
	teclado</title>

      <indexterm>
        <primary>installation</primary>
        <secondary>headless (serial console)</secondary>
      </indexterm>
      <indexterm><primary>serial console</primary></indexterm>
      <para>Es posible instalar &os; en m&aacute;quinas que no
        tengan teclado ni siquiera monitor conectado.  De hecho
	no tienen por qu&eacute; tener ni salida VGA.  
	&iquest;C&oacute;mo es posible?, se preguntar&aacute;:
	Haciendolo todo a trav&eacute;s de una consola serie.  Una consola serie
	consiste b&aacute;sicamente en usar otro sistema como la pantalla y el
	teclado de una m&aacute;quina.  Siga las instrucciones de
	creaci&oacute;n de los disquetes que se detallan en la <xref
        linkend="install-floppies">.</para>

      <para>Tendr&aacute; que modificar esos disquetes para que arranquen
	en la consola serie; siga estas instrucciones:</para>


      <procedure>
	<step>


	  <title>Modificaci&oacute;n de los disquetes de arranque para que
	    permitan el arranque en la consola serie</title>
  	    <indexterm>
	      <primary><command>mount</command></primary>
	    </indexterm>
	    <para>Si arrancara con los disquetes que acaba de crear &os;
	      arrancar&iacute;a en el modo normal de instalaci&oacute;n.  Lo
	      que queremos es que &os; arranque en una consola serie,
	      as&iacute; que hemos de montar el disquete
	      <filename>kern.flp</filename> en un sistema &os; mediante
	      &man.mount.8;.</para>

            <screen>&prompt.root; <userinput>mount /dev/fd0 /mnt</userinput></screen>

	    <para>Una vez montado el disquete entre en el directorio 
	      <filename role="directory">/mnt</filename>&nbsp;:</para>

	    <screen>&prompt.root; <userinput>cd /mnt</userinput></screen>

	    <para>Aqu&iacute; es donde ense&ntilde;aremos al disquete a
	      arrancar en la consola serie.  Debe crearse un fichero llamado
	      <filename>boot.config</filename> que contenga lo siguiente:
	      <literal>/boot/loader -h</literal>.  Con esto le pasamos
	      cargador de arranque (el &laquo;bootloader&raquo;)
	      el par&aacute;metro necesario para que intente arrancar
	      en una consola serie.</para>

	    <screen>&prompt.root; <userinput>echo "/boot/loader -h" > boot.config</userinput></screen>

	    <para>Una vez configurado correctamente nuestro disquete lo
	      desmontamos con &man.umount.8;:</para>

            <screen>&prompt.root; <userinput>cd /</userinput>
&prompt.root; <userinput>umount /mnt</userinput></screen>

	    <para>Y podemos extraer el disquete de la unidad.</para>
	  </step>

	  <step>
	    <title>Conexi&oacute;n del cable modem</title>

  	    <indexterm><primary>null modem cable</primary></indexterm>
	    <para>Tiene que conectar un
	      <link linkend="term-cables-null">cable
	      m&oacute;dem  nulo</link> entre dos m&aacute;quinas.  
	      <emphasis>Un cable serie normal no funcionar&aacute;</emphasis>,
	      necesitar&aacute; un cable m&oacute;dem nulo porque tiene
	      cruzado alguno de los hilos.</para>
	  </step>

	  <step>
	    <title>Arranque de la instalaci&oacute;n</title>

            <para>Podemos iniciar la instalaci&oacute;n.  Introduzca el
	      disquete <filename>kern.flp</filename> en la unidad de disquetes
	      de la m&aacute;quina en la que quiere hacer la instalaci&oacute;n
	      y encienda la m&aacute;quina.</para>
	  </step>

	  <step>
	    <title>La conexi&oacute;n a su m&aacute;quina sin teclado
	      ni monitor</title>
	    <indexterm>
	      <primary><command>cu</command></primary>
	    </indexterm>
	    <para>Con&eacute;ctese usando &man.cu.1;:</para>

	    <screen>&prompt.root; <userinput>cu -l /dev/cuaa0</userinput></screen>
	  </step>
      </procedure>

      <para>&iquest;Ya est&aacute;! Desde este momento ya puede controlar su
        m&aacute;quina sin monitor ni teclado desde la sesi&oacute;n
	<command>cu</command> que acaba de abrir.  El sistema le pedir&aacute;
	que introduzca el disco <filename>kern1.flp</filename> y despu&eacute;s
	tendr&aacute; que elegir qu&eacute; tipo de terminal va a utilizar.  Elija
	la consola en color de &os; y buena suerte con la instalaci&oacute;n.</para>

    </sect2>
  </sect1>

  <sect1 id="install-diff-media">
    <title>C&oacute;mo preparar su propio medio de instalaci&oacute;n</title>

    <note>
      <para>&nbsp;Para evitar la repetici&oacute;n &laquo;disco &os;&raquo; 
	ser&aacute; en adelante un CDROM o un DVD de &os; que haya
	comprado o hecho por sus propios medios.</para>
    </note>

    <para>Es posible que tengaque crear su propio
      medio de instalaci&oacute;n de &os;.  Puede tratarse de un medio
      f&iacute;sico como una cinta o una fuente para que
      <application>sysinstall</application> pueda obtener los ficheros
      que vaya necesitando, como un sitio FTP local, o bien puede
      tratarse de una partici&oacute;n &ms-dos;.</para>

    <para>Por ejemplo:</para>


    
    <itemizedlist>
      <listitem>
        <para>Tiene muchas m&aacute;quinas conectadas a una red local y
	  un s&oacute;lo disco &os;.  Quiere crear un sitio FTP local
	  con el contenido del disco &os; y que desde &eacute;l sus
	  m&aacute;quinas obtengan los ficheros en lugar de tener que
	  conectarse a Internet.</para>
      </listitem>

      <listitem>
	<para>Tiene un disco &os; y &os; no reconoce su unidad CD/DVD pero
	  &ms-dos;/&windows; s&iacute;.  Quiere copiar los ficheros de
	  instalaci&oacute;n de &os; a una partici&oacute;n DOS en
	  mismo sistema y luego instalar &os; usando esos ficheros.</para>
      </listitem>

      <listitem>
	<para>El sistema en el que quiere instalar &os; no tiene
	  unidad CD/DVD ni tarjeta de red pero puede conectar un cable
	  paralelo o un cable serie &laquo;Laplink&raquo; a una computadora
	  que s&iacute; que tiene.</para>
      </listitem>

      <listitem>
	<para>Quiere crear una cinta desde la que se pueda instalar
	  &os;.</para>
      </listitem>
    </itemizedlist>

    <sect2 id="install-cdrom">
      <title>Creaci&oacute;n de un CDROM de instalaci&oacute;n</title>



      <para>Con cada &laquo;release&raquo; el Proyecto &os; libera dos
	im&aacute;genes de CDROM (&laquo;im&aacute;genes ISO&raquo;).  
	Dichas im&aacute;genes pueden copiarse a CD si dispone de una
	grabadora y usarse posteriormente para instalar &os;.  
	Si tiene una grabadora de CD y el ancho de banda no le supone un
	problema la forma m&aacute;s f&aacute;cil de instalar &os; es
	esta.</para>


      <procedure>
	<step>
	  <title>Descargar la imagen ISO correcta</title>

	  <para>Puede descargar las im&aacute;genes ISO de cada
	   &laquo;release&raquo; desde
	   <filename>ftp://ftp.FreeBSD.org/pub/FreeBSD/ISO-IMAGES-<replaceable>arquitectura</replaceable>/<replaceable>versi&oacute;n</replaceable></filename>
	    o desde la r&eacute;plica m&aacute;s pr&oacute;xima.  
	    Sustituya <replaceable>arquitectura</replaceable> y
	    <replaceable>versi&oacute;n</replaceable> por lo que
	    corresponda.</para>

	  <para>Ese directorio contendr&aacute; normalmente las siguientes
	    im&aacute;genes:</para>



	  <table frame="none">
	    <title>Nombres y funciones de las im&aacute;genes de &os;&nbsp;6.<replaceable>X</replaceable> and 7.<replaceable>X</replaceable></title>

	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Nombre</entry>

		  <entry>Contenido</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-RELEASE-<replaceable>arch</replaceable>-bootonly.iso</filename></entry>

		  <entry>Todo lo necesario para arrancar un kernel
		    de &os; y ejecutar la interfaz de instalaci&oacute;n.  
		    Los ficheros que vayan haciendo falta tendr&aacute;n
		    que irse descargando por FTP o por alg&uacute;n
		    otro medio.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-RELEASE-<replaceable>arch</replaceable>-disc1.iso</filename></entry>

		  <entry>Todo lo necesario para instalar A&os; y un
		    &laquo;live filesystem&raquo;, que le ser&aacute;
		    muy &uacute;til (conjuntamente con la aplicaci&oacute;n
		    &laquo;Repair&raquo; de
		    <application>sysinstall</application>.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-RELEASE-<replaceable>arch</replaceable>-disc2.iso</filename></entry>

		  <entry>Todas las aplicaciones que puedan caber en un
		    disco.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-RELEASE-<replaceable>arch</replaceable>-docs.iso</filename></entry>

		  <entry>La documentaci&oacute;N de &os;.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </table>

	  <para>Descargue la imagen ISO  de arranque (si existe para su
	    plataforma) o la imagen del disco uno.  
	    <emphasis>No</emphasis> descargue ambas, puesto que el disco 
	    uno contiene todo lo que hay en la imagen ISO de arranque.</para>

	  <para>Utilice la imagen ISO de arranque si su acceso a Internet es barato.  
	    Con ella podr&aacute; instalar &os; e instalar todo tipo de
	    software descarg&aacute;ndolo como paquetes/ports (consulte
	    el <xref linkend="ports">) cuando lo precise.</para>

	  <para>Utilice la imagen del disco uno si quiere disponer en el
	    propio disco de una selecci&oacute;n bastante completa
	    de software.</para> 

          <para>Si tiene acceso de alta velocidad a Internet las dem&aacute;s
	    im&aacute;genes de disco son &uacute;tiles pero no
	    esenciales.</para>
	</step>

	<step>
	  <title>Escribir los CD</title>

	  <para>Si va a grabar los CD en un sistema &os; consulte la
	    <xref linkend="creating-cds"> (en particular la
	    <xref linkend="burncd"> y la
	    <xref linkend="cdrecord">).</para>

          <para>Las im&aacute;genes se hacen en un formato ISO 
	    est&aacute;ndar; si va a grabarlas en cualquier otra plataforma 
	    no deber&iacute;a tener problemas para hacerlo cualquiera que sea 
	    la aplicaci&oacute;n que use para grabar CD.</para>
	</step>
      </procedure>

      <note><para>Si lo que quiere hacer es crear una &laquo;release&raquo;
        personalizada de &os; consulte el art&iacute;culo <ulink
        url="&url.articles.releng;">Release Engineering</ulink>.</para></note>

    </sect2>

    <sect2 id="install-ftp">
      <title>Creaci&oacute;n de un sitio FTP local a partir de un disco de
        instalaci&oacute;n de &os;</title>
	
      <indexterm>
	<primary>installation</primary>
	<secondary>network</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>



      <para>Los discos de &os; tienen la misma estructura que los sitios FTP.  
	Esa circunstancia le facilitar&aacute; mucho la tarea de crear un sitio
	FTP local para uso de otras m&aacute;quinas de su red durante la
	instalaci&oacute;n de &os;.</para>

      <procedure>
	<step>
	  <para>Monte el CDROM en el directorio <filename>/cdrom</filename>
	    del sistema que va a albergar el sitio FTP.</para>

	  <screen>&prompt.root; <userinput>mount /cdrom</userinput></screen>
	</step>

	<step>
	  <para>Cree una cuenta apta para FTP an&oacute;nimo en
	    <filename>/etc/passwd</filename> editando
	    <filename>/etc/passwd</filename> con &man.vipw.8;.  
	    A&ntilde;&aacute;dale lo siguiente:</para>

	  <programlisting>ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>
	</step>

	<step>
	  <para>Compruebe que el servicio FTP est&aacute; activado en
	    <filename>/etc/inetd.conf</filename>.</para>
	</step>
      </procedure>

      <para>Ahora cualquier m&aacute;quina capaz de conectarse a su
	sistema a trav&eacute;s de una red puede elegir como medio de
	instalaci&oacute;n &laquo;FTP&raquo; y escribir
	<userinput>ftp://<replaceable>su m&aacute;quina</replaceable></userinput>
	tras seleccionar &laquo;Other&raquo; en el men&uacute; de sitios
	FTP.</para>

      <warning>
	<para>&nbsp;Acabamos de exponer una buena soluci&oacute;n para usar
	  en un sistema de su propia red y que adem&aacute;s est&aacute;
	  protegido por un cortafuegos.  Si ofrece servicios FTP a
	  m&aacute;quinas de Internet (y no de su red local) expone su
	  sistema a caer bajo la atenci&oacute;n de &laquo;crackers&raquo;
	  y otras variedades de indeseable.  Le recomendamos encarecidamente
	  que siga a rajatabla pol&iacute;ticas sensatas de seguridad.</para>
      </warning>

    </sect2>

      <sect2>
        <title>Creaci&oacute;n de disquetes de instalaci&oacute;n</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>floppies</secondary>
      </indexterm>



      <para>Si quiere instalar &os; desde disquetes (cosa que, de
	antemano, le sugerimos que <emphasis>no</emphasis> haga) bien
	sea porque &os; no soporta cierto componente necesario de su
	sistema o sencillamente porque insiste en querer hacer las cosas
	de la manera m&aacute;s dif&iacute;cil, tendr&aacute; que
	tener a mano unos cuantos disquetes.</para>

	<para>Como m&iacute;nimo necesitar&aacute; tantos disquetes de
	  1.44&nbsp;MB o 1.2&nbsp;MB como hagan falta para dar cabida a todos
	  los ficheros que hay en <filename>bin</filename>.   Recuerde la
	  entrada &laquo;binary distribution&raquo; (distribuci&oacute;n
	  binaria) durante la instalaci&oacute;n.  Si est&aacute; generando
	  los disquetes en DOS <emphasis>debe formatearlos</emphasis> con
	  <command>FORMAT</command> de &ms-dos;.  Si est&aacute; usando
	  &windows; puede usar el Explorador para formatear disquetes:
	  bot&oacute;n derecho del rat&oacute;n sobre la unidad
	  <devicename>A:</devicename> y elija &laquo;Formatear&raquo;.</para>

	<para>&nbsp;<emphasis>No</emphasis> conf&iacute;e en el preformateo
	  de f&aacute;brica de los disquetes.  Format&eacute;elos usted de
	  nuevo, s&oacute;lo para asegurarse.  La mayor&iacute;a de los
	  problemas de los que se ha informado se han debido a formateos
	  defectuosos, t&eacute;ngalo en cuenta.</para>

	<para>Si puede crear los disquetes en una m&aacute;quina &os; un
	  formateo sigue sin ser una mala idea, pero no necesitar&aacute;
	  crear un sistema de ficheros DOS en cada floppy.  Use
	  <command>disklabel</command> y <command>newfs</command>
	  para crear un sistema de ficheros UFS en los disquetes tal y como
	  se muestra aqu&iacute; (en un floppy de 1.44&nbsp;MB y 3.5")
	  :</para>

	<screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

	<note>
	  <para>&nbsp;Tendr&aacute; que usar <literal>fd0.1200</literal> y
	    <literal>floppy5</literal> si usa discos de 5.25" y
	    1.2&nbsp;MB.</para>
	</note>

	<para>Ahora puede montarlos y escribir en ellos igual que en cualquier
	  otro sistema de ficheros del sistema.</para>

	<para>Tras el formateo de los disquetes pasamos a llenarlos.  Los
	  ficheros necesarios para crear la distribuci&oacute;n se dividen en
	  partes de tama&ntilde;o regular de modo que cinco de ellas entren
	  en otros tantos disquetes de 1.44&nbsp;MB.  Empaquete tantos ficheros
	  como pueda en cada uno hasta que tenga todas las distribuciones
	  que necesita listas para pasar a los disquetes.
	  Cada distribuci&oacute;n
	  deber&iacute;a ir en un subdirectorio del floppy, por ejemplo
	  <filename>a:\bin\bin.aa</filename>,
	  <filename>a:\bin\bin.ab</filename>, etc.</para>

	<para>Una vez en el men&uacute; de selecci&oacute;n de medio de
	  instalaci&oacute;n elija <guimenuitem>Floppy</guimenuitem> y
	  siga las instrucciones.</para>
      </sect2>

      <sect2 id="install-msdos">
        <title>Instalaci&oacute;n desde una partici&oacute;n &ms-dos;</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>from MS-DOS</secondary>
	</indexterm>

	<para>Copie los ficheros de la distribuci&oacute;n en un directorio
	  llamado <filename>freebsd</filename> en el directorio ra&iacute;z
	  de la partici&oacute;n, por ejemplo <filename>c:\freebsd</filename>.  
	  La estructura de directorios del sitio FTP o el CDROM debe
	  reproducirse parcialmente en este directorio, as&iacute; que le
	  sugerimos que use <command>xcopy</command> si est&aacute;
	  copiando los datos desde un CD.  En el siguiente ejemplo vamos a
	  preparar una instalaci&oacute;n m&iacute;nima de &os;:</para>

	<screen><prompt>C:\&gt;</prompt> <userinput>md c:\freebsd</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\bin c:\freebsd\bin\ /s</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\manpages c:\freebsd\manpages\ /s</userinput></screen>

        <para>Se ha asumido que <devicename>C:</devicename> es donde tiene
	  espacio libre y <devicename>E:</devicename> es donde tiene montada
	  su unidad CDROM.</para>
	
	<para>Si no tiene unidad CDROM puede descargar la distribuci&oacute;n
	  desde <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/">ftp.FreeBSD.org</ulink>.  
	  Cada distribuci&oacute;n dispone de su propio directorio; por
	  ejemplo, la distribuci&oacute;n <emphasis>base</emphasis> est&aacute;
	  en el directorio<ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/base/">&rel.current;/base/</ulink>.</para>

	<para>La &uacute;nica distribuci&oacute;n
	  <emphasis>imprescindible</emphasis> es <literal>BIN</literal>.  
	  Guarde esta y todas las distribuciones que quiera instalar desde
	  una partici&oacute;n &ms-dos; bajo
	  <filename>c:\freebsd</filename>.</para>

      </sect2>

      <sect2>
        <title>Creaci&oacute;n de una cinta de instalaci&oacute;n</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>from QIC/SCSI Tape</secondary>
	</indexterm>

	<para>La instalaci&oacute;n desde cinta es probablemente el
	  m&eacute;todo m&aacute;s f&aacute;cil, casi tanto como una
	  instalaci&oacute;n desde una r&eacute;plica FTP o desde un
	  CDROM.  Lo &uacute;nico que el programa de instalaci&oacute;n
	  necesita es que los  ficheros est&eacute;n empaquetados con
	  <application>tar</application> y en una cinta.  Veamos
	  un ejemplo:</para>

	<screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>

	<para>Cuando est&eacute; preparando la instalaci&oacute;n tenga
	  la precauci&oacute;n de dejar sitio suficiente en alg&uacute;n
	  directorio temporal (accesible en ese momento) para dejar
	  <emphasis>todos los ficheros</emphasis> que hubiera en la
	  cinta de instalaci&oacute;n.  A causa del acceso secuencial propio
	  del dise&ntilde;o de las cintas este m&eacute;todo de
	  instalaci&oacute;n requiere un poco de almacenamiento
	  temporal.</para>

	<note>
	  <para>&nbsp;Recuerde que antes de arrancar desde el disquete de
	    arranque la cinta <emphasis>debe estar en la unidad</emphasis>.  
	    La prueba de hardware de la instalaci&oacute;n no
	    encontrar&iacute;a la cinta.</para> 
	</note>
      </sect2>

      <sect2>
        <title>Before Installing over a Network</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>serial (SLIP or PPP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>parallel (PLIP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>Ethernet</tertiary>
	</indexterm>

	<para>Hay tres tipos de instalaci&oacute;n a trav&eacute;s de
	  una red disponibles en &os;: Puerto serie (SLIP o PPP), puerto
	  paralelo (PLIP (cable &laquo;laplink&raquo;)) y Ethernet.</para>

	<para>El adaptador Ethernet es, debido a su velocidad de transferencia,
	  la mejor elecci&oacute;n.  
	  &os; soporta la mayor&iacute;a de los adaptadores Ethernet.  Tiene
	  una lista de dispositivos soportados en las notas de hardware de
	  cada &laquo;release&raquo; de &os;.  Si disponde alguno de los
	  adaptadores Ethernet PCMCIA soportados por &os; recuerde que debe
	  estar presente en el sistema <emphasis>antes</emphasis> de que
	  el sistema arranque.  Por desgracia &os; no soporta a&uacute;n
	  la inserci&oacute;n en caliente de tarjetas PCMCIA durante la
	  instalaci&oacute;n.</para>

	<para>Tendr&aacute; que saber tambi&eacute;n la direcci&oacute;n
	  IP de la red, la m&aacute;scara de red correcta para la clase de
	  su red y el nombre de su m&aacute;quina.  Si va a instalar
	  mediante una conexi&oacute;n PPP y no tiene IP est&aacute;tica no
	  se preocupe, su ISP puede asignarle una IP temporal
	  din&aacute;micamente.  Su administrador de sistemas seguramente
	  puede ayudarle con la configuraci&oacute;n de su red.  Si va a
	  intentar conectarse con otras m&aacute;quinas mediante sus
	  nombres en lugar de sus direcciones IP necesitar&aacute; los
	  datos de un servidor de nombres y es posible que necesite
	  tambi&eacute;n la direcci&oacute;n de un &laquo;gateway&raquo;
	  (si usa PPP vale con la direcci&oacute;n IP de su proveedor).  
	  Si va a instalar por FTP a trav&eacute;s de un proxy HTTP
	  necesitar&aacute; la direcci&oacute;n del proxy.  
	  Si no sabe qu&eacute; pueden significar todas (o la mayor&iacute;a) 
	  de estas preguntas hable con su administrador de sistemas o con su 
	  ISP <emphasis>antes</emphasis> de intentar instalar &os; de esta
	  forma.</para>



	<sect3>
	  <title>Antes de instalar via NFS</title>

	  <indexterm>
	    <primary>installation</primary>
	    <secondary>network</secondary>
	    <tertiary>NFS</tertiary>
	  </indexterm>


	  <para>La instalaci&oacute;n por NFS es bastante sencilla.  
	    S&oacute;lo tendr&aacute; que copiar los ficheros de la
	    distribuci&oacute;n a un servidor NFS, seleccionar NFS como
	    medio de instalaci&oacute;n y apuntar a los contenidos a donde
	    los haya copiado.</para>

	  <para>si el servidor s&oacute;lo soporta
	    &laquo;puertos privilegiados&raquo; (que suele ser la
	    configuraci&oacute;n por omisi&oacute;n en estaciones de trabajo
	    Sun) tendr&aacute; que seleccionar la opci&oacute;n
	    <option>NFS Secure</option> en el men&uacute;
	    &laquo;Options&raquo; antes de comenzar con la
	    instalaci&oacute;n.</para>

	  <para>Si usa tarjeta Ethernet de mala calidad y est&aacute;
	    experimentando velocidades de transferencia muy bajas puede
	    probar con el par&aacute;metro <option>NFS Slow</option>.</para>

	  <para>Para que la instalaci&oacute;n via NFS funcione el servidor
	    debe permitir el montaje de subdirectorios.  Por ejemplo, si su
	    distribuci&oacute;n  FreeBSD&nbsp;&rel.current; est&aacute; en
	    <filename>ziggy:/usr/archive/stuff/FreeBSD</filename> el servidor
	    <hostid>ziggy</hostid> tendr&aacute; que permitir que pueda
	    montarse <filename>/usr/archive/stuff/FreeBSD</filename>, no
	    simplemente como <filename>/usr</filename> o
	    <filename>/usr/archive/stuff</filename>.</para>

	  <para>En el fichero <filename>/etc/exports</filename> de &os;
	    eso puede controlarse mediante la opci&oacute;n
	    <option>-alldirs</option>.  Puede que otros servidores NFS
	    requieran de par&aacute;metros diferentes.  Si ve mensajes
	    de <errorname>permission denied</errorname> seguramente no ha
	    activado esto correctamente.</para>

	</sect3>

      </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
