<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->


<chapter id="install">
  <title>Instalando FreeBSD</title>
      
  <para>As&iacute; que te gustar&iacute;a probar FreeBSD en tu m&aacute;quina?.
    Esta secci&oacute;n es una gu&iacute;a r&aacute;pida sobre lo que necesitas
    hacer. FreeBSD puede ser instalado desde una gran cantidad de soportes
    incluyendo CDROM, floppies, cintas magn&eacute;ticas, una partici&oacute;n
    MS-DOS y, si tienes conexion de red, v&iacute;a FTP an&oacute;nimo
    o NFS.</para>

  <para>Sea cual sea el soporte de instalaci&oacute;n que elijas, puedes
    empezar por crear <emphasis>los discos de instalaci&oacute;n</emphasis> 
    como se describe m&aacute;s abajo. Arranca tu ordenador con el instalador
    de FreeBSD, aunque no est&eacute;s pensando en realizar la 
    instalaci&oacute;n, y podr&aacute;s obtener gran cantidad de 
    informaci&oacute;n sobre la compatibilidad del hardware de tu ordenador y
    FreeBSD, adem&aacute;s de una descripci&oacute;n m&aacute;s exacta sobre
    las diferentes posibilidades de instalaci&oacute;n.</para>

  <para>Si tienes pensado hacer la instalaci&oacute;n v&iacute;a FTP, 
    s&oacute;lo necesitas el disco de arranque, ya que &eacute;l solo se
    encarga de gestionar todo lo referente a la conexi&oacute;n, ya sea
    ethernet o PPP.</para>

  <para>Para m&aacute;s informaci&oacute;n sobre c&oacute;mo obtener la
    &uacute;ltima distribuci&oacute;n de FreeBSD, por favor, mira la
    secci&oacute;n <link linkend="mirrors">Obteniendo FreeBSD</link> en el 
    Ap&eacute;ndice.</para>

  <para>Bi&eacute;n, para empezar a caminar, sigue los siguientes pasos:</para>

    <procedure>

      <step>
        <para>Revisa la secci&oacute;n 
          <link linkend="install-hw">configuraciones soportadas</link> de esta
          gu&iacute;a de instalaci&oacute;n para asegurarte de que tu
          hardware es soportado por FreeBSD. Ser&iacute;a de gran ayuda que
          hicieses una lista  de cualquier tarjeta especial que tengas
          instalada, como controladoras SCSI, tarjetas de red o tarjetas
          de sonido. Esta lista deber&iacute;a incluir par&aacute;matros
          relevantes de configuraci&oacute;n como interrupciones (IRQ) y
          direcciones de entrada/salida (IO ports).</para>
      </step>

      <step>
        <para>Si est&aacute;s instalando FreeBSD desde un CDROM tienes 
          diferentes opciones de instalaci&oacute;n:</para>
          <itemizedlist>
     
            <listitem>
              <para>Si el CD ha sido grabado con el soporte de arranque
                El Torito, y tu sistema soporta arranque directo desde
                CDROM (muchos sistemas antiguos <emphasis>no</emphasis>),
                simplemente inserta el CD en el lector y arranque directamente
                desde &eacute;l.</para>
            </listitem>

            <listitem>
              <para>Si est&aacute;s ejecutando DOS y tienes los drivers
                adecuados para acceder al lector de CDROM, ejecuta el 
                fichero install.bat incluido en el CD. Este intentar&aacute;
                arrancar la instalaci&oacute;n de FreeBSD desde DOS.</para>
 
              <note>
                <para>Debes hacer esto desde el DOS y no desde una
                  m&aacute;quina Windows.</para>
              </note>

              <para>Si quieres instalar FreeBSD desde una partici&oacute;n 
                DOS (por ejemplo, por que FreeBSD no soporta tu lector de
                CDROM), ejecuta primero el programa setup para copiar los
                ficheros adecuados del CD a la partici&oacute;n. A
                continuaci&oacute;n ejecuta el programa de instalaci&oacute;n.
              </para>
            </listitem>

            <listitem>
              <para>Si cualquiera de los dos m&eacute;todos anteriores
                funciona, puedes pasar por alto el resto de esta
                secci&oacute;n, en caso contrario, tu opci&oacute;n final es
                crear un disco de arranque con la im&aacute;gen 
                <filename>floppies\boot.flp</filename>. Salta al paso 4
                para instrucciones sobre como hacerlo.</para>
            </listitem>
          </itemizedlist>

        </step>

        <step>
          <para>Si no tienes una distribuci&oacute;n en CDROM, simplemente
            b&aacute;jate los <ulink
            URL="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/&rel.current;-RELEASE/floppies/boot.flp">discos de instalaci&oacute;n y arranque</ulink> a tu disco duro, 
            asegur&aacute;ndote de que tu navegador <emphasis>grabe</emphasis>
            el fichero en lugar de <emphasis>mostrarlo</emphasis>.</para>

          <note>
            <para>Estas im&aacute;genes solo se pueden usar con discos de
              1,44Mb.</para>
          </note>
        </step>

        <step>
          <para>Haz el disco de instalaci&oacute;n a partir del fichero 
            im&aacute;gen:</para>
            <itemizedlist>

              <listitem>
                <para>Si est&aacute;s usando MS-DOS o Windows b&aacute;jate el 
                programa <ulink
                URL="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/tools/fdimage.exe">fdimage.exe</ulink> o c&oacute;gelo de <filename>tools\fdimage.exe</filename> en el
                CDROM y ejec&uacute;talo de la siguiente manera:</para>

                  <informalexample>
                    <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage
floppies\boot.flp a:</userinput></screen>
                  </informalexample>
                <para>El programa <emphasis>fdimage</emphasis> 
                formatear&aacute; el disco <devicename>A:</devicename> y
                copiar&aacute; la im&aacute;gen <filename>boot.flp</filename>
                en &eacute:l (asumiendo que est&aacute;s en el nivel superior
                de la distribuci&oacute de FreeBSD y que las im&aacute;genes
                est&aacute;n en el subdirectorio <filename>floppies</filename>
                , tal y como suele ser habitual).</para>
            </listitem>

            <listitem>
              <para>Si est&aacute;s instalando un sistema UNIX para crear las
              im&aacute;genes de disco:</para>

              <informalexample>
                <screen>&prompt.root; <userinput>dd if=boot.flp of=<replaceable>disk_device</replaceable></userinput></screen>
              </informalexample>
              <para><replaceable>disk_device</replaceable> es el dispositivo
              <filename>/dev</filename> para la disquetera. En sistemas
              FreeBSD, &eacute;ste es <filename>/dev/rfd0</filename> para el
              disco <devicename>A:</devicename> y <filename>/dev/rfd1</filename>
              para el disco <devicename>B:</devicename>.</para>
            </listitem>

          </itemizedlist>
        </step>

        <step>

          <para>Con el disco de instalaci&oacute;n en el disco 
          <devicename>A:</devicename>, rearranca tu sistema. Deber&iacute;as
          obtener un prompt de arranque como este:</para>
            <informalexample>
              <screen>
&gt;&gt; FreeBSD BOOT ...
Usage: [[[0:][wd](0,a)]/kernel][-abcCdhrsv]
Use 1:sd(0,a)kernel to boot sd0 if it is BIOS drive 1
Use ? for file list or press Enter for defaults
Boot:
              </screen>
            </informalexample>
          <para>Si <emphasis>no</emphasis> tecleas nada, FreeBSD 
          arrancar&aacute; autom&aacute;ticamente con su configuraci&oacute;n
          por defecto, despu&eacute;s de una pausa de 5 segundos. Cuando
          FreeBSD arranca, comprueba tu ordenador para determinar el 
          hardware instalado. El resultado de estas comprobaciones es mostrado
          en la pantalla.</para>
        </step>

        <step>
          <para>Cuando el proceso de arranque finaliza, el men&uacute; 
            principal de instalaci&oacute;n de FreeBSD se muestra en 
            pantalla.</para>
        </step>

      </procedure>

    <para><emphasis>Si algo va mal...</emphasis></para>

    <para>Debido a limitaciones en la arquitectura de los PC's, es imposible
      para el programa de prueba de hardware ser 100 por 100 fiable. En el caso
      de que tu hardware sea identificado incorrectamente, o que el proceso 
      de prueba cuelgue la m&aacute;quina, primero mira la secci&oacute;n
      <link linkend="install-hw">configuraciones soportadas</link> en esta
      gu&iacute;a de instalaci&oacute;n para asegurar que tu hardware es
      soportado por FreeBSD.</para>

    <para>Si tu hardware est&aacute; soportado, resetea el ordenador y cuando 
      aparece el prompt <prompt>Boot:</prompt> teclea <literal>-c</literal>.
      Esto har&aacute; que FreeBSD entre en modo de configuraci&oacute;n de
      hardware. El kernel de FreeBSD en el disco de intalaci&oacute;n 
      est&aacute; configurado asumiendo que la mayor&iacute; de dispositivos
      hardware est&aacute;n configurados tal y como viene de f&aacute;brica en 
      lo referente a IRQ's, direcciones de memoria, canales DMA, etc. Si tu
      hardware ha sido reconfigurado, necesitar&aacute;s usar la opci&oacute;n
      <option>-c</option> en el arranque para indicarle a FreeBSD donde se
      encuentra cada cosa.</para>

    <para>Tambi&eacute;n es posible que la prueba de un dispositivo no 
      existente provoque una correcta detecci&oacute;n de un dispositivo que
      s&iacute; est&aacute; presente. En este caso, la prueba para este
      driver conflictivo deber&iacute; ser desactivada.</para>

  <warning>
    <para>No desactives ning&uacute;n dispositivo que necesitas durante la
     instalaci&oacute;n, como la pantalla (<devicename>sc0</devicename>).</para>
  </warning>

    <para>En el modo de configuraci&oacute;n puedes:</para>

      <itemizedlist> 

        <listitem>
         <para>Listar los drivers de dispositivos presentes en el kernel.</para>
        </listitem>

        <listitem>
          <para>Desactivar los drivers de hardware no instalado en tu sistema.</para>
        </listitem>

        <listitem>
        <para>Cambiar la IRQ, DRQ y direcciones IO usadas por los drivers
          de dispositivo.</para>
        </listitem>

      </itemizedlist> 

      <para>Mientras aparece el prompt <prompt>config&gt;</prompt>, teclea
        <command>help</command> para m&aacute;s informaci&oacute;n sobre los
        comandos disponibles. Despu&eacute;s de ajustar los par&aacute;metros
        del kernel con el hardware que tienes instalado, teclea
        <command>quit</command> en el prompt <prompt>config&gt;</prompt> para
        continuar el arranque con la nueva instalaci&oacute;n.</para>

      <para>Una vez FreeBSD est&aacute; instalado, los cambios hechos en el
        modo de configuraci&oacute;n ser&aacute;n guardados permanentemente
        para que no tengas que reconfigurar el sistema cada vez que
        arranques. A&uacute;n as&iacute;, es aconsejable que te crees un kernel
        personalizado para optimizar el sistema. Mira en
        <link linkend="kernelconfig">Configuraci&oacute;n del kernel</link>
        para crear un kernel personalizado.</para>

      <sect1 id="install-hw">
        <title>Configuraciones soportadas</title>

        <para>Actualmente FreeBSD se ejecuta en una variedad de buses
          ISA, VLB, EISA y PCI basados en PC's, cubriendo desde un 386sx
          hasta Pentiums (piensa que 386sx no es recomendado). Tambi&eacute;n
          se soportan configuraciones IDE o ESDI, diferentes controladoras
          SCSI, tarjetas de red y serie, etc.</para>

        <para>Un m&iacute;nimo de cuatro megabytes de RAM son requeridos para
          ejecutar FreeBSD. Para ejecutar el Sistema X Window, ocho
          megabytes de RAM es el m&iacute;nimo recomendado.</para>

        <para>A continuaci&oacute;n te presentamos una lista de todas las
          controladores de disco y tarjetas de red que actualmente
          funcionan en FreeBSD. Otras configuraciones posiblemente
          funcionen tambi&eacute;n, pero no hemos tenido noticias de ello.
          </para>

        <sect2>
          <title>Controladoras de disco</title>

            <itemizedlist>

              <listitem>
                <para>WD1003 (any generic MFM/RLL)</para>
              </listitem>

              <listitem>
                <para>WD1007 (any generic IDE/ESDI)</para>
              </listitem>

              <listitem>
                <para>IDE</para>
              </listitem>

              <listitem>
                <para>ATA</para>
              </listitem>

              <listitem>
                <para>Adaptec 1505 ISA SCSI controller</para>
              </listitem>

              <listitem>
                <para>Adaptec 152x series ISA SCSI controllers</para>
              </listitem>

              <listitem>
                <para>Adaptec 1535 ISA SCSI controllers</para>
              </listitem>

              <listitem>
                <para>Adaptec 154x series ISA SCSI controllers</para>
              </listitem>

              <listitem>
                <para>Adaptec 174x series EISA SCSI controller in standard and
                  enhanced mode.</para>
              </listitem>

              <listitem>
                <para>Adaptec 274x/284x/2940/2940U/3940 (Narrow/Wide/Twin)
                  series EISA/VLB/PCI SCSI controllers</para>
              </listitem>

              <listitem>
                <para>Adaptec AIC7850 on-board SCSI controllers</para>
              </listitem>

              <listitem>
                <para>Adaptec AIC-6360 based boards, which includes the
                  AHA-152x and SoundBlaster SCSI cards.</para>
                <note>
                  <para>No puedes arrancar desde tarjeta SounBlaster ya que no
                    tienen BIOS, la cual es necesaria para mapear el dispositivo
                    de arranque en los vectores de Entrada/Salida. Son
                    perfectamente usables para cintas externas, CDROM's, etc.
                    Lo mismo se aplica a cualquier otra tarjeta basada en la
                    AIC-6x60 sin ROM de arranque. Algunos sistemas tienen
                    una ROM de arranque, la cual es mostrada de alguna manera
                    cuando el sistema arranca. Revisa la configuraci&oacute;n
                    de tu sistema/placa para m&aacute;s detalles.</para>
                </note>
              </listitem>

<listitem>
                <para>Buslogic 545S &amp; 545c</para>

                <note>
                  <para>Buslogic was formerly known as &ldquo;Bustek&rdquo;.
                    </para>
                </note>
              </listitem>

              <listitem>
                <para>Buslogic 445S/445c VLB SCSI controller</para>
              </listitem>

              <listitem>
                <para>Buslogic 742A/747S/747c EISA SCSI controller.</para>
              </listitem>

              <listitem>
                <para>Buslogic 946c PCI SCSI controller</para>
              </listitem>

              <listitem>
                <para>Buslogic 956c PCI SCSI controller</para>
              </listitem>

              <listitem>
                <para>NCR 53C810/53C815/53C825/53C860/53C875 PCI SCSI
                  controller.</para>
              </listitem>

              <listitem>
                <para>NCR5380/NCR53400 (&ldquo;ProAudio Spectrum&rdquo;) SCSI
                  controller.</para>
              </listitem>

              <listitem>
                <para>DTC 3290 EISA SCSI controller in 1542 emulation mode.
                  </para>
              </listitem>

              <listitem>
                <para>UltraStor 14F/24F/34F SCSI controllers.</para>
              </listitem>

              <listitem>
                <para>Seagate ST01/02 SCSI controllers.</para>
              </listitem>

              <listitem>
                <para>Future Domain 8xx/950 series SCSI controllers.</para>
              </listitem>

              <listitem>
                <para>WD7000 SCSI controllers.</para>
              </listitem>

            </itemizedlist>

          <para>Con todas las controladoras SCSI soportadas, se consigue
            ofrecer soporte completo para perif&eacute;ricos SCSI-I
            &amp; SCSI-II, incluyendo discos, cintas, DAT, y lectores de
            CDROM.</para>

          <para>Los siguientes tipos de CDROM son soportados actualmente:
            </para>

            <itemizedlist>

              <listitem>
                <para>SoundBlaster SCSI and ProAudio Spectrum SCSI 
                  (<literal>cd</literal>)</para> 

              </listitem>

              <listitem>
                <para>Mitsumi (all models) proprietary interface 
                  (<literal>mcd</literal>)</para>
              </listitem>

              <listitem>
                <para>Matsushita/Panasonic (Creative) CR-562/CR-563
                  proprietary interface (<literal>matcd</literal>)</para>
              </listitem>

              <listitem>
                <para>Sony proprietary interface (<literal>scd</literal>)</para>
              </listitem>

              <listitem>
                <para>ATAPI IDE interface  (experimental and should be
                  considered ALPHA quality!)  (<literal>wcd</literal>)</para>
              </listitem>

            </itemizedlist>


        </sect2> 

        <sect2 id="install-nics">
          <title>Tarjetas de red</title>

            <itemizedlist>

              <listitem>
                <para>Allied-Telesis AT1700 and RE2000 cards</para>
              </listitem>

              <listitem>
                <para>SMC Elite 16 WD8013 Ethernet interface, and most other
                  WD8003E, WD8003EBT, WD8003W, WD8013W, WD8003S, WD8003SBT and
                  WD8013EBT based clones. SMC Elite Ultra and 9432TX based
                  cards are also supported.</para>
              </listitem> 

              <listitem>
                <para>DEC EtherWORKS III NICs (DE203, DE204, and DE205)</para>
              </listitem>

              <listitem>
                <para>DEC EtherWORKS II NICs (DE200, DE201, DE202, and
                  DE422)</para>
              </listitem>

              <listitem>
                <para>DEC DC21040/DC21041/DC21140 based NICs:</para>
                  <itemizedlist>

                    <listitem>
                      <para>ASUS PCI-L101-TB</para>
                    </listitem>

                    <listitem>
                      <para>Accton ENI1203</para>
                    </listitem>

                    <listitem>
                      <para>Cogent EM960PCI</para>
                    </listitem>

                    <listitem>
                      <para>Compex CPXPCI/32C</para>
                    </listitem>

                    <listitem>
                      <para>D-Link DE-530</para>
                    </listitem>

                    <listitem>
                      <para>DEC DE435</para>
                    </listitem>

                    <listitem>
                      <para>Danpex EN-9400P3</para>
                    </listitem>

                    <listitem>
                      <para>JCIS Condor JC1260</para>
                    </listitem>

                    <listitem>
                      <para>Kingston KNE100TX</para>
                    </listitem>

                    <listitem>
                      <para>Linksys EtherPCI</para>
                    </listitem>

                    <listitem>
                      <para>Mylex LNP101</para>
                    </listitem>

                    <listitem>
                      <para>SMC EtherPower 10/100 (Model 9332)</para>
                    </listitem>

                    <listitem>
                      <para>SMC EtherPower (Model 8432)</para>
                    </listitem>

                    <listitem>
                      <para>SMC EtherPower (2)</para>
                    </listitem>

                    <listitem>
                      <para>Zynx ZX314</para>
                    </listitem>

                    <listitem>
                      <para>Zynx ZX342</para>
                    </listitem>

                  </itemizedlist>

              </listitem>

              <listitem>
                <para>DEC FDDI (DEFPA/DEFEA) NICs</para>
              </listitem>

              <listitem>
                <para>Fujitsu FMV-181 and FMV-182</para>
              </listitem>

              <listitem>
                <para>Fujitsu MB86960A/MB86965A</para>
              </listitem>

              <listitem>
                <para>Intel EtherExpress</para>
              </listitem>

              <listitem>
                <para>Intel EtherExpress Pro/100B 100Mbit.</para>
              </listitem>

              <listitem>
                <para>Isolan AT 4141-0 (16 bit)</para>
              </listitem> 

              <listitem>
                <para>Isolink 4110 (8 bit)</para>
              </listitem>

              <listitem>
                <para>Lucent WaveLAN wireless networking interface.</para>
              </listitem>

              <listitem>
                <para>Novell NE1000, NE2000, and NE2100 ethernet interface.
                  </para>
              </listitem>

              <listitem>
                <para>3Com 3C501 cards</para>
              </listitem>

              <listitem>
                <para>3Com 3C503 Etherlink II</para>
              </listitem> 

              <listitem>
                <para>3Com 3c505 Etherlink/+</para>
              </listitem>

              <listitem>
                <para>3Com 3C507 Etherlink 16/TP</para>
              </listitem>

              <listitem>
                <para>3Com 3C509, 3C579, 3C589 (PCMCIA) Etherlink III</para>
              </listitem>

              <listitem>
                <para>3Com 3C590, 3C595 Etherlink III</para>
              </listitem>

              <listitem>
                <para>3Com 3C90x cards.</para>
              </listitem>

              <listitem>
                <para>HP PC Lan Plus (27247B and 27252A)</para>
              </listitem>

              <listitem>
                <para>Toshiba ethernet cards</para>
              </listitem>

              <listitem>
                <para>PCMCIA ethernet cards from IBM and National
                  Semiconductor are also supported.</para>
              </listitem>

            </itemizedlist>

          <note>
            <para>Actualmente FreeBSD no soporta las caracter&iacute;sticas PnP
            (plug-n-play) de algunas tarjetas. Si tu tarjeta tiene Pnp y te
            est&aacute; dando problemas, intenta desactivarle el PnP.</para>
          </note>
        </sect2>

        <sect2 id="install-misc">
          <title>Dispositivos varios</title>

            <itemizedlist>
            
              <listitem>
                <para>AST 4 port serial card using shared IRQ.</para>
              </listitem>

              <listitem>
                <para>ARNET 8 port serial card using shared IRQ.</para>
              </listitem>

              <listitem>
                <para>BOCA IOAT66 6 port serial card using shared IRQ.</para>
              </listitem> 

              <listitem>
                <para>BOCA 2016 16 port serial card using shared IRQ.</para>
              </listitem>

              <listitem>
                <para>Cyclades Cyclom-y Serial Board.</para>
              </listitem>

              <listitem>
                <para>STB 4 port card using shared IRQ.</para>
              </listitem>

              <listitem>
                <para>SDL Communications Riscom/8 Serial Board.</para>
              </listitem>

              <listitem>
                <para>SDL Communications RISCom/N2 and N2pci sync serial
                  cards.</para>
              </listitem> 

              <listitem>
                <para>Digiboard Sync/570i high-speed sync serial card.</para>
              </listitem>

              <listitem>
                <para>Decision-Computer Intl. &ldquo;Eight-Serial&rdquo; 8 port
serial
                  cards  using shared IRQ.</para>
              </listitem>

              <listitem>
                <para>Adlib, SoundBlaster, SoundBlaster Pro, ProAudioSpectrum,
                  Gravis UltraSound, Gravis UltraSound MAX and Roland MPU-401
                  sound cards.</para>
              </listitem>

              <listitem>
                <para>Matrox Meteor video frame grabber.</para>
              </listitem>

              <listitem> 
                <para>Creative Labs Video spigot frame grabber.</para>
              </listitem>

              <listitem>
                <para>Omnimedia Talisman frame grabber.</para>
              </listitem>

              <listitem>
                <para>Brooktree BT848 chip based frame grabbers.</para>
              </listitem>

              <listitem>
                <para>X-10 power controllers.</para>
              </listitem>

              <listitem>
                <para>PC joystick and speaker.</para>
              </listitem> 

            </itemizedlist>

          <para>FreeBSD actualmente no soporta el bus microcanal de IBM (MCA).
            </para>

        </sect2>
      </sect1>

      <sect1>
        <title>Prepar&aacute;ndonos para la instalaci&oacute;n</title>

        <para>Existen diferentes m&eacute;todos de instalaci&oacute;n de 
          FreeBSD. La siguiente secci&oacute;n describe la preparaci&oacute;n
          necesaria para cada tipo de instalaci&oacute;n.</para>

        <sect2>
          <title>Antes de instalar desde CDROM</title>

          <para>Si tu lector de CDROM no est&aacute; soportado, por favor,
            pasa a la secci&oacute;n <link linkend="install-msdos">
            Preparaci&oacute;n en MSDOS</link>.</para>

          <para>No hay mucho trabajo de preparaci&oacute;n previo para realizar
            una instalaci&oacute;n satisfactoria desde uno de los CDROM's de
            Walnut Creek (otras distribuciones en CDROM tambi&eacute;n es
            posible que funcionen pero no tenemos manera de asegurarlo ya que
            no hemos podido probar ninguno, y tampoco sabemos como est&aacute;n
            hechos). Puedes arrancar directamente el programa de 
            instalaci&oacute;n desde DOS usando el fichero 
            <filename>install.bat</filename> o puedes hacer los discos de 
            arranque ejecutando el programa <filename>makeflp.bat</filename>.
            </para>

          <note>
            <para>Si est&aacute;s ejecutando FreeBSD 2.1-RELEASE y tienes un
              CDROM IDE, usa los ficheros <filename>inst_ide.bat</filename>
              o <filename>atapiflp.bat</filename>.</para>

          </note>

          <para>Para acceder al interface m&aacute;s sencillo de todos
            (desde DOS), ejecuta el comando <command>view</command>. 
            Aparecer&aacute; una utilidad DOS con un men&uacute; 
            a trav&eacute;s del cual puedes acceder a todas las opciones
            de instalaci&oacute;n disponibles.</para>

          <para>Si est&aacute;s creando el disco de arranque desde un sistema
            UNIX, mira <link linkend="install">el principio de esta gu&iacute;a
            </link>.</para>

          <para>Una vez hayas arrancado desde DOS o floppy, deber&iacute;s ser
            capaz de poder seleccionar el CDROM como el soporte de
            instalaci&oacute;n en el men&uacute; Media y cargar la
            distribuci&oacute;n completa desde el CDROM. No se requiere
            ning&uacute;s soporte adicional para la instalaci&oacute;n.</para>

          <para>Despu&eacute;s de instalar por completo el sistema y arrancar
            desde el disco duro, puedes montar el CDROM en cualquier momento
            tecleando: <command>mount /cdrom</command></para>

          <para>Antes de poder quitar el CDROM, es necesario teclear:
            <command>umount /cdrom</command>.</para>

          <note>
            <para>Antes de ejecutar el programa de instalaci&oacute;n 
              aseg&uacute;rate de tener el CDROM en el lector para que 
              &eacute;ste pueda ser detectado durante la fase de pruebas
              de hardware. Esto es necesario tambi&eacute;n si quieres que
              el CDROM sea a&ntilde;adido autom&aacute;ticamente a la 
              configuraci&oacute;n inicial del sistema.</para>
          </note>

          <para>Finalmente, si quieres que tus usuarios puedan instalar FreeBSD
            v&iacute;a FTP directamente desde el CDROM de tu m&aacute;quina,
            lo puedes hacer de manera muy sencilla. Una vez tienes la 
            m&aacute;quina completamente instalada, s&oacute;lo tienes que
            a&ntilde;dir la siguiente l&iacute;nea al fichero de passwords
            (usando el comando vipw):</para>

          <programlisting>
ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>

          <para>Cualquiera con conectividad en tu red (y permisos para 
            acceder a ella) puede seleccionar ahora como soporte de la
            instalaci&oacute;n el tipo FTP y teclear:
            <userinput>ftp://<replaceable>tu_maquina</replaceable></userinput>
            despu&eacute;s de seleccionar &ldquo;Other&rdquo; en el men&uacute;
            de servidores FTP.</para>

        </sect2>

        <sect2>
          <title>Antes de instalar desde Floppy</title>

          <para>Si debes instalar desde disquettes, bi&eacute;n por problemas
            de compatibilidad de hardware o por que te guste hacer las cosas
            de la manera m&aacute;s complicada, antes debes preparar algunos
            disquettes.</para>

          <para>Necesitar&aacute;s, como m&iacute;nimo, tantos disquettes de
            1.44MB o 1.2MB como espacio ocupe la distribuci&oacute;n en el 
            directorio bin. Si est&aacute;s preparando estos disquettes bajo
            DOS, entonces ESTOS disquettes <emphasis>deben</emphasis> estar
            formateados con el comando FORMAT de MS-DOS. Si utilizas Windows, 
            usa el comando format del administrador de ficheros.</para>

          <para><emphasis>NO</emphasis> te f&iacute;es de los discos 
            preformateados. Format&eacute;alos t&uacute; mismo, s&oacute;lo
            para estar seguro. Muchos de los problemas reportados en el pasado
            por usuarios, han tenido que ver con disquettes mal formateados o
            defectuosos.</para>

          <para>Si est&aacute;s creando los disquettes desde una m&aacute;quina
            FreeBSD, formatear los discos tampoco es mala idea. Puedes usar el
            comando <command>disklabel</command> y <command>newfs</command>
            para formatearlos e incluir en ellos el sistema de ficheros UFS.
            Para hacerlo, puedes seguir la siguiente secuencia de comandos:
            </para>

            <informalexample>
              <screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440
              </userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/rfd0</userinput>
              </screen>
            </informalexample>

          <note>
            <para>Usa <literal>fd0.1200</literal> y <literal>floppy5</literal>
              para discos de 5.25" (o 1.2MB).</para>
          </note>

          <para>Ahora puedes montar los disquettes y escribir en ellos como
            en cualquier otro sistema de ficheros.</para>

          <para>Despu&eacute;s de formatear los disquettes, necesitar&aacute;s
            copiar los ficheros en ellos. Los ficheros de la distribuci&oacute;n
            est&aacute;n convenientemente distribuidos para que quepan 5 de 
            ellos en cada disquette de 1.44Mb. Utiliza todos los discos 
            necesarios para incluir en ellos todas las distribuciones que
            quieras instalar. Cada distribuci&oacute;n debe estar en un
            subdirectorio del floppy, por ejemplo:
            <filename>a:\bin\bin.aa</filename>,
            <filename>a:\bin\bin.ab</filename>, y as&iacute; hasta completar
            la distribuci&oacute;n.</para>

          <para>Una vez llegues a la pantalla de selecci&oacute;n del 
            soporte de la instalaci&oacute;n, selecciona &ldquo;Floppy&rdquo;
            , siendo preguntado por el resto de par&aacute;metros necesarios.
            </para>

        </sect2>

        <sect2 id="install-msdos">
          <title>Antes de instalar desde una partici&oacute;n MS-DOS</title>

          <para>Para realizar la instalaci&oacute;n desde una partici&oacute;n
            MS-DOS, copia los ficheros de la distribuci&oacute;n en un
            directorio llamado <filename>C:\FREEBSD</filename>. La estructura
            de directorios del CDROM tiene que ser parcialmente reproducida
            dentro de &eacute;ste directorio, por lo que te aconsejamos usar
            el comando <command>xcopy</command>. Por ejemplo, para preparar una
            instalaci&oacute;n m&iacute;nima de FreeBSD:</para>

            <informalexample>
              <screen><prompt>C:\&gt;</prompt> <userinput>MD C:\FREEBSD
                </userinput>
<prompt>C:\&gt;</prompt> <userinput>XCOPY /S E:\BIN C:\FREEBSD\BIN\</userinput>
<prompt>C:\&gt;</prompt> <userinput>XCOPY /S E:\MANPAGES C:\FREEBSD\MANPAGES\
</userinput></screen>
            </informalexample>

          <para>Asumiendo que <devicename>C:</devicename> es donde tienes
            espacio libre y <devicename>E:</devicename> es la unidad de tu
            lector de CDROM.</para>

          <para>Tienes que copiar cada distribuci&oacute;n que quieras instalar
            desde MS-DOS, bajo <filename>C:\FREEBSD</filename> &mdash; la
            distribuci&oacute;n <abbrev>BIN</abbrev> es s&oacute;lo la 
            m&iacute;nima requerida.</para>

        </sect2>

        <sect2>
          <title>Antes de instalar desde una cinta QIC/SCSI</title>

          <para>Instalar desde una cinta es probablemente el m&eacute;todo
            m&aacute;s sencillo, aparte de una instalaci&oacute;n on-line, 
            v&iacute;a FTP o CDROM. El programa de instalaci&oacute;n espera
            que los ficheros est&eacute;n en formato tar en la cinta, por lo
            que s&oacute;lo tienes que seleccionar la distribuci&oacute;n a  
            instalar y copiarla en una cinta en formato tar con un comando
            como:</para>

            <informalexample>
              <screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>
            </informalexample> 

          <para>Cuando ejecutas la instalaci&oacute;n, deber&iacute;s 
            asegurarte de dejar suficiente espacio libre en alg&uacute;n
            directorio temporal (el cual podr&aacute;s elegir), para 
            que el programa de instalaci&oacute;n pueda recuperar 
            <emphasis>todo</emphasis> el contenido de la cinta. Dado al acceso
            no aleatorio de las cintas, este m&eacute;todo exige un poco de
            espacio temporal. Necesitar&aacute;s tanto espacio temporal como 
            contenidos hayan en la cinta.</para>

          <note>
            <para>Es imprescindible que la cinta est&eacute; en el lector
              <emphasis>antes</emphasis> de arrancar con el disco de
              instalaci&oacute;n.</para>
          </note>
       
        </sect2>

        <sect2>
          <title>Antes de instalar sobre una red</title>

          <para>Puedes hacer instalaciones de red mediante 3 tipos de
            conexi&oacute;n:</para>

            <variablelist>
              <varlistentry><term>Puerto serie</term>

                <listitem>
                  <para>SLIP o PPP</para>

                </listitem>
              </varlistentry>

              <varlistentry><term>Puerto paralelo</term>
              
                <listitem>
                  <para>PLIP (cable laplink)</para>

                </listitem>
              </varlistentry>

              <varlistentry><term>Ethernet</term>

                <listitem>
                  <para>Tarjeta ethernet estandar (incluye algunas PCMCIA).
                    </para>

                </listitem>
              </varlistentry>
            </variablelist>

          <para>El soporte de SLIP es bastante primitivo, y limitado a 
            conexiones punto a punto como una cable serie entre un 
            port&aacute;til y otro ordenador. La conexi&oacute;n debe ser
            mediante un cable cruzado serie ya que la instalaci&oacute;n
            SLIP no ofrece posibilidad de marcado telef&oacute;nico; esta
            facilidad se ofrece mediante la utilidad PPP, la cual aconsejamos
            usar siempre que sea posible.</para>

          <para>Si est&aacute;s usando un m&oacute;dem, PPP es tu &uacute;nica
            opci&oacute;n. Aseg&uacute;rate de tener la informaci&oacute;n de
            tu proveedor a mano ya que el proceso de instalaci&oacute;n te
            la pedir&aacute; de manera inmediata. Necesitar&aacute;s saber
            como llamar a tu proveedor usando  &ldquo;comando AT&rdquo;
            espec&iacute;ficos de tu m&oacute;dem por que el marcador PPP 
            s&oacute;lo ofrece un simple emulador de terminal. Si usas
            PAP o CHAP, necesitar&aacute;s teclear los comandos
            <command>set authname</command> y <command>set authkey</command>
            antes de teclear el comando <command>term</command>.
            P&aacute;sate por el <link linkend="userppp">manual ppp</link>
            y las secciones de las <ulink URL="../FAQ/userppp.html">FAQ</ulink>
            para m&aacute;s informaci&oacute;n. Si tienes problemas, el log
            puede ser dirigido a la pantalla usando el comando
            <command>set log local ...</command>.</para>

          <para>Si puedes disponer de una conexi&oacute;n punto a punto a otro 
            sistema FreeBSD (2.0R o superior), deber&iacute;as considerar la
            instalaci&oacute;n sobre el puerto paralelo con un cable
            &ldquo;laplink&rdquo;. La velocidad es mucho mayor que la que
            podemos conseguir sobre una conexi&oacute;n serie (por encima de
            los 50k/seg), obteniendo una instalaci&oacute;n m&aacute;s
            r&aacute;pida.</para>

          <para>Finalmente, para la instalaci&oacute;n de red m&aacute;s
            r&aacute;pida posible, una tarjeta ethernet es siempre una
            buena elecci&oacute;n. FreeBSD soporta muchas de las tarjetas
            ethernet del mercado, una tabla de las tarjetas soportadas
            (y sus caracter&iacute;sticas requeridas) est&aacute;
            disponible en la secci&oacute;n 
            <link linkend="install-hw">Hardware soportado</link>. Si 
            est&aacute;s usando una de las tarjeta PCMCIA soportadas, 
            aseg&uacute;rate de tener la tarjeta insertada 
            <emphasis>antes</emphasis> de encender el port&aacute;til. 
            Desafortunadamente, actualmente FreeBSD no soporta la
            "inserci&oacute;n en caliente" de tarjetas PCMCIA durante el 
            proceso de instalaci&oacute;n.</para>

          <para>Tambi&eacute;n necesitar&aacute;s saber tu direcci&oacute;n IP
            en la red, el valor de la m&aacute;scara de tu clase de 
            direcciones y el nombre de tu m&aacute;quina. Tu administrador
            de sistemas puede darte todos los valores adecuados a la 
            configuraci&oacute;n de tu red. Si vas a acceder a otras
            m&aacute;quinas por nombre en lugar de direcci&oacute;n IP, 
            necesitar&aacute;s la direcci&oacute;n de un servidor de nombres
            y posiblemente la direcci&oacute;n de un gateway (si usas PPP es
            la direcci&oacute;n IP de tu proveedor). Si no conoces las
            respuestas a la mayor&iacute;a de estas preguntas, definitivamente
            debes hablar con tu administrador de sistemas 
            <emphasis>antes</emphasis> de intentar &eacute;ste tipo de
            instalaci&oacute;n.</para>

          <para>Una vez tienes una conexi&oacute;n de red de cualquier tipo
            funcionando, la instalaci&oacute;n puede continuar sobre NFS o
            FTP.</para>

          <sect3>
            <title>Preparando la instalaci&oacute;n sobre NFS</title>

            <para>La instalaci&oacute;n sobre NFS es muy sencilla: 
              simplemente copia los ficheros de las distribuciones de FreeBSD
              que necesites en alg&uacute;n lugar del servidor, y apunta
              el soporte de instalaci&oacute;n de NFS hacia &eacute;l.</para>

            <para>Si este servidor s&oacute;lo soporta accesos a 
              &ldquo;puertos seleccionados&rdquo; (como ocurre generalmente
              con las estaciones de trabajo SUN), necesitar&aacute;s activar
              esta opci&oacute;n en el men&uacute; Options antes de proceder
              con la instalaci&oacute;n.</para>

            <para>Si tienes una conexi&oacute;n de red de poca calidad, con
              ratios de transferencia muy pobres, tambi&eacute;n deber&iacute;as
              activar el flag apropiado en el men&uacute; Options.</para>

            <para>Para que la instalaci&oacute;n por NFS funcione, el servidor
              debe soportar el acceso a subdirectorios exportados, por
              ejemplo, si el directorio de tu distribuci&oacute;n de FreeBSD
              &rel.current; reside en:
              <filename>ziggy:/usr/archive/stuff/FreeBSD</filename> Entonces 
              <hostid>ziggy</hostid> debe permitir montar directamete
              <filename>/usr/archive/stuff/FreeBSD</filename>, y no s&oacute;lo
              <filename>/usr</filename> o
              <filename>/usr/archive/stuff</filename>.</para>

            <para>En fichero <filename>/etc/exports</filename> de FreeBSD, 
              esto es controlado por la opci&oacute;n <option>-alldirs</option>
              . Otros servidores NFS pueden usar opciones diferentes. Si 
              obtienes el mensaje <errortype>Permission Denied</errortype> por
              parte del servidor, significa que no tienes esta opci&oacute;n
              activada de manera adecuada.</para>

          </sect3>

          <sect3>
            <title>Preparando una instalaci&oacute;n por FTP</title>

            <para>La instalaci&oacute;n por FTP se puede realizar desde 
              cualquiera de los servidores mirror que contengan una 
              versi&oacute;n razonablemente actualizada de FreeBSD 
              &rel.current;. Un completo men&uacute; de elecciones razonables
              para pr&aacute;cticamente cualquier parte del mundo est&aacute;
              disponible en el men&uacute; de instalaci&oacute;n FTP.</para>

            <para>Si est&aacute;s instalando desde cualquier otro servidor no
              listado en ese men&uacute;, o tienes problemas con la 
              configuraci&oacute;n del servidor de nombres o la 
              resoluci&oacute;n correcta, puedes especificar tu propia URL
              seleccionando la opci&oacute;n &ldquo;Other&rdquo; en el 
              men&uacute;. Una URL tambi&eacute;n puede ser una direcci&oacute;n
              IP, de manera que lo siguiente funcionar&iacute;a en la ausencia
              de un servidor de nombres:</para>

              <informalexample>
                <screen><userinput>ftp://165.113.121.81/pub/FreeBSD/&rel.current
;-RELEASE</userinput></screen>
              </informalexample>

            <para>Hay dos modos de instalaci&oacute;n FTP que puedes 
              usar:</para>

              <variablelist>
                <varlistentry><term>FTP Activo</term>
                  <listitem>
                    <para>Para todas las transferencias FTP, usa el modo
                    &ldquo;Activo&rdquo;. Esto no funcionar&aacute; a 
                    trav&eacute;s de firewalls, pero funcionar&aacute; sin
                    problemas con servidores FTP antiguos que no soportan
                    el modo pasivo. Si tu conexi&oacute;n se cuelga con el
                    modo pasivo, intenta con el modo activo!.</para>
                  </listitem>
                </varlistentry>

                <varlistentry><term>FTP Pasivo</term>

                  <listitem>
                    <para>Para todas las transferencias FTP usa el modo
                      &ldquo;Pasivo&rdquo;. Esto permite al usuario conectar
                      a trav&eacute;s de firewalls que no aceptan conexiones
                      entrantes en direcciones de puertos aleatorias.</para>
                  </listitem>
                </varlistentry>
              </variablelist>

            <note>
              <para>Los modos Activos y Pasivos no son lo mismo que una
                conexi&oacute;n a trav&eacute;s de &ldquo;proxy&rdquo;, donde
                un servidor proxy FTP est&aacute; escuchando y reenviando
                las peticiones FTP!.</para>
            </note>

            <para>Para un servidor proxy FTP, normalmente deber&iacute;as 
              darle el nombre del servidor real al que quieres conectar como
              parte del nombre de usuario despu&eacute;s de una @-sign.
              El servidor proxy reenviar&aacute; la petici&oacute;n al servidor
              adecuado. Un ejemplo: digamos que quieres realizar la 
              instalaci&oacute;n desde 
              <hostid role="fqdn">ftp.freebsd.org</hostid> usando el servidor
              proxy FTP <hostid role="fqdn">foo.bar.com</hostid>, que 
              est&aacute; escuchando en el puerto 1234.</para>

            <para>En este caso, tienes que ir al men&uacute; de opciones, y 
              poner el nombre de usuario de FTP como ftp@ftp.freebsd.org, y
              tu direcci&oacute;n de correo como password. Como medio de
              instalaci&oacute;n , especifica FTP (o FTP pasivo, si el proxy
              lo soporta) y la URL

              <literal>
                ftp://foo.bar.com:1234/pub/FreeBSD
              </literal></para>

            <para><filename>/pub/FreeBSD</filename> de
              <hostid role="fqdn">ftp.freebsd.org</hostid> es "cacheado" bajo
              <hostid role="fqdn">foo.bar.com</hostid>, permitiendote realizar
              la instalaci&oacute;n desde <emphasis>esa</emphasis>
              m&aacute;quina (la cual coge los ficheros de
              <hostid role="fqdn">ftp.freebsd.org</hostid> a medida que la
              instalaci&oacute;n los necesita).</para>

          </sect3>
        </sect2>
      </sect1>

      <sect1>
        <title>Instalando FreeBSD</title>

        <para>Una vez has tomado nota de los pasos apropiados en la
          preinstalaci&oacute;n, deber&iacute;s poder instalar FreeBSD sin
          ning&uacute;n tipo de problema.</para>

        <para>Si tienes alg&uacute;n problema, deber&iacute;as vover 
          atr&aacute;s y releer la secci&oacute;n de preparaci&oacute;n 
          aplicable a tu medio de instalaci&oacute;n. Si est&aacute;s teniendo
          problemas de hardware, o FreeBSD se niega a arrancar, lee la
          Gu&iacute;a de Hardware que puedes encontrar en el disco de arranque
          para posibles soluciones.</para>

        <para>El disco de arranque de FreeBSD contiene toda la 
          documentaci&oacute;n on-line que deber&iacute;s necesitar para 
          realizar la instalaci&oacute;n. Si no es as&iacute;, nos 
          gustar&iacute;a saber que es lo que te ha confundido o d&oacute;nde
          has tenido m&aacute;s problemas. Env&iacute; tus comentarios a
          &a.doc;. El objetivo del programa de instalaci&oacute;n de FreeBSD
          (sysinstall) es estar suficientemente documentado para poder realizar
          una instalaci&oacute;n sin problemas.</para>

        <para>Mientras tanto, puedes encontrar &uacute;til esta
          &ldquo;t&iacute;pica secuencia de instalaci&oacute;n&rdquo;:
          </para>

          <orderedlist>

            <listitem>
              <para>Arranca con el disco de arranque. Despu&eacute;s de la
                secuencia de arranque que puede tardar entre 30 segundos y
                3 minutos, dependiendo del hardware, deber&iacute;a aparecer
                un men&uacute; de opciones iniciales. Si el disco no arranca o
                el arranque se cuelga en alg&uacute;n momento, lee la 
                secci&oacute;n Q&amp;A de la Gu&iacute;a de Hardware para 
                conocer las posibles causas.</para>
            </listitem>

            <listitem>
              <para>Pulsa F1. Deber&iacute;as ver unas instrucciones 
                b&aacute;sicas sobre el sistema de men&uacute;s y 
                del programa en general. Si no has usado este sistema de
                men&uacute; anteriormente, <emphasis>por favor</emphasis>
                l&eacute;elo.</para>
            </listitem>

            <listitem>
              <para>Selecciona la opci&oacute;n Options y configura las
                preferencias que puedas tener o necesitas.</para>
            </listitem>

            <listitem>
              <para>Selecciona la instalaci&oacute;n Novice, Custom o Express,
                dependiendo de la ayuda que quieras recibir del programa de
                instalaci&oacute;n durante todo el proceso. Si nunca has usado
                FreeBSD anteriormente, la instalaci&oacute;n Novice es la
                m&aacute;s recomendada.</para>
            </listitem>

            <listitem>
              <para>El men&uacute; de configuraci&oacute;n final te permite
                configurar tu instalaci&oacute;n de FreeBSD a trav&eacute;s
                de un sistema guiado por men&uacute;s. Algunas secciones,
                como la de red, pueden ser importantes si has hecho la
                instalaci&oacute;n desde CDROM/Cinta/Floppy y no has configurado
                todav&iacute;a tus interfaces de red (asumiendo que exista
                alguno). Configurando adecuadamente en este momento los
                interfaces permitir&aacute;a que FreeBSD est&eacute; activo en
                la red cuando reinicies por primera vez desde el disco 
                duro.</para>
            </listitem>

          </orderedlist>

        </sect1>

        <sect1>
          <title>Preguntas y Respuestas para usuarios de MS-DOS</title>

          <para>Muchos usuarios de FreeBSD querr&aacute;n instalar FreeBSD
            en PC's habitados por MS-DOS. Aqu&iacute; est&aacute;n algunas
            de las pregunas (y respuestas) m&aacute;s comunes sobre la
            instalaci&oacute;n de FreeBSD en estos sistemas.</para>

          <para><emphasis>Ayuda! No tengo espacio. Necesito borrarlo todo?
            </emphasis></para>

          <para>Si tu m&aacute;quina est&aacute; todav&iacute;a ejecutando
            MS-DOS y tienes poco o ning&uacute;n espacio libre disponible
            para la instalaci&oacute;n de FreeBSD, no todo est&aacute;
            perdido!. Quiz&aacute;s encuentres &uacute;til la utilidad FIPS,
            disponible en el directorio <filename>tools</filename> del CDROM
            de FreeBSD, o en cualquiera de los mirrors de FreeBSD.</para>

          <para>FIPS te permite repartir una partici&oacute;n MS-DOS en dos
            partes, preservando la partici&oacute;n original permitiendo la
            instalaci&oacute;n en la segunda. Primero debes defragmentar
            tu partici&oacute;n MS-DOS usando el programa DEFRAG de DOS 6.x o
            las utilidades Norton. Despu&eacute;s ejecuta FIPS. El propio
            programa te preguntar&aacute; todos los datos que necesite conocer.
            Finalmente puedes reiniciar la m&aacute;quina e instalar FreeBSD
            en la segunda partici&oacute;n. Mira el men&uacute;
            <emphasis>Distributions</emphasis> para hacer una estimaci&oacute;n
            de la cantidad de espacio necesario para el tipo de 
            instalaci&oacute;n que deseas hacer.</para>

          <para><emphasis>Puedo usar sistemas de ficheros comprimidos desde
            FreeBSD?</emphasis></para>

          <para>No. Si est&aacute;s usando una utilidad como Stacker(tm) o
            DoubleSpace(tm), FreeBSD solo ser&aacute; capaz de usar la
            parte del sistema de ficheros no comprimida. El resto del 
            sistema de ficheros se mostrar&aacute;s como un &uacute;nico
            fichero. <emphasis>No borres este fichero</emphasis>. Lo 
            agradecer&aacute;s enormemente!.</para>

          <para>Es mejor soluci&oacute;n crear otra partici&oacute;n primaria
            de MS-DOS no comprimida y usarla para la comunicaci&oacute;n entre
            MS-DOS y FreeBSD.</para>

          <para><emphasis>Puedo montar mis particiones MS-DOS extendidad?
            </emphasis></para>

          <para>S&iacute;. Las particiones extendidas de DOS son mapeadas al
            final del otro &ldquo;slices&rdquo; en FreeBSD, por ejemplo, tu
            disco <devicename>D:</devicename> ser&aacute;
            <filename>/dev/sd0s5</filename>, tu disco 
            <devicename>E:</devicename> ser&aacute;
            <filename>/dev/sd0s6</filename> y as&iacute; respectivamente. Este
            ejemplo asume, por supuesto, que tu partici&oacute;n extendida 
            est&aacute; en el disco SCSI 0. Para discos IDE, sustituye
            <filename>wd</filename> por <filename>sd</filename>. Para montar
            las particiones extendidas tienes que hacerlo exactamente igual
            que cualquier otra partici&oacute;n o disco DOS:</para>

          <informalexample>
            <screen>&prompt.root; <userinput>mount -t msdos /dev/sd0s5 /dos_d
              </userinput></screen>
          </informalexample>

          <para><emphasis>Puedo ejecutar binarios MS-DOS bajo FreeBSD?
            </emphasis></para>

          <para>BSDI ha donado su emulador DOS al mundo BSD y &eacute;ste ha
            sido portado a FreeBSD.</para>

          <para>Hay tambi&eacute;n una (tecnicamente) buena aplicaci&oacute;n 
            disponible en la <link linkend="ports">Colecci&oacute;n de Ports
            </link> llamada pcemu, la cual te permite ejecutar muchos binarios
            en modo texto emulando por completo una CPU 8088.</para>

      </sect1>
    </chapter>


<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->

