<!--
     The FreeBSD Documentation Project

$FreeBSD$
$FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/install/chapter.sgml,v 1.5 2004/10/08 18:48:47 jesusr Exp $
     Traducido de la version: 1.300
-->

<chapter id="install">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Reestructurado, reorganizado y con 
	  algunas partes reescritas por </contrib>
      </author>
    </authorgroup>

    <authorgroup>
      <author>
	<firstname>Randy</firstname>
	<surname>Pratt</surname>
	<contrib>El recorrido por sysinstall, las capturas de 
	  pantalla y el texto original son obra de </contrib>
      </author>
    </authorgroup>
    <!-- January 2000 -->
  </chapterinfo>

  <title>Instalaci&oacute;n de &os;</title>

  <sect1 id="install-synopsis">
    <title>Sinopsis</title>

    <indexterm><primary>installaci&oacute;n</primary></indexterm>

    <para>&os; dispone de un programa en modo texto muy f&aacute;cil de 
      usar llamado <application>sysinstall</application>.  Es el programa 
      de instalaci&oacute;n por defecto de &os;, pero quien decida 
      distribuir &os; tiene todo el derecho de facilitar un sistema de 
      instalaci&oacute;n propio si as&iacute; lo desea.  Este cap&iacute;tulo 
      trata sobre c&oacute;mo usar <application>sysinstall</application> 
      para instalar &os;</para>

    <para>Tras leer este cap&iacute;tulo sabr&aacute; usted:</para>

    <itemizedlist>
      <listitem>
	<para>C&oacute;mo crear unos discos de instalaci&oacute;n de 
          &os;</para>
      </listitem>
      
      <listitem>
        <para>C&oacute;mo interpreta (y subdivide) &os; sus discos 
          duros.</para>
      </listitem>

      <listitem>
	<para>C&oacute;mo arrancar <application>
          sysinstall</application>.</para>
      </listitem>

      <listitem>
        <para>Qu&eacute; preguntas le har&aacute; <application>
          sysinstall</application>, qu&eacute; significan y c&oacute;mo 
          responderlas.</para> 
      </listitem>
    </itemizedlist>

    <para>Antes de leer este cap&iacute;tulo deber&iacute;a usted:</para>

    <itemizedlist>
      <listitem>
	<para>Leer la lista de hardware soportado que se suministra con la 
	  con la versi&oacute;n de &os; que va a instalar y verificar que su 
	  hardware est&aacute; en dicha lista.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>En general &eacute;stas instrucciones de instalaci&oacute;n 
        han sido escritas para computadoras de arquitectura &i386; 
	(<quote>PC compatible</quote>).  En algunos puntos concretos 
	se dar&aacute;n instrucciones espec&iacute;ficas para otras 
	plataformas (por ejemplo Alpha).  A pesar de que esta gu&iacute;a 
	se intenta mantener todo lo al d&iacute;a que es posible 
	puede que se encuentre con peque&ntilde;as diferencias entre el 
	programa de instalaci&oacute;n y lo que aqu&iacute; se le 
	muestra.  Le sugerimos que use este cap&iacute;tulo como una 
	gu&iacute;a general m&aacute;s que como un manual literal de 
	instalaci&oacute;n.</para>
    </note>

  </sect1>

  <sect1 id="install-pre">
    <title>Tareas anteriores a la instalaci&oacute;n</title>

    <sect2 id="install-inventory">
      <title>Inventario de su sistema</title>

      <para>Antes de instalar &os; en su sistema deber&iacute;a completar 
	un inventario de los componentes de su computadora.  El sistema 
	de instalaci&oacute;n de &os; le mostrar&aacute; los componentes 
	(discos duros, tarjetas de red, unidades de CDROM, etc.) con sus 
	datos de modelo y fabricante.  &os; tratar&aacute; tambi&eacute;n 
	de determinar la configuraci&oacute;n correcta para dichos 
	dispositivos, lo que incluye informaci&oacute;n sobre las IRQ y 
	el uso de puertos IO.  A causa de la ingente variedad de hardware 
	para PC este proceso no siempre se puede culminar con &eacute;xito 
	y es posible que deba corregir las decisiones de &os; retocando 
	la configuraci&oacute;n.</para>

      <para>Si ya dispone de otro sistema operativo instalado, como 
	&windows; o Linux, puede usar los recursos que dicho o dichos 
	sistemas operativos le faciliten para determinar exactamente 
	qu&eacute; hardware tiene y c&oacute;mo est&aacute; configurado.  
	Si tiene del todo claro qu&eacute; configuraci&oacute;n est&aacute; 
	usando una tarjeta de expasi&oacute;n concreta es posible que 
	pueda encontrar esos datos impresos en la propia tarjeta.  Es muy 
	habitual el uso de las IRQ 3, 5 y 7 y las direcciones de los 
	puertos IO suelen representarse con n&uacute;meros hexadecimales, 
	como 0x330.</para>

      <para>Le recomendamos imprimir o tomar nota de todos esos datos 
	antes de instalar &os;  Una tabla como esta puede serle de mucha 
	ayuda:</para>

      <table pgwide="1" frame="none">
	<title>Ejemplo de inventario de dispositivos

	<tgroup cols="4">
          <colspec colwidth="2*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">
	  <thead>
	    <row>
	      <entry>Nombre de dispositivo</entry>

	      <entry>IRQ</entry>

	      <entry>Puerto(s) IO</entry>

	      <entry>Notas</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry>Primer disco duro</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>40&nbsp;GB, fabricado por Seagate, primer maestro IDE </entry>
	    </row>

	    <row>
	      <entry>CDROM</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Primer esclavo IDE</entry>
	    </row>

	    <row>
	      <entry>Segundo disco duro</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>20&nbsp;GB, fabricado por IBM, segundo maestro IDE</entry>
	    </row>

	    <row>
	      <entry>Primera controladora IDE</entry>

	      <entry>14</entry>

	      <entry>0x1f0</entry>

	      <entry></entry>
	    </row>

	    <row>
	      <entry>Tarjeta de red</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&intel; 10/100</entry>
	    </row>

	    <row>
	      <entry>M&oacute;dem</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&tm.3com; 56K faxmodem, en COM1</entry>
	    </row>

	    <row>
	      <entry>&hellip;</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>
    </sect2>

    <sect2>
      <title>Haga una copia de seguridad de sus datos</title>
      
      <para>Si la computadora en la que va a instalar &os; contiene 
	datos que desea conservar por alg&uacute;n motivo 
	aseg&uacute;rese de haber hecho una copia de seguridad de los 
	mismos y de que esa copia es de fiar antes de instalar &os;.  
	El sistema de instalaci&oacute;n de &os; le mostrar&aacute; una 
	advertencia antes de modificar datos en su disco pero una vez 
	que el proceso ha comenzado no hay manera de dar marcha 
	atr&aacute;s.</para>
    </sect2>

    <sect2 id="install-where">
      <title>D&oacute;nde instalar &os;</title>

      <para>Si quiere que &os; use todo su disco duro puede saltar 
	tranquilamente a la siguiente secci&oacute;n.</para>

      <para>Si por el contrario necesita que &os; coexista con otros 
	sistemas operativos tendr&aacute; que comprender c&oacute;mo 
	se almacenan los datos en el disco duro y c&oacute;mo le afecta 
	todo esto.</para>

      <sect3 id="install-where-i386">
	<title>Esquemas de disco en &i386;</title>

      <para>Un disco de PC puede dividirse en varias partes.  Estas partes 
	reciben el nombre de <firstterm>particiones</firstterm>.  Por razones 
	de dise&ntilde;o los PC s&oacute;lo admiten cuatro particiones por 
	disco.  Esas particiones se denominan <firstterm>particiones 
	primarias</firstterm>.  Para evitar esa limitaci&oacute;n y 
	poder usar m&aacute;s de cuatro particiones se cre&oacute; un nuevo 
	tipo de partici&oacute;n, las <firstterm>particiones 
	extendidas</firstterm>.  Cada disco s&oacute;lo puede contener una 
	partici&oacute;n extendida.  Pueden crearse particiones especiales, 
	llamadas <firstterm>particiones l&oacute;gicas</firstterm>, dentro 
	de esta partici&oacute;n extendida.</para>

      <para>Cada partici&oacute;n tiene un <firstterm>identificador de 
	partici&oacute;n</firstterm> (o  <firstterm>partition ID</firstterm>), 
	que es un n&uacute;mero usado para identificar el tipo de datos que 
	alberga la partici&oacute;n.  Las particiones &os; tienen como 
	identificador de partici&oacute;n <literal>165</literal>.</para>

      <para>Normalmente cada sistema operativo que vaya a utilizar 
	identificar&aacute; las particiones de un modo propio.  Por ejemplo 
	DOS, y descendientes suyos como &windows;, asignan a cada 
	partici&oacute;n primaria y l&oacute;gica una 
	<firstterm>letra de unidad</firstterm> a partir de 
	<devicename>C:</devicename>.</para>

      <para>&os; debe instalarse en una partici&oacute;n primaria.  &os; 
	puede albergar todos los datos que necesita, incluyendo cualquier 
	fichero que pueda usted crear, en esta partici&oacute;n.  Si tiene 
	usted varios discos duros puede crear particiones para que &os; las 
	use en todos ellos o en algunos nada m&aacute;s.  Al instalar &os; 
	debe usar al menos una partici&oacute;n.  Puede usar una 
	partici&oacute;n vac&iacute;a que haya preparado o puede usar 
	tambi&eacute;n una partici&oacute;n que contenga datos que no desea 
	conservar.</para>

      <para>Si est&aacute; usando todas las particiones de todos sus discos 
	tendr&aacute; que dejar libre una de ellas para &os; usando las 
	herramientas del otro sistema operativo que est&eacute; usando 
	(por ejemplo <command>fdisk</command> en DOS o en 
	&windows;).</para>

      <para>Si tiene una partici&oacute;n sobrante puede usarla, pero puede 
	verse en la necesidad de reducir una o m&aacute;s de las particiones 
	que est&aacute; usando.</para>

      <para>Una instalaci&oacute;n m&iacute;nima de &os; cabr&iacute; en 
	s&oacute;lo 100&nbsp;MB de disco pero tenga en cuenta que apenas 
	quedar&iacute;a espacio para los ficheros que quiera crear.  Un 
	m&iacute;nimo m&aacute;s realista ser&iacute;a de 250&nbsp;MB si no 
	pretende usar entorno gr&aacute;fico y 350&nbsp;MB o m&aacute;s si 
	quiere usar un interfaz gr&aacute;fico de usuario.  Si quiere instalar 
	gran cantidad de software para usarlo en &os; sin duda 
	necesitar&aacute; m&aacute;s espacio.</para>

      <para>Puede usar aplicaciones comerciales como 
	<application>&partitionmagic;</application> para ajustar el 
	tama&ntilde;o de sus particiones y hacer sitio a &os;.  El 
	directorio <filename>tools</filename> del CDROM contiene 
	dos aplicaciones libres que puede usar para &eacute;ste fin: 
	<application>FIPS</application> y 
	<application>PResizer</application>.  En el propio directorio puede 
	encontrar documentaci&oacute;n para ambas aplicaciones.  
	<application>FIPS</application>,
	<application>PResizer</application> y 
	<application>&partitionmagic;</application> pueden redimensionar 
	las particiones <acronym>FAT16</acronym> y 
	<acronym>FAT32</acronym> &mdash; que se usan de &ms-dos; a 
	&windows; ME.  <application>&partitionmagic;</application> es la 
	&uacute;nica aplicaci&oacute;n conocida que pueda redimensionar 
	particiones <acronym>NTFS</acronym>.</para>

      <warning>
	<para>El uso incorrecto de estas herramientas puede borrar datos 
	  de su disco duro.  Recuerde, aseg&uacute;rese de disponer de 
	  copias de seguridad recientes y utilizables antes de 
	  usarlas.</para>
      </warning>

      <example>
	<title>Uso de una partici&oacute;n sin cambiar nada</title>

	<para>Supongamos que tiene una m&aacute;quina con un s&oacute;lo 
	  disco de 4&nbsp;GB que ya tiene una versi&oacute;n de &windows; 
	  instalada y que ese disco est&aacute; dividido en dos unidades, 
	  <devicename>C:</devicename> y <devicename>D:</devicename>, cada 
	  una de las cuales tiene un tama&ntilde;o de  2&nbsp;GB.  Tiene 
	  1&nbsp;GB de datos en <devicename>C:</devicename> y 0.5&nbsp;GB de 
	  datos en <devicename>D:</devicename>.</para>

	<para>Esto significa que su disco duro tiene dos particiones, una 
	  por cada letra de unidad.  Copie todos sus datos de 
	  <devicename>D:</devicename> en <devicename>C:</devicename> y 
	  habr&aacute; dejado limpia su segunda partici&oacute;n, 
	  dej&aacute;ndola lista para &os;</para>
      </example>

      <example>
	<title>Reducir una partici&oacute;n existente</title>

	<para>Suponga que tiene una m&aacute;quina con un s&oacute;lo disco 
	  de 4&nbsp;GB que contiene una versi&oacute;n de &windows; instalada.  
	  Cuando instal&oacute; &windows; cre&oacute; una gran 
	  partici&oacute;n, lo que le di&oacute; como resultado una unidad 
	  <devicename>C:</devicename> de 4&nbsp;GB.  Est&aacute; usando 
	  1.5&nbsp;GB de espacio y quiere que &os; tenga  2&nbsp;GB de 
	  espacio.</para>

	<para>Para poder instalar &os; tendr&aacute; que realizar una de 
	  las siguientes tareas:</para>

	<orderedlist>
	  <listitem>
	    <para>Haga una copia de sus datos de &windows; y despu&eacute;s 
	    reinstale &windows;, eligiendo una partici&oacute;n de 2&nbsp;GB 
	    en el momento de la instalaci&oacute;n.</para>
	  </listitem>

	  <listitem>
	    <para>Utilice alguna herramienta del estilo de 
	      <application>&partitionmagic;</application> que se han 
	      descrito antes para reducir el tama&ntilde;o de su 
	      partici&oacute;n de &windows;.</para>
	  </listitem>
	</orderedlist>
      </example>

      </sect3>

      <sect3>
	<title>Estructura de discos en Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Tendr&aacute; que dedicar un disco de su sistema 
	  para usar &os; puesto que de momento es imposible compartir 
	  un disco con otro sistema operativo.  Dependiendo de la 
	  la m&aacute;quina Alpha que tenga el disco podr&aacute; ser 
	  SCSI o IDE en la medida en que sea posible arrancar desde 
	  tales discos.</para>

	<para>Siguiendo las normas de los manuales de Digital / Compaq 
	  todos los datos suministrados a SRM se muestran en 
	  may&uacute;sculas.  SRM no distingue entre may&uacute;sculas y 
	  min&uacute;sculas.</para>

	<para>Use <literal>SHOW DEVICE</literal> en la consola de SRM 
	  para saber qu&eacute; tipo de discos hay en su sistema:</para>

	<screen>&gt;&gt;&gt;<userinput>SHOW DEVICE</userinput>
dka0.0.0.4.0               DKA0           TOSHIBA CD-ROM XM-57  3476
dkc0.0.0.1009.0            DKC0                       RZ1BB-BS  0658
dkc100.1.0.1009.0          DKC100             SEAGATE ST34501W  0015
dva0.0.0.0.1               DVA0
ewa0.0.0.3.0               EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0            PKC0                  SCSI Bus ID 7  5.27
pqa0.0.0.4.0               PQA0                       PCI EIDE
pqb0.0.1.4.0               PQB0                       PCI EIDE</screen>

	<para>Este ejemplo es de una  Digital Personal Workstation 
	  433au y muestra tres discos instalados en el sistema.  
	  El primer disco es una unidad CDROM llamada 
	  <devicename>DKA0</devicename> y los otros dos reciben los nombres 
	  de <devicename>DKC0</devicename> y <devicename>DKC100</devicename> 
	  respectivamente.</para>

	<para>Los discos con nombres tipo  <devicename>DKx</devicename> 
	  son discos SCSI.  Por ejemplo <devicename>DKA100</devicename> 
	  se refiere a un disco SCSI con el <quote>target ID 1</quote> en 
	  el primer bus SCSI (A), mientras que <devicename>DKC300</devicename> 
	  es un disco SCSI con un ID 3 en el tercer bus SCSI (C).  
	  Los nombres de dispositivo <devicename>PKx</devicename> son para 
	  adaptadores de bus SCSI.  Como hemos visto en la salida de 
	  <literal>SHOW DEVICE</literal> las unidades CDROM SCSI se consideran 
	  del mismo modo que otros discos duros SCSI.</para>

	<para>Los discos IDE tienen nombres similares a <devicename>
	  DQx</devicename>, mientras que <devicename>PQx</devicename> es la 
	  controladora IDE asociada.</para>

      </sect3>
    </sect2>

    <sect2>
      <title>Recolecci&oacute;n de los detalles de la configuraci&oacute;n 
	de la red</title>

      <para>Si pretende conectarse a alguna red durante la instalaci&oacute;n 
	de &os; (por ejemplo, pretende hacerlo desde un sitio FTP o mediante 
	un servidor NFS), tendr&aacute; que conocer la configuraci&oacute;n de 
	su red.  Durante la instalaci&oacute;n se le pedir&aacute;n esos datos 
	para que &os; pueda conectarse a la red y realizar la 
	instalaci&oacute;n.</para>

      <sect3>
	<title>Conexi&oacute;n a una red Ethernet o a un m&oacute;dem 
	  Cable/DSL</title>

	<para>Necesitar&aacute; la siguiente informaci&oacute;n si va a 
	  conectarse a una red Ethernet o si tiene una conexi&oacute;n a 
	  Internet a trav&eacute;s de una adaptador Ethernet via cable o 
	  DSL:</para>

	<orderedlist>
	  <listitem>
	    <para>Direcci&oacute;n IP</para>
	  </listitem>

	  <listitem>
	    <para>Direcci&oacute;n IP de la pasarela (<quote>gateway</quote>, 
	      <quote>puerta de enlace</quote>)</para>
	  </listitem>

	  <listitem>
	    <para>Nombre del sistema (<quote>hostname</quote>)</para>
	  </listitem>

	  <listitem>
	    <para>Direcci&oacute;n IP del servidor DNS</para>
	  </listitem>

	  <listitem>
	    <para>M&aacute;scara de subred</para>
	  </listitem>
	</orderedlist>

	<para>Si no conoce estos datos p&oacute;ngase en contacto con su 
	  administrador de sistemas o con su proveedor de servicios.  Es 
	  que le digan que tal informaci&oacute;n se asigna 
	  autom&aacute;ticamente mediante <firstterm>DHCP</firstterm>.  
	  Si es as&iacute;, an&oacute;telo.</para>
      </sect3>

      <sect3>
	<title>Conexi&oacute;n mediante m&oacute;dem</title>

	<para>Si usted se conecta con su ISP mediante un m&oacute;dem 
	  tradicional sigue pudiendo instalar &os; a trav&eacute;s de 
	  Internet, el problema es que le resultar&aacute; bastante 
	  m&aacute;s largo que por otros medios.</para>

	<para>Necesitar&aacute; saber:</para>

	<orderedlist>
	  <listitem>
	    <para>El n&uacute;mero de tel&eacute;fono de su ISP a 
	       trav&eacute;s del que acceder&aacute; a Internet</para>
	  </listitem>

	  <listitem>
	    <para>El COM: el puerto al que est&aacute; conectado su 
	      su m&oacute;dem</para>
	  </listitem>

	  <listitem>
	    <para>Su nombre de usuario y su contrase&ntilde;a de acceso 
	      a Internet</para>
	  </listitem>
	</orderedlist>
      </sect3>
    </sect2>
    <sect2>
      <title>Consulte <quote>&os; Errata</quote></title>
      
      <para>A pesar de que el proyecto &os; hace todo lo humanamente posible 
	para asegurarse de que cada <quote>release</quote> de &os; es todo 
	lo estable posible a veces alg&uacute;n error logra entrar en 
	escena.  En contad&iacute;simas ocasiones esos errores llegan a 
	afectar al proceso de instalaci&oacute;n.  Cuando esos errores son 
	ubicados y corregidos se anotan en 
	<ulink url="http://www.FreeBSD.org/releases/&rel.current;R/errata.html">FreeBSD Errata</ulink>, en el sitio web de &os;.  Deber&iacute;a consultar 
	este texto antes de la instalaci&oacute;n para asegurarse de que 
	no hay problemas de &uacute;ltima hora de los que deba 
	preocuparse.</para>

      <para>Tiene informaci&oacute;n sobre las <quote>releases</quote>, 
	incluyendo la lista de erratas de cada una de ellas, en la 
	<ulink
	url="http://www.FreeBSD.org/releases/index.html">secci&oacute;n de 
	informaci&oacute;n de <quote>releases</quote> </ulink> del 
	<ulink
	  url="http://www.FreeBSD.org/index.html">sitio web de &os;</ulink>.</para>
    </sect2>

    <sect2>
      <title>Obtenci&oacute;n de los ficheros de instalaci&oacute;n de 
	&os;</title>

      <para>El proceso de instalaci&oacute;n de &os; permite instalar &os; 
	desde ficheros ubicados en cualquiera de los siguientes 
	sitios:</para>

      <itemizedlist>
	<title>Medios locales</title>
	
	<listitem>
	  <para>Un CDROM o DVD</para>
	</listitem>

	<listitem>
	  <para>Una partici&oacute;n DOS en la propia computadora</para>
	</listitem>

	<listitem>
	  <para>Una cinta SCSI o QIC</para>
	</listitem>

	<listitem>
	  <para>Discos floppy</para>
	</listitem>
      </itemizedlist>

      <itemizedlist>
	<title>Red</title>

	<listitem>
	  <para>Un sitio FTP, saliendo a trav&eacute;s de un cortafuegos o 
	    usando un proxy HTTP si fuera necesario</para>
	</listitem>

	<listitem>
	  <para>Un servidor NFS</para>
	</listitem>

	<listitem>
	  <para>Una conexi&oacute;n serie o a trav&eacute;s de una cable 
	    paralelo</para>
	</listitem>
      </itemizedlist>

      <para>Si ha adquirido &os; en CD o DVD ya tiene todo lo que 
	necesitar&aacute;, puede pasar a la siguiente secci&oacute;n: 
	(<xref linkend="install-floppies">).</para>

      <para>Si no dispone de los ficheros de instalaci&oacute;n de &os; 
	deber&iacute;a consultar 
	<xref linkend="install-diff-media">, donde se explica c&oacute;mo 
	preparar la instalaci&oacute;n de &os; desde cualquiera de los 
	medios listados anteriormente.  Tras leer esa secci&oacute;n puede 
	volver aqu&iacute; y leer 
	<xref linkend="install-floppies">.</para>
    </sect2>

    <sect2 id="install-floppies">
      <title>Preparaci&oacute;n del medio de arranque</title>
      
      <para>El proceso de instalaci&oacute;n de &os; comienza por arrancar 
	su sistema mediante el instalador de &os;: no es un programa que 
	pueda ejecutar desde otro sistema operativo.  Su sistema suele 
	arrancar usando el sistema operativo que est&aacute; instalado en 
	su disco duro pero puede tambi&eacute;n ser configurado para que 
	lo haga desde un floppy <quote>arrancable</quote>.  Las computadoras 
	m&aacute;s modernas pueden tambi&eacute;n arrancar desde un CDROM 
	introducido en la unidad CDROM.</para>

      <tip>
	<para>Si tiene &os; en CDROM o DVD (por haberlo comprado o haberlo 
	  preparado especialmente usted) y su sistema puede arracar desde 
	  CDROM o DVD (suele ser una opci&oacute;n de BIOS llamada 
	  <quote>Boot Order</quote> o algo similar) puede saltarse esta 
	  secci&oacute;n.  Las im&aacute;genes de CDROM o DVD de &os; 
	  permiten arrancar desde ellas y pueden emplearse para instalar 
	  &os; sin ninguna preparaci&oacute;n especial.</para>
      </tip>
    
      <para>Siga estos pasos para crear las im&aacute;genes que le 
	permitir&aacute;n arrancar desde floppy:</para>

      <procedure>
	<step>
	  <title>Consiga las im&aacute;genes de arranque desde 
	    floppy</title>
	  
	  <para>Los discos de arranque se encuentran en el directorio 
	    <filename>floppies/</filename> del medio de instalaci&oacute;n 
	    o pueden descargarse desde el directorio correspondiente de 
	    <literal>ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/<replaceable>&lt;arch&gt;</replaceable>/<replaceable>&lt;version&gt;</replaceable>-RELEASE/floppies/</literal>.  
	    Reemplace <replaceable>&lt;arch&gt;</replaceable> y 
	    <replaceable>&lt;version&gt;</replaceable> con la 
	    arquitectura y la versi&oacute;n de &os; que quiera instalar.  
	    Por ejemplo, las im&aacute;genes de arranque desde floppy para 
	    &os;&nbsp;&rel.current;-RELEASE para &i386; est&aacute;n en 
	    from <ulink url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/floppies/"></ulink>.</para>

	  <para>Las im&aacute;genes de floppy tienen la extensi&oacute;n 
	    <filename>.flp</filename>.  El directorio 
	    <filename>floppies/</filename> contiene diferentes im&aacute;genes 
	    y las que usted necesitar&aacute; depender&aacute;n de la 
	    versi&oacute;n de &os; que vaya a instalar y, en algunos casos, 
	    del hardware en el que lo va a instalar.  En la mayor&iacute;a de 
	    de los casos solamente usar&aacute; dos ficheros: 
	    <filename>kern.flp</filename> y 
	    <filename>mfsroot.flp</filename>.  La instalaci&oacute;n en 
	    algunos sistemas concretos requerir&aacute; controladores de 
	    dispositivo adicionales, que se encuentran en la imagen 
	    <filename>drivers.flp</filename>.  Consulte 
	    <filename>README.TXT</filename> en el propio directorio, 
	    ah&iacute; encontrar&aacute; la informaci&oacute;n m&aacute;s 
	    reciente sobre las im&aacute;genes.</para>

	  <important>
	    <para>Su programa de FTP debe usar <emphasis>
	      modo binario</emphasis> para descargar las im&aacute;genes.  
	      Algunos navegadores web son conocidos por usar el modo 
	      <emphasis>texto</emphasis> ( o <emphasis>ASCII</emphasis>).  
	      He aqu&iacute; lo primero a comprobar si no puede arrancar desde 
	      los disquetes que ha creado.</para>
	  </important>
	</step>

	<step>
	  <title>Preparaci&oacute;n de los discos floppy</title>
	  
	  <para>Tendr&aacute; que preperar un disquete por cada imagen que 
	    descargue.  Es imprescindible que esos discos carezcan de 
	    errores.  La forma m&aacute;s sencilla de asegurarlo es 
	    formatearlos usted.  No conf&iacute;e en disquetes 
	    preformateados.  La herramienta de formateo de &windows; no le 
	    advertir&aacute; del hallazgo de bloques defectuosos, 
	    si encuentra alguno sencillamente lo marcar&aacute; como 
	    <quote>defectuoso</quote> y lo ignorar&aacute;.  Le recomendamos 
	    que use disquetes nuevos si decide usar este procedimiento de 
	    instalaci&oacute;n.</para>

	  <important>
	    <para>Si instenta instalar &os; y el programa de 
	      instalaci&oacute;n falla, se queda congelado o sucede alguna 
	      otra cat&aacute;strofe uno de las primeras cosas de las que 
	      sospechar son los disquetes.  Escriba los ficheros 
	      de imagen en discos nuevos e int&eacute;ntelo de nuevo.</para>
	  </important>
	</step>

	<step>
	  <title>Escriba los ficheros de imagen en discos floppy (<quote>
	    disquetes</quote>)</title>

	  <para>Los ficheros <filename>.flp</filename> <emphasis>
	    no</emphasis> son ficheros normales que puedan copiarse 
	    a disco.  Son im&aacute;genes del contenido completo de los 
	    discos.  Esto significa que <emphasis>no puede</emphasis> 
	    simplemente copiar esos ficheros de un disco a otro.  Debe 
	    usar herramientas especializadas para escribir esas 
	    im&aacute;genes directamente al disco correspondiente.</para>

	  <indexterm><primary>DOS</primary></indexterm>
	  <para>Si va a crear los disquetes de arranque en un sistema en 
	    el que se est&aacute; ejecutando &ms-dos;/&windows; utilice 
	    la herramienta <command>fdimage</command>.</para>

	  <para>Si las im&aacute;genes est&aacute;n en el CDROM y su 
	    CDROM es la unidad <devicename>E:</devicename> ejecute lo 
	    siguiente:</para>

	  <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\kern.flp A:</userinput></screen>

	  <para>Repita el proceso con cada fichero <filename>.flp</filename> 
	    reemplazando cada vez el disquete y recuerde etiquetar los discos 
	    con el nombre del fichero que ha copiado en cada uno.  Modifique 
	    la l&iacute;nea del comando donde sea necesario, adapt&aacute;ndola 
	    al lugar donde tenga usted los ficheros <filename>.flp</filename>.  
	    <command>fdimage</command> puede descargarse desde el 
            directorio <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/tools/"><filename class="directory">tools</filename>
	   </ulink> del sitio FTP de &os;.</para>
	  
	  <para>Si va a crear los disquetes en un sistema &unix; (por ejemplo 
	    otro sistema &os;) puede utilizar &man.dd.1; para escribir las 
	    im&aacute;genes en los discos.  En &os; deber&iacute; 
	    ejecutar:</para>
	  
	  <screen>&prompt.root; <userinput>dd if=kern.flp of=/dev/fd0</userinput></screen>

	  <para>En &os; <filename>/dev/fd0</filename> es la primera 
	    unidad de disquetes (la unidad 
	    <devicename>A:</devicename>).  <filename>/dev/fd1</filename> 
	    ser&iacute;a la unidad <devicename>B:</devicename> y as&iacute; 
	    sucesivamente.  Otras versiones de &unix; pueden asignar 
	    nombres diferentes a las unidades de disquetes, consulte la 
	    documentaci&oacute;n de su sistema si lo estima oportuno.</para>
	</step>
      </procedure>

      <para>Ya podemos instalar instalar &os;.</para>
    </sect2>
  </sect1>

  <sect1 id="install-start">
    <title>Inicio de la instalaci&oacute;n</title>

    <important>
      <para>Por defecto la instalaci&oacute;n no efect&uacute;a ning&uacute;n 
	cambio en su disco o discos duros hasta la aparici&oacute;n del
	siguiente mensaje:</para>

      <literallayout class="monospaced">Last Chance: Are you SURE you want continue the installation?

If you're running this on a disk with data you wish to save then WE
STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding!

We can take no responsibility for lost disk contents!</literallayout>

	<para>Es decir:</para>
     <literallayout class="monospaced">&Uacute;ltima oportunidad: &iquest;Seguro que quiere proseguir con la instalación? 

&iexcl;Si está ejecutando este programa en un disco que contenga datos 
que quiera conservar LE RECOMENDAMOS ENCARECIDAMENTE QUE HAGA 
COPIAS DE SEGURIDAD FIABLES antes de proseguir!

¡No podemos responsabilizarnos de datos perdidos!</literallayout>


      <para>El proceso de instalaci&oacute;n puede abandonarse en cualquier 
	momento antes de la advertencia final sin efectuar cambios en el 
	contenido del disco duro.  Si advierte que ha configurado algo 
	de forma incorrecta basta con que apague su sistema y no 
	estropear&aacute; nada.</para>
    </important>

    <sect2 id="install-starting">
      <title>El arranque</title>

      <sect3 id="install-starting-i386">
        <title>El arranque en &i386;</title>

      <procedure>
	<step>
	  <para>Comience con su sistema apagado.</para>
	</step>

	<step>
	  <para>Arranque el sistema.  Durante el arranque deber&iacute; 
	    mostrarse la opci&oacute;n para entrar en la BIOS, normalmente 
	    mediante las teclas <keycap>F2</keycap>, <keycap>F10</keycap>, 
	    <keycap>Del</keycap>, o 
	    <keycombo action="simul"> 
	      <keycap>Alt</keycap> 
	      <keycap>S</keycap> 
	    </keycombo>.  Utilice la tecla o combinaci&oacute;n de las mismas 
	    que se le indique en pantalla.  En algunos casos el sistema puede 
	    mostrar un gr&aacute;fico durante el arranque.  Pulsar 
	    <keycap>Esc</keycap> suele disminu&iacute;r en esos casos el 
	    tama&ntilde;o del gr&aacute;fico y le permitir&aacute; ver 
	    los mensajes del arranque.</para>
	</step>

	<step>
	  <para>Encuentre el par&aacute;metro que controla desde qu&eacute; 
	    dispositivos arranca el sistema.  Normalmente se llama 
	    <quote>Boot Order</quote> y suele presentarse como una lista 
	    de dispositivos, como <literal>Floppy</literal>, 
	    <literal>CDROM</literal>, <literal>First Hard Disk</literal>, 
	    etc.</para>

	  <para>Si necesita disquetes de arranque aseg&uacute;rese de que 
	    selecciona la unidad correspondiente.  Si va a arrancar desde 
	    CDROM, seleccione la unidad CDROM.  En caso de duda consulte el 
	    manual que ven&iacute;a con su computadora y/o el de su placa 
	    base.</para>

	  <para>Haga los cambios necesarios, guarde los cambios y salga.  
	    El sistema deber&iacute;a reiniciarse.</para>
	</step>

	<step>
	  <para>Si ha elegido arrancar desde disquete, tal y como se describe 
	    en <xref linkend="install-floppies">, uno de ellos ser&aacute; 
	    el primer disco de arranque, probablemente el que contiene 
	    <filename>kern.flp</filename>.  Introduzca ese disco en su 
	    unidad de disquetes.</para>

	  <para>Si va a arrancar desde CDROM tendr&aacute; que arrancar el 
	    sistema e introducir el CDROM en cuanto tenga 
	    ocasi&oacute;n.</para>

	  <para>Si su sistema arranca normalmente y carga el sistema 
	    operativo que ya est&aacute; instalado puede ocurrir alguna 
	    de estas cosas:</para>

	  <orderedlist>
	    <listitem>
	      <para>Los discos no se introdujeron lo suficientemente pronto 
		en el proceso de arranque.  D&eacute;jelos insertados y 
		reinicie su sistema.</para>
	    </listitem>

	    <listitem>
	      <para>Los cambios que hizo en la BIOS no han funcionado.  
		Deber&iacute;a repetir los pasos previos hasta que d&eacute; 
		con la opci&oacute;n correcta.</para>
	    </listitem>

	    <listitem>
	      <para>Su BIOS en concreto no admite el arranque el arranque 
		desde el medio que ha elegido.</para>
	    </listitem>
	</orderedlist>
	</step>
    
	<step>
	  <para>&os; comenzar&aacute; a arrancar.  Si est&aacute; arrancando 
	    desde CDROM deber&iacute;a ver algo parecido a esto (se ha omitido 
	    la informaci&oacute;n de n&uacute;mero de versi&oacute;n):</para>
	  
	  <screen>Verifying DMI Pool Data ........
Boot from ATAPI CD-ROM :
 1. FD 2.88MB  System Type-(00)
Uncompressing ... done

BTX loader 1.00 BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive B: is disk1
BIOS drive C: is disk2
BIOS drive D: is disk3
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

|
Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>
	
	  <para>Si arranca desde floppy ver&aacute; algo parecido a esto 
	    (se ha omitido la informaci&oacute;n de n&uacute;mero de 
	    versi&oacute;n):</para>
	
	  <screen>Verifying DMI Pool Data ........ 

BTX loader 1.00  BTX version is 1.01 
Console: internal video/keyboard 
BIOS drive A: is disk0 
BIOS drive C: is disk1 
BIOS 639kB/261120kB available memory 

FreeBSD/i386 bootstrap loader, Revision 0.8 

/kernel text=0x277391 data=0x3268c+0x332a8 |

Please insert MFS root floppy and press enter:</screen>

	  <para>Siga las instrucciones y extraiga el disco 
	    <filename>kern.flp</filename> disc, inserte el disco 
	    <filename>mfsroot.flp</filename> y presione 
	    <keycap>Intro</keycap>.</para>
	</step>

	<step>
	  <para>Tanto si arranca desde disquete como CDROM el proceso 
	    de arranque llegar&aacute; a este punto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt. 
Booting [kernel] in 9 seconds... _</screen>

	  <para>Dicho y hecho: espere diez segundos o pulse 
	    <keycap>Enter</keycap>.  Esto lanzar&aacute; el men&uacute; de 
	    configuraci&oacute;n del kernel.</para>
	</step>
      </procedure>

      </sect3>
      <sect3>
        <title>Arranque en Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

      <procedure>
	<step>
	  <para>Comience con su sistema apagado.</para>
	</step>

	<step>
	  <para>Encienda su computadora y espera un mensaje de arranque 
	    en el monitor.</para>
        </step>

	<step>
	  <para>Si va a arrancar desde disquetes, tal y como se describe en 
	    <xref linkend="install-floppies">, uno de ellos ser&aacute; el 
	    primer disco de arranque, probablemente el que contiene 
	    <filename>kern.flp</filename>.  Ponga este disco en la unidad de 
	    disquetes y escriba el siguiente comando para lanzar el arranque 
	    desde el disco (corrija el nombre de su unidad de disquetes si 
	    fuera necesario):</para>

	  <screen>&gt;&gt;&gt;<userinput>BOOT DVA0 -FLAGS '' -FILE ''</userinput></screen>

	  <para>Si va a arrancar desde CDROM introduzca el CDROM en la 
	    unidad y escriba el siguiente comando para iniciar la 
	    instalaci&oacute;n (corrija el nombre de la unidad correcta de 
	    CDROM si fuera necesario):</para>

          <screen>&gt;&gt;&gt;<userinput>BOOT DKA0 -FLAGS '' -FILE ''</userinput></screen>
	</step>
    
	<step>
	  <para>&os; comenzar&aacute; a arrancar.  Si est&aacute; arrancando 
	    desde disquete llegado un cierto punto ver&aacute; usted este 
	    mensaje:</para>

	  <screen>Please insert MFS root floppy and press enter:</screen>

	  <para>Siga las instrucciones del programa de instalaci&oacute;n y 
	     retire el disco <filename>kern.flp</filename>, inserte el 
	    disco <filename>mfsroot.flp</filename>y pulse 
	    <keycap>Intro</keycap>.</para>
	</step>

	<step>
	  <para>Tanto si arranc&oacute;n desde disquete como desde CDROM 
	    el proceso de arranque llegar&aacute; a este punto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt. 
Booting [kernel] in 9 seconds... _</screen>

	  <para>Dicho y hecho: Espere diez segundos o pulse 
	    <keycap>Enter</keycap>.  Esto iniciar&aacute; el men&uacute; 
	    de configuraci&oacute;n del kernel.</para>
	</step>
      </procedure>

      </sect3>

    </sect2>

    <sect2 id="start-userconfig">
      <title>Configuraci&oacute;n del kernel</title>

      <note><para>A partir de &os; 5.0 y siguientes userconfig ha sido 
	sustituido por el m&eacute;todo &man.device.hints.5;.  Para 
	m&aacute;s informaci&oacute;n sobre &man.device.hints.5; consulte 
	<xref linkend="device-hints"></para></note>

      <para>El <firstterm>kernel</firstterm> es el n&uacute;cleo del 
	sistema operativo.  Es el responsable de muchas cosas como 
	el acceso a todos los dispositivos que pueda tener en el sistema, 
	como discos duros, tarjetas de red, tarjetas de sonido, etc.  Cada 
	dispositivo que administra el kernel de &os; tiene un controlador 
	(<quote>driver</quote>) asociado.  Cada controlador tiene un nombre 
	de dos o tres letras como <devicename>sa</devicename>, que es el 
	controlador de acceso secuencial SCSI, o  <devicename>sio</devicename>, 
	el controlador I/O Serie (que gestiona los puertos COM).</para>

      <para>Cuando arranca el kernel cada controlador chequea el sistema 
	para saber si el hardware que &eacute;l soporta existe en el 
	sistema.  Si es as&iacute; el controlador configura el hardware y 
	lo convierte en accesible para el resto del kernel.</para>

      <para>Se suele llamar a este chequeo <firstterm>device 
	probing</firstterm> (<quote>prueba de controladores</quote>).  Por 
	desgracia no siempre es posible ejecutarlo correctamente.  Ciertos 
	controladores de hardware no coexisten muy bien y probar un 
	dispositivo f&iacute;sico concreto puede dejar otro en un estado 
	inconsistente.  La culpa es de una limitaci&oacute;n b&aacute;sica 
	del dise&ntilde;o del <acronym>PC</acronym>.</para>

      <para>Muchos dispositivos ant&iacute;guos reciben el nombre de ISA 
	(el opuesto de los dispositivos PCI).  La especificaci&oacute;n ISA 
	exige que cada dispositivo tenga cierta informaci&oacute;n escrita 
	en &eacute;l, normalmente el n&uacute;mero de IRQ y la direcci&oacute;n 
	de puerto IO que el controlador usa.  Esta informaci&oacute;n suele 
	asignarse mediante <firstterm>jumpers</firstterm> f&iacute;sicos en la 
	propia tarjeta y tambi&eacute;n con un programa de DOS.</para>

      <para>Esto era con frecuencia un foco de problemas porque no era posible 
	tener dos dispositivos que compartieran la misma IRQ o direcci&oacute;n 
	de puerto.</para>

      <para>Los nuevos dispositivos siguen la especificaci&oacute;n PCI, que 
	no requiere esto, de forma que se supone que los dispositivos 
	cooperar&aacute;n con la BIOS y que se les puede asignar qu&eacute; 
	IRQ o qu&eacute; direcci&oacute;n de puerto IO usar&aacute;n.</para>

      <para>Si tiene alg&uacute;n dispositivo ISA en su sistema el controlador 
	de &os; que manejar&aacute; ese dispositivo necesitar&aacute; ser 
	configurado con la IRQ y la direcci&oacute;n de puerto que le haya 
	asignado usted al dispositivo.  Esta es la raz&oacute;n de que 
	le recomend&aacute;ramos mantener una lista de su hardware 
	(consulte <xref
	linkend="install-inventory">), le puede ser &uacute;til.</para>

      <para>Por desgracia las IRQ y los puertos de memoria que usan algunos 
	controladores provocan conflictos.  Esto se debe a que algunos 
	dispositivos ISA vienen de f&aacute;brica con IRQ y direcciones de 
	memoria que provocan conflictos.  Los controladores de &os;, por 
	defecto, tienden intencionadamente a replicar los valores por 
	defecto de los fabricantes para que la mayor&iacute;a de dispositivos 
	funcionen sin intervenci&oacute;n por nuestra parte.</para>

      <para>Esto casi nunca es un problema en el uso diario de &os;.  
	Su sistema raramente tendr&aacute; dos dispositivos hardware 
	que choquen porque uno de ellos no funcionar&aacute; 
	(independientemente del sistema operativo que use).</para>

      <para>Cuando s&iacute; que es un problema es al instalar &os; porque 
	el kernel que se usa durante la instalaci&oacute;n ha de contener 
	el m&aacute;ximo posible de controladores, de forma que pueda 
	funcionar en la mayor variedad posible de hardware.  Esto conlleva 
	que algunos de esos controladores tendr&aacute;n configuraciones 
	conflictivas.  Los dispositivos se prueban en un orden estricto y 
	si tiene usted en el sistema un dispositivo que es probado muy tarde 
	dentro del proceso, pero choca con uno que ha sido probado al 
	principio, su hardware podr&iacute;a no funcionar o no se probado 
	correctamente cuando instale &os;.</para>

      <para>A causa de esto lo primero que tiene ocasi&oacute;n de hacer 
	al instalar &os; es ver la lista de controladores que hay configurados 
	en el kernel; desde ella puede desactivar algunos si no tiene 
	dispositivos que los necesiten o confirmar (y modificar) la 
	configuraci&oacute;n si tiene el dispositivo pero la 
	configuraci&oacute;n por defecto est&aacute; equivocada.</para>

      <para>Probablemente esto suena mucho m&aacute;s complicado de lo que 
	en realidad es.</para>

      <para>La <xref linkend="kernel-config"> muestra el primer men&uacute; 
	de configuraci&oacute;n del kernel.  Le recomendamos que elija 
	la opci&oacute;n <guimenuitem>Start kernel configuration in full-screen 
	visual mode</guimenuitem> (<quote>Arrancar el modo visual de 
	configuraci&oacute;n del kernel a pantalla completa</quote>), 
	puesto que es el interfaz m&aacute;s sencillo para nuevos 
	usuarios.</para>

      <figure id="kernel-config">
	<title>Men&uacute; de configuraci&oacute;n del kernel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig" format="PNG">
	  </imageobject>

	  <textobject>
	    <screen>&txt.install.userconfig;</screen>
	  </textobject>
	</mediaobject>
      </figure>

      <para>La pantalla de configuraci&oacute;n del kernel 
	(<xref linkend="fig-userconfig">) se divide en cuatro 
	secciones:</para>

      <orderedlist>
	<listitem>
          <para>Una lista (que puede ocultarse) con todos los controladores 
	    marcados como <quote>activo</quote>, subdividida a su vez en 
	    grupos como <literal>Storage</literal> (almacenamiento) y 
	    <literal>Network</literal> (Red).  Cada controlador muestra una 
	    descripci&oacute;n, su nombre de dos o tres letras y la IRQ y la 
	    direcci&oacute;n de memoria que usa el controlador.  Adem&aacute;s, 
	    si un controlador activo choca con otro controlador activo 
	    aparece <literal>CONF</literal> junto al nombre del 
	    controlador.  Esta secci&oacute;n muestra tambi&eacute;n el 
	    total de controladores con conflictos que hay activados.</para>
	</listitem>

	<listitem>
          <para>Los controladores marcados como inactivos.  Permanecen en el 
	    kernel pero no buscar&aacute;n su dispositivo cuando arranque el 
	    kernel.  Se subdividen en grupos de la misma manera que la lista 
	    de controladores activos.</para>
	</listitem>

	<listitem>
	  <para>Detalles m&aacute;s exhaustivos sobre el controlador 
	    seleccionado, incluyendo su IRQ y direcci&oacute;n de puerto de 
	    memoria.</para>
	</listitem>

	<listitem>
	  <para>Informaci&oacute;n sobre los atajos de teclado que pueden 
	    emplearse en pantalla.</para>
	</listitem>
      </orderedlist>

      <figure id="fig-userconfig">
	<title>El interfaz visual de configuraci&oacute;n de 
	  dispositivos del kernel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig2" format="PNG">
	  </imageobject>

          <textobject>
            <screen>&txt.install.userconfig2;</screen>
          </textobject>
        </mediaobject>
      </figure>

      <para>No se preocupe por los conflictos que aparezcan puesto que 
	algo as&iacute; era de esperar.  Tenga en cuenta que todos los 
	controladores est&aacute;n activados y, como ya se ha dicho, algunos 
	entrar&aacute;n en conflicto con otros.</para>

      <para>Ahora tendr&aacute; que moverse por la lista de controladores 
	resolviendo conflictos.</para>

      <procedure>
	<title>Resoluci&oacute;n de conflictos de dispositivos</title>

	<step>
	  <para>Pulse <keycap>X</keycap>.  Esto expandir&aacute; toda la 
	    lista de controladores para que pueda verlos todos.  Tendr&aacute; 
	    que usar las flechas del teclado para moverse arriba y abajo por 
	    la lista de controladores activos.</para>

	  <para>La <xref linkend="hardware-conflicts"> muestra lo que sucede al 
	    pulsar <keycap>X</keycap>.</para>

	  <figure id="hardware-conflicts">
	    <title>Lista expandida de controladores</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/hdwrconf" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>

	<step>
	  <para>Desactive todos los controladores de dispositivos que no 
	    no tenga.  Para desactivar un controlador, m&aacute;rquelo con 
	    las flechas y pulse <keycap>Del</keycap>.  El controlador 
	    pasa a la lista <literal>Inactive Drivers</literal> (Controladores 
	    Inactivos).</para>

	  <para>Si ha desactivado sin querer un controlador que necesita 
	    pulse <keycap>Tab</keycap> para pasar a la lista 
	    <literal>Inactive Drivers</literal>, seleccione el controlador 
	    que hab&iacute;a desactivado y pulse <keycap>Enter</keycap> 
	    para devolverlo a la lista activa.</para>

	  <warning>
	    <para>No desactive <devicename>sc0</devicename>.  Controla la 
	      pantalla y lo necesitar&aacute; a menos que est&eacute; 
	      instalando a trav&eacute;s de un cable serie.</para>
	  </warning>

	  <warning>
	    <para>S&oacute;lo desactive <devicename>atkbd0</devicename> si 
	      est&aacute; usted usando un teclado USB.  Si tiene un teclado 
	      normal debe mantener <devicename>atkbd0</devicename>.</para>
	  </warning>
	</step>

	<step>
	  <para>Si no aparecen conflictos puede saltar este paso.  Si aparecen 
	    conflictos, tendr&aacute; que examinarlos.  Si no tienen la 
	    indicaci&oacute;n de <quote>allowed conflict</quote> (conflicto 
	    asumido) en el &aacute;rea de mensajes, tendr&aacute; que cambiar 
	    la IRQ/direcci&oacute;n en la que se est&aacute; probando el 
	    dispositivo <emphasis>o</emphasis> la IRQ/direcci&oacute;n debe 
	    cambiarse en el propio hardware.</para>

	  <para>Para cambiar la IRQ y la direcci&oacute;n del puerto IO del 
	    controlador seleccione el dispositivo y presione <keycap>
	    Intro</keycap>.  El cursor pasar&aacute; a la tercera 
	    secci&oacute;n de la pantalla y podr&aacute; usted cambiar los 
	    valores.  Deber&iacute;a introducir los valores de IRQ y 
	    direcci&oacute;n de memoria que obtuvo cuando hizo su inventario 
	    de hardware.  Pulse <keycap>Q</keycap> para finalizar la 
	    edici&oacute;n de la configuraci&oacute;n del dispositivo y 
	    volver a la lista de controladores activos.</para>
	  
	  <para>Si no est&aacute; seguro de qu&eacute; debiera poner puede 
	    probar con <literal>-1</literal>.  Algunos controladores de 
	    dispositivo de &os; pueden probar el hardware para averiguar 
	    los valores de correctos que deben usar para su 
	    configuraci&oacute;n  y el valor de <literal>-1</literal> los 
	    configura para ello.</para>

	  <para>El procedimiento para cambiar la direcci&oacute;n en el 
	    hardware var&iacute;a de un dispositivo a otro.  En algunos 
	    dispositivos puede ser necesario extraer f&iacute;sicamente 
	    la tarjeta del sistema y ajustar la configuraci&oacute;n de los 
	    <quote>jumpers</quote>.  Otras tarjetas pueden venir con un 
	    disquete para DOS que contiene programas a trav&eacute;s de los 
	    cuales es posible reconfigurar la tarjeta.  En cualquier caso 
	    tendr&aacute; que recurrir a la documentaci&oacute;n del 
	    dispositivo.  Cuando tenga todos los detalles puede volver a 
	    la instalaci&oacute;n de &os; una vez reconfigurada su 
	    tarjeta.</para>
	</step>

	<step>
	  <para>Una vez subsanados todos los conflictos deber&iacute;a poder 
	    ver una pantalla similar a <xref linkend="userconfig-done">.</para>

	  <figure id="userconfig-done">
	    <title>Configuraci&oacute;n de controladores sin 
	      conflictos</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/probstart" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>

	  <para>La lista de controladores activos ahora es mucho m&aacute;s 
	    corta, como puede ver. S&oacute;lo se muestran los controladores 
	    necesarios para gestionar el hardware de que disponemos.</para>
	  
	  <para>Ahora pueden guardarse los cambios hechos en la 
	    configuraci&oacute;n y pasar al siguiente punto de la 
	    instalaci&oacute;n.  Pulse  Press <keycap>Q</keycap> para salir 
	    del interfaz de configuraci&oacute;n de dispositivos.  Ver&aacute; 
	    este mensaje:</para>

	  <screen>Save these parameters before exiting? ([Y]es/[N]o/[C]ancel)</screen>

	  <para>Responda <keycap>Y</keycap> para guardar los par&aacute;metros 
	    en memoria (se guardar&aacute;n en disco al finalizar la 
	    instalaci&oacute;n) y comenzar&aacute; el chequeo del sistema.  
	    Tras mostrar en pantalla los resultados en texto negro sobre 
	    blanco, <application>sysinstall</application> mostrar&aacute; su 
	    men&uacute; principal.  
	    (<xref linkend="sysinstall-main">).</para>

	  <figure id="sysinstall-main">
	    <title>El men&uacute; principal de sysinstall</title>
	    
	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/main1" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>
      </procedure>
    </sect2>

    <sect2 id="view-probe">
      <title>Revisi&oacute;n de los resultados de la prueba de 
	de dispositivos</title>

      <para>Es posible revisar los &uacute;ltimos cientos de l&iacute;neas 
	que se han mostrado en pantalla, pues se almacenan en un <quote>
	buffer</quote> con ese prop&oacute;sito.</para>

      <para>Pulse <keycap>Bloq Despl</keycap> (<keycap>Scroll Lock</keycap>) 
	y ya puede revisar el buffer.  Para moverse puede usar las flechas o 
	<keycap>ReP&aacute;g</keycap> y  <keycap>AvP&aacute;g</keycap> 
	( <keycap>PageUp</keycap> y <keycap>PageDown</keycap> 
	respectivamente).  Pulse de nuevo <keycap>Bloq Despl</keycap> cuando 
	quiera salir del <quote>buffer</quote>.</para>

      <para>Pru&eacute;belo, revise el texto que gener&oacute; el kernel tras 
	probar los dispositivos.  Ver&aacute; un texto muy similar a 
	<xref linkend="install-dev-probe">, aunque en su caso concreto 
	el texto diferir&aacute; al mostrar los dispositivos que tenga usted 
	en su sistema.</para>

      <figure id="install-dev-probe">
	<title>Un ejemplo de resultado de prueba de dispositivos</title>

	<screen>avail memory = 253050880 (247120K bytes) 
Preloaded elf kernel "kernel" at 0xc0817000.
Preloaded mfs_root "/mfsroot" at 0xc0817084.
md0: Preloaded image &lt;/mfsroot&gt; 4423680 bytes at 0xc03ddcd4

md1: Malloc disk
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard   
npx0: INT 16 interface   
pcib0: &lt;Host to PCI bridge&gt; on motherboard
pci0: &lt;PCI bus&gt; on pcib0
pcib1:&lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0
pci1: &lt;PCI bus&gt; on pcib1
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0
isa0: &lt;iSA bus&gt; on isab0
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0
ata0: at 0x1f0 irq 14 on atapci0
ata1: at 0x170 irq 15 on atapci0
uhci0 &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci
0
usb0: &lt;VIA 83572 USB controller&gt; on uhci0
usb0: USB revision 1.0
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr1
uhub0: 2 ports with 2 removable, self powered
pci0: &lt;unknown card&gt; (vendor=0x1106, dev=0x3040) at 7.3
dc0: &lt;ADMtek AN985 10/100BaseTX&gt; port 0xe800-0xe8ff mem 0xdb000000-0xeb0003ff ir
q 11 at device 8.0 on pci0
dc0: Ethernet address: 00:04:5a:74:6b:b5
miibus0: &lt;MII bus&gt; on dc0
ukphy0: &lt;Generic IEEE 802.3u media interface&gt; on miibus0
ukphy0: 10baseT, 10baseT-FDX, 100baseTX, 100baseTX-FDX, auto
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xec00-0xec1f irq 9 at device 10.
0 on pci0
ed0 address 52:54:05:de:73:1b, type NE2000 (16 bit)
isa0: too many dependant configs (8)
isa0: unexpected small tag 14
orm0: &lt;Option ROM&gt; at iomem 0xc0000-0xc7fff on isa0
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq2 on isa0
fdc0: FIFO enabled, 8 bytes threshold
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0
atkbdc0: &lt;Keyboard controller (i8042)&gt; at port 0x60,0x64 on isa0
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq1 on atkbdc0
kbd0 at atkbd0
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0
psm0: model Generic PS/@ mouse, device ID 0
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x100 on isa0
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt;
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0
sio0: type 16550A
sio1 at port 0x2f8-0x2ff irq 3 on isa0
sio1: type 16550A
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
pppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
ppc0: FIFO with 16/16/15 bytes threshold
plip0: &lt;PLIP network interface&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master UDMA33
acd0: CD-RW &lt;LITE-ON LTR-1210B&gt; at ata1-slave PIO4
Mounting root from ufs:/dev/md0c
/stand/sysinstall running as init on vty0</screen>
      </figure>

      <para>Compruebe cuidadosamente que &os; haya encontrado todos los 
	dispositivos que debe encontrar.  Si no se lista  alg&uacute;n 
	dispositivo, &os; no lo ha encontrado.  Si el controlador del 
	dispositivo requer&iacute;a configuraci&oacute;n de IRQ y puerto de 
	memoria compruebe que los datos que introduzco eran 
	correctos.</para>

      <para>Si necesita retocar algo en el chequeo de dispositivos UserConfig 
	no tiene m&aacute;s que salir de <application>sysinstall</application> 
	y arrancarlo de nuevo.  Tampoco es mala idea del todo si no est&aacute; 
	muy familiarizado con el proceso de instalaci&oacute;n de &os;.</para>

      <figure id="sysinstall-exit">
	<title>Seleccionar la salida de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/sysinstall-exit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Use las flechas para seleccionar 
	<guimenuitem>Exit Install</guimenuitem> en el men&uacute; de la 
	pantalla principal de instalaci&oacute;n.  Aparecer&aacute; el 
	siguiente mensaje:</para>


      <screen>                      User Confirmation Requested 
         Are you sure you wish to exit? The system will reboot 
           (be sure to remove any floppies from the drives).

                            [ Yes ]    No</screen>

      <para>El programa de instalaci&oacute;n comenzar&aacute; de nuevo si
	deja el CDROM en la unidad y ha seleccionado &gui.yes;.</para>

      <para>Si va a arrancar desde disquetes tendr&aacute; que retirar el 
	floppy <filename>mfsroot.flp</filename> e introducir en la unidad 
	<filename>kern.flp</filename> antes de reiniciar.</para>
    </sect2>
  </sect1>

  <sect1 id="using-sysinstall">
    <title>Introducci&oacute;n a sysinstall</title>

    <para><application>sysinstall</application> es la herramienta de 
      instalaci&oacute;n que proporciona el Proyecto &os;.  Es orientado a 
      pantalla y se divide en diferentes men&uacute;s y pantallas que puede 
      usar para configurar y controlar el proceso de instalaci&oacute;n.</para>

    <para>El sistema de men&uacute;s de <application>sysinstall</application> 
      puede recorrerse y manejarse a trav&eacute;s del teclado: 
      <keycap>Intro</keycap>, <keycap>Espacio</keycap>, las flechas y otras 
      teclas.  Tiene una descripci&oacute;n detallada de las funciones de 
      de esas teclas en la ayuda de 
      <application>sysinstall</application>.</para>

    <para>Si quiere consultarla seleccione <guimenuitem>Usage</guimenuitem> 
      y que el bot&oacute;n <guibutton>[Select]</guibutton> est&aacute; 
      seleccionado, tal y como se describe en <xref
      linkend="sysinstall-main3">, y luego pulse <keycap>Intro</keycap>.</para>

    <para>Se le mostrar&aacute;n las instrucciones para poder usar los 
      men&uacute;s.  Una vez revisadas puede pulsar <keycap>Intro</keycap> 
      para regresar al men&uacute; principal.</para>

    <figure id="sysinstall-main3">
      <title>Uso de la selecci&oacute;n en el men&uacute; principal de 
	de sysinstall</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/main1" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <sect2 id="select-doc">
      <title>Selecci&oacute;n del men&uacute; de documentaci&oacute;n</title>

      <para>Desde el men&uacute; principal seleccione 
	<guimenuitem>Doc</guimenuitem> con las flechas y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="main-doc">
 	<title>Selecci&oacute;n del men&uacute; de documentaci&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-doc" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Esto mostrar&aacute; el men&uacute; de documentaci&oacute;n</para>

      <figure id="docmenu1">
	<title>El men&uacute; de documentaci&oacute;n de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/docmenu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Es muy importante que lea la documentaci&oacute;n que 
	incluye sysinstall.</para>

      <para>Si desea consultar un documento selecci&oacute;nelo con las 
	flechas y pulse <keycap>Intro</keycap>.  Cuando acabe pulse de 
	nuevo <keycap>Intro</keycap> y volver&aacute; al men&uacute; de 
	documentaci&oacute;n.</para>

      <para>Si desea regresar al men&uacute; principal de la 
	instalaci&oacute;n seleccione <guimenuitem>Exit</guimenuitem>
	y pulse <keycap>Intro</keycap>.</para>
    </sect2>

    <sect2 id="keymap">
      <title>Selecci&oacute;n del men&uacute; de mapas de teclado</title>

      <para>Si quiere cambiar su esquema de teclado seleccione mediante 
	las flechas <guimenuitem>Keymap</guimenuitem> y pulse 
	<keycap>Intro</keycap>.  Haga esto si su teclado no sigue 
	el est&aacute;ndar de los EEUU de Am&eacute;rica.</para>

      <figure id="sysinstall-keymap">
	<title>Men&uacute; principal de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La elecci&oacute;n de un mapa de teclado se hace del siguiente 
	modo: seleccione uno de la lista mediante las flechas arriba/abajo y 
	pulse <keycap>Espacio</keycap>.  Si pulsa <keycap>Espacio</keycap> de 
	nuevo anular&aacute; la selecci&oacute;n.  Cuando est&eacute; seguro 
	con su elecci&oacute;n seleccione &gui.ok; mediante las flechas y 
	pulse <keycap>Intro</keycap>.</para>

      <para>En esta pantalla s&oacute;lo se presenta parte de la lista.  
	Seleccione &gui.cancel; mediante <keycap>Tabulador</keycap> si quiere 
	seguir usando el mapa de teclado por defecto y regresar al 
	men&uacute; principal de instalaci&oacute;n.</para>

      <figure id="sysinstall-keymap-menu">
	<title>Men&uacute; de mapas de teclado de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

    </sect2>

    <sect2 id="viewsetoptions">
      <title>Pantalla de opciones de instalaci&oacute;n</title>

    <para>Seleccione <guimenuitem>Options</guimenuitem> y pulse 
	<keycap>Intro</keycap>.</para>

    <figure id="sysinstall-options">
      <title>Men&uacute; principal de sysinstall</title>

      <mediaobject>
        <imageobject>
	  <imagedata fileref="install/main-options" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

      <figure id="options">
	<title>Opciones de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/options" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Los valores por defecto deber&iacute;n ser adecuados para la 
	mayor&iacute;a de usuarios.  El n&uacute;mero de <quote>
	release</quote> puede variar seg&uacute;n la versi&oacute;n que 
	est&eacute; instalando.</para>

      <para>La descripci&oacute;n de lo que haya elegido aparecer&aacute; 
	al final de la pantalla resaltado en azul.  Tenga en cuenta que una 
	de las opciones es <guimenuitem>Use Defaults</guimenuitem> 
	(<quote>Usar la configuraci&oacute;n por defecto</quote>) y 
	todos los valores a sus valores de partida.</para>

      <para>Pulse <keycap>F1</keycap> si quiere leer la pantalla de ayuda 
	de las opciones que se le ofrecen.</para>

      <para>Pulse <keycap>Q</keycap> para volver al men&uacute; principal de 
	instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="start-install">
      <title>Comenzar una instalaci&oacute;n est&aacute;ndar</title>

      <para>La instalaci&oacute;n <guimenuitem>Standard</guimenuitem> es 
	la opci&oacute;n m&aacute;s recomendable para reci&eacute;n llegados 
	a &unix; y &os;.  Mediante las flechas seleccione 
	<guimenuitem>Standard</guimenuitem> y para comenzar la 
	instalaci&oacute;n pulse <keycap>Intro</keycap>.</para>

      <figure id="sysinstall-standard">
	<title>Comienzo de una instalaci&oacute;n est&aacute;ndar</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-std" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-steps">
    <title>Asignaci&oacute;n de espacio en disco</title>

    <para>Lo primero que tiene que hacer es asignar espacio en disco para 
      &os; y marcar dicho espacio de modo que <application>
      sysinstall</application> pueda dejarlo listo para su uso.  Para ello 
      necesita saber c&oacute;mo espera &os; encontrar la informaci&oacute;n 
      del disco.</para>

    <sect2 id="install-drive-bios-numbering">
      <title>Numeraci&oacute;n de unidades desde el punto de vista de la 
	BIOS</title>

      <para>Antes de que instale y configure &os; en su sistema hay una 
	cosa m&aacute;s de la que preocuparse, especialmente si tiene 
	m&aacute;s de un disco duro.</para>

      <indexterm><primary>DOS</primary></indexterm>
      <indexterm><primary>Microsoft Windows</primary></indexterm>
      <para>La BIOS es capaz de abstraer el orden normal de los discos si 
	hablamos de un PC en el que se est&aacute; ejecutando un sistema 
	operativo <quote>BIOS-dependiente</quote> como &ms-dos; o 
	&microsoft.windows;, que admiten esos cambios sin problemas.  
	Tal cosa permite al usuario arrancar desde un disco duro distinto del 
	llamado <quote>maestro principal</quote>.  Esto es muy conveniente 
	en el caso de algunos usuarios que han encontrado el sistema m&aacute;s 
	simple y barato de disponer de un sistema <quote>backup</quote>: 
	un segundo disco duro id&eacute;ntico y copiar peri&oacute;dicamente 
	la primera unidad en la segunda mediante 
	<application><trademark class="registered">Ghost</trademark></application> or <application>XCOPY</application>
	.  As&iacute;, si la primera unidad falla, sufre el ataque de 
	alg&uacute;n virus o padece las consecuencias de un defecto del 
	sistema operativo, s&oacute;lo tiene que decirle a BIOS que 
	interpole l&oacute;gicamente las unidades.  Es como si intercambiara 
	las conexiones de los discos sin tener que abrir la caja del 
	sistema.</para>

      <indexterm><primary>SCSI</primary></indexterm>
      <indexterm><primary>BIOS</primary></indexterm>
      <para>En sistemas m&aacute;s caros a veces pueden encontrarse·
	controladoras SCSI que incorporan extensiones BIOS, que permite 
	organizar hasta siete unidades SCSI de un modo muy similar.</para>

      <para>Cualquiera que est&eacute; acostumbrado a usar tales 
	t&eacute;cnicas puede recibir una sorpresa al intentar practicarlas 
	en &os;.  &os; no usa la BIOS y no tiene en cuenta en absoluto la 
	<quote>notaci&oacute;n de unidades l&oacute;gicas desde el punto de 
	vista de la BIOS</quote>.  Esto puede dar situaciones bastante 
	chocantes, especialmente cuando las unidades son f&iacute;sicamente 
	id&eacute;nticas en geometr&iacute;a y han sido creadas como clones de 
	de tados la una de la otra.</para>

      <para>Si va a usar &os; recuerde siempre devolver a la BIOS a los valores 
	de numeraci&oacute;n <quote>natural</quote> antes de la 
	instalaci&oacute;n y d&eacute;jelos ah&iacute;.  Si tiene que 
	intercambiar unidades h&aacute;galo, pero a la vieja usanza: abra la 
	caja y toque los <quote>jumpers</quote> y los cables todo lo que 
	sea menester.</para>

      <sidebar>
	<title>Veamos un instructivo ejemplo extra&iacute;do de Las 
	  excepcionales aventuras de Pedro y Pablo:</title>
      
	<para>Pedro decide dedicar una vieja m&aacute;quina 
	  <quote>Wintel</quote> para prepararle un sistema &os; a Pablo.  
	  Pedro le instala una sola unidad SCSI como 
	  <quote>unidad SCSI 0</quote> e instala &os; en ella.</para>

	<para>Pablo comienza a usar el sistema pero a los pocos d&iacute;s 
	  advierte que esa vieja unidad SCSI est&aacute; mostrando 
	  numerosos errores l&oacute;gicos, as&iacute; que informa del hecho 
	  a Pedro.</para>

	<para>D&iacute;as despu&eacute;s Pedro decide solucionar el problema; 
	  consigue un disco id&eacute;ntico al que instal&oacute; a Pablo.  
	  Le pasa un chequeo de superficie que da resultados satisfactorios, 
	  as&iacute; que instala este disco como <quote>unidad SCSI 4</quote> y 
	  hace una copia binaria de la unidad 0 (el primer disco) a la 
	  reci&eacute;n instalada unidad 4.  Una vez que el nuevo disco 
	  est&aacute; instalado Pedro decide que hay que empezar a usarlo, 
	  as&iacute; que configura la BIOS SCSI para reorganizar las unidades 
	  de disco para que el sistema arranque desde la unidad SCSI 4.  
	  &os; arranca desde dicha unidad y todo funciona perfectamente.</para>

	<para>Pablo sigue trabajando varios d&iacute;s y no pasa mucho tiempo 
	  antes de que Pedro y Pablo decidan que ya es hora de meterse en una 
	  nueva aventura: actualizarse a la nueva vers&iacute;n de &os;.  
	  Bill retira la unidad SCSI 0 de la m&aacute;quina porque le parece 
	  poco de fiar y la reemplaza por un disco que obtiene de su en 
	  apariencia inagotable trastero.  Pedro instala la &uacute;ltima 
	  versi&oacute;n de &os; en la nueva unidad SCSI mediante los 
	  disquetes m&aacute;gicos FTP de Internet de Pablo. La 
	  instalaci&oacute;n se ejecuta sin problemas.</para>

	<para>Pablo utiliza la nueva versi&oacute;n de &os; durante unos 
	  d&iacute;s y comprueba que en efecto es lo bastante buena como para 
	  usarla en el departamento de ingenier&iacute;a.  Ha llegado, por 
	  tanto, el momento de copiar los datos que tiene en la versi&oacute;n 
	  anterior de &os; a su nuevo alojamiento.  Pablo monta la unidad 
	  SCSI 4 (la &uacute;ltima que instal&oacute; con la versi&oacute;n 
	  anterior de &os;).  Pablo queda consternado al comprobar que en la 
	  unidad SCSI 4 no hay ni rastro de sus preciados datos.</para>

	<para>&iquest;D&oacute;nde est&aacute;n los datos?</para>

	<para>Cuando Pedro hizo la copia binaria de la unidad SCSI 0 
	  en la unidad SCSI 4, la unidad se convirti&oacute; en el 
	  <quote>el nuevo clon</quote>.  Cuando Pedro reconfigur&oacute; la 
	  BIOS SCSI para poder arrancar desde la unidad SCSI 4 tan 
	  s&oacute;lo estaba enga&ntilde;&aacute;ndose a s&iacute; mismo 
	  puesto que &os; segu&iacute;a arrancando desde la unidad SCSI 
	  0.  Al hacer tal cambio en la BIOS causamos que parte del 
	  c&oacute;digo de arranque y del cargador del sistema se copie de 
	  una a otra unidad pero en cuanto los controladores del kernel de 
	  &os; toman el control de la situaci&oacute;n el esquema de 
	  nomenclatura de unidades de la BIOS es desestimado y &os; recupera 
	  el esquema normal de nomenclatura.  En nuestro ejemplo el sistema 
	  sigue funcionando desde la unidad SCSI 0 y ah&iacute; est&aacute;n 
	  todos los datos de Pablo, no en la unidad SCSI 4.  El hecho de que 
	  pareciera que el sistema estaba funcionando en la unidad SCSI 4 era 
	  un producto de la imaginaci&oacute;n humana.</para>

	<para>Estamos encantados de decir que ni un solo byte fu&eacute; 
	  herido o maltratado durante el descubrimiento de este 
	  fen&oacute;meno.  La vieja unidad SCSI 0 fu&eacute; recuperada del 
	  mont&oacute;n de discos ca&iacute;dos en acto de servicio y 
	  fu&eacute; posible devolver todo el trabajo de Pablo a su 
	  leg&iacute;timo due&ntilde;o.  Por si fuera poco, ahora Pedro sabe 
	  con certeza que es capaz de contar hasta cero.</para>

	<para>En el ejemplo se han usado unidades SCSI pero los conceptos 
	  pueden aplicarse perfectamente a unidades IDE.</para>
      </sidebar>
    </sect2>

    <sect2 id="main-fdisk">
      <title>Creaci&oacute;n de <quote>slices</quote> con FDisk</title>

      <note>
	<para>A&uacute;n no ha hecho modificaciones en su disco duro.  
	  Si cree que ha cometido alg&uacute;n error y quiere comenzar de 
	  nuevo puede hacerlo, salga de los men&uacute;s de 
	  <application>sysinstall</application> e int&eacute;ntelo de nuevo 
	  o pulse <keycap>U</keycap> para ejecutar la opci&oacute;n 
	  <guimenuitem>Undo</guimenuitem> (deshacer).  Si se pierde o no 
	  sabe c&oacute;mo salir siempre puede sencillamente apagar su 
	  sistema.</para>
      </note>

      <para>Si ha elegido iniciar una instalaci&oacute;n est&aacute;ndar 
	<application>sysinstall</application> le mostrar&aacute; el siguiente 
	mensaje:</para>

      <screen>                                 Message
 In the next menu, you will need to set up a DOS-style ("fdisk")
 partitioning scheme for your hard disk. If you simply wish to devote
 all disk space to FreeBSD (overwriting anything else that might be on
 the disk(s) selected) then use the (A)ll command to select the default
 partitioning scheme followed by a (Q)uit. If you wish to allocate only
 free space to FreeBSD, move to a partition marked "unused" and use the
 (C)reate command. 
                                [  OK  ] 

                      [ Press enter or space ]</screen>

     <para>Es decir:</para>
	
     <screen>                                 Mensaje
 En el siguiente menú tendrá que configurar un esquema de particionado 
 estilo DOS ("fdisk") en su disco duro.  Si quiere dedicar todo el 
 espacio de disco a FreeBSD (cosa que sobreescribirá cualquier cosa 
 que contuviera el/los disco/s) use el comando (A)ll (Todo) para 
 seleccionar el esquema de particiones por defecto y luego pulse 
 (Q)uit (Salir).  Si quiere asignar a FreeBSD sólamente el espacio 
 libre en la unidad elija una partición que figure marcada como 
 "unused" (sin usar) y ejecute el comando (C)reate (Crear).
                                [  OK  ]

                      [ Pulse Intro o Espacio ]</screen>

      <para>Pulse <keycap>Intro</keycap> tal y como se le dice.  Se le 
	mostrar&aacute; una lista con todas unidades de disco duro que el 
	kernel ha econtrado al hacer el chequeo del sistema.  
	La <xref linkend="sysinstall-fdisk-drive1"> muestra un ejemplo de un 
	sistema con dos discos IDE.  Reciben los nombres de 
	<devicename>ad0</devicename> y <devicename>ad2</devicename>.</para>

      <figure id="sysinstall-fdisk-drive1">
	<title>Elija en qu&eacute; unidad usar FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Quiz&aacute;s est&eacute; pregunt&aacute;ndose por qu&eacute; 
	<devicename>ad1</devicename> no aparece por ning&uacute;n lado.  
	&iquest;Acaso hemos pasado algo por algo?</para>

      <para>Veamos lo que ocurrir&iacute;a si tuviera usted dos discos 
	duros IDE, uno como maestro de la primera controladora IDE y el 
	otro como maestro de la segunda controladora IDE.  Si &os; asignara 
	n&uacute;meros de unidad en el orden en el que las encuentra, en el 
	ejemplo habr&iacute;amos visto <devicename>ad0</devicename> y 
	<devicename>ad1</devicename> (y adem&aacute;s todo funcionar&iacute;a 
	perfectamente.</para>

      <para>Pero si tuviera usted que a&ntilde;adir un tercer disco, digamos 
	como esclavo de la primera controladora IDE, tendr&iacute;a que 
	llamarse <devicename>ad1</devicename> y el disco que antes era 
	<devicename>ad1</devicename> pasar&iacute;a a llamarse 
	<devicename>ad2</devicename>.  Los nombres de dispositivo (como 
	por ejemplo <devicename>ad1s1a</devicename>) se usan para ubicar 
	sistemas de ficheros, as&iacute; que podr&iacute;a encontrarse con 
	que alguno de sus sistemas de ficheros no est&aacute; donde debiera 
	y tendr&iacute;a que modificar la configuraci&oacute;n de su 
	&os;.</para>
      
      <para>Para evitar este problema el kernel puede configurarse para 
	asignar nombres a discos IDE bas&aacute;ndose en d&oacute;nde 
	est&aacute;n en lugar de hacerlo por el orden en el que los 
	encuentra.  Seg&uacute;n dicho esquema el disco maestro de la segunda 
	contoladora IDE <emphasis>siempre</emphasis> ser&aacute; 
	<devicename>ad2</devicename>, incluso si no existen dispositivos 
	<devicename>ad0</devicename> o 
	<devicename>ad1</devicename>.</para>

      <para>&Eacute;sta es la configuraci&oacute;n por defecto del kernel de 
	&os;, por lo que se muestran las unidades <devicename>ad0</devicename> 
	y <devicename>ad2</devicename>.  El sistema en el que se tomaron las 
	capturas de pantalla tiene sendos discos IDE en ambos canales 
	maestros de las dos controladoras y carece de discos en los canales 
	esclavos.</para>

      <para>Seleccione el disco en el que desea instalar &os; y pulse 
	&gui.ok;.  
	<application>FDisk</application> arrancar&aacute; y ver&aacute; una 
	pantalla similar a la que muestra la 
	<xref linkend="sysinstall-fdisk1">.</para>

      <para>La pantalla de <application>FDisk</application> se divide en 
	tres partes.</para>

      <para>La primera parte, que ocupa las dos primeras l&iacute;neas de la 
	pantalla, muestra los detalles del disco que seleccionemos, el 
	nombre que &os; le da, la geometr&iacute;a del disco y el 
	tama&ntilde;o total del disco.</para>

      <para>La segunda parte muestra las <quote>slices</quote> que haya 
	en el disco, d&oacute;nde comienzan y acaban, cu&acute;l es su 
	tama&ntilde;o, qu&eacute; nombre les da &os;, su descripci&oacute;n 
	y subtipo.  Este ejemplo muestra dos peque&ntilde;as 
	<quote>slices</quote> sin usar; las <quote>slices</quote> (del 
	ingl&eacute;s <quote>rebanadas</quote>) son un tipo de esquema 
	estructural de los discos de PC.  Tambi&eacute;n muestra una gran 
	<quote>slice</quote> <acronym>FAT</acronym>, que casi con total 
	seguridad aparecer&aacute; como <devicename>C:</devicename> en 
	&ms-dos; / &windows;, y una <quote>slice</quote> extendida, que 
	podr&iacute;a contener otras letras de unidad de 
	&ms-dos; / &windows;.</para>

      <para>La tercera parte muestra los comandos que pueden usarse en 
	<application>FDisk</application>.</para>

      <figure id="sysinstall-fdisk1">
	<title>Particionamiento t&iacute;pico con FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Lo que deba hacer a partir de ahora depender&aacute; mucho de 
	la forma en la que quiera distribu&iacute;r su disco.</para>

      <para>Si desea usar &os; en el resto del disco (lo que implica borrar 
	todos los datos que pudiera haber en el disco una vez que le 
	confirme a <application>sysinstall</application> que desea seguir 
	adelante con la instalaci&oacute;n) pulse <keycap>A</keycap>, que 
	equivale a la opci&oacute;n <guimenuitem>Use Entire Disk</guimenuitem> 
	(Utilizar el disco &iacute;ntegro).  Las <quote>slices</quote> que 
	existieran ser&aacute;n borradas y reemplazadas por un peque&ntilde;o 
	&aacute;rea de disco marcado como <literal>sin usar</literal> (otro 
	recurso de la estructura de disco de los PC) y tras &eacute;l una gran 
	<quote>slice</quote> destinada a &os;.  Ahora marque la 
	partici&oacute;n &os; que acaba de crear como arrancable: pulse 
	<keycap>S</keycap>.  La pantalla que ver&aacute; ha de ser muy 
	similar a la <xref linkend="sysinstall-fdisk2">.  Observe la 
	<literal>A</literal> en la columna <literal>Flags</literal>: indica 
	que la <quote>slice</quote> es <emphasis>activa</emphasis> y se 
	arrancar&aacute; desde ella.</para>

      <para>Si desea borrar una <quote>slice</quote> para hacer m&aacute;s 
	sitio a &os; selecci&oacute;nela mediante las flechas y pulse 
	<keycap>D</keycap>.  Despu&eacute;s pulse <keycap>C</keycap> y 
	ver&aacute; un mensaje en el que se le pedir&aacute; el 
	tama&ntilde;o de la <quote>slice</quote> que va a crear.  
	Introduzca los datos apropiados y pulse <keycap>Intro</keycap>.  
	El valor por defecto en &eacute;sta pantalla es el de la 
	<quote>slice</quote> m&aacute;s grande que pueda crear en el disco, 
	que deber&iacute;a ser la mayor parte del disco que queda sin usar 
	o el tama&ntilde;o del disco duro completo.</para>
      
      <para>Si ha hecho sitio para &os; (quiz&aacute;s con una herramienta 
	como <application>&partitionmagic;</application>) puede pulsar 
	press <keycap>C</keycap> y crear una nueva <quote>slice</quote>.  
	Ver&aacute; de nuevo un mensaje en el que se le pedir&aacute; que 
	escriba el tama&ntilde;o de la <quote>slice</quote> que va a 
	crear.</para>

      <figure id="sysinstall-fdisk2">
	<title>Partici&oacute;n con FDisk usando el disco completo</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Cuando acabe pulse <keycap>Q</keycap>.  Recuerde que de momento 
	<application>sysinstall</application> est&aacute; guardando la 
	informaci&oacute;n de los cambios que est&aacute; haciendo pero 
	a&uacute;n no los est&aacute; escribiendo en el disco.</para>
    </sect2>

    <sect2 id="bootmgr">
      <title>Instalaci&oacute;n de un gestor de arranque</title>

      <para>Ha llegado el momento de instalar un gestor de arranque.  
	Deber&iacute;a instalar el gestor de arranque de &os; si:</para>

      <itemizedlist>
	<listitem>
	  <para>Tiene m&aacute;s de un disco y ha instalado &os; en un disco 
	    distinto del primero.</para>
	</listitem>

	<listitem>
	  <para>Ha instalado &os; codo con codo con otro sistema 
	    operativo y quiere poder elegir si arrancar &os; o ese 
	    otro sistema operativo cuando arranque su sistema.</para>
	</listitem>
      </itemizedlist>

      <para>Si &os; va a ser el &uacute;nico sistema operativo en el 
	sistema y va a instalarse en el primer disco duro deber&iacute;a 
	elegir el gestor de arranque <guimenuitem>Standard</guimenuitem>.  
	Elija <guimenuitem>None</guimenuitem> si va a usar alg&uacute;n 
	otro gestor de arranque a trav&eacute;s del cual pueda 
	arrancar &os;.</para>

      <para>Elija y pulse <keycap>Intro</keycap>.</para>

      <figure id="sysinstall-bootmgr">
	<title>Men&uacute; de gestores de arranque de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/boot-mgr" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La pantalla de ayuda (que puede consultarse en cualquier 
	momento pulsando <keycap>F1</keycap>) trata sobre los problemas 
	con los que puede encontrarse al intentar compartir el disco duro 
	entre distintos sistemas operativos.</para>
    </sect2>

    <sect2>
      <title>Creaci&oacute;n de <quote>slices</quote> en otra 
	unidad</title>

      <para>Si hay m&aacute;s de una unidad de disco el programa de 
	instalaci&oacute;n volver&aacute; a la pantalla 
	<quote>Select Drives</quote> (<quote>selecci&oacute;n de 
	unidades</quote>) una vez elegido el gestor de arranque.  Si quiere 
	instalar &os; en m&aacute;s de un disco seleccione aqu&iacute; ese 
	otro disco y repita el proceso con las <quote>slices</quote> mediante 
	<application>FDisk</application>.</para>

      <important>
	<para>Si va a instalar &os; en una unidad que no sea la primera 
	  tendr&aacute; que instalar el gestor de arranque de &os; 
	  en ambas unidades.</para>
      </important>

      <figure id="sysinstall-fdisk-drive2">
	<title>Salir de la selecci&oacute;n de unidad</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La tecla <keycap>Tabulador</keycap> hace pasar el cursor de 
	la &uacute;ltima unidad seleccionada, &gui.ok; y &gui.cancel;.</para>

      <para>Pulse una vez el <keycap>Tabulador</keycap> para pasar el 
	cursor hasta ·&gui.ok; y luego pulse <keycap>Intro</keycap> para 
	proseguir con la instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="disklabeleditor">
      <title>Creaci&oacute;n de particiones con 
	<application>Disklabel</application></title>
      
      <para>Debe crear particiones dentro de las <quote>slices</quote> que 
	acaba de crear.  Recuerde que cada partici&oacute;n est&aacute; 
	asociada a una letra de <literal>a</literal> a <literal>h</literal> y 
	que las particiones <literal>b</literal>, <literal>c</literal> y 
	<literal>d</literal> tienen significados heredados que deber&iacute;a 
	tener en cuenta.</para>

      <para>Ciertas aplicaciones pueden optimizar su rendimiento de un 
	esquema de particiones concreto, sobre todo si hace particiones 
	repartidas en m&aacute;s de un disco.  Si embargo si esta es su 
	primera instalaci&oacute;n de &os; no necesita dedicarle demasiado 
	tiempo a decidir c&oacute;mo partir el disco duro.  Es mucho 
	m&aacute;s importante que instale &os; y empiece a aprender a 
	usarlo.  Siempre est&aacute;a tiempo de reinstalar &os; y cambiar 
	su esquema de particiones cuando est&eacute; m&aacute;s 
	familiarizado con el sistema operativo.</para>

      <para>Este esquema tiene cuatro particiones: una para la swap tres para 
	los sistemas de ficheros.</para>

      <table frame="none" pgwide="1">
	<title>Estructura de particiones del primer disco</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">

	  <thead>
	    <row>
	      <entry>Partici&oacute;n</entry>
	      
	      <entry>Sistema de ficheros</entry>

	      <entry>Tama&ntilde;o</entry>

	      <entry>Descripci&oacute;n</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>a</literal></entry>

	      <entry><filename>/</filename></entry>

	      <entry>100&nbsp;MB</entry>

	      <entry>Este es el sistema de ficheros ra&iacute;z.  el resto 
		de sistemas de ficheros se montar&aacute;n en alg&uacute;n 
		punto de este sistema ra&iacute;z.  100&nbsp;MB es un 
		tama&ntilde;o razonable para &eacute;l.  No es el mejor sitio 
		para almacenar muchos datos y la instalaci&oacute;n de &os; 
		escribir&aacute; cerca de 40&nbsp;MB de datos en ella.  
		El resto del espacio es para datos temporales y por si futuras 
		versiones de &os; necesitan m&aacute;s espacio en 
		<filename>/</filename>.</entry>
	    </row>

	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>2-3 x RAM</entry>

	      <entry><para>Esta partici&oacute;n es el espacio de memoria de 
		  intercambio (o <quote>swap</quote>) del sistema.  La 
		  elecci&oacute;n de la cantidad correcta de swap es 
		  casi un arte en s&iacute; mismo.  Hay una regla 
		  b&aacute;sica que es asignar a la swap el doble o el 
		  triple de MB de los que haya en la memoria f&iacute;sica 
		  (RAM) del sistema.  Deber&iacute;a tener 
		  al menos 64&nbsp;MB de swap as&iacute; que si tiene 
		  menos de 32&nbsp;MB de RAM as&iacute;gnele a su swap 
		  64&nbsp;MB.</para><para>

		  Si tiene m&aacute;s de un disco puede poner espacio 
		  swap en cada disco.  &os; usar&aacute; ambas swap con el 
		  resultado de acelerar notablemente el intercambio de 
		  p&aacute;ginas de memoria.  Calcule el total de swap que 
		  necesita (por ejemplo 128&nbsp;MB) y divida esa cantidad 
		  por el n&uacute;mero de discos que tenga (por ejemplo dos) 
		  y ya tiene la cantidad de espacio que debe destinar a swap 
		  en cada uno de sus discos. En nuestro ejemplo 64&nbsp;MB 
		  de swap por disco.</para></entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry><filename>/var</filename></entry>

	      <entry>50&nbsp;MB</entry>

	      <entry>El directorio <filename>/var</filename> contiene 
		ficheros que est&aacute;n en cont&iacute;nuo cambio, como 
		ficheros de <quote>log</quote> y otros ficheros 
		administrativos.  Muchos de esos ficheros son una 
		consecuencia de o son de gran ayuda para el correcto 
		funcionamiento diario de &os;.  &os; ubica dichos ficheros 
		en ese sistema de ficheros para optimizar el acceso a 
		los mismos sin afectar a otros ficheros ni directorios que 
		que tienen similar patr&oacute;n de accesos.</entry>
	    </row>

	    <row>
	      <entry><literal>f</literal></entry>

	      <entry><filename>/usr</filename></entry>

	      <entry>Resto del disco</entry>

	      <entry>El resto de sus ficheros pueden almacenarse en 
		<filename>/usr</filename> y sus subdirectorios.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>
      
      <para>Si va a instalar &os; en m&aacute;s de un disco tendr&aacute; que 
	crear particiones en las dem&aacute;s <quote>slices</quote> que haya 
	configurado.  La forma m&aacute;s sencilla de hacerlo es crear dos 
	particiones en cada disco, una para la swap y la otra para sistemas 
	de ficheros.</para>

      <table frame="none" pgwide="1">
	<title>Esquema de particiones para varios discos</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="2*">
          <colspec colwidth="3*">

	  <thead>
	    <row>
	      <entry>Partici&oacute;n</entry>
	      
	      <entry>Sistema de ficheros</entry>

	      <entry>Tama&ntilde;o</entry>

	      <entry>Descripci&oacute;n</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>See description</entry>

	      <entry>Tal y como se ha explicado, puede repartir su espacio 
		swap entre varios discos.  Aunque piense que la 
		partici&oacute;n <literal>a</literal> est&aacute; libre 
		la costumbre (y se dice que <quote>las costumbres son 
		leyes</quote>) dicta que el espacio swap reside en la 
		partici&oacute;n <literal>b</literal>.</entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry>/disco<replaceable>n</replaceable></entry>

	      <entry>Resto del disco</entry>

	      <entry>El resto del disco puede dejarse en una sola 
		partici&oacute;n.  Esto podr&iacute;a ubicarse simplemente 
		en la partici&oacute;n <literal>a</literal> en lugar de en 
		la <literal>e</literal>.  Sin embargo la costumbre dice que 
		la partici&oacute;n <literal>a</literal> de una 
		<quote>slice</quote> est&aacute; reservada para el sistema de 
		ficheros que ha de albergar el sistema de ficheros 
		ra&iacute;z (<filename>/</filename>).  No tiene por qu&eacute; 
		seguir la costumbre pero tenga en cuenta que 
		<application>sysinstall</application> s&iacute; que lo hace, 
		as&iacute; que si la sigue sabe que est&aacute; haciendo una 
		instalaci&oacute;n m&aacute;s limpia.  Puede montar los 
		sistemas de ficheros donde prefiera; este ejemplo le sugiere 
		que los monte como directorios 
		<filename>/disco<replaceable>n</replaceable></filename>, donde 
		<replaceable>n</replaceable> es un n&uacute;mero que cambia en 
		cada disco.  Por supuesto que puede usar el esquema que 
		prefiera.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <para>Una vez elegido el esquema de particiones creelo con 
	<application>sysinstall</application>.  Se le mostrar&aacute; el 
	siguiente mensaje:</para>

      <screen>                                 Message
 Now, you need to create BSD partitions inside of the fdisk
 partition(s) just created. If you have a reasonable amount of disk
 space (200MB or more) and don't have any special requirements, simply
 use the (A)uto command to allocate space automatically. If you have
 more specific needs or just don't care for the layout chosen by
 (A)uto, press F1 for more information on manual layout.  

                                [  OK  ]
                          [ Press enter or space ]</screen>

      <para>Es decir:</para>

      <screen>                                 Message
 Debe crear particiones BSD dentro de las 'particiones 
 fdisk' que acaba de crear.  Si tiene una cantidad de espacio en 
 disco razonablemente grande (200MB o más) y no tiene necesidades 
 especiales puede simplemente usar el comando (A)uto para asignar 
 el espacio automáticamente. Si tiene necesidades más concretas o 
 simplemente no le gusta la estructura que le da (A)uto, pulse 
 F1 y obtendrá más información sobre la creación manual de 
 la estructura.

                                [  OK  ]
                          [ Pulse Intro o Espacio ]</screen>

      <para>Al pulsar <keycap>Intro</keycap> arrancar&aacute; el editor 
	de particiones de &os;, <application>Disklabel</application>.</para>

      <para>La<xref linkend="sysinstall-label"> muestra lo que ver&aacute; 
	cuando arranque <application>Disklabel</application>.  La pantalla 
	se divide en tres partes.</para>

      <para>Las primeras l&iacute;neas muestran el nombre del disco en el 
	que estamos haciendo cambios y el de la <quote>slice</quote> que 
	contiene  las particiones que estamos creando 
	(<application>Disklabel</application> las muestra bajo 
	<literal>Partition name</literal> 
	(<quote>nombre de partici&oacute;n</quote>) en lugar de hacerlo 
	como <quote>slices</quote>).  Vemos tambi&eacute;n ah&iacute; la 
	cantidad de espacio libre en la <quote>slice</quote>, esto es, el 
	espacio que hay asignado a la <quote>slice</quote> pero que 
	a&uacute;n no ha sido asignado a ninguna partici&oacute;n.</para>

      <para>En la mitad de la pantalla se muestran las particiones que se 
	han creado, el nombre de los sistemas de ficheros que contiene cada 
	partici&oacute;n, sus tama&ntilde;os y algunas opciones relacionadas 
	con la creaci&oacute;n de sistemas de ficheros.</para>

      <para>La tercera parte de la pantalla, la de m&aacute;s abajo, muestra 
	los atajos de teclado que pueden usarse 
	en <application>Disklabel</application>.</para>

      <figure id="sysinstall-label">
	<title>El editor Disklabel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para><application>Disklabel</application> puede crear 
	autom&aacute;ticamente particiones y asignarles tambi&eacute;n 
	tama&ntilde;os por defecto.  Pru&eacute;belo, pulse 
	<keycap>A</keycap>.  Ver&aacute; una pantalla similar a la que 
	aparece en la <xref linkend="sysinstall-label2">.  Dependiendo del 
	tama&ntilde;o del disco que est&eacute; usando esos valores por 
	defecto pueden o no ser los apropiados.  Esto no es algo de lo 
	que deba preocuparse puesto que no es obligatorio aceptar los 
	valores por defecto.</para>

	<note>
	  <para>A partir de FreeBSD&nbsp;4.5 la estructura de directorios 
	    asigna su propia partici&oacute;n a <filename>/tmp</filename> en 
	    lugar de formar parte de <filename>/</filename>.  Esto ayuda a 
	    evitar un desbordamiento de la partici&oacute;n 
	    <filename>/</filename> debido a ficheros temporales.</para>
	</note>

      <figure id="sysinstall-label2">
	<title>Editor Disklabel con los valores por defecto</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-auto" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Si decide no usar los valores por defecto para las particiones 
	y quiere reemplazar tales valores por los suyos use las flechas: 
	elija la primera partici&oacute;n y pulse <keycap>D</keycap> para 
	borrarla.  Repita el proceso para borrar todas las particiones que 
	desee.</para>

      <para>Vamos a crear la primera partici&oacute;n 
	(<literal>a</literal>, montada como <filename>/</filename> 
	o ra&iacute;z).  Seleccione la <quote>slice</quote> adecuada y 
	pulse <keycap>C</keycap>.  Aparecer&aacute; un di&aacute;logo 
	pidi&eacute;ndole que escriba el tama&ntilde;o de la nueva 
	partici&oacute;n (como se muestra en la 
	in <xref linkend="sysinstall-label-add">).  Puede introducir 
	el tama&ntilde;o expresado en bloques de disco o como un 
	n&uacute;mero seguido de una <literal>M</literal> para 
	megabytes, una <literal>G</literal> para gygabytes o una 
	<literal>C</literal> para cilindros.</para> 

      <note><para>A partir de FreeBSD&nbsp;5.X es posible hacer lo 
	siguiente: elegir <acronym>UFS2</acronym> mediante la opci&oacute;n 
	<literal>Custom Newfs</literal> (<keycap>Z</keycap>), marcar partes 
	del disco con <literal>Auto Defaults</literal> y modificarlas 
	con la opci&oacute;n <literal>Custom Newfs</literal> o 
	a&ntilde;adir la opci&oacute;n <option>-O 2</option> en el momento 
	de su creaci&oacute;n.  No olvide a&ntilde;adir <option>-U</option> 
	a SoftUpdates si usa la opci&oacute;n 
	<literal>Custom Newfs</literal>.</para></note>

      <figure id="sysinstall-label-add">
	<title>Liberar espacio para la partici&oacute;n ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>El tama&ntilde;o por defecto que se muestra crear&aacute; una 
	partici&oacute;n que ocupe el resto de la <quote>slice</quote>.  
	Si va a usar los tama&ntilde;os de partici&oacute;n que se daban 
	en el ejemplo anterior borre el texto existente pulsando 
	<keycap>Retroceso</keycap>; escriba <userinput>64M</userinput>, como 
	se puede ver en la 
	<xref linkend="sysinstall-label-add2">.  Ahora pulse 
	&gui.ok;.</para>
      
      <figure id="sysinstall-label-add2">
	<title>Edici&oacute;n del tama&ntilde;o de la partici&oacute;n 
	  ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Una vez elegido el tama&ntilde;o de la partici&oacute;n 
	tendr&aacute; que elegir si esta partici&oacute;n ha de contener 
	un sistema de ficheros o espacio swap y escribir lo que corresponda 
	en una pantalla como la que se muestra en la 
	<xref linkend="sysinstall-label-type">.  Esta primera partici&oacute;n 
	contendr&aacute; un sistema de ficheros, as&iacute; que 
	seleccione <guimenuitem>FS</guimenuitem> y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="sysinstall-label-type">
	<title>Elija el tipo de partici&oacute;n ra&iacute;</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-fs" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
      
      <para>Dado que est&aacute; creando un sistema de ficheros tendr&aacute; 
	que especificarle a <application>Disklabel</application> d&oacute;nde 
	quiere montar el sistema de ficheros.  La pantalla se muestra en la 
	<xref linkend="sysinstall-label-mount">.  El punto de montaje del 
	sistema de ficheros ra&iacute;z es <filename>/</filename>, as&iacute; 
	que escriba <userinput>/</userinput> y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="sysinstall-label-mount">
	<title>Elija el punto de montaje del s. f. ra&iacute;z</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La pantalla le mostrar&aacute; ahora la partici&oacute;n que 
	acaba de crear.  Repita el procedimiento todas las veces que 
	necesite con las dem&aacute;s particiones.  Cuando cree la 
	partici&oacute;n swap no se le pedir&aacute; el punto de 
	montaje puesto que las particiones swap nunca se montan como 
	tales.  Cuando cree la &uacute;ltima partici&oacute;n, 
	<filename>/usr</filename>, puede dejar el tama&ntilde;o que se le 
	sugiere, esto es, usar el resto del espacio en la 
	<quote>slice</quote>.</para>

      <para>La &uacute;ltima pantalla del editor Disklabel ser&aacute; muy 
	parecida a la <xref linkend="sysinstall-label4">, aunque los valores 
	pueden ser diferentes.  Pulse <keycap>Q</keycap> para salir del 
	editor.</para>

      <figure id="sysinstall-label4">
	<title>Editor Disklabel, sysinstall</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-choosing">
    <title>Elecci&oacute;n de qu&eacute; instalar</title>

    <sect2 id="distset">
      <title>Elecci&oacute;n del tipo de instalaci&oacute;n</title>

      <para>La elecci&oacute;n de qu&eacute; tipo de instalaci&oacute;n 
	debe hacer depende enormemente del uso que se va a dar al sistema y 
	del espacio de disco disponible.  El rango de opciones predefinidas 
	est&aacute; entre hacer la instalaci&oacute;n m&aacute;s 
	peque&ntilde;a posible o instalarlo todo.  Aquellos que sean 
	nuevos en &unix; y/o &os; deber&aacute;n seguramente elegir 
	alguna de las predefinidas que se le ofrecen, a las que llamaremos 
	distribuciones, de <quote>distribution set</quote> tal y como 
	aparecen en el men&uacute; de <application>sysinstall</application>.  
	Una instalaci&oacute;n ·a medida es algo m&aacute;s adecuado para 
	para usuarios con algo m&aacute;s de experiencia.</para>

      <para>Pulse <keycap>F1</keycap> si quiere obtener m&aacute;s 
	informaci&oacute;n sobre las opciones de tipo de instalaci&oacute;n 
	y qu&eacute; contiene cada distribuci&oacute;n.  Cuando acabe de 
	consultar la ayuda pulse <keycap>Intro</keycap> y volver&aacute; al 
	al men&uacute; de selecci&oacute;n de instalaci&oacute;n de 
	distribuciones.</para>

      <para>Si quiere instalar un interfaz gr&aacute;fico de usuario 
	deber&aacute; elegir una distribuci&oacute;n cuyo nombre comienza 
	por <literal>X</literal>.  La configuraci&oacute;n de 
	<application>&xfree86;</application> y la selecci&oacute;n de un 
	escritorio es una de las tareas post-instalaci&oacute;n.</para>

      <para>La versi&oacute;n por defecto de 
	<application>&xfree86;</application> que se instala depende de la 
	viersi&oacute;n de &os; que instale.  En versiones de &os; anteriores 
	a 4.6 se instala <application>&xfree86; 3.X</application>; en las 
	versiones FreeBSD&nbsp;4.6 y posteriores se instala 
	<application>&xfree86; 4.X</application>.</para>

      <para>El mejor sitio para saber si su tarjeta gr&aacute;fica est&aacute; 
	soportada es el sitio web de 
	<ulink url="http://www.xfree86.org/">&xfree86;</ulink>.  Si su 
	tarjeta gr&aacute;fica no est&aacute; soportada por la versi&oacute;n 
	que se instala con &os; deber&aacute; seleccionar e instalar una 
	distribuci&oacute;n sin X.  Tras la instalaci&oacute;n del sistema 
	puede instalar y configurar una versi&oacute;n m&aacute;s reciente 
	de <application>&xfree86;</application> desde los ports.</para>

      <para>Si preve compilar un kernel a medida selecciones la 
	opci&oacute;n que incluye el c&oacute;digo fuente.  Para m&aacute;s 
	informaci&oacute;n sobre las razones por las que debe compilarse 
	un kernel a medida y sobre c&oacute;mo compilar uno de esos kernel, 
	consulte el <xref linkend="kernelconfig">.</para>

      <para>Evidentemente el sistema m&aacute;s vers&aacute;til es 
	aqu&eacute;l que lo tiene todo.  Si dispone de espacio de disco 
	suficiente seleccione <guimenuitem>All</guimenuitem>, como se 
	muestra en la <xref linkend="distribution-set1">, usando las 
	flechas y pulsando <keycap>Intro</keycap>.  Si el espacio en 
	disco es limitado piense en usar alguna de las otras opciones.  
	No pierda con ello demasiado tiempo puesto que el resto de 
	distribuciones pueden a&ntilde;adirse en cualquier momento tras 
	la intalaci&oacute;n.</para>

      <figure id="distribution-set1">
	<title>Elegir distribuciones</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>

    <sect2 id="portscol">
      <title>Instalaci&oacute;n del &aacute;rbol de ports</title>

      <para>Tras seleccionar la distribuci&oacute;n elegida se le 
	presentar&aacute; la opci&oacute;n de instalar el &aacute;rbol 
	de ports, o Colecci&oacute;n de Ports de &os;.  Los ports son una 
	forma f&aacute;cil y c&oacute;moda de instalar software.  El 
	&aacute;rbol de ports no contiene el c&oacute;digo fuente necesario 
	para compilar software; es una gran colecci&oacute;n de ficheros que 
	automatiza la descarga, la compilaci&oacute;n y la instalaci&oacute;n 
	de paquetes de software de todo tipo.  El 
	<xref linkend="ports"> explica con detalle c&oacute;mo utilizar los 
	ports.</para>

      <para>El programa de instalaci&oacute;n no comprueba si tiene espacio 
	suficiente.  Seleccione esta opci&oacute;n si dispone de sitio 
	en el disco.  En &os; &rel.current; los ports ocupan cerca de 
	&ports.size; en disco.  Puede asumir tranquilamente un 
	n&uacute;mero mayor en versiones m&aacute;s reciente de 
	&os;.</para>

<screen>                         User Confirmation Requested
 Would you like to install the FreeBSD ports collection? 

 This will give you ready access to over &os.numports; ported software packages,
 at a cost of around &ports.size; of disk space when "clean" and possibly much
 more than that if a lot of the distribution tarballs are loaded
 (unless you have the extra CDs from a FreeBSD CD/DVD distribution
 available and can mount it on /cdrom, in which case this is far less
 of a problem). 

 The ports collection is a very valuable resource and well worth having
 on your /usr partition, so it is advisable to say Yes to this option. 

 For more information on the ports collection & the latest ports,
 visit: 
     http://www.FreeBSD.org/ports  

                              [ Yes ]     No</screen>

      <para>Es decir:</para>

<screen> Petición de confirmación por parte del usuario
 ¿Quiere instalar la colección de ports de FreeBSD?

 Tendrá acceso inmediato a más de &os.numports; paquetes de software listos 
 para usarse en &os;, aunque necesitará cerca de &ports.size; de 
 espacio en disco como mínimo y posiblemente mucho más 
 si descarga los 'tarballs' de código fuente (aunque si tiene los CD 
 extra de una versión de &os; en CD/DVD puede montarlos en /cdrom, de forma 
 que esto dejaría de ser un problema).

 La colección de ports es un recurso extremadamente valioso y es muy 
 recomendable que la instale en su partición /usr, así que debería 
 responder Sí a la siguiente pregunta.

 Si quiere conocer las últimas entradas novedades y las últimas 
 entradas en la colección de ports visite: 
     http://www.FreeBSD.org/ports

                              [ Yes ]     No</screen>


      <para>Seleccione &gui.yes; con las flechas e instale los 
	ports o &gui.no; para obviar la pregunta.  Pulse 
	<keycap>Intro</keycap> para seguir con la instalaci&oacute;n.  
	Volvemos al men&uacute; de elecci&oacute;n de distribuciones.</para>

      <figure id="distribution-set2">
	<title>Confirmar distribuciones</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Ahora puede seleccionar <guimenuitem>Exit</guimenuitem> 
	<guimenuitem>Exit</guimenuitem> con las flechas; aseg&uacute;rese 
	de que &gui.ok; est&aacute; seleccionado y pulse 
	<keycap>Intro</keycap>.</para>

    </sect2>
  </sect1>

  <sect1 id="install-media">
    <title>Elecci&oacute;n del medio de instalaci&oacute;n</title>

    <para>Si va a instalar &os; desde CDROM o DVD seleccione 
      <guimenuitem>Install from a FreeBSD CD/DVD</guimenuitem> con las 
      flechas.  Una vez &gui.ok; est&aacute; seleccionado pulse 
      <keycap>Intro</keycap> y siga adelante con la instalaci&oacute;n.</para>
    
    <para>Si quiere usar otro m&eacute;todo de instalaci&oacute;n seleccione 
      una opci&oacute;n y siga las instrucciones.</para>

    <para>Pulse <keycap>F1</keycap> para acceder a la ayuda en l&iacute;nea 
      del medio de instalaci&oacute;n elegido.  Pulse <keycap>Intro</keycap> 
      para regresar al men&uacute; de selecci&oacute;n de medio.</para>

    <figure id="choose-media">
      <title>Elecci&oacute;n del medio de instalaci&oacute;n.</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/media" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <note>
      <title>Modos de instalaci&oacute;n por FTP</title>

      <indexterm>
	<primary>instalaci&oacute;n</primary>
	<secondary>red</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>
      
      <para>Hay tres tipos de instalaci&oacute;n via FTP que puede usar: 
	FTP activo, FTP pasivo y via un proxy HTTP.</para>

      <variablelist>
	<varlistentry>
	  <term>FTP Activo: <guimenuitem>Install from an FTP
	      server</guimenuitem>, es decir: 
	      <quote>Instalar desde un servidor FTP</quote></term>
	  
	  <listitem>
	    <para>Esta opci&oacute;n har&aacute; que todas las 
	      transferencias FTP usen el modo <quote>Activo</quote>.  
	      No funcionar&aacute; a trav&eacute;s de cortafuegos pero 
	      seguramente funcionar&aacute; con viejos servidores FTP que 
	      no soportan el modo pasivo.  Si su conexi&oacute;n se cuelga 
	      cuando usa el modo pasivo (el modo por defecto) pruebe el 
	      modo activo.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term>FTP Pasivo: <guimenuitem>Install from an FTP server through a
	      firewall</guimenuitem>, es decir 
	      <quote>Instalar desde un servidor FTP tras un 
	      cortafuegos</quote>.</term>
	  
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>modo pasivo</secondary>
	    </indexterm>

	    <para>Esta opci&oacute;n configura 
              <application>sysinstall</application> para que use el 
	      modo <quote>Pasivo</quote> para todas las operaciones 
	      FTP.  Esto permite al usuario pasar a trav&eacute;s de 
	      cortafuegos que no permiten conexiones entrantes a 
	      puertos TCP aleatorios.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term>FTP via un proxy HTTP: <guimenuitem>Install from an FTP server
	      through a http proxy</guimenuitem>, es decir 
              <quote>Instalar desde un servidor FTP via un proxy 
	      http</quote></term>
	    
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>via un proxy HTTP</secondary>
	    </indexterm>
	    
	    <para>Esta opci&oacute;n configura 
	      <application>sysinstall</application> para usar el 
	      el protocolo HTTP (como si fuera un navegador web) para 
	      conectarse a un proxy en todas las operaciones FTP.  El 
	      proxy traducir&aacute; las peticiones del usuario de forma 
	      que pasar&aacute;n a trav&eacute;s de un cortafuegos que 
	      no permita ning&uacute;n tipo de conexiones FTP pero 
	      ofrezca un proxy HTTP.  Tendr&aacute; que suministrar los 
	      datos del proxy adem&aacute;s de los del servidor 
	      FTP.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
      <para>Si quiere usar un servidor proxy FTP tendr&aacute; que usar 
	el nombre del servidor con el que realmente quiere conectar como 
	nombre de usuario seguido de un signo <quote>@</quote>.  Veamos un 
	ejemplo.  Quiere usted instalar desde 
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> a trav&eacute;s del 
	servidor proxy FTP 
	<hostid role="fqdn">foo.ejemplo.com</hostid>, que escucha en el 
	puerto 1024.</para>
      
      <para>Vaya al men&uacute; opciones, ponga 
	<literal>ftp@ftp.FreeBSD.org</literal> como nombre de usuario FTP, 
	y su direcci&oacute;n de correo electr&oacute;nico como 
	contrase&ntilde;a.  El medio de instalaci&oacute;n ser&aacute; FTP 
	(o FTP pasivo si el proxy lo permite) y la URL
	<literal>ftp://foo.ejemplo.com:1234/pub/FreeBSD</literal>.</para>

      <para>Dado accede al directorio <filename>/pub/FreeBSD</filename> 
	de <hostid role="fqdn">ftp.FreeBSD.org</hostid> a trav&eacute;s 
	del proxy <hostid role="fqdn">foo.ejemplo.com</hostid> puede usted
	instalar desde <emphasis>&eacute;sta</emphasis> m&aacute;quina, 
	que ir&aacute; descargando los ficheros que necesite desde 
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> a medida que el 
	proceso de instalaci&oacute;n los vaya requiriendo.</para> 
    </note>
  </sect1>

  <sect1 id="install-final-warning">
    <title>El punto sin retorno</title>

    <para>The installation can now proceed if desired.  This is also
      the last chance for aborting the installation to prevent changes
      to the hard drive.</para>

    <screen>                       User Confirmation Requested
 Last Chance! Are you SURE you want to continue the installation? 

 If you're running this on a disk with data you wish to save then WE
 STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding! 

 We can take no responsibility for lost disk contents!  

                             [ Yes ]    No</screen>

    <para>Es decir:</para>

   <screen>   Petici&oacute;n de confirmaci&oacute;n del usuario
 ¡Última oportunidad!.  ¿SEGURO que quiere seguir con la instalación?

 Si está ejecutando este proceso en un disco que contenga datos que 
 quiera coservar LE RECOMENDAMOS ENCARECIDAMENTE QUE HAGA COPIAS DE 
 SEGURIDAD FIABLES antes de instalar.

 No podemos asumir nigún tipo de responsabilidad por datos que pierda.

                             [ Yes ]    No</screen>


    <para>Seleccione &gui.yes; y pulse 
      <keycap>Intro</keycap>.</para>

    <para>La instalaci&oacute;n tardar&aacute; m&aacute;s o menos 
      tiempo seg&uacute;n la distribuci&oacute;n que haya elegido, el medio 
      de instalaci&oacute;n  y la velocidad del sistema.  Se le 
      mostrar&aacute;n mensajes durante el proceso para irle 
      informando.</para> 
    
    <para>Cuando acabe la instalaci&oacute;n ver&aacute; un mensaje como 
      este:</para>

    <screen>                               Message 

Congratulations! You now have FreeBSD installed on your system. 

We will now move on to the final configuration questions. 
For any option you do not wish to configure, simply select No. 

If you wish to re-enter this utility after the system is up, you may
do so by typing: /stand/sysinstall .  

                                 [ OK ] 

                      [  Press enter to continue  ]</screen>

    <para>Es decir:</para>

    <screen>                               Mensaje 

         ¡Enhorabuena! Ha instalado &os; en su sistema.

Ahora terminaremos la configuración del sistema.  Si hay alguna 
opción que no quiere configurar sencillamente elija No.

Si en algún momento quiere regresar a este programa pulse 
/stand/sysinstall .

                                 [ OK ]

                      [  Pulse Intro  ]</screen>


    <para>Tras pulsar <keycap>Intro</keycap> pasar&aacute; a la 
      configuraci&oacute;n posterior instalaci&oacute;n.</para>

    <para>Si selecciona &gui.no; y pulsa <keycap>Intro</keycap> 
      la instalaci&oacute;n se detendr&aacute; para no hacer 
      m&aacute;s modificaciones en su sistema.  Ver&aacute; el 
      el siguiente mensaje.</para>

    <screen>                                Message
Installation complete with some errors.  You may wish to scroll
through the debugging messages on VTY1 with the scroll-lock feature. 
You can also choose "No" at the next prompt and go back into the
installation menus to retry whichever operations have failed. 

                                 [ OK ]</screen>

    <para>Es decir:</para>

<screen>                                Mensaje
La instalación ha finalizado con errores.  Puede moverse por la 
pantalla de mensajes de depuración de VTY1 tras pulsar la tecla 
de Bloqueo de Pantalla.  También puede elegir "No" en el próximo
menú y volver a los menús de instalación para repetir cualquier 
operación que haya fallado.

                                 [ OK ]</screen>


    <para>Este mensaje se ha generado porque no se ha instalado nada.  
      Pulse <keycap>Intro</keycap> para volver al men&uacute;n 
      principal y salir de la instalaci&oacute;n.</para>
  </sect1>

  <sect1 id="install-post">
    <title>Despu&eacute;s de la instalaci&oacute;n</title>

    <para>Para poder terminar una instalaci&oacute;n debemos 
      responder todav&iacute;a a unas cuantas preguntas.  Estas opciones 
      se nos presentar&aacute;n de nuevo entrando en la 
      configuraci&oacute;n antes de entrar en el nuevo sistema &os; o 
      una vez en &eacute;l mediante 
      <command>/stand/sysinstall</command>, seleccionando 
      <guimenuitem>Configure</guimenuitem>.</para>

    <sect2 id="inst-network-dev">
      <title>Configuraci&oacute;n de dispositivos de red</title>

      <para>Si ha tenido que configurar PPP para poder hacer una 
	instalaci&oacute;n via FTP no se le mostrar&aacute; la siguiente 
	pantalla.</para>

      <para>Si necesita informaci&oacute;n detallada sobre Redes de 
	&Aacute;rea Local y la configuraci&oacute;n necesaria para 
	que &os; haga de <quote>gateway/router</quote> consulte el 
	cap&iacute;tulo 
	<link linkend="advanced-networking">Advanced Networking</link>
	.</para>

      <screen>                      User Confirmation Requested 
   Would you like to configure any Ethernet or SLIP/PPP network devices?

                             [ Yes ]   No</screen>

      <para>Selecciones &gui.yes; y pulse 
	<keycap>Intro</keycap> si quiere configurar dispositivos de 
	red; si no quiere, seleccione &gui.no;.</para>

      <figure id="ed-config1">
	<title>Selecci&oacute;n de un dispositivo Ethernet</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione con las flechas el interfaz de red que desea configurar 
	y pulse <keycap>Intro</keycap>.</para>

      <screen>                      User Confirmation Requested 
       Do you want to try IPv6 configuration of the interface?

                              Yes   [ No ]</screen>

      <para>En la red local del ejemplo el tipo de protocolo de Internet 
	que hab&iacute;a (<acronym>IPv4</acronym>) parec&iacute;a m&aacute;s 
	que suficiente as&iacute; que se eligi&oacute; &gui.no;.</para>

      <para>Si puede conectar con alguna red <acronym>IPv6</acronym> mediante 
	un servidor <acronym>RA</acronym> elija ·&gui.yes; y pulse 
	<keycap>Intro</keycap>.  La b&uacute;squeda de servidores RA 
	llevar&aacute; unos instantes.</para>

      <screen>                             User Confirmation Requested 
        Do you want to try DHCP configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Si no necesita DHCP seleccione &gui.no; con las flechas y pulse 
	<keycap>Intro</keycap>.</para>

      <para>Si selecciona &gui.yes; se ejecutar&aacute; 
	<application>dhclient</application>y , si ha funcionado, 
	encontrar&aacute; los datos de configuraci&oacute;n de la red 
	autom&aacute;ticamente.  Para m&aacute;s informaci&oacute;n consulte 
	la <xref linkend="network-dhcp">.</para>

      <para>La siguiente ilustraci&oacute;n muestra la configuraci&oacute;n 
	de un dispositivo Ethernet en un sistema que har&aacute; de 
	<quote>gateway</quote> para una red local.</para>

      <figure id="ed-config2">
	<title>Configuraci&oacute;n de ed0</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Use el <keycap>Tabulador</keycap> para ir pasando de un campo 
	al siguiente una vez que los vaya rellenando:</para>

      <variablelist>
	<varlistentry>
	  <term>Host</term>

	  <listitem>
            <para>El nombre totalmente cualificado del sistema 
	      (<quote>fully-qualified hostname</quote>) 
	      <hostid role="fqdn">k6-2.example.com</hostid> en 
	      este caso.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Dominio</term>

	  <listitem>
	    <para>El nombre del dominio al que pertenece su m&aacute;quina, 
	      en este caso 
	      <hostid role="domainname">example.com</hostid>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><quote>gateway</quote> IPv4</term>

	  <listitem>
	    <para>La direcci&oacute;n IP del sistema que reenv&iacute;a 
	      paquetes a destinos fuera de la red local.  Debe rellenar este 
	      campo si esta funci&oacute;n la realiza una m&aacute;quina 
	      que forma parte de la red.  <emphasis>D&eacute;jelo en 
	      blanco</emphasis> si el sistema es el enlace con Internet para 
	      su red.  El <quote>gateway</quote> IPv4 es conocido 
	      tambi&eacute;n  como puerta de enlace o ruta por 
	      defecto.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Servidor de nombres</term>

	  <listitem>
	    <para>Direcci&oacute;n IP de su servidor DNS local.  Dado que 
	      en la red del ejemplo no se dispone de un servidor DNS local
	      se ha introducido la direcci&oacute;n IP del servidor DNS del 
	      proveedor de Internet: 
	      <hostid role="ipaddr">208.163.10.2</hostid> .</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Direcci&oacute;n IPv4</term>

	  <listitem>
	    <para>En este interfaz se us&oacute;n la direcci&oacute;n IP 
	      <hostid role="ipaddr">192.168.0.1</hostid></para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Netmask</term>

	  <listitem>
	    <para>En esta red local se usa un bloque de redes de Clase C 
	      (<hostid role="ipaddr">192.168.0.0</hostid> -
	      <hostid role="ipaddr">192.168.255.255</hostid>).
	      La m&aacute;scara de red es, por tanto, tambi&eacute;n para 
	      una red de Clase C: 
	      (<hostid role="netmask">255.255.255.0</hostid>).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Opciones adicionales de ifconfig</term>

	  <listitem>
	    <para>Cualquier tipo de opci&oacute;n que quiera a&ntilde;adir 
	      a su interfaz mediante <command>ifconfig</command>.  
	      en nuestro caso no hab&iacute;a ninguna.</para>
	  </listitem>
	</varlistentry>

      </variablelist>

      <para>Use <keycap>Tab</keycap> to select &gui.ok;
	when finished and press <keycap>Enter</keycap>.</para>


      <screen>                      User Confirmation Requested 
        Would you like to Bring Up the ed0 interface right now?

                             [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y pulse 
	<keycap>Intro</keycap> si quiere conectar inmediatamente su 
	sistema a la red mediante el o los interfaces que acaba de 
	configurar, pero recuerde que a&uacute;n tendr&aacute; que 
	reiniciar la m&aacute;quina.</para>
    </sect2>

    <sect2 id="gateway">
      <title>Configuraci&oacute;n del <quote>gateway</quote></title>

      <screen>                       User Confirmation Requested 
       Do you want this machine to function as a network gateway?

                              [ Yes ]    No</screen>

      <para>Si el sistema har&aacute; de enlace de la red local y 
	reenviar&aacute; paquetes entre otras m&aacute;quinas elija 
	&gui.yes; y pulse <keycap>Intro</keycap>.  
	Si la m&aacute;quina es un nodo de una red elija 
	&gui.no; y pulse 
	<keycap>Intro</keycap>.</para>
    </sect2>

    <sect2 id="inetd-services">
      <title>Configuraci&oacute;n de servicios de Internet</title>

      <screen>                      User Confirmation Requested
Do you want to configure inetd and the network services that it provides?

                               Yes   [ No ]</screen>

      <para>Si selecciona &gui.no; varios servicios de la m&aacute;quina, 
	como <application>telnetd</application> y otros, no se 
	activar&aacute;n.  Eso significa que los usuarios remotos no 
	podr&aacute;n acceder al sistema mediante 
	<application>telnet</application>.  Los usuarios locales, en cambio, 
	podr&aacute;n acceder a sistemas remotos mediante 
	<application>telnet</application>.</para>

      <para>Dichos servicios pueden activarse en cualquier momento 
	editando <filename>/etc/inetd.conf</filename> con el editor de 
	texto que prefiera.  Para m&aacute;s informaci&oacute;n sobre esto 
	consulte la 
	<xref linkend="network-inetd-overview">.</para>

      <para>Seleccione &gui.yes; si desea configurar estos servicios 
	durante la instalaci&oacute;n.  Se le mostrar&aacute; el 
	siguiente mensaje:</para>

      <screen>                      User Confirmation Requested
The Internet Super Server (inetd) allows a number of simple Internet
services to be enabled, including finger, ftp and telnetd.  Enabling
these services may increase risk of security problems by increasing
the exposure of your system.

With this in mind, do you wish to enable inetd?

                             [ Yes ]   No</screen>

      <para>Es decir:</para>

      <screen>      Petición de confirmación por parte del usuario 
El Super Servidor de Internet (inetd) le permite activar diversos 
servicios sencillos de Internet, como finger, ftp y telnetd.  Si 
activa tales servicios puede sobreexponer su sistema al exterior, lo 
que puede incrementar el riesgo de tener problemas de seguridad.

Dicho esto ¿desea activar inetd?

                             [ Yes ]   No</screen>


      <para>Seleccione &gui.yes;.</para>

      <screen>                      User Confirmation Requested
inetd(8) relies on its configuration file, /etc/inetd.conf, to determine
which of its Internet services will be available.  The default FreeBSD
inetd.conf(5) leaves all services disabled by default, so they must be
specifically enabled in the configuration file before they will
function, even once inetd(8) is enabled.  Note that services for
IPv6 must be separately enabled from IPv4 services.

Select [Yes] now to invoke an editor on /etc/inetd.conf, or [No] to
use the current settings.

                             [ Yes ]   No</screen>

      <para>Es decir:</para>

      <screen>      Petición de confirmación por parte del usuario
inetd(8) depende de su fichero de configuración,  /etc/inetd.conf, donde 
se declara qué servicios de Internet se activarán.  El inetd.conf(5) por 
defecto de &os; trae todos los servicios desactivados, así que deben ser 
activados uno a uno en el fichero de configuración para que funcionen, 
incluso una vez que inetd(8) ya esté activado.  Recuerde que los servicios 
IPv6 se activan aparte de los servicios IPv4.

Elija [Yes] si quiere abrir /etc/inetd.conf en un editor y [No] si 
quiere dejarlo como está.

                             [ Yes ]   No</screen>



      <para>Si elige &gui.yes; podr&aacute; a&ntilde;adir servicios 
	de un modo muy sencillo: borre el caracter <literal>#</literal> 
	del principio de la l&iacute;nea donde est&eacute; el servicio 
	que quiera activar.</para>

      <figure id="inetd-edit">
	<title>Edici&oacute;n de <filename>inetd.conf</filename></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/edit-inetd-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Una vez a&ntilde;adidos servicios deseados, pulse 
	<keycap>Escape</keycap> y ver&aacute; un men&uacute; en el 
	que se le preguntar&aacute; si quiere guardar los cambios.</para>

    </sect2>

    <sect2 id="ftpanon">
      <title>FTP An&oacute;nimo</title>

      <screen>                      User Confirmation Requested
 Do you want to have anonymous FTP access to this machine? 

                              Yes    [ No ]</screen>

      <sect3 id="deny-anon">
	<title>Rechazar el FTP an&oacute;nimo</title>
      
	<para>Si elige la respuesta por defecto (&gui.no;) y pulsa 
	  <keycap>Intro</keycap> tenga en cuenta que los usuarios con 
	  cuenta en la m&aacute;quina pueden seguir accediendo a ella 
	  mediante FTP.</para>
      </sect3>

      <sect3 id="ftpallow">
	<title>Dar acceso FTP an&oacute;nimo</title>

	<para>Si lo activa cualquiera podr&aacute; conectarse 
	  an&oacute;nimamente a su m&aacute;quina con FTP.  Deber&iacute;a 
	  plantearse las implicaciones de seguridad antes de 
	  activar tal cosa.  Tiene m&aacute;s informaci&oacute;n sobre 
	  seguridad en el 
	  <xref linkend="security">.</para>

	<para>Si quiere activar el FTP an&oacute;nimo seleccione &gui.yes; 
	  con las flechas y pulse <keycap>Intro</keycap>.  Ver&aacute; 
	  la siguiente pantalla (o una muy similar):</para>

	<figure id="anon-ftp2">
	  <title>Configuraci&oacute;n por defecto del FTP 
	    an&oacute;nimo</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon1" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Para ver la ayuda pulse <keycap>F1</keycap>:</para>

	<screen>This screen allows you to configure the anonymous FTP user.

The following configuration values are editable:

UID:     The user ID you wish to assign to the anonymous FTP user.
         All files uploaded will be owned by this ID.

Group:   Which group you wish the anonymous FTP user to be in.

Comment: String describing this user in /etc/passwd


FTP Root Directory:

        Where files available for anonymous FTP will be kept.

Upload subdirectory:

        Where files uploaded by anonymous FTP users will go.</screen>

	<para>Es decir:</para>

<screen>En esta pantalla puede configurar el usuario de FTP 
        anónimo.

Puede editar los siguientes valores de la configuración:

UID:     El ID del usuario que quiere asignar al usuario anónimo de 
         de FTP.  Todos los ficheros que se suban le  pertenecerán.

Group:   El grupo al que pertenecerá el usuario FTP anónimo.

Comment: La descripción del usuario en /etc/passwd


FTP Root Directory:

        Dónde se guardarán contenidos para los usuarios anónimos.

Upload subdirectory:

        Dónde se guardarán los ficheros que suban los usuarios 
	de FTP anónimo.</screen>

	<para>Por defecto en directorio ra&iacute;z del ftp se ir&aacute; 
	  en <filename>/var</filename>.  Si no hay sitio suficiente para 
	  lo que prevea que va a necesitar puede usar 
	  <filename>/usr</filename>, puede poner el Directorio Ra&iacute;z de 
	  FTP en <filename>/usr/ftp</filename>.</para>

	<para>Cuando haya terminado con la configuraci&oacute;n pulse 
	  <keycap>Intro</keycap>.</para>

	<screen>                          User Confirmation Requested 
         Create a welcome message file for anonymous FTP users?

                              [ Yes ]    No</screen>

	<para>Si selecciona &gui.yes; y pulsa <keycap>Intro</keycap> 
	  arrancar&aacute; autom&aacute;ticamente un editor y podr&aacute; 
	  crear un mensaje que ver&aacute; los usuarios de FTP 
	  an&oacute;nimo al conectarse a la m&aacute;quina.</para>

	<figure id="anon-ftp4">
	  <title>Edici&oacute;n del mensaje de bienvenida de FTP</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon2" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Vemos en acci&oacute;n un editor de texto llamado 
	  <command>ee</command>.  Puede cambiar el mensaje ahora mismo 
	  o hacerlo en cualquier otro momento con el editor de texto que 
	  prefiera.  Observe el nombre del fichero y su ubicaci&oacute;n 
	  en la parte baja de la pantalla.</para>  

	<para>Pulse <keycap>Escape</keycap> y aparecer&aacute; una 
	  ventana flotante con la opci&oacute;n por defecto de 
	  <guimenuitem>a) leave editor</guimenuitem> (salir del editor).  
	  Pulse <keycap>Intro</keycap> si quiere salir y continuar.  Pulse 
	  <keycap>Intro</keycap> de nuevo si quiere guardar los cambios si 
	  es que hizo alguno.</para>
      </sect3>
    </sect2>

    <sect2 id="nfsconf">
      <title>Configuraci&oacute;n de NFS</title>

      <para>NFS (<quote>Network File System</quote> o Sistema de Ficheros 
	en Red) le permite compartir ficheros a trav&eacute;s de una red.  
	Una m&aacute;quina puede configurarse como servidor, como cliente y 
	como ambos.  Para m&aacute;s informaci&oacute;n consulte la 
	<xref linkend="network-nfs">.</para>

      <sect3 id="nsf-server-options">
	<title>NFS Server</title>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS server? 

                              Yes    [ No ]</screen>

	<para>Si no tiene necesidad de usar un servidor NFS seleccione 
	  &gui.no; y pulse 
	  <keycap>Intro</keycap>.</para>

	<para>Si ha elegido &gui.yes; ver&aacute; un mensaje emergente 
	  indicando que debe crearse el fichero 
	  <filename>exports</filename>.</para>

	<screen>                               Message
Operating as an NFS server means that you must first configure an
/etc/exports file to indicate which hosts are allowed certain kinds of
access to your local filesystems.
Press [Enter] now to invoke an editor on /etc/exports
                               [ OK ]</screen>

	<para>Es decir:</para>

	<screen>                               Mensaje
Hacer funcionar un servidor NFS implica que tendrá que configurar 
un fichero /etc/exports para indicar qué hosts estarán autorizados a 
acceder de qué manera a sus sistemas de ficheros locales.
Pulse [Intro] para abrir /etc/exports en un editor
                               [ OK ]</screen>


	<para>Pulse <keycap>Intro</keycap> para seguir adelante.  Se 
	  abrir&aacute; un editor de texto gracias al cual se podr&aacute; 
	  editar y crear el fichero <filename>exports</filename>.</para>

	<figure id="nfs-server-edit">
	  <title>Edici&oacute;n de <filename>exports</filename></title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/nfs-server-edit" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Puede editar el fichero ahora mismo o m&aacute;s tarde con 
	  el editor de texto que prefiera.  Observe que el nombre del 
	  fichero y su ubicaci&oacute;n aparecen en la parte de abajo de 
	  de la pantalla.</para>

	<para>Pulse <keycap>Escape</keycap>, aparecer&aacute; un mensaje 
	  emergente que por defecto le ofrecer&aacute; 
	  <guimenuitem>a) leave editor</guimenuitem> (es decir, salir del 
	  editor).  Pulse <keycap>Intro</keycap> para salir del editor y 
	  seguir adelante.</para>
      </sect3>

      <sect3 id="nfs-client-options">
	<title>Cliente NFS</title>

	<para>El cliente NFS hace que su m&aacute;quina pueda acceder a 
	  servidores NFS.</para>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS client? 

                              Yes   [ No ]</screen>

	<para>Seleccione con las flechas la opci&oacute;n que 
	  prefiera ( &gui.yes; o &gui.no; ) y pulse 
	  <keycap>Intro</keycap>.</para>
      </sect3>
    </sect2>

    <sect2 id="securityprofile">
      <title>El Perfil de seguridad</title>

      <para>un <quote>perfil de seguridad</quote> es un conjunto de 
	opciones de configuraci&oacute;n que intenta suministrar el 
	grado de seguridad deseado activando y desactivando ciertos 
	programas entre otras cosas.  Cuanto m&aacute;s 
	restrictivo es el perfil de seguridad menos programas activa 
	por defecto.  Se trata de uno de los principios b&aacute;sicos de 
	la seguridad: <emphasis>ejecuta s&oacute;lamente lo que 
	necesites</emphasis>.</para>

      <para>Por favor, tenga muy en cuenta que un perfil de seguridad 
	es s&oacute;lamente una configuraci&oacute;n por defecto.  
	Todos los programas pueden activarse y desactivarse una vez 
	que haya instalado &os; modificando o a&ntilde;adiendo las 
	l&iacute;neas correspondientes en <filename>/etc/rc.conf</filename>.  
	Para m&aacute;s informaci&oacute;n consulte 
	&man.rc.conf.5;.</para>

      <para>La siguiente tabla muestra qu&eacute; proporciona cada 
	perfil de seguridad.  Las columnas son las opciones que tiene 
	para cada perfil de seguridad y las filas son los programas o 
	caracter&iacute;sticas que el perfil activa o desactiva.</para> 

      <table>
	<title>Perfiles de seguridad posibles</title>

	<tgroup cols=3>
	  <thead>
	    <row>
	      <entry></entry>

	      <entry>Extremo</entry>

	      <entry>Moderado</entry>
	    </row>
	  </thead>

	  <tbody>

	    <row>
	      <entry>&man.sendmail.8;</entry>

	      <entry>NO</entry>

	      <entry>S&Iacute;</entry>
	    </row>

	    <row>
	      <entry>&man.sshd.8;</entry>

	      <entry>NO</entry>

	      <entry>S&Iacute;</entry>
	    </row>

	    <row>
	      <entry>&man.portmap.8;</entry>

	      <entry>NO</entry>

	      <entry>ES POSIBLE
		<footnote>
		  <para>portmapper se activa en la propia instalaci&oacute;n 
		    si la m&aacute;quina va a disponer de un cliente o 
		    o un servidor NFS.</para>
		</footnote>
	      </entry>
	    </row>

	    <row>
	      <entry>Servidor NFS</entry>

	      <entry>NO</entry>

	      <entry>S&Iacute;</entry>
	    </row>

	    <row>
	      <entry>&man.securelevel.8;</entry>

	      <entry>S&Iacute;
		<footnote>
		  <para>Si elige un perfil de seguridad que implante un 
		    nivel de seguridad <quote>Extremo</quote> o 
		    <quote>Alto</quote> debe ser consciente de las 
		    implicaciones.  Por favor, lea &man.init.8; y 
		    ponga especial atenci&oacute;n en el significado de 
		    los niveles de seguridad o puede encontrarse m&aacute;s 
		    tarde con problemas bastante serios.</para>
		</footnote>
	      </entry>

	      <entry>NO</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <screen>                       User Confirmation Requested
 Do you want to select a default security profile for this host (select
 No for "medium" security)? 

                            [ Yes ]    No</screen>

      <para>Seleccionando &gui.no; y pulsando despu&eacute;s 
	<keycap>Intro</keycap> asignar&aacute; al sistema un perfil de 
	seguridad medio.</para>

      <para>Si selecciona &gui.yes; y pulsa 
	<keycap>Intro</keycap> podr&aacute; elegir otro perfil de 
	seguridad.</para>

      <figure id="security-profile">
	<title>Opciones de los perfiles de seguridad</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/security" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Pulse <keycap>F1</keycap> para consultar la ayuda.  Pulse 
	<keycap>Intro</keycap> y volver&aacute; al men&uacute; 
	de selecci&oacute;n.</para>

      <para>Use las flechas para elegir <guimenuitem>Medium</guimenuitem> 
	a menos que con total seguridad otro nivel de seguridad sea lo 
	que necesite.  Una vez seleccionado &gui.ok; pulse 
	<keycap>Intro</keycap>.</para>

      <para>Seg&uacute;n qu&eacute; tipo de perfil se haya elegido ver&aacute; 
	un mensaje de confirmaci&oacute;n diferente.</para>

      <screen>                                 Message

Moderate security settings have been selected.

Sendmail and SSHd have been enabled, securelevels are
disabled, and NFS server setting have been left intact.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a standard set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>

	<para>Es decir:</para>

	<screen>                                 Mensaje

Ha elegido un perfil de seguridad medio.

Sendmail y SSHd han sido activados, los 'securelevels' han 
sido desactivados y el NFS no se ha tocado.  POR FAVOR, 
TENGA EN CUENTA que esto no le exime de asegurar correctamente 
su sistema mediante otras técnicas o ejercicios diligentes 
de administración.  Esto simplemente le da una norma 
que funciona para usarla como punto de partida.

Edite /etc/rc.conf para modificar la configuración.

                                  [OK]</screen>

      <screen>                                 Message

Extreme security settings have been selected.

Sendmail, SSHd, and NFS services have been disabled, and
securelevels have been enabled.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a more secure set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>
	<para>Es decir:</para>

	<screen>                                 Mensaje

Ha seleccionado un perfil de seguridad extremo.

Se han desactivado los servicios de sendmail, SSHd y NFS. 
Se han activado los 'securelevels'.
POR FAVOR, TENGA EN CUENTA QUE esto no le exime de asegurar 
correctamente su sistema mediante otras técnicas o ejercicios 
diligentes de administración.  Esto simplemente le da una 
norma que funciona para usarla como punto de partida.

Edite /etc/rc.conf para modificar la configuración.

                                  [OK]</screen>


      <para>Pulse <keycap>Intro</keycap> para proseguir con la 
	configuraci&oacute;n posterior a la instalaci&oacute;n.</para>

      <warning>
	<para>&iexcl;Los perfiles de seguridad no son varitas 
	  m&aacute;gicas!  Aunque use un perfil de seguridad 
	  extremo tendr&aacute; que estar al d&iacute;a en cuestiones 
	  de seguridad: lea alguna lista de correo adecuada 
	  (como la <xref linkend="eresources-mail">), 
	  use contrase&ntilde;as robustas y hablando en general, 
	  conozca y aplique pr&aacute;cticas seguras.</para>
      </warning>

    </sect2>

    <sect2 id="console">
      <title>Configuraci&oacute;n de la consola del sistema</title>

      <para>La consola tiene unos cuantos par&aacute;metros que puede 
	configurar aqu&iacute; mismo.</para>

      <screen>                      User Confirmation Requested 
       Would you like to customize your system console settings?

                              [ Yes ]  No</screen>

      <para>Seleccione &gui.yes; y pulse <keycap>Intro</keycap> 
	para ver y configurar las opciones.</para>

      <figure id="saver-options">
	<title>Opciones de configuraci&oacute;n de la consola del 
	  sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Una opci&oacute;n que suele elegirse es el uso del 
	salvapantallas.  Elija <guimenuitem>Saver</guimenuitem> y 
	luego pulse <keycap>Intro</keycap>.</para>

      <figure id="saver-select">
	<title>Opciones del salvapantallas</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Despl&aacute;cese arriba y abajo con las flechas por la 
	lista de salvapantallas y elija el que prefiera pulsando 
	<keycap>Intro</keycap> sobre &eacute;l.  Se le mostrar&aacute; 
	de nuevo el men&uacute; de configuraci&oacute;n de la consola.</para>

      <para>El intervalo por defecto es de 300 segundos.  Si quiere cambiarlo 
	seleccione <guimenuitem>Saver</guimenuitem> otra vez.  Busque 
	<guimenuitem>Timeout</guimenuitem> en el men&uacute; de opciones del 
	salvapantallas y pulse <keycap>Intro</keycap>.  Aparecer&aacute; un 
	mensaje en pantalla:</para>

      <figure id="saver-timeout">
	<title>Retardo del salvapantallas</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>El valor del retardo del salvapantallas puede ajustarse aqu&iacute; 	a voluntad;  seleccione &gui.ok; y pulse <keycap>Intro</keycap> 
	para regresar al men&uacute; de configuraci&oacute;n de la 
	consola.</para>

      <figure id="saver-exit">
	<title>Salida de la configuraci&oacute;n de la consola</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Exit</guimenuitem> y pulse 
	<keycap>Intro</keycap> para poder seguir con la configuraci&oacute;n 
        del sistema.</para>
    </sect2>

    <sect2 id="timezone">
      <title>Configuraci&oacute;n de la zona horaria</title>

      <para>Si su sistema tiene correctamente configurada la zona 
	horaria podr&aacute; corregir cualquier autom&aacute;ticamente 
	cualquier cambio horario regional, as&iacute; como cumplir 
	adecuadamente con otras funciones relacionadas con zonas 
	horarias.</para>

      <para>El ejemplo que se muestra en las capturas de pantalla es 
	de una m&aacute;quina ubicada en la zona horaria del Este de los 
	Estados Unidos.</para>

      <screen>                      User Confirmation Requested 
          Would you like to set this machine's time zone now?

                            [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y pulse 
	<keycap>Intro</keycap>.  Vamos a configurar la zona horaria del 
	sistema.</para>

      <screen>                       User Confirmation Requested
 Is this machine's CMOS clock set to UTC? If it is set to local time
 or you don't know, please choose NO here! 

                              Yes   [ No ]</screen>

      <para>Seleccione &gui.yes; o &gui.no; seg&uacute;n sea la 
	configuraci&oacute;n del sistema y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="set-timezone-region">
	<title>Elecci&oacute;n de regi&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija la regi&oacute;n que corresponda movi&eacute;ndose con 
	las flechas y pulsando <keycap>Intro</keycap> cuando sea 
	conveniente.</para>

      <figure id="set-timezone-country">
	<title>Elija pa&iacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija el pa&iacute;s que m&aacute;s se adapte a su 
	situaci&oacute;n geogr&aacute;fica exacta y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="set-timezone-locality">
	<title>Elija su zona horaria</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Elija la zona horaria que le corresponda con las flechas 
	y pulse <keycap>Intro</keycap>.</para>

      <screen>                            Confirmation 
            Does the abbreviation 'EDT' look reasonable?

                            [ Yes ]   No</screen>

      <para>Confirme si la abreviatura de la zona horaria es correcta.  
	Si es as&iacute; pulse <keycap>Intro</keycap> y siga 
	adelante.</para>
    </sect2>

    <sect2 id="linuxcomp">
      <title>Compatibilidad con Linux</title>

      <screen>                      User Confirmation Requested 
          Would you like to enable Linux binary compatibility?

                            [ Yes ]   No</screen>

      <para>Si selecciona &gui.yes; y pulsa 
	<keycap>Intro</keycap> podr&aacute; ejecutar software Linux en 
	FreeBSD.  La instalaci&oacute;n a&ntilde;adir&aacute; los paquetes 
	necesarios para poder tener compatibilidad binaria con 
	Linux.</para>

      <para>Si realiza la instalaci&oacute;n por FTP la m&aacute;quina 
	necesitar&aacute; conectarse a Internet.  A veces los servidores 
	ftp no tienen todas las distribuciones, de forma que si no puede 
	instalar la distribuci&oacute;n de compatibilidad con Linux no se 
	preocupe, puede probar con otro servidor o instalarla m&aacute;s 
	tarde.</para>
    </sect2>

    <sect2 id="mouse">
      <title>Configuraci&oacute;n del rat&oacute;n</title>

      <para>Esta opci&oacute;n le permitir&aacute; cortar y pegar texto en 
	consola y en otros programas mediante un rat&oacute;n de tres 
	botones.  Consulte &man.moused.8 si usa uno de 2 botones, es posible 
	emular ese tercer bot&oacute;n.  En el siguiente ejemplo veremos la 
	configuraci&oacute;n de un rat&oacute;n <quote>no USB</quote> (es 
	decir, PS/2 o de puerto COM):</para> 

      <screen>                      User Confirmation Requested 
         Does this system have a non-USB mouse attached to it?

                            [ Yes ]    No </screen>

      <para>Seleccione &gui.yes; en el caso de un ra&oacute;n 
	no USB o &gui.no; si tiene un rat&oacute;n USB y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="mouse-protocol">
	<title>Elija el protocolo que usa el rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Type</guimenuitem> mediante las 
	flechas y pulse <keycap>Intro</keycap>.</para>

      <figure id="set-mouse-protocol">
	<title>Ajuste del procolo del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>En el ejemplo se ha usado un rat&oacute;n PS/2, as&iacute; que 
	<guimenuitem>Auto</guimenuitem> era correcto.  Para cambiar el 
	protocolo use las flechas para moverse por el men&uacute; y elegir otra 
	opci&oacute;n.  Para salir seleccione &gui.ok; y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="config-mouse-port">
	<title>Configuraci&oacute;n del puerto del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>Port</guimenuitem> y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="set-mouse-port">
	<title>Configuraci&oacute;n del puerto del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Este sistema tiene un rat&oacute;n PS/2, de forma que la 
	configuraci&oacute;n por defecto (<guimenuitem>PS/2</guimenuitem>) 
	basta.  Si quiere modificarla use las flechas y pulse 
	<keycap>Intro</keycap>.</para>

      <figure id="test-daemon">
	<title>Arranque del d&aelig;mon del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse5" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Para terminar, seleccione con las flechas 
	<guimenuitem>Enable</guimenuitem> (activar) y pulse 
	<keycap>Intro</keycap>:  as&iacute; se activa y prueba 
	el d&aelig;mon del rat&oacute;n.</para>


      <figure id="test-mouse-daemon">
	<title>Prueba del d&aelig;mon del rat&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse6" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Mueva el rat&oacute;n un poco por la pantalla hasta 
	asegurarse de que el cursor responde adecuadamente.  Si todo 
	es correcto seleccione &gui.yes; y pulse 
	<keycap>Intro</keycap>.  Si hay algo que no funciona correctamente 
	seleccione &gui.no; e int&eacute;ntelo con otras opciones de 
	configuraci&oacute;n.</para>

      <para>Seleccione <guimenuitem>Exit</guimenuitem> y pulse 
	<keycap>Intro</keycap> para volver a la configuraci&oacute;n 
	del sistema.</para>
    </sect2>

    <sect2 id="network-services">
      <title>Configuraci&oacute;n de servicios adicionales de 
	red</title>

      <para>La configuraci&oacute;n de servicios de red puede ser una 
	verdadera pesadilla para el usuario poco experimentado, sobre todo 
	si las redes son un campo que no conoce demasiado bien.  Las 
	redes, incluyendo Internet, son un campo de vital importancia en 
	todo lo relacionado con los sistemas operativos modernos y entre 
	ellos por supuesto que est&aacute; &os;;  por lo tanto le 
	resultar&aacute; muy &uacute;til tener unas nociones de las 
	vastas funciones de red que puede desarrollar &os;.  El hacerlo 
	durante la instalaci&oacute;n sirve para asegurar que los 
	usuarios tienen al menos una comprensi&oacute;n aproximada 
	de los diversos servicios de que pueden disponer.</para>

      <para>Los servicios de red son programas que aceptan conexiones 
	de cualquiera en la red.  Se han hecho todos los esfuerzos 
	posibles para que ning&uacute;n programa haga nada 
	<quote>malo</quote> pero por desgracia los programadores no 
	son perfectos y a lo largo de los a&ntilde;os han aparecido casos 
	de errores en servicios de red que han sido aprovechados por 
	atacantes para hacer todo tipo de maldades.  Es muy importante 
	que active s&oacute;lamente los servicios de red que sabe que 
	necesita.  Si duda, lo mejor es que no arranque un servicio de red 
	que no sabe si necesita.  Recuerde que siempre puede activar ese 
	servicio cuando se asegure de que lo necesite ejecutando 
	<application>sysinstall</application> o modificando 
	<filename>/etc/rc.conf</filename>.</para>

      <para>Si selecciona la opci&oacute;n <guimenu>Networking</guimenu> 
	ver&aacute; un men&uacute; muy similar a este:</para>

      <figure id="network-configuration">
	<title>Configuraci&oacute;n de la red, primera parte</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La primera opci&oacute;n, <guimenuitem>Interfaces</guimenuitem>, 
	se describi&oacute; en la <xref linkend="inst-network-dev">, 
	as&iacute; que podemos ignorarla.</para>

      <para>Si elige <guimenuitem>AMD</guimenuitem> activar&aacute; la 
	utilidad de montaje autom&aacute;tica de <acronym>BSD</acronym>.  
	Normalmente se usa junto con <acronym>NFS</acronym> (ver 
	m&aacute;s adelante) para montar autom&aacute;ticamente sistemas 
	de ficheros remotos.  No hay m&aacute;s configuraci&oacute;n que 
	podamos hacer adem&aacute;s de activar o desactivar el 
	servicio.</para>

      <para>En la siguiente l&iacute;nea vemos la opci&oacute;n 
	<guimenuitem>AMD Flags</guimenuitem>.  Si la selecciona 
	aparecer&aacute; un men&uacute; emergente para que configure 
	los par&aacute;metros de <acronym>AMD</acronym>.  El men&uacute; 
	contiene un conjunto de opciones por defecto:</para>

      <screen>-a /.amd_mnt -l syslog /host /etc/amd.map /net /etc/amd.map</screen>

      <para>La opci&oacute;n <option>-a</option> ajusta el punto de 
	montaje, en este caso <filename>/.amd_mnt</filename>.  
	La opci&oacute;n <option>-l</option> declara el fichero 
	<quote>log</quote> por defecto.  Por otra parte, si se usa 
	<literal>syslogd</literal> toda la actividad de 
	<quote>logs</quote> se enviar&aacute; al d&aelig;mon de 
	<quote>logs</quote> del sistema.  El directorio 
	<filename role="directory">/host</filename> se usa 
	para montar un sistema de ficheros exportado por un 
	sistema remoto, mientras que el directorio 
	<filename role="directory">/net</filename> se usa para 
	montar un sistema de ficheros que se exporta desde una 
	direcc&oacute;n <acronym>IP</acronym>.  El fichero 
	<filename>/etc/amd.map</filename> define las opciones 
	de exportaci&oacute;n por defecto de 
	<acronym>AMD</acronym>.</para>

      <para>La opci&oacute;n <guimenuitem>Anon FTP</guimenuitem> permite 
	conexiones <acronym>FTP</acronym> an&oacute;nimas.  Seleccione 
	esta opci&oacute;n para convertir su sistema en un servidor 
	<acronym>FTP</acronym> an&oacute;nimo.  Tenga en cuenta las 
	implicaciones de seguridad de tal hecho.  Se le mostrar&aacute; 
	otro men&uacute; para explicarle en profundidad los riesgos de 
	seguridad y la configuraci&oacute;n.</para>

      <para>El men&uacute; de configuraci&oacute;n 
	<guimenuitem>Gateway</guimenuitem> le servir&aacute; para 
	configurar su sistema como un <quote>gateway</quote> tal y como 
	se ha descrito previamente.  Tambi&eacute;n puede usarse para 
	desactivar la opci&oacute;n <guimenuitem>Gateway</guimenuitem> 
	si por error la seleccion&oacute;n durante el proceso de 
	instalaci&oacute;n.</para>

      <para>La opci&oacute;n <guimenuitem>Inetd</guimenuitem> puede usarse 
	para configurar o desactivar totalmente el d&aelig;mon 
	&man.inetd.8; como se ha descrito antes.</para>

      <para>La opci&oacute;n <guimenuitem>Mail</guimenuitem> se usa para 
	configurar el <acronym>MTA</acronym> (<quote>Mail Transfer 
	Agent</quote>, o Agente de Transferencia de Correo) por defecto del 
	del sistema.  Si selecciona &eacute;sta opci&oacute;n ver&aacute; 
	el siguiente men&uacute;:</para>

      <figure id="mta-selection">
	<title>Selecci&oacute;n del MTA por defecto</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mta-main" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Aqu&iacute; puede elegir qu&eacute; 
	<acronym>MTA</acronym> instalar en el sistema.  Un 
	<acronym>MTA</acronym> es ni m&aacute;s ni menos que un servidor 
	de correo que gestiona el correo electr&oacute;nico para usuarios 
	del sistema o incluso del resto de Internet.</para>

      <para>Si selecciona <guimenuitem>Sendmail</guimenuitem> 
	instalar&aacute; el ya tradicional <application>sendmail</application>, 
	que es el <acronym>MTA</acronym> por defecto de &os;.  La 
	opci&oacute;n <guimenuitem>Sendmail local</guimenuitem> har&aacute; 
	que <application>sendmail</application> sea el 
	<acronym>MTA</acronym> por defecto pero desactiva su funci&oacute;n 
	de recibir correo entrante desde Internet.  Las otras opciones 
	disponibles, <guimenuitem>Postfix</guimenuitem> y 
	<guimenuitem>Exim</guimenuitem> funcionan de forma similar a 
	<guimenuitem>Sendmail</guimenuitem>.  Ambos gestionan correo 
	electr&oacute;nico, aunque hay usuarios que prefieren una de esas 
	alternativas a usar <application>sendmail</application> como 
	<acronym>MTA</acronym>.</para>

      <para>Tras seleccionar un <acronym>MTA</acronym> (o quiz&aacute;s 
	haya elegido no usar <acronym>MTA</acronym>) aparecer&aacute; la 
	siguiente opci&oacute;n del men&uacute; de configuraci&oacute;n de 
	la red: <guimenuitem>NFS client</guimenuitem>.</para> 

      <para>La opci&oacute;n <guimenuitem>NFS client</guimenuitem> 
	configurar&aacute; el sistema para que pueda comunicarse con un 
	servidor via <acronym>NFS</acronym>.  Un servidor 
	<acronym>NFS</acronym> hace que sus sistemas de ficheros sean 
	accesibles para otras m&aacute;quinas a trav&eacute;s de la red 
	mediante el protocolo <acronym>NFS</acronym>.  Si el suyo es un 
	sistema que no va a conectarse a ninguna red puede dejar la 
	opci&oacute;n como est&aacute;.  Es posible que el sistema 
	necesite ser configurado m&aacute;s adelante; consulte la 
	<xref linkend="network-nfs">, donde hay m&aacute;s informaci&oacute;n 
	sobre la configuraci&oacute;n como cliente y como 
	servidor.</para>

      <para>La siguiente opci&oacute;n es 
	<guimenuitem>NFS server</guimenuitem>, que le permitir&aacute; 
	convertir el sistema en un servidor <acronym>NFS</acronym>.  
	Tambi&eacute;n a&ntilde;ade la informaci&oacute;n necesaria para 
	el arranque de servicios <acronym>RPC</acronym>.  
	<acronym>RPC</acronym> se usa para coordinar conexiones entre 
	m&aacute;quinas y programas.</para>

      <para>La siguiente en la lista es la opci&oacute;n 
	<guimenuitem>Ntpdate</guimenuitem>, relacionada con la 
	gesti&oacute;n de la sincronizaci&oacute;n del reloj del 
	sistema.  Si la selecciona ver&aacute; un men&uacute; como 
	este:</para>

      <figure id="Ntpdate-config">
	<title>Configuraci&oacute;n de ntpdate</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ntp-config" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Desde este men&uacute; elija el servidor m&aacute;s 
	pr&oacute;ximo a su ubicaci&oacute;n geogr&aacute;fica.  
	Al elegir un servidor m&aacute;s pr&oacute;ximo hace que la 
	sincronizaci&oacute;n sea m&aacute;s fiable que contra un 
	servidor m&aacute;s lejano, que puede tener una latencia 
	m&aacute;s alta en las conexiones.</para>

      <para>La siguiente opci&oacute;n es <acronym>PCNFSD</acronym>.  
	Esta opci&oacute;n instalar&aacute; el paquete 
	<filename role="package">net/pcnfsd</filename> desde la 
	colecci&oacute;n de ports.  Es una aplicaci&oacute;n muy 
	&uacute;til que facilita servicios de autenticaci&oacute;n en 
	<acronym>NFS</acronym> para sistemas que son incapaces de 
	darla por s&iacute; mismos, l&eacute;ase el sistema operativo 
	&ms-dos; de Microsoft.</para>

      <para>Ahora baje un poco por la pantalla y vea 
	el resto el opciones:</para>

      <figure id="Network-configuration-cont">
	<title>Configuraci&oacute;n de la red; segunda parte</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>&man.rpcbind.8;, &man.rpc.statd.8; y &man.rpc.lockd.8; se 
	usan en (<acronym>RPC</acronym>).  <command>rpcbind</command>
	gestiona la comunicaci&oacute;n entre servidores y clientes 
	<acronym>NFS</acronym>; es una parte imprescindible del sistema 
	si se quiere que un servidor <acronym>NFS</acronym> funcione 
	correctamente.  El d&aelig;mon <application>rpc.statd</application> 
	interact&uacute;a con el d&aelig;mon 
	<application>rpc.statd</application> de otros servidores y 
	proporciona monitorizaci&oacute;n de estado.  Los informes que 
	suministra suelen encontrarse en 
	<filename>/var/db/statd.status</filename>.  La siguiente 
	opci&oacute;n que encontramos es <guimenuitem>rpc.lockd</guimenuitem> 
	que, si se activa, proporciona servicios de bloqueo de ficheros.  
	Se suele utilizar mediante <application>rpc.statd</application> 
	para monitorizar qu&eacute; hosts est&aacute;n pidiendo bloqueos y 
	con qu&eacute;n frecuencia lo hacen.  Aunque estas dos &uacute;ltimas 
	opciones son fant&aacute;sticas para la depuraci&oacute;n de 
	problemas no son necesarias para el funcionamiento de clientes y 
	servidores <acronym>NFS</acronym>.</para>

      <para>Si sigue avanzando en la lista se encontrar&aacute; con 
	<guimenuitem>Routed</guimenuitem>, el d&aelig;mon de 
	enrutado.  &man.routed.8; gestiona bajo petici&oacute;n 
	las tablas de rutas de cualquier host  f&iacute;sicamente conectado 
	a la red.  Suele usarse en sistemas que hacen de 
	<quote>gateway</quote> de una red local.  Si lo selecciona se le 
	presentar&aacute; un men&uacute; en el que se le pedir&aacute; 
	la ubicaci&oacute;n de la aplicaci&oacute;n.  Viene definida por 
	defecto y puede aprobarla pulsando <keycap>Intro</keycap>.  Se le 
	presentar&aacute;n entonces otro men&uacute;, en el que podr&aacute; 
	inclu&iacute;r <quote>flags</quote> (par&aacute;metros) a 
	<application>routed</application>.  La opci&oacute;n por defecto 
	es <option>-q</option> y deber&iacute;a constar ya en pantalla.</para>

      <para>La siguiente es la opci&oacute;n <guimenuitem>Rwhod</guimenuitem> 
	que, una vez activada, arrancar&aacute; el d&aelig;mon &man.rwhod.8; 
	en el arranque del sistema.  La aplicaci&oacute;n 
	<command>rwhod</command> enviar&aacute; peri&oacute;dicamente (en modo 
	<quote>broadcast</quote>) mensajes de sistema a trav&eacute;s de 
	la red, o los recoger&aacute; si se le configura en modo  
	<quote>consumer</quote>.  Tiene m&aacute;s informaci&oacute;n sobre 
	esto en &man.ruptime.1; y &man.rwho.1;.</para>

      <para>La pen&uacute;ltima opci&oacute;n del men&uacute; es el 
	d&aelig;mon &man.sshd.8;.  Se trata del servidor de shell 
	segura de <application>OpenSSH</application> y su uso es del 
	todo recomendable en lugar de <application>telnet</application> y 
	<acronym>FTP</acronym>.  El servidor <application>sshd</application> 
	se emplea para crear conexiones seguras entre hosts mediante 
	conexiones cifradas.</para>

      <para>Para terminar tenemos la opci&oacute;n 
	<guimenuitem>TCP Extensions</guimenuitem>.  Activa las 
	extensiones <acronym>TCP</acronym> definidas en los 
	<acronym>RFC</acronym>&nbsp;1323 y <acronym>RFC</acronym>&nbsp;1644.  
	Aunque en muchos sistemas activar 
	<guimenuitem>TCP Extensions</guimenuitem> puede acelerar las 
	conexiones puede provocar que se rechacen algunas.  No se recomienda 
	hacerlo, por tanto, en servidores pero puede ser beneficioso en otros 
	casos.</para>

      <para>Ahora que ha configurado los servicios de red puede seleccionar 
	<guimenuitem>Exit</guimenuitem> y pasar a la siguiente secci&oacute;n 
	de la configuraci&oacute;n.</para>

    </sect2>

    <sect2 id="x-server">
      <title>Configuraci&oacute;n del servidor X</title>

      <para>Si quiere usar un interfaz gr&aacute;fico de usuario como 
	<application>KDE</application>, <application>GNOME</application>, 
	u otros, tendr&aacute; que configurar un servidor X.</para>

      <note>
        <para>Si necesita ejecutar <application>&xfree86;</application> 
	  como un usuario distinto de <username>root</username> tendr&aacute; 
	  que instalar <filename role="package">x11/wrapper</filename>.  
	  Viene instalado por defecto en &os; 4.7 y siguientes; en versiones 
	  anteriores puede instalarse desde el men&uacute; de selecci&oacute;n 
	  de paquetes.</para>
      </note>

      <para>Consulte el sitio web de 
	<ulink url="http://www.xfree86.org/"> &xfree86;</ulink> para saber 
	si su tarjeta gr&aacute;fica est&aacute; soportada.</para>


      <screen>                      User Confirmation Requested 
        Would you like to configure your X server at this time?

                            [ Yes ]   No</screen>

      <warning>
	<para>&nbsp;Es imprescindible que disponga de las especificaciones de 
	  su monitor y su tarjeta gr&aacute;fica.  La configuraci&oacute;n 
	  incorrecta puede da&ntilde;ar su hardware.  Si no dispone de 
	  la informaci&oacute;n necesaria elija &gui.no; y configure su 
	  servidor X cuando recopile los datos necesarios.  
	  Cuando sea posible ejecute <command>/stand/sysinstall</command>, 
	  elija <guimenuitem>Configure</guimenuitem> y en ese men&uacute; 
	  elija <guimenuitem>XFree86</guimenuitem>.  
	  Si configura mal en servidor X puede dejar el sistema 
	  congelado.  Suele decirse que la configuraci&oacute;n del 
	  servidor X es una tarea que debe acometerse una vez que la 
	  la instalaci&oacute;n ha terminado.</para>
      </warning>

      <para>Si dispone de los datos de su tarjeta gr&aacute;fica y de su 
	monitor puede pasar a la configuraci&oacute;n de su servidor X: 
	seleccione &gui.yes; y pulse <keycap>Intro</keycap>.</para>

      <figure id="xserver2">
	<title>Men&uacute; de selecci&oacute;n del m&eacute;todo de 
	  configuraci&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/xf86setup" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Hay varios m&eacute;todos de configuraci&oacute;n del 
	servidor X.  Use las flechas para seleccionar el m&eacute;todo 
	que prefiera y pulse <keycap>Intro</keycap>.  Lea atentamente todos 
	los mensajes que se le muestren.</para>

      <para>Los m&eacute;todos <application>xf86cfg</application> y 
	<application>xf86cfg -textmode</application> pueden oscurecer la 
	pantalla y tardar unos segundos en arrancar.  No se 
	impaciente.</para>


      <para>Vamos a ver un ejemplo de uso de la herramienta de 
	configuraci&oacute;n <application>xf86config</application>.  Las 
	opciones de configuraci&oacute;n depender&aacute;n del hardware 
	presente en el sistemay seguramente en su caso ser&aacute;n 
	diferentes de las que aqu&iacute; se muestran:</para>

      <screen>                                Message
 You have configured and been running the mouse daemon. 
 Choose "/dev/sysmouse" as the mouse port and "SysMouse" or
 "MouseSystems" as the mouse protocol in the X configuration utility. 

                                 [ OK ]

                      [ Press enter to continue ]</screen>

      <para>Esto indica que el d&aelig;mon del rat&oacute;n que hemos 
	configurado con anterioridad ha sido detectado.  Pulse 
	<keycap>Intro</keycap> y prosigamos.</para>

      <para>Al arrancar <application>xf86config</application> se 
	mostrar&aacute; una breve introducci&oacute;n:</para>

      <screen>This program will create a basic XF86Config file, based on menu selections you
make.

The XF86Config file usually resides in /usr/X11R6/etc/X11 or /etc/X11. A sample
XF86Config file is supplied with XFree86; it is configured for a standard
VGA card and monitor with 640x480 resolution. This program will ask for a
pathname when it is ready to write the file.

You can either take the sample XF86Config as a base and edit it for your
configuration, or let this program produce a base XF86Config file for your
configuration and fine-tune it.

Before continuing with this program, make sure you know what video card
you have, and preferably also the chipset it uses and the amount of video
memory on your video card. SuperProbe may be able to help with this.

Press enter to continue, or ctrl-c to abort.</screen>

      <para>Si pulsa <keycap>Intro</keycap> arrancar&aacute; la 
	configuraci&oacute;n del rat&oacute;n.  Siga las instrucciones y 
	elija <quote>Mouse Systems</quote> como protocolo del rat&oacute;n y 
	<filename>/dev/sysmouse</filename> como el puerto del rat&oacute;n 
	incluso en el caso de que tenga un rat&oacute;n PS/2, como el 
	de la ilustraci&oacute;n.</para>

      <screen>First specify a mouse protocol type. Choose one from the following list:

 1.  Microsoft compatible (2-button protocol)
 2.  Mouse Systems (3-button protocol) & FreeBSD moused protocol
 3.  Bus Mouse
 4.  PS/2 Mouse
 5.  Logitech Mouse (serial, old type, Logitech protocol)
 6.  Logitech MouseMan (Microsoft compatible)
 7.  MM Series
 8.  MM HitTablet
 9.  Microsoft IntelliMouse

If you have a two-button mouse, it is most likely of type 1, and if you have
a three-button mouse, it can probably support both protocol 1 and 2. There are
two main varieties of the latter type: mice with a switch to select the
protocol, and mice that default to 1 and require a button to be held at
boot-time to select protocol 2. Some mice can be convinced to do 2 by sending
a special sequence to the serial port (see the ClearDTR/ClearRTS options).

Enter a protocol number: 2

You have selected a Mouse Systems protocol mouse. If your mouse is normally
in Microsoft-compatible mode, enabling the ClearDTR and ClearRTS options
may cause it to switch to Mouse Systems mode when the server starts.

Please answer the following question with either 'y' or 'n'.
Do you want to enable ClearDTR and ClearRTS? n

You have selected a three-button mouse protocol. It is recommended that you
do not enable Emulate3Buttons, unless the third button doesn't work.

Please answer the following question with either 'y' or 'n'.
Do you want to enable Emulate3Buttons? y

Now give the full device name that the mouse is connected to, for example
/dev/tty00. Just pressing enter will use the default, /dev/mouse.
On FreeBSD, the default is /dev/sysmouse.

Mouse device: /dev/sysmouse</screen>

      <para>El siguiente punto es la configuraci&oacute;n del teclado.  
	En nuestro ejemplo tenemos un teclado gen&eacute;rico de 
	101 teclas.  Puede usar cualquier variedad del mismo tipo o 
	simplemente pulsar <keycap>Intro</keycap> y aceptar el 
	modelo por defecto.</para>

      <screen>Please select one of the following keyboard types that is the better
description of your keyboard. If nothing really matches,
choose 1 (Generic 101-key PC)

  1  Generic 101-key PC                                
  2  Generic 102-key (Intl) PC                         
  3  Generic 104-key PC                                
  4  Generic 105-key (Intl) PC                         
  5  Dell 101-key PC                                   
  6  Everex STEPnote                                   
  7  Keytronic FlexPro                                 
  8  Microsoft Natural                                 
  9  Northgate OmniKey 101                             
 10  Winbook Model XP5                                 
 11  Japanese 106-key                                  
 12  PC-98xx Series                                    
 13  Brazilian ABNT2                                   
 14  HP Internet                                       
 15  Logitech iTouch                                   
 16  Logitech Cordless Desktop Pro                     
 17  Logitech Internet Keyboard                        
 18  Logitech Internet Navigator Keyboard              
 19  Compaq Internet                                   
 20  Microsoft Natural Pro                             
 21  Genius Comfy KB-16M                               
 22  IBM Rapid Access                                  
 23  IBM Rapid Access II                               
 24  Chicony Internet Keyboard                         
 25  Dell Internet Keyboard                            

Enter a number to choose the keyboard.

1


Please select the layout corresponding to your keyboard


  1  U.S. English                                      
  2  U.S. English w/ ISO9995-3                         
  3  U.S. English w/ deadkeys                          
  4  Albanian                                          
  5  Arabic                                            
  6  Armenian                                          
  7  Azerbaidjani                                      
  8  Belarusian                                        
  9  Belgian                                           
 10  Bengali                                           
 11  Brazilian                                         
 12  Bulgarian                                         
 13  Burmese                                           
 14  Canadian                                          
 15  Croatian                                          
 16  Czech                                             
 17  Czech (qwerty)                                    
 18  Danish                                            

Enter a number to choose the country.
Press enter for the next page

1


Please enter a variant name for 'us' layout. Or just press enter
for default variant

us


Please answer the following question with either 'y' or 'n'.
Do you want to select additional XKB options (group switcher,
group indicator, etc.)? n</screen>

      <para>Ahora pasaremos a la configuraci&oacute;n del monitor.  
	No supere las limitaciones de su monitor o puede da&ntilde;arlo de 
	forma irreparable.  Si tiene dudas espere a disponer de todos los 
	datos y luego configure su monitor.</para>

      <screen>Now we want to set the specifications of the monitor. The two critical
parameters are the vertical refresh rate, which is the rate at which the
whole screen is refreshed, and most importantly the horizontal sync rate,
which is the rate at which scanlines are displayed.

The valid range for horizontal sync and vertical sync should be documented
in the manual of your monitor. If in doubt, check the monitor database
/usr/X11R6/lib/X11/doc/Monitors to see if your monitor is there.

Press enter to continue, or ctrl-c to abort.



You must indicate the horizontal sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range.

It is VERY IMPORTANT that you do not specify a monitor type with a horizontal
sync range that is beyond the capabilities of your monitor. If in doubt,
choose a conservative setting.

    hsync in kHz; monitor type with characteristic modes
 1  31.5; Standard VGA, 640x480 @ 60 Hz
 2  31.5 - 35.1; Super VGA, 800x600 @ 56 Hz
 3  31.5, 35.5; 8514 Compatible, 1024x768 @ 87 Hz interlaced (no 800x600)
 4  31.5, 35.15, 35.5; Super VGA, 1024x768 @ 87 Hz interlaced, 800x600 @ 56 Hz
 5  31.5 - 37.9; Extended Super VGA, 800x600 @ 60 Hz, 640x480 @ 72 Hz
 6  31.5 - 48.5; Non-Interlaced SVGA, 1024x768 @ 60 Hz, 800x600 @ 72 Hz
 7  31.5 - 57.0; High Frequency SVGA, 1024x768 @ 70 Hz
 8  31.5 - 64.3; Monitor that can do 1280x1024 @ 60 Hz
 9  31.5 - 79.0; Monitor that can do 1280x1024 @ 74 Hz
10  31.5 - 82.0; Monitor that can do 1280x1024 @ 76 Hz
11  Enter your own horizontal sync range

Enter your choice (1-11): 6

You must indicate the vertical sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range. For interlaced modes,
the number that counts is the high one (e.g. 87 Hz rather than 43 Hz).

 1  50-70
 2  50-90
 3  50-100
 4  40-150
 5  Enter your own vertical sync range

Enter your choice: 2

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names.

The strings are free-form, spaces are allowed.
Enter an identifier for your monitor definition: Hitachi</screen>

      <para>Ahora elegiremos un controlador para la tarjeta gr&aacute;fica 
	en una lista.  Si ha pasado de largo su tarjeta siga pulsando 
	<keycap>Intro</keycap> y la lista volver&aacute; a pasar por 
	pantalla desde el principio.  Veamos un fragmento de la lista:</para>

      <screen>Now we must configure video card specific settings. At this point you can
choose to make a selection out of a database of video card definitions.
Because there can be variation in Ramdacs and clock generators even
between cards of the same model, it is not sensible to blindly copy
the settings (e.g. a Device section). For this reason, after you make a
selection, you will still be asked about the components of the card, with
the settings from the chosen database entry presented as a strong hint.

The database entries include information about the chipset, what driver to
run, the Ramdac and ClockChip, and comments that will be included in the
Device section. However, a lot of definitions only hint about what driver
to run (based on the chipset the card uses) and are untested.

If you can't find your card in the database, there's nothing to worry about.
You should only choose a database entry that is exactly the same model as
your card; choosing one that looks similar is just a bad idea (e.g. a
GemStone Snail 64 may be as different from a GemStone Snail 64+ in terms of
hardware as can be).

Do you want to look at the card database? y



288  Matrox Millennium G200 8MB                        mgag200
289  Matrox Millennium G200 SD 16MB                    mgag200
290  Matrox Millennium G200 SD 4MB                     mgag200
291  Matrox Millennium G200 SD 8MB                     mgag200
292  Matrox Millennium G400                            mgag400
293  Matrox Millennium II 16MB                         mga2164w
294  Matrox Millennium II 4MB                          mga2164w
295  Matrox Millennium II 8MB                          mga2164w
296  Matrox Mystique                                   mga1064sg
297  Matrox Mystique G200 16MB                         mgag200
298  Matrox Mystique G200 4MB                          mgag200
299  Matrox Mystique G200 8MB                          mgag200
300  Matrox Productiva G100 4MB                        mgag100
301  Matrox Productiva G100 8MB                        mgag100
302  MediaGX                                           mediagx
303  MediaVision Proaxcel 128                          ET6000
304  Mirage Z-128                                      ET6000
305  Miro CRYSTAL VRX                                  Verite 1000

Enter a number to choose the corresponding card definition.
Press enter for the next page, q to continue configuration.

288

Your selected card definition:

Identifier: Matrox Millennium G200 8MB
Chipset:    mgag200
Driver:     mga
Do NOT probe clocks or use any Clocks line.

Press enter to continue, or ctrl-c to abort.



Now you must give information about your video card. This will be used for
the "Device" section of your video card in XF86Config.

You must indicate how much video memory you have. It is probably a good
idea to use the same approximate amount as that detected by the server you
intend to use. If you encounter problems that are due to the used server
not supporting the amount memory you have (e.g. ATI Mach64 is limited to
1024K with the SVGA server), specify the maximum amount supported by the
server.

How much video memory do you have on your video card:

 1  256K
 2  512K
 3  1024K
 4  2048K
 5  4096K
 6  Other

Enter your choice: 6

Amount of video memory in Kbytes: 8192

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names (possibly from a card definition).

Your card definition is Matrox Millennium G200 8MB.

The strings are free-form, spaces are allowed.
Enter an identifier for your video card definition:</screen>

      <para>Ahora hay que ajustar los modos de video y las resoluciones 
	que les corresponden.  Normalmente se usan rangos de  640x480, 800x600 
	y 1024x768, pero depende de la potencia de la tarjeta 
	gr&aacute;fica, el tama&ntilde;o del monitor y la comodidad de 
	la vista de quien decide.  Al elegir la profundidad de color 
	procure elegir la m&aacute;s alta que admita su tarjeta.</para>

      <screen>For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"640x480" "800x600" "1024x768" "1280x1024" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 2

Select modes from the following list:

 1  "640x400"
 2  "640x480"
 3  "800x600"
 4  "1024x768"
 5  "1280x1024"
 6  "320x200"
 7  "320x240"
 8  "400x300"
 9  "1152x864"
 a  "1600x1200"
 b  "1800x1400"
 c  "512x384"

Please type the digits corresponding to the modes that you want to select.
For example, 432 selects "1024x768" "800x600" "640x480", with a
default mode of 1024x768.

Which modes? 432

You can have a virtual screen (desktop), which is screen area that is larger
than the physical screen and which is panned by moving the mouse to the edge
of the screen. If you don't want virtual desktop at a certain resolution,
you cannot have modes listed that are larger. Each color depth can have a
differently-sized virtual screen

Please answer the following question with either 'y' or 'n'.
Do you want a virtual screen that is larger than the physical screen? n



For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"1024x768" "800x600" "640x480" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 4



Please specify which color depth you want to use by default:

  1  1 bit (monochrome)                                
  2  4 bits (16 colors)                                
  3  8 bits (256 colors)                               
  4  16 bits (65536 colors)                            
  5  24 bits (16 million colors)                       

Enter a number to choose the default depth.

4</screen>

      <para>Para conclu&iacute;r, salvamos la configuraci&oacute;n 
	teniendo cuidado de guardarla como 
	<filename>/etc/XF86Config</filename>.</para>

      <screen>I am going to write the XF86Config file now. Make sure you don't accidently
overwrite a previously configured one.

Shall I write it to /etc/X11/XF86Config? y</screen>

      <para>Si la configuraci&oacute;n falla puede volver a intentarlo 
	seleccionando &gui.yes; cuando vea el siguiente mensaje:</para>

      <screen>          User Confirmation Requested
The XFree86 configuration process seems to have
failed.  Would you like to try again?

             [ Yes ]         No</screen>

      <para>Si tiene problemas al configurar 
	<application>&xfree86;</application> seleccione &gui.no; 
	y pulse <keycap>Enter</keycap> para seguir con el proceso de 
	instalaci&oacute;n.  Una vez instalado el sistema puede ejecutar 
	(siempre como <username>root</username>) las aplicaciones de 
	configuraci&oacute;n de l&iacute;nea de comandos 
	<command>xf86cfg -textmode</command> o <command>xf86config</command>.  
	Hay un m&eacute;todo m&aacute;s para configurar 
	<application>&xfree86;</application> que se describe en el 
	<xref linkend="x11">.   Si decide no configurar 
	<application>&xfree86;</application> el siguiente men&uacute; 
	ser&aacute; el de selecci&oacute;n de paquetes.</para>

      <para>Por defecto existe una combinaci&oacute;n de teclas que 
	<quote>matar&aacute;</quote> el servidor X: 
	<keycombo action='simul'>
	<keycap>Ctrl</keycap><keycap>Alt</keycap>
	<keycap>Retroceso</keycap></keycombo>.  Ejec&uacute;tela si 
	hay alg&uacute;n error en la configuraci&oacute;n o para evitar 
	dan&tilde;ar el hardware.</para>

      <para>Existe tambi&eacute;n una combinaci&oacute;n de teclas que 
	permite pasar de un modo de video a otro:  
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>+</keycap>
	</keycombo> o 
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>-</keycap>
	</keycombo>.   
      </para>

      <para>Una vez tiene <application>&xfree86;</application> en 
	marcha puede ajustar el <quote>display</quote> a lo ancho,a lo alto 
	y puede centrarlo con <application>xvidtune</application>.</para>

      <para>Puede que aparezca alguna advertencia relacionada con una 
	mala configuraci&oacute;n y el da&ntilde;o que puede hacer a su 
	hardware: h&aacute;gale caso.  Si tiene alguna duda, no configure 
	nada.  Puede usar los controles del monitor para ajustar el 
	comportamiento de X Window.  Puede haber algunas diferencias cuando 
	vuelva al modo texto pero es mejor eso que da&ntilde;ar su 
	equipo.</para>

      <para>Lea &man.xvidtune.1; antes de ajustar nada.</para>

      <para>Tras una instalaci&oacute;n correcta de 
	<application>&xfree86;</application> vendr&aacute; la elecci&oacute;n 
	de un escritorio por defecto.</para>
    </sect2>

    <sect2 id="default-desktop">
      <title>Selecci&oacute;n de un Escritorio X por defecto</title>

      <para>Hay una enorme variedad de gestores de ventanas, y los hay de 
	todos los tipos.  Hay entornos muy b&aacute;sicos y hay entornos 
	completos de escritorio con una enorme cantidad de software.  
	Los hay que requieren poca memoria y muy poco espacio en disco, 
	mientras que los m&aacute;s completos requieren muchos m&aacute;s 
	recursos.  La forma ideal de determinar cu&aacute;l es el que mejor 
	le va es que pruebe unos cuantos.  Puede instalarlos como paquetes o 
	desde los ports.</para>

      <para>Puede elegir uno de los m&aacute;s usados y configurarlo para 
	que sea su escritorio por defecto.  As&iacute; podr&aacute; comenzar 
	en cuanto acabe con la instalaci&oacute;n.</para>

      <figure id="x-desktop">
	<title>Elecci&oacute;n del escritorio por defecto</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/desktop" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>


      <para>Seleccione un escritorio con las flechas y pulse 
	<keycap>Intro</keycap>.  El escritorio que haya elegido se 
	instalar&aacute;.</para>
    </sect2>

    <sect2 id="packages">
    <title>Instalaci&oacute;n de paquetes</title>

      <para>Los paquetes son binarios precompilados y son una forma 
	muy c&oacute;moda de instalar software.</para>

      <para>Veamos la instalaci&oacute;n de un paquete.  Puede instalar 
	m&aacute;s paquetes si lo desea.  Una vez conclu&iacute;da la 
	instalaci&oacute;n puede instalar paquetes desde 
	<command>/stand/sysinstall</command>.</para>

      <screen>                     User Confirmation Requested
 The FreeBSD package collection is a collection of hundreds of
 ready-to-run applications, from text editors to games to WEB servers
 and more. Would you like to browse the collection now? 

                            [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y pulse 
	<keycap>Intro</keycap>: ver&aacute; 
	las pantallas de selecci&oacute;n de paquetes.</para>

      <figure id="package-category">
	<title>Selecci&oacute;n de categor&iacute;a de paquetes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-cat" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Los paquetes presentes en el medio de instalaci&oacute;n que 
	est&eacute; accesible en cada momento son los &uacute;nicos que 
	se pueden instalar.</para>

      <para>Todos los paquetes disponibles en el medio se mostrar&aacute;n al 
	seleccionar la categor&iacute;a <guimenuitem>All</guimenuitem>.  
	Elija una categor&iacute;a y pulse 
	<keycap>Intro</keycap>.</para>

      <para>Al seleccionar una categor&iacute;a aparecer&aacute; un 
	men&uacute; con los paquetes disponibles existentes en la misma:</para>

      <figure id="package-select">
	<title>Selecci&oacute;n de paquetes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-sel" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Hemos elegido la shell <application>bash</application>.  
	Seleccione tantos paquetes como quiera instalar y pulse la tecla 
	<keycap>Espacio</keycap>.  Se mostrar&aacute; una breve 
	descripci&oacute;n de cada paquete en la esquina inferior izquierda 
	de la pantalla.</para>

      <para>Pulsando el <keycap>Tabulador</keycap> desplazar&aacute; el 
	cursor entre el &uacute;ltimo paquete que haya seleccionado, 
	&gui.ok; y &gui.cancel;.</para>

      <para>Cuando haya seleccionado todos los paquetes que quiera 
	instalar pulse <keycap>Tabulador</keycap> una sola vez para que 
	el cursor pase a &gui.ok; y pulse <keycap>Intro</keycap>, lo que 
	le llevar&aacute; al men&uacute; de selecci&oacute;n de 
	paquetes.</para>

      <para>Las flechas <quote>izquierda</quote> y <quote>derecha</quote> 
	 pueden usarse para mover el cursor entre &gui.ok; y &gui.cancel;.  
	 Use esto para seleccionar &gui.ok; y pulsar 
	<keycap>Intro</keycap> para volver al men&uacute; de 
	selecci&oacute;n de paquetes.</para>

      <figure id="package-install">
	<title>Instalaci&oacute;n de paquetes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-install" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guibutton>[&nbsp;Install&nbsp;]</guibutton> con 
	el <keycap>Tabulador</keycap> y las flechas y pulse 
	<keycap>Intro</keycap>.  Se le pedir&aacute; que confirme que 
	quiere instalar los paquetes:</para>

      <figure id="package-install-confirm">
	<title>Confirmaci&oacute;n previa a la instalaci&oacute;n de 
	  paquetes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-confirm" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Si selecciona &gui.ok; y pulsa <keycap>Intro</keycap> 
	comenzar&aacute; la instalaci&oacute;n de paquetes.  Ir&aacute;n 
	apareciendo mensajes relacionados con los diversos procesos de 
	instalaci&oacute;n hasta que se cumplan todos.  Est&eacute; atento 
	por si aparecieran mensajes de error.</para>

      <para>Tras la instalaci&oacute;n de paquetes nos quedan unos toques 
	finales a la configuraci&oacute;n.  Si no ha elegido ning&uacute;n 
	paquete y quiere regresar al men&uacute; de configuraci&oacute;n 
	seleccione <guibutton>Install</guibutton> de todos modos.</para>
    </sect2>

    <sect2 id="addusers">
      <title>A&ntilde;adir Usuarios/Grupos</title>

      <para>Deber&iacute; al menos a&ntilde;adir un usuario al sistema 
	para poder usarlo para acceder al sistema una vez reiniciado sin 
	tener que recurrir a <username>root</username>.  La partici&oacute;n 
	ra&iacute;z suele ser peque&ntilde;a y ejecutar aplicaciones como 
	<username>root</username> tiene a llenarla r&aacute;pidamente.  
	Pero hay un peligro mucho mayor:</para>

      <screen>                     User Confirmation Requested
 Would you like to add any initial user accounts to the system? Adding
 at least one account for yourself at this stage is suggested since
 working as the "root" user is dangerous (it is easy to do things which
 adversely affect the entire system). 

                            [ Yes ]   No</screen>

      <para>Es decir:</para>

      <screen>     Petición de confirmación por parte del usuario
 ¿Quiere añadir algún usuario al sistema? Le sugerimos que añada al menos 
 uno para usted puesto que trabajar como "root" es peligroso (es fácil 
 hacer algo con consecuencias en todo el sistema).

                            [ Yes ]   No</screen>


      <para>Elija &gui.yes; y pulse <keycap>Intro</keycap> para 
	a&ntilde;adir un usuario.</para>

      <figure id="add-user2">
	<title>Seleccione <quote>A&ntilde;adir usuario</quote></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guimenuitem>User</guimenuitem> con las flechas 
	y pulse <keycap>Intro</keycap>.</para>

      <figure id="add-user3">
	<title>A&ntilde;adir la informaci&oacute;n del usuario</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A medida que vaya seleccionando los campos ayud&aacute;ndose del 
	<keycap>Tabulador</keycap> se le ir&aacute;n mostrando las siguientes 
	descripciones en la parte baja de la pantalla:</para>

      <variablelist>
	<varlistentry>
	  <term>Login ID</term>

	  <listitem>
	    <para>El nombre de usuario (obligatorio).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>UID</term>
	
	  <listitem>
	    <para>El ID num&eacute;rico del usuario (d&eacute;jelo en blanco 
	      si quiere que el sistema lo asigne 
	      autom&aacute;ticamente).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Group</term>

	  <listitem>
	    <para>El grupo al que pertenecer&aacute; el usuario.  
	      (d&eacute;jelo en blanco si quiere que el sistema lo asigne 
	      autom&aacute;ticamente).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Password</term>

	  <listitem>
	    <para>La contrase&ntilde;a del usuario (<emphasis>rellene 
	      con cuidado este campo</emphasis>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Full name</term>

	  <listitem>
	    <para>El nombre completo del usuario (o un comentario 
	      descriptivo sobre &eacute;l/ella).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Member groups</term>

	  <listitem>
	    <para>Los grupos a los que este usuario pertenece.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Home directory</term>

	  <listitem>
	    <para>El directorio <quote>home</quote> del usuario.  
	      (d&eacute;jelo en blanco si quiere que el sistema lo asigne 
	      autom&aacute;ticamente).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Login shell</term>
	  <listitem>
	    <para>La shell con la que el usuario acceder&aacute; al 
	      sistema.  (D&eacute;jela en blanco si le sirve la 
	      opci&oacute;n por defecto, esto es, 
	      <filename>/bin/sh</filename>).</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>En el ejemplo se cambi&oacute; <filename>/bin/sh</filename> por 
	<filename>/usr/local/bin/bash</filename> para poder usar la shell
	<application>bash</application> que previamente se ha instalado.  
	No intente usar una shell que no exista o no podr&aacute; acceder al 
	sistema.  La shell m&aacute;s com&uacute;n en entornos BSD es la 
	<quote>C shell</quote>, <filename>/bin/tcsh</filename>.</para>

      <para>El usuario se a&ntilde;adi&oacute; tambi&eacute;n al grupo 
	<groupname>wheel</groupname> para que pueda convertirse en 
	superusuario, es decir, con privilegios de 
	<username>root</username>.</para>

      <para>Cuando haya terminado pulse &gui.ok;  y el men&uacute; de 
	gesti&oacute;n de usuarios y grupos aparecer&aacute; de 
	nuevo:</para>

      <figure id="add-user4">

	<title>Salir de la gesti&oacute;n de usuarios y grupos</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Los grupos tambi&eacute;n pueden a&ntilde;adirse en este 
	momento si fuera necesario.  Tambi&eacute;n puede hacerse desde 
	<filename>/stand/sysinstall</filename> una vez culminada la 
	instalaci&oacute;n.</para>

      <para>Cuando haya acabado de a&ntilde;adir usuarios seleccione 
	<guimenuitem>Exit</guimenuitem> con las flechas y pulse 
	<keycap>Intro</keycap> y siga con la instalaci&oacute;n.</para>
    </sect2>

    <sect2 id="rootpass">
      <title>Asigne la contrase&ntilde;a de 
	<username>root</username></title>

      <screen>                        Message
 Now you must set the system manager's password.  
 This is the password you'll use to log in as "root". 

                         [ OK ] 

               [ Press enter to continue ]</screen>

      <para>Es decir:</para>

      <screen>                        Mensaje
 Ahora debe asignar la contraseña del administrador del sistema. 
 Esta es la contraseña que usará cuando acceda al sistema como 
 "root".

                         [ OK ]

                    [ Pulse Intro ]</screen>

      <para>Pulse <keycap>Intro</keycap> y as&iacute;gnele una 
	contrase&ntilde;a a <username>root</username>.</para>

      <para>Tendr&aacute; que escribir la contrase&ntilde;a correctamente 
	dos veces.  No hay necesidad de decirle que es importante que 
	recuerde esa contrase&ntilde;a.</para>

      <screen>Changing local password for root. 
New password : 
Retype new password :</screen>

      <para>La instalaci&oacute;n continuar&aacute; una vez que haya 
	introducido las contrase&ntilde;as correctamente.</para>
    </sect2>

    <sect2 id="exit-inst">
      <title>Salir de la instalaci&oacute;n</title>

      <para>Si tiene que configurar algo m&aacute;s en la red o en 
	cualquier otro sitio puede hacerlo ahora mismo (o m&aacute;s tarde 
	una vez reiniciado el sistema) desde 
	<filename>/stand/sysinstall</filename>.</para>

      <screen>                     User Confirmation Requested
 Visit the general configuration menu for a chance to set any last
 options? 

                              Yes   [ No ]</screen>

      <para>Seleccione &gui.no; con las flechas y pulse 
	<keycap>Intro</keycap> para volver al men&uacute; principal 
	de la instalaci&oacute;n.</para>

      <figure id="final-main">
	<title>Salir de la instalaci&oacute;n</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mainexit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seleccione <guibutton>[X Exit Install]</guibutton> con las 
	flechas y pulse <keycap>Intro</keycap>.  Se le pedir&aacute; 
	confirmaci&oacute;n antes de salir de la instalaci&oacute;n:</para>

      <screen>                     User Confirmation Requested
 Are you sure you wish to exit? The system will reboot (be sure to  
 remove any floppies from the drives). 

                            [ Yes ]   No</screen>

      <para>Es decir:</para>

      <screen>            Confirmación por parte del usuario
 ¿Seguro que quiere salir?  El sistema reiniciará (compruebe que 
 ha retirado los disquetes de la unidad).

                            [ Yes ]   No</screen>

      <para>Seleccione &gui.yes; y extraiga el disquete si ha arrancado desde 
	floppy.  La unidad CDROM est&aacute; bloqueada hasta que la 
	m&aacute;quina comience a reiniciarse.  La unidad CDROM se desbloquea 
	y (actuando con agilidad felina) puede extraerse el CDROM.</para>

      <para>El sistema reiniciar&aacute;, est&eacute; atento por si aparece 
	alg&uacute;n mensaje de error.</para>
    </sect2>

    <sect2 id="freebsdboot">
      <title>El arranque de &os;</title>

      <sect3 id="freebsdboot-i386">
        <title>El arranque de &os; en &i386;</title>

      <para>Si todo ha ido bien ver&aacute; pasar una larga lista de 
	mensajes hasta que llegue al <quote>login prompt</quote> (es 
	decir, donde podr&aacute; escribir un nombre de usuario y 
	una contrase&ntilde;a para acceder al sistema).  Puede 
	leer detenidamente ese mensajes pulsando 
	<keycap>Bloq&nbsp;Despl</keycap> y usando 
	<keycap>ReP&aacute;g</keycap> y <keycap>AvP&aacute;g</keycap>.  
	Pulse <keycap>Bloq&nbsp;Despl</keycap> cuando quiera para regresar 
	al prompt.</para>

      <para>Es posible que el mensaje completo no pueda mostrarse debido a 
	limitaciones del buffer pero puede verlo desde la l&iacute;nea de 
	comandos escribiendo <command>dmesg</command>.</para>

      <para>Entre al sistema con el nombre de usuario y la 
	contrase&ntilde;a que escribi&oacute; durante la 
	instalaci&oacute;n (en el ejemplo 
	<username>rpratt</username>).  Evite acceder al sistema como 
	<username>root</username> excepto cuando sea necesario hacerlo.</para>

      <para>Veamos un t&iacute;pico mensaje de arranque (se han omitido los 
	datos de versi&oacute;n):</para>

<screen>Copyright (c) 1992-2002 The FreeBSD Project. 
Copyright (c) 1979, 1980, 1983, 1986, 1988, 1989, 1991, 1992, 1993, 1994
        The Regents of the University of California. All rights reserved. 

Timecounter "i8254"  frequency 1193182 Hz
CPU: AMD-K6(tm) 3D processor (300.68-MHz 586-class CPU)
  Origin = "AuthenticAMD"  Id = 0x580  Stepping = 0
  Features=0x8001bf&lt;FPU,VME,DE,PSE,TSC,MSR,MCE,CX8,MMX&gt; 
  AMD Features=0x80000800&lt;SYSCALL,3DNow!&gt; 
real memory  = 268435456 (262144K bytes) 
config&gt; di sn0 
config&gt; di lnc0 
config&gt; di le0 
config&gt; di ie0 
config&gt; di fe0 
config&gt; di cs0 
config&gt; di bt0  
config&gt; di aic0 
config&gt; di aha0 
config&gt; di adv0 
config&gt; q 
avail memory = 256311296 (250304K bytes)
Preloaded elf kernel "kernel" at 0xc0491000. 
Preloaded userconfig_script "/boot/kernel.conf" at 0xc049109c. 
md0: Malloc disk 
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard 
npx0: INT 16 interface 
pcib0: &lt;Host to PCI bridge&gt; on motherboard 
pci0: &lt;PCI bus&gt; on pcib0 
pcib1: &lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0 
pci1: &lt;PCI bus&gt; on pcib1 
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11 
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0 
isa0: &lt;ISA bus&gt; on isab0 
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0 
ata0: at 0x1f0 irq 14 on atapci0 
ata1: at 0x170 irq 15 on atapci0 
uhci0: &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci0 
usb0: &lt;VIA 83C572 USB controller&gt; on uhci0 
usb0: USB revision 1.0 
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr 1 
uhub0: 2 ports with 2 removable, self powered 
chip1: &lt;VIA 82C586B ACPI interface&gt; at device 7.3 on pci0 
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xe800-0xe81f irq 9 at
device 10.0 on pci0 
ed0: address 52:54:05:de:73:1b, type NE2000 (16 bit) 
isa0: too many dependant configs (8) 
isa0: unexpected small tag 14 
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq 2 on isa0
fdc0: FIFO enabled, 8 bytes threshold 
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0 
atkbdc0: &lt;keyboard controller (i8042)&gt; at port 0x60-0x64 on isa0 
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq 1 on atkbdc0 
kbd0 at atkbd0 
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0 
psm0: model Generic PS/2 mouse, device ID 0 
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x1 on isa0 
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt; 
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0 
sio0: type 16550A 
sio1 at port 0x2f8-0x2ff irq 3 on isa0 
sio1: type 16550A 
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0 
ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode 
ppc0: FIFO with 16/16/15 bytes threshold 
ppbus0: IEEE1284 device found /NIBBLE
Probing for PnP devices on ppbus0: 
plip0: &lt;PLIP network interface&gt; on ppbus0 
lpt0: &lt;Printer&gt; on ppbus0 
lpt0: Interrupt-driven port 
ppi0: &lt;Parallel I/O&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master using UDMA33 
ad2: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata1-master using UDMA33 
acd0: CDROM &lt;DELTA OTC-H101/ST3 F/W by OIPD&gt; at ata0-slave using PIO4 
Mounting root from ufs:/dev/ad0s1a 
swapon: adding /dev/ad0s1b as swap device 
Automatic boot in progress... 
/dev/ad0s1a: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1a: clean, 48752 free (552 frags, 6025 blocks, 0.9% fragmentation)
/dev/ad0s1f: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1f: clean, 128997 free (21 frags, 16122 blocks, 0.0% fragmentation)
/dev/ad0s1g: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1g: clean, 3036299 free (43175 frags, 374073 blocks, 1.3% fragmentation)
/dev/ad0s1e: filesystem CLEAN; SKIPPING CHECKS 
/dev/ad0s1e: clean, 128193 free (17 frags, 16022 blocks, 0.0% fragmentation)
Doing initial network setup: hostname. 
ed0: flags=8843&lt;UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> mtu 1500
        inet 192.168.0.1 netmask 0xffffff00 broadcast 192.168.0.255
        inet6 fe80::5054::5ff::fede:731b%ed0 prefixlen 64 tentative scopeid 0x1
        ether 52:54:05:de:73:1b
lo0: flags=8049&lt;UP,LOOPBACK,RUNNING,MULTICAST&gt; mtu 16384 
        inet6 fe80::1%lo0 prefixlen 64 scopeid 0x8 
        inet6 ::1 prefixlen 128 
        inet 127.0.0.1 netmask 0xff000000 
Additional routing options: IP gateway=YES TCP keepalive=YES
routing daemons:. 
additional daemons: syslogd. 
Doing additional network setup:. 
Starting final network daemons: creating ssh RSA host key 
Generating public/private rsa1 key pair.
Your identification has been saved in /etc/ssh/ssh_host_key. 
Your public key has been saved in /etc/ssh/ssh_host_key.pub. 
The key fingerprint is: 
cd:76:89:16:69:0e:d0:6e:f8:66:d0:07:26:3c:7e:2d root@k6-2.example.com
 creating ssh DSA host key 
Generating public/private dsa key pair.
Your identification has been saved in /etc/ssh/ssh_host_dsa_key. 
Your public key has been saved in /etc/ssh/ssh_host_dsa_key.pub. 
The key fingerprint is: 
f9:a1:a9:47:c4:ad:f9:8d:52:b8:b8:ff:8c:ad:2d:e6 root@k6-2.example.com.
setting ELF ldconfig path: /usr/lib /usr/lib/compat /usr/X11R6/lib
/usr/local/lib 
a.out ldconfig path: /usr/lib/aout /usr/lib/compat/aout /usr/X11R6/lib/aout 
starting standard daemons: inetd cron sshd usbd sendmail.
Initial rc.i386 initialization:. 
rc.i386 configuring syscons: blank_time screensaver moused. 
Additional ABI support: linux. 
Local package initialization:. 
Additional TCP options:. 

FreeBSD/i386 (k6-2.example.com) (ttyv0)

login: rpratt 
Password:</screen>

      <para>La generaci&oacute;n de las llaves RSA y DSA puede llevar 
	cierto tiempo, especialmente en sistemas lentos.  No se preocupe 
	por ello porque esto s&oacute;lo ha de hacerse en el primer 
	arranque tras una instalaci&oacute;n.  Los dem&aacute;s arranques 
	del sistema ser&aacute;n mucho m&aacute;s r&aacute;pidos.</para> 

      <para>Si se configur&oacute; el servidor X y se eligi&oacute; 
	escritorio por defecto puede teclear <command>startx</command> y 
	usarlos.</para>

      </sect3>

      <sect3>
        <title>Arranque de &os; en Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

        <para>Una vez que el proceso de instalaci&oacute;n ha terminado 
	  podr&aacute; arrancar &os; escribiendo algo parecido a esto 
	  en el prompt de SRM:</para>

	<screen>&gt;&gt;&gt;<userinput>BOOT DKC0</userinput></screen>

        <para>Esto indica al firmware que arranque desde el disco 
	  especificado.  Para que &os; arranque autom&aacute;ticamente en el 
	  el futuro use los siguientes comandos:</para>

	<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_OSFLAGS A</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_FILE ''</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOTDEF_DEV DKC0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET AUTO_ACTION BOOT</userinput></screen>

	<para>Los mensajes de arranque ser&aacute;n muy similares (pero no 
	  id&eacute;nticos a los que se producen en el arranque de &os; 
	  en &i386;.</para>
      </sect3>
    </sect2>

    <sect2 id="shutdown">
      <title>Apagar &os;</title>

      <para>Es muy importante apagar correctamente el sistema operativo.  
	No se trata de pulsar el bot&oacute;n <quote>power</quote>.  
	Lo primero que debe hacer es convertirse en superusuario 
	escribiendo <command>su</command> en la l&iacute;nea de comandos e 
	introduciendo la contrase&ntilde;a de <username>root</username>.  
	Tenga en cuenta que s&oacute;lo podr&aacute; hacer tal cosa si 
	el usuario es miembro del grupo <groupname>wheel</groupname>.  
	Si no, puede acceder al sistema como <username>root</username> y 
	teclear <command>shutdown -h now</command>.</para>
      <para>It is important to properly shutdown the operating
	system.  Do not just turn off power.  First, become a superuser by
	typing <command>su</command> at the command line and entering the
	<username>root</username> password.  This will work only if the user
	is a member of the <groupname>wheel</groupname> group.
	Otherwise, login as <username>root</username> and use
	<command>shutdown -h now</command>.</para>

      <screen>The operating system has halted. 
Please press any key to reboot.</screen>

      <para>Es decir:</para>

      <screen>Se ha detenido el sistema operativo.
Por favor, pulse cualquier tecla y el sistema se reiniciará.</screen>


      <para>Una vez que ha aparecido el mensaje 
	<quote>Please press any key to reboot.</quote> puede apagar el 
	sistema tranquilamente.  Si pulsa cualquier tecla en vez de 
	<emphasis>apagar</emphasis> la m&aacute;quina, el sistema se 
	reiniciar&aacute;.</para>

      <para>Tambi&eacute;n puede usar la combinaci&oacute;n de teclas 
        <keycombo action="simul">
	  <keycap>Ctrl</keycap>
	  <keycap>Alt</keycap>
	  <keycap>Supr</keycap>
	</keycombo>
	para reiniciar el sistema pero recuerde que no es la forma m&aacute;s 
	recomendable de hacerlo.</para>

    </sect2>
  </sect1>

  <sect1 id="install-supported-hardware">
    <title>Hardware soportado</title>

    <indexterm><primary>hardware</primary></indexterm>
    <para>&os; funciona en una gran variedad de PC con buses 
      ISA, VLB, EISA y PCI y procesadores <quote>x86</quote> de los 
      tipos Intel, AMD, Cyrix y NexGen, adem&aacute;s de en m&aacute;quinas 
      con procesadores Compaq Alpha.  &os; funciona en unidades ESDI e 
      IDE gen&eacute;ricas, gran cantidad de controladoras SCSI, tarjetas 
      PCMCIA, dispositivos USB, as&iacute; como tarjetas serie y de red.  
      &os; soporta el bus MCA (microcanal) de IBM.</para>

    <para>En cada <quote>release</quote> de &os; se facilita una lista de 
      hardware soportado, dentro de las llamadas <quote>&os; Hardware 
      Notes</quote>.  Normalmente el texto est&aacute; en un fichero llamado 
      <filename>HARDWARE.TXT</filename> que puede encontrarse en el nivel 
      m&aacute;s alto del CDROM o de la distribuci&oacute;n FTP, as&iacute; 
      como en el men&uacute; de documentaci&oacute;n de 
      <application>sysinstall</application>.  En la lista aparece, clasificada 
      por arquitecturas,  el hardware del que se han recibido informes 
      de funcionamiento en cada <quote>release</quote> de &os;.  Puede 
      encontrar copias de esas listas de hardware soportado (para diversas 
      arquitecturas y de todas las <quote>releases</quote> en la 
      p&aacute;gina de <ulink
      url="http://www.FreeBSD.org/releases/index.html">Informaci&oacute;n 
      de <quote>releases</quote></ulink> del sitio web de &os;.</para>
  </sect1>

  <sect1 id="install-trouble">
    <title>Soluci&oacute;n de problemas</title>

    <indexterm>
      <primary>installation</primary>
      <secondary>troubleshooting</secondary>
    </indexterm>
    <para>Esta secci&oacute;n trata sobre la soluci&oacute;n de problemas 
      habituales durante la instalaci&oacute;n que la comunidad de usuarios 
      ha documentado.  Hay tambi&eacute;n unas cuantas preguntas ya respuestas 
      para quienes quieren elegir en el arranque entre &os; y &ms-dos;.</para>

    <sect2>
      <title>Qu&eacute; hacer si algo va mal</title>

      <para>A causa de diversas limitaciones de la arquitectura PC es 
	imposible hacer que nada funcione con un 100% de probabilidades pero 
	al menos hay unas cuantas cosas que pueden hacerse si algo 
	va mal.</para>

      <para>Consulte la lista de hardware soportado y aseg&uacute;rese de 
	que su hardware deber&iacute;a funcionar con su versi&oacute;n de 
	&os;.</para>

      <para>Si su hardware est&aacute; soportado y sigue experimentando 
	<quote>cuelgues</quote> u otro tipo de problemas reset&eacute;e su 
	computadora y cuando se le ofrezca la opci&oacute;n de 
	configuraci&oacute;n visual del kernel, el&iacute;jala.  
	De este modo podr&aacute; obtener una informaci&oacute;n mucho 
	m&aacute;s precisa sobre su hardware y lo que es m&aacute;s m&aacute;s 
	importante, le suministrar&aacute; toda esa informaci&oacute;n al 
	sistema.  El kernel que se encuentra en los discos de arranque 
	se configura asumiendo que la mayor&iacute;a de los dispositivos 
	van a funcionar con la configuraci&oacute;n por defecto que traen 
	de f&aacute;brica (en t&eacute;rminos de IRQ, direcciones IO y 
	canales DMA).  Si su hardware ha sido reconfigurado quiz&aacute;s 
	tendr&aacute; que usar el editor de configuraci&oacute;n para 
	decirle a &os; d&oacute;nde encontrar las cosas.</para>

      <para>Es posible tambi&eacute;n que la prueba de un dispositivo que 
	no existe en el sistema cause problemas m&aacute;s tarde al probar 
	un dispositivo que s&iacute; est&aacute; en la m&aacute;quina.  
	Si ese puede ser su caso desactive las pruebas de de controladores 
	conflictivos.</para>

      <note>
        <para>Algunos problemas de instalaci&oacute;n pueden evitarse o 
	  al menos aliviarse actualizando el firmware de varios tipos de 
	  componentes de hardware; esto es especialmente cierto en el caso 
	  de las placas base.  El firmware de las placas base se llama 
	  tambi&eacute;n <acronym>BIOS</acronym> y la mayor&iacute;a de las 
	  placas base y de los fabricantes de computadoras tienen un sitio 
	  web,  en el que pueden encontrarse actualizaciones e 
	  informaci&oacute;n sobre c&oacute;mo usarlas.</para>

	<para>La mayor&iacute;a de los fabricantes recomienda que no se 
	  actualice la <acronym>BIOS</acronym> de la placa base a menos que 
	  tenga una buena raz&oacute;n, por ejemplo una actualizaci&oacute;n 
	  cr&iacute;tica.  El proceso de actualizaci&oacute;n 
          <emphasis>puede</emphasis> ir mal, lo que pueden significar 
	  da&ntilde;os en el chip de la <acronym>BIOS</acronym>.</para>
        </note>

      <warning>
	<para>&nbsp;No desactive controladores que vaya a necesitar durante la 
	  instalaci&oacute;n, como el de pantalla 
	  (<devicename>sc0</devicename>).  Si la instalaci&oacute;n 
	  se congela o falla misteriosamente tras salir del editor de 
	  configuraci&oacute;n probablemente se debe a que a quitado o 
	  cambiado algo que no deb&iacute;a.  Reinicie e 
	  int&eacute;ntelo de nuevo.</para>
      </warning>

      <para>En el modo de configuraci&oacute;n puede:</para>

      <itemizedlist>
        <listitem>
	  <para>Listar los controladores de dispositivos que hay 
	    instalados en el kernel.</para>
        </listitem>

        <listitem>
	  <para>Desactivar controladores de hardware que no est&aacute; 
	    presente en el sistema.</para>
        </listitem>

        <listitem>
	  <para>Cambiar IRQ, DRQ y direcciones de puertos IO que utilice 
	    alg&uacute;n controlador de dispositivo.</para>
        </listitem>
      </itemizedlist>

      <para>Tras ajustar el kernel a su configuraci&oacute;n de hardware 
	escriba <command>Q</command>;  esto har&aacute; que arranque con 
	la nueva configuraci&oacute;n.  Una vez que haya conclu&iacute;do la 
	instalaci&oacute;n cualquier cambio que haga en el modo 
	configuraci&oacute;n ser&aacute; permanente, as&iacute; que no 
	tendr&aacute; que repetirlo cada vez que arranque el sistema.  
	En cualquier caso es muy posible que tenga que <link
        linkend="kernelconfig">compilar un kernel a medida</link>.</para>
    </sect2>
    
    <sect2>
      <title>Convivencia con particiones &ms-dos; que ya exist&iacute;n 
	previamente</title>

      <indexterm><primary>DOS</primary></indexterm>
      <para>Tarde o temprano muchos usuarios se ven en la tesitura de instalar 
	&os; en un <acronym>PC</acronym> en el que ya hab&iacute;a 
	instalado alguno de los sistemas operativos de &microsoft;.  
	Para esos casos &os; dispone de una aplicaci&oacute;n llamada 
	<application>FIPS</application>.  Esta aplicaci&oacute;n se 
	encuentra en el directorio <filename>tools</filename> del CDROM de 
	instalaci&oacute;n y puede descargarse desde cualquiera de las 
	<link linkend="mirrors">r&eacute;plicas de &os;</link>.</para>

      <para>&nbsp;<application>FIPS</application> permite dividir una 
	partici&oacute;n &ms-dos; en uso en dos partes, preservando la 
	partici&oacute;n original y permitiendo instalar en la segunda 
	parte, que est&aacute; libre.   Antes de nada tendr&aacute; que 
	desfragmentar la partici&oacute;n &ms-dos; mediante el 
	<application>Desfragmentador de discos</application> (desde el 
	<quote>Explorador</quote>, pulse el bot&oacute;n derecho del 
	rat&oacute;n sobre el disco duro y elija <quote>desfragmentar su 
	disco duro</quote>), o use 
	<application>Norton Disk Tools</application>.  Una vez hecho puede 
	ejecutar <application>FIPS</application>.  Le pedir&aacute; 
	ciertos datos que necesita para funcionar, usted s&oacute;lo tiene 
	que seguir las instrucciones en pantalla.  Despu&eacute;s puede 
	reiniciar el sistema e instalar &os; en el espacio libre que acaba 
	de crear.  Consulte el men&uacute; 
	<guimenuitem>Distributions</guimenuitem>, le vendr&aacute; muy bien 
	una estimaci&oacute;n de cu&aacute;nto espacio libre necesitar&aacute; 
	para la instalaci&oacute;n que quiere.</para> 

      <para>Existe tambi&eacute;n un producto muy &uacute;til: 
	<application>&partitionmagic;</application>, de PowerQuest 
	(<ulink url="http://www.powerquest.com/">http://www.powerquest.com</ulink>).  
	Este programa tiene muchas m&aacute;s posibilidades que 
	<application>FIPS</application> y es muy recomendable si suele 
	instalar y desinstalar sistemas operativos con una cierta 
	frecuencia.  Cuesta dinero, as&iacute; que si su idea es instalar 
	&os; y dejarlo instalado probablemente <application>FIPS</application> 
	es m&aacute;s que suficiente.</para>
    </sect2>

    <sect2>
      <title>Uso de sistemas de ficheros &ms-dos; y &windows;</title>

      <para>Cuando se escribe este texto &os; no soporta sistemas de 
	ficheros comprimidos con 
	<application>Double Space&trade;</application>.  Deber&aacute; por 
	lo tanto descomprimir el sistema de ficheros antes de acceder a los 
	datos desde &os;.  Para ello ejecute el 
	<application>Agente de compresi&oacute;n</application> situado en el 
	men&uacute; <guimenuitem>Inicio</guimenuitem>&gt; 
	<guimenuitem>Programas</guimenuitem> &gt;
	<guimenuitem>Herramientas del sistema</guimenuitem>.</para>


      <para>&os; soporta sistemas de ficheros &ms-dos;.  Para ello 
	deber&aacute; usar &man.mount.msdos.8; con los par&aacute;metros 
	correctos ( en &os;&nbsp;5.X use &man.mount.msdosfs.8;)  El uso 
	m&aacute;s frecuente de estas aplicaciones es parecido a lo 
	siguiente:</para>

      <screen>&prompt.root; <userinput>mount_msdos /dev/ad0s1 /mnt</userinput></screen>

      <para>En el ejemplo que se muestra el sistema de ficheros &ms-dos; 
	est&aacute; en la primera partici&oacute;n del primer disco duro.  
	La situaci&oacute;n en su sistema puede ser diferente: compruebe la 
	salida de <command>dmesg</command> y <command>mount</command>.  
	Deber&iacute;an suministrarle suficiente informaci&oacute;n como para 
	darle una idea de la estructura de particiones en la que est&aacute; 
	trabajando.</para>

      <note><para>&nbsp;Los sistemas de ficheros &ms-dos; extendidos suelen 
	<quote>mapearse</quote> tras las particiones &os;.  En otras palabras, 
	el n&uacute;mero de <quote>slice</quote> puede ser superior que el que 
	&os; est&aacute; usando.  Veamos un ejemplo: la primera 
	partici&oacute;n &ms-dos; puede ser <filename>/dev/ad0s1</filename>, 
	la partici&oacute;n &os; puede ser <filename>/dev/ad0s2</filename>, 
	mientras que la partici&oacute;n extendida &ms-dos; puede ser 
	<filename>/dev/ad0s3</filename>.  Esto puede ser un poco confuso al 
	principio.</para></note>

      <para>Las particiones NTFS pueden montarse de un modo muy parecido 
	mediante &man.mount.ntfs.8;.</para>
    </sect2>

    <sect2>
      <title>Preguntas y respuestas para usuarios de Alpha</title>

      <indexterm><primary>Alpha</primary></indexterm>

      <para>En esta secci&oacute;n encontrar&aacute; unas cuantas 
	preguntas frecuentes sobre la instalaci&oacute;n de &os; en 
	sistemas Alpha.</para>

      <qandaset>
	<qandaentry>
	  <question>
	    <para>&iquest;Puedo arrancar desde ARC o desde la 
	      consola BIOS de Alpha?</para>
	  </question>

	  <indexterm><primary>ARC</primary></indexterm>
	  <indexterm><primary>Alpha BIOS</primary></indexterm>
	  <indexterm><primary>SRM</primary></indexterm>

	  <answer>
	    <para>No. &os; al igual que sucede con Compaq Tru64 y VMS, 
	      s&oacute;lo puede arrancar desde la consola SRM.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>&iexcl;Socorro, no tengo espacio! &iquest;Debo 
	      borrarlo todo primero?</para>
	  </question>

	  <answer>
	    <para>Por desgracia <emphasis>s&iacute;</emphasis>.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>&iquest;Puedo montar mis sistemas de ficheros 
	      Compaq Tru64 o VMS?</para>
	  </question>

	  <answer>
	    <para>En este momento <emphasis>no</emphasis>.</para>
	  </answer>
	</qandaentry>
      </qandaset>
    </sect2>
  </sect1>

  <sect1 id="install-advanced">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Valentino</firstname>
	  <surname>Vaschetto</surname>
	  <contrib>Escrito por </contrib>
	</author>
	<!-- May 2001 -->
      </authorgroup>
    </sect1info>

    <title>Gu&iacute;a de instalaci&oacute;n avanzada</title>

    <para>Esta secci&oacute;n trata sobre la instalaci&oacute;n de &os; en 
       casos excepcionales.</para>

    <sect2 id="headless-install">
      <title>Instalaci&oacute;n de &os; en un sistema sin monitor o 
	teclado</title>

      <indexterm>
        <primary>installation</primary>
        <secondary>headless (serial console)</secondary>
      </indexterm>
      <indexterm><primary>serial console</primary></indexterm>
      <para>&Eacute;sta instalaci&oacute;n es conocida como 
	<quote>instalaci&oacute;n sin cabeza</quote>, porque la 
	m&aacute;quina en la que est&aacute; intentando instalar &os; 
	no tiene un monitor conectado; quiz&aacute;s ni siquiera tiene 
	salida VGA.  &iquest;C&oacute;mo es posible?, se preguntar&aacute;: 
	A trav&eacute;s de una consola serie.  Una consola serie consiste 
	b&aacute;sicamente en usar otro sistema como la pantalla y el 
	teclado de una m&aacute;quina.  Siga las instrucciones de 
	creaci&oacute;n de los disquetes que se detallan en la <xref
        linkend="install-floppies">.</para>

      <para>Tendr&aacute; que modificar esos disquetes para que arranquen 
	en la consola serie; siga estas instrucciones:</para>

      <procedure>
	<step>
	  <title>Modificaci&oacute;n de los disquetes de arranque para que 
	    permitan el arranque en la consola serie</title>
  	    <indexterm>
	      <primary><command>mount</command></primary>
	    </indexterm>
	    <para>Si arrancara con los disquetes que acaba de crear &os; 
	      arrancar&iacute;a en el modo normal de instalaci&oacute;n.  Lo 
	      que queremos es que &os; arranque en una consola serie, 
	      as&iacute; que hemos de montar el floppy 
	      <filename>kern.flp</filename> en un sistema &os; mediante 
	      &man.mount.8;.</para>

            <screen>&prompt.root; <userinput>mount /dev/fd0 /mnt</userinput></screen>

	    <para>Una vez montado el floppy entre en el directorio 
	      <filename role="directory">/mnt</filename>&nbsp;:</para>

	    <screen>&prompt.root; <userinput>cd /mnt</userinput></screen>

	    <para>Aqu&iacute; es donde ense&ntilde;aremos al floppy a 
	      arrancar en la consola serie.  Debe crearse un fichero llamado 
	      <filename>boot.config</filename> que contenga lo siguiente: 
	      <literal>/boot/loader -h</literal>.  Con esto le pasamos a 
	      al <quote>bootloader</quote> (el <emphasis>cargador de 
	      arranque</emphasis>) la <quote>flag</quote> de arrancar 
	      en una consola serie.</para>

	    <screen>&prompt.root; <userinput>echo "/boot/loader -h" > boot.config</userinput></screen>

	    <para>Una vez configurado correctamente nuestro floppy lo 
	      desmontamos con &man.umount.8;:</para>

            <screen>&prompt.root; <userinput>cd /</userinput>
&prompt.root; <userinput>umount /mnt</userinput></screen>

	    <para>Y podemos extraer el floppy de la unidad.</para>
	  </step>

	  <step>
	    <title>Conexi&oacute;n del cable modem</title>

  	    <indexterm><primary>null modem cable</primary></indexterm>
	    <para>Tiene que conectar un 
	      <link linkend="term-cables-null">cable 
	      m&oacute;dem  nulo</link> entre dos m&aacute;quinas.  
	      <emphasis>Un cable serie normal no funcionar&aacute;</emphasis>, 
	      necesitar&aacute; un cable m&oacute;dem nulo porque tiene 
	      cruzado alguno de los hilos.</para>
	  </step>

	  <step>
	    <title>Arranque de la instalaci&oacute;n</title>

            <para>Podemos iniciar la instalaci&oacute;n.  Introduzca el 
	      floppy <filename>kern.flp</filename> en la unidad de disquetes 
	      de la m&aacute;quina en la que quiere hacer la instalaci&oacute;n 
	      y encienda la m&aacute;quina.</para>
	  </step>

	  <step>
	    <title>La conexi&oacute;n a su <quote>m&aacute;quina sin 
	      cabeza</quote></title>
	    <indexterm>
	      <primary><command>cu</command></primary>
	    </indexterm>
	    <para>Con&eacute;ctese mediante &man.cu.1;:</para>

	    <screen>&prompt.root; <userinput>cu -l /dev/cuaa0</userinput></screen>
	  </step>
      </procedure>

      <para>&nbsp;&iexcl;Ya est&aacute;! Desde ahora deber&iacute;a ser 
	capaz de controlar su <quote>m&aacute;quina sin cabeza</quote> 
	mediante su sesi&oacute;n <command>cu</command>.  El sistema de 
	instalaci&oacute;n le avisar&aacute; de que debe introducir el 
	floppy <filename>mfsroot.flp</filename> y despu&eacute;s le 
	preguntar&aacute; por el tipo de terminal que prefiere usar.  
	Elija la consola en color de &os; y &iexcl;buena suerte con la 
	instalaci&oacute;n!.</para>

    </sect2>
  </sect1>

  <sect1 id="install-diff-media">
    <title>C&oacute;mo preparar su propio medio de 
      instalaci&oacute;n</title>

    <note>
      <para>&nbsp;Para evitar la repetici&oacute;n <quote>disco &os;</quote> 
	ser&aacute; en adelante un CDROM o un DVD de &os; que usted ha 
	comprado o ha hecho por sus propios medios.</para>
    </note>

    <para>Puede darse la circunstancia de que tenga que crear su propio 
      medio de instalaci&oacute;n de &os;.  Puede tratarse de un medio 
      f&iacute;sico como una cinta o una fuente para que 
      <application>sysinstall</application> pueda obtener los ficheros 
      que vaya necesitando, como un sitio FTP local, o bien puede 
      tratarse de una partici&oacute;n &ms-dos;.</para>

    <para>Por ejemplo:</para>

    <itemizedlist>
      <listitem>
        <para>Tiene muchas m&aacute;quinas conectadas a una red local y 
	  un s&oacute;lo disco &os;.  Quiere crear un sitio FTP local 
	  con el contenido del disco &os; y que desde &eacute;l sus 
	  m&aacute;quinas obtengan los ficheros en lugar de tener que 
	  conectarse a Internet.</para>
      </listitem>

      <listitem>
	<para>Tiene un disco &os; y &os; no reconoce su unidad CD/DVD pero 
	  &ms-dos;/&windows; s&iacute;.  Quiere copiar los ficheros de 
	  instalaci&oacute;n de &os; a una partici&oacute;n DOS en el mismo 
	  mismo sistema y luego instalar &os; usando esos ficheros.</para>
      </listitem>

      <listitem>
	<para>El sistema en el que quiere instalar &os; no tiene 
	  unidad CD/DVD ni tarjeta de red pero puede conectar un cable 
	  paralelo o un cable serie <quote>Laplink</quote> a una computadora 
	  que s&iacute; que tiene.</para>
      </listitem>

      <listitem>
	<para>Quiere crear una cinta desde la que se pueda instalar 
	  &os;.</para>
      </listitem>
    </itemizedlist>

    <sect2 id="install-cdrom">
      <title>Creaci&oacute;n de un CDROM de instalaci&oacute;n</title>

      <para>Con cada <quote>release</quote> el proyecto &os; libera dos 
	im&aacute;genes de CDROM (<quote>im&aacute;genes ISO</quote>).  
	Esas im&aacute;genes pueden copiarse a CD 
	(<quote>quemadas</quote> o <quote>tostadas</quote>) en CD si dispone 
	de una grabadora de CD, y usarse posteriormente para instalar &os;.  
	Si tiene una grabadora de CD y el ancho de banda no le supone un 
	problema la forma m&aacute;s f&aacute;cil de instalar &os; es 
	esta.</para>

      <procedure>
	<step>
	  <title>Descargar la imagen ISO correcta</title>

	  <para>Puede descargar las im&aacute;genes ISO de cada 
	   <quote>release</quote> desde 
	   <filename>ftp://ftp.FreeBSD.org/pub/FreeBSD/ISO-IMAGES-<replaceable>arquitectura</replaceable>/<replaceable>versi&oacute;n</replaceable></filename> 
	    o desde la r&eacute;plica m&aacute;s pr&oacute;xima.  
	    Sustituya <replaceable>arquitectura</replaceable> y 
	    <replaceable>versi&oacute;n</replaceable> por lo que 
	    corresponda.</para>

	  <para>Ese directorio contendr&aacute; normalmente las siguientes 
	    im&aacute;genes:</para>

	  <table frame="none">
	    <title>Nombre de las im&aacute;genes ISO de &os; y
	      su significado</title>

	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Nombre de fichero</entry>

		  <entry>Contenido</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-mini.iso</filename></entry>
		  
		  <entry>Todo lo que necesita para instalar &os;.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-disc1.iso</filename></entry>

		  <entry>Todo lo necesario para instalar &os; as&iacute; como 
		    un gran n&uacute;mero de paquetes de software.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>versi&oacute;n</replaceable>-disc2.iso</filename></entry>

		  <entry>Un sistema de ficheros <quote>live</quote> (es decir, 
		    ejecutable desde CD) que ejecutado en conjunci&oacute;n 
		    con la aplicaci&oacute;n <quote>Repair</quote> de 
		    <application>sysinstall</application>.  Una copia del 
		    &aacute;rbol CVS &os;.  Un gran n&uacute;mero de paquetes 
		    de software.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </table>

<!-- XXX we don't need to mention things prior to 4.4 anymore
	  <note>
	    <para>The mini ISO was only produced for FreeBSD&nbsp;4.4 and
	      subsequent releases.  The images for discs two, three, and four
	      were only produced for FreeBSD&nbsp;4.5 and subsequent
	      releases.</para>
	  </note>
-->

	  <para>Descargue la imagen mini ISO o la imagen del disco uno.  
	    <emphasis>No</emphasis> descargue ambas, puesto que el disco 
	    uno contiene todo lo que hay en la imagen mini ISO.</para>

	  <para>Use la mini ISO si su acceso a Internet es barato.  Con ella 
	    podr&aacute; instalar &os; y podr&aacute; instalar todo tipo de 
	    software descarg&aacute;ndolo como paquetes/ports (consulte 
	    el <xref linkend="ports">) cuando lo precise.</para>

	  <para>Utilice la imagen del disco uno si quiere disponer en el 
	    propio disco de una selecci&oacute;n bastante completa 
	    de paquetes de software.</para> 

          <para>Si tiene acceso de alta velocidad a Internet las dem&aacute;s 
	    im&aacute;genes de disco son &uacute;tiles pero no 
	    esenciales.</para>
	</step>

	<step>
	  <title>Escribir los CD</title>

	  <para>Si va a grabar los CD en un sistema &os; consulte la 
	    <xref linkend="creating-cds"> (en particular la 
	    <xref linkend="burncd"> y la 
	    <xref linkend="cdrecord">).</para>

          <para>Las im&aacute;genes se hacen en un formato ISO 
	    est&aacute;ndar; si va a grabarlas en cualquier otra plataforma 
	    no deber&iacute;a tener problemas para hacerlo cualquiera que sea 
	    la aplicaci&oacute;n que use para grabar CD.</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="install-ftp">
      <title>Creaci&oacute;n de un sitio FTP local a partir de un 
	disco &os;</title>
	
      <indexterm>
	<primary>installation</primary>
	<secondary>network</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>

      <para>Los discos &os; tienen la misma estructura que los sitios FTP.  
	Esa circunstancia le facilitar&aacute; mucho la tarea de crear un sitio 
	FTP local para uso de otras m&aacute;quinas de su red durante la 
	instalaci&oacute;n de &os;.</para>

      <procedure>
	<step>
	  <para>Monte el CDROM en <filename>/cdrom</filename> del 
	    sistema que va a albergar el sitio FTP.</para>

	  <screen>&prompt.root; <userinput>mount /cdrom</userinput></screen>
	</step>

	<step>
	  <para>Cree una cuenta apta para FTP an&oacute;nimo en 
	    <filename>/etc/passwd</filename> editando 
	    <filename>/etc/passwd</filename> con &man.vipw.8;.  
	    A&ntilde;&aacute;dale lo siguiente:</para>

	  <programlisting>ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>
	</step>

	<step>
	  <para>Compruebe que el servicio FTP est&aacute; activado en 
	    <filename>/etc/inetd.conf</filename>.</para>
	</step>
      </procedure>

      <para>Ahora cualquier m&aacute;quina capaz de conectarse a su 
	sistema a trav&eacute;s de una red puede elegir como medio de 
	instalaci&oacute;n <quote>FTP</quote> y escribir 
	<userinput>ftp://<replaceable>su m&aacute;quina</replaceable></userinput>
	tras seleccionar <quote>Other</quote> en el men&uacute; de sitios 
	FTP.</para>

      <warning>
	<para>&nbsp;Acabamos de exponer una buena soluci&oacute;n para usar 
	  en un sistema de su propia red y que adem&aacute;s est&aacute; 
	  protegido por un cortafuegos.  Si ofrece servicios FTP a 
	  m&aacute;quinas de Internet (y no de su red local) expone su 
	  computadora a caer bajo la atenci&oacute;n de 
	  <quote>crackers</quote> y otras variedades de indeseable.  Le 
	  recomendamos encarecidamente que siga a rajatabla pol&iacute;ticas 
	  sensatas de seguridad.</para>
      </warning>
    </sect2>

      <sect2>
	<title>Creaci&oacute;n de disquetes de instalaci&oacute;n</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>floppies</secondary>
      </indexterm>

      <para>Si quiere instalar &os; desde disquetes (cosa que, de 
	antemano, le sugerimos que <emphasis>no</emphasis> haga) bien 
	sea porque &os; no soporta cierto componente necesario de su 
	sistema o sencillamente porque insiste en querer hacer las cosas 
	de la manera m&aacute;s dif&iacute;cil, tendr&aacute; que 
	tener a mano unos cuantos disquetes.</para>

	<para>Como m&iacute;nimo necesitar&aacute; tantos disquetes de 
	  1.44&nbsp;MB o 1.2&nbsp;MB como hagan falta para dar cabida a todos 
	  los ficheros que hay en <filename>bin</filename>.   Recuerde la 
	  entrada <quote>binary distribution</quote> (distribuci&oacute;n 
	  binaria) durante la instalaci&oacute;n.  Si est&aacute; generando 
	  los disquetes en DOS <emphasis>debe formatearlos</emphasis> con 
	  <command>FORMAT</command> de &ms-dos;.  Si est&aacute; usando 
	  &windows; puede usar el Explorador para formatear disquetes: 
	  bot&oacute;n derecho del rat&oacute;n sobre la unidad 
	  <devicename>A:</devicename> y elija <quote>Formatear</quote>.</para>

	<para>&nbsp;<emphasis>No</emphasis> conf&iacute;e en el preformateo 
	  de f&aacute;brica de los disquetes.  Format&eacute;elos usted de 
	  nuevo, s&oacute;lo para asegurarse.  La mayor&iacute;a de los 
	  problemas de los que se ha informado se han debido a formateos 
	  defectuosos, t&eacute;ngalo en cuenta.</para>

	<para>Si puede crear los disquetes en una m&aacute;quina &os; un 
	  formateo sigue sin ser una mala idea, pero no necesitar&aacute; 
	  crear un sistema de ficheros DOS en cada floppy.  Use 
	  <command>disklabel</command> y <command>newfs</command> 
	  para crear un sistema de ficheros UFS en los disquetes tal y como 
	  se muestra aqu&iacute; (en un floppy de 1.44&nbsp;MB y 3.5")
	  :</para>

	<screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

	<note>
	  <para>&nbsp;Tendr&aacute; que usar <literal>fd0.1200</literal> y 
	    <literal>floppy5</literal> si usa discos de 5.25" y 
	    1.2&nbsp;MB.</para>
	</note>

	<para>Ahora puede montarlos y escribir en ellos igual que en cualquier 
	  otro sistema de ficheros del sistema.</para>

	<para>Tras el formateo de los disquetes pasamos a llenarlos.  Los 
	  ficheros necesarios para crear la distribuci&oacute;n se dividen en 
	  partes de tama&ntilde;o regular de modo que cinco de ellas entren 
	  en otros tantos disquetes de 1.44&nbsp;MB.  Empaquete tantos ficheros 
	  como pueda en cada uno hasta que tenga todas las distribuciones 
	  que necesita lista para pasar a los disquetes.
	  Cada distribuci&oacute;n 
	  deber&iacute;a ir ir en un subdirectorio del floppy, por ejemplo 
	  <filename>a:\bin\bin.aa</filename>,
	  <filename>a:\bin\bin.ab</filename>, etc.</para>

	<para>Una vez en el men&uacute; de selecci&oacute;n de medio de 
	  instalaci&oacute;n elija <guimenuitem>Floppy</guimenuitem> y 
	  siga las instrucciones.</para>
      </sect2>

      <sect2 id="install-msdos">
	<title>Instalaci&oacute;n desde una partici&oacute;n &ms-dos;</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>from MS-DOS</secondary>
	</indexterm>
	<para>Copie los ficheros de la distribuci&oacute;n en un directorio 
	  llamado <filename>freebsd</filename> en el directorio ra&iacute;z 
	  de la partici&oacute;n, por ejemplo <filename>c:\freebsd</filename>.  
	  La estructura de directorios del sitio FTP o el CDROM debe 
	  reproducirse parcialmente en este directorio, as&iacute; que le 
	  sugerimos que use <command>xcopy</command> si est&aacute; 
	  copiando los datos desde un CD.  En el siguiente ejemplo vamos a 
	  preparar una instalaci&oacute;n m&iacute;nima de &os;:</para>

	<screen><prompt>C:\&gt;</prompt> <userinput>md c:\freebsd</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\bin c:\freebsd\bin\ /s</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\manpages c:\freebsd\manpages\ /s</userinput></screen>

        <para>Se ha asumido que <devicename>C:</devicename> es donde tiene 
	  espacio libre y <devicename>E:</devicename> es donde tiene montada 
	  su unidad CDROM.</para>
	
	<para>Si no tiene unidad CDROM puede descargar la distribuci&oacute;n 
	  desde <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/">ftp.FreeBSD.org</ulink>.  
	  Cada distribuci&oacute;n dispone de su propio directorio; por 
	  ejemplo, la distribuci&oacute;n <emphasis>base</emphasis> est&aacute; 
	  en el directorio<ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/base/">&rel.current;/base/</ulink>.</para>

	<note>
	  <para>&nbsp;En las versiones 4.X y anteriores de &os; la 
	    distribuci&oacute;n <quote>base</quote> se llamaba 
	    <quote>bin</quote>.  Corrija donde corresponda los comandos que 
	    se dan como ejemplo en el p&aacute;rrafo anterior si est&aacute; 
	    usted usando alguna de las versiones citadas.</para>
	</note>
    
	<para>La &uacute;nica distribuci&oacute;n 
	  <emphasis>imprescindible</emphasis> es <literal>BIN</literal>.  
	  Guarde esta y todas las distribuciones que quiera instalar desde 
	  una partici&oacute;n &ms-dos; bajo 
	  under <filename>c:\freebsd</filename>.</para>
      </sect2>

      <sect2>
	<title>Creaci&oacute;n de una cinta de instalaci&oacute;n</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>from QIC/SCSI Tape</secondary>
	</indexterm>
	<para>La instalaci&oacute;n desde cinta es probablemente el 
	  m&eacute;todo m&aacute;s f&aacute;cil, casi tanto como una 
	  instalaci&oacute;n desde una r&eacute;plica FTP o desde un 
	  CDROM.  Lo &uacute;nico que el programa de instalaci&oacute;n 
	  necesita es que los  ficheros est&eacute;n·empaquetador con 
	  <application>tar</application> y en una cinta.  Veamos 
	  un ejemplo:</para>

	<screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>

	<para>Cuando est&eacute; preparando la instalaci&oacute; tenga 
	  la precauci&oacute;n de dejar sitio suficiente en alg&uacute;n 
	  directorio temporal (accesible en ese momento) para dejar 
	  <emphasis>todos los ficheros</emphasis> que hubiera en la 
	  cinta de instalaci&oacute;n.  A causa del acceso secuencial propio 
	  del dise&ntilde;o de las cintas este m&eacute;todo de 
	  instalaci&oacute;n requiere un poco de almacenamiento 
	  temporal.</para>

	<note>
	  <para>&nbsp;Recuerde que antes de arrancar desde el disquete de 
	    arranque la cinta <emphasis>debe estar en la unidad</emphasis>.  
	    La prueba de hardware de la instalaci&oacute;n no 
	    encontrar&iacute;a la cinta.</para> 
	</note>
      </sect2>

      <sect2>
	<title>Antes de arrancar a trav&eacute;s de una red</title>

	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>serial (SLIP or PPP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>parallel (PLIP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>installation</primary>
	  <secondary>network</secondary>
	  <tertiary>Ethernet</tertiary>
	</indexterm>
	<para>Hay tres tipos de instalaci&oacute;n a trav&eacute;s de 
	  una red disponibles en &os;: Puerto serie (SLIP o PPP), puerto 
	  paralelo (PLIP (cable <quote>laplink</quote>)) y Ethernet 
	  (mediante un interfaz Ethernet est&aacute;ndar o algunos 
	  PCMCIA).</para>

	<para>El protocolo SLIP es bastante primitivo y destinado en su 
	  origen a enlaces directos, como un cable serie entre un sistema 
	  port&aacute;til (<quote>laptop</quote>) y otra computadora.  
	  El enlace debe ser directo puesto que la instalaci&oacute;n a 
	  trav&eacute;s de SLIP no permite llamadas telef&oacute;nicas; 
	  para ello tendr&aacute; que usar PPP, que deber&iacute; intentar 
	  usar en lugar de SLIP sea cual sea la circunstancia.</para>

	<para>Si va a usar un m&oacute;dem PPP es casi su &uacute;nica 
	  opci&oacute;n.  Tenga a mano la informaci&oacute;n de su proveedor 
	  de servicios (ISP) puesto que se le van a pedir unos cuantos 
	  datos sobre &eacute;l bastante pronto.</para>

	<para>Si usa PAP o CHAP al conectar con su ISP (en otras palabras, 
	  si conecta su &windows; con su ISP sin usar un 
	  <quote>script</quote>) s&oacute;lo tiene que escribir 
	  <command>dial</command> en el prompt de 
	  <application>ppp</application> prompt.  Adem&aacute;s tendr&aacute; 
	  que saber c&oacute;mo llamar a su ISP mediante los 
	  <quote>comandos AT</quote> propios de su m&oacute;dem, puesto que 
	  PPP dispone de un emulador de terminal bastante escaso.  Consulte 
	  la parte relacionada con user-ppp del <link
	  linkend="userppp">handbook</link> y las <ulink
	  url="http://www.FreeBSD.org/doc/en/books/faq/ppp.html">FAQ</ulink>.  
	  Si tiene problemas puede redirigir la salida a pantalla mediante 
	  <command>set log local ...</command>.</para>

	<para>Si hay posibilidad de conectar directamente con otra 
	  m&aacute;quina &os; (2.0-R o posterior) quiz&aacute;s fuera 
	  razonable instalar a trav&eacute;s de un cable paralelo 
	  <quote>laplink</quote>.  La tasa de transferencia es mucho 
	  m&aacute;s alta de lo que suele ser en una l&iacute;nea serie 
	  (m&aacute;s de 50&nbsp;kbytes/s), lo que puede hacer la 
	  instalaci&oacute;n much&iacute;simo m&aacute;s r&aacute;pida.</para>

	<para>Un adaptador Ethernet es siempre una buena elecci&oacute;n.  
	  &os; soporta la mayor&iacute;a de los adaptadores Ethernet.  Tiene 
	  una lista de dispositivos soportados en las notas de hardware de 
	  cada <quote>release</quote> de &os;.  Si disponde alguno de los 
	  adaptadores Ethernet PCMCIA soportados por &os; recuerde que debe 
	  estar presente en el sistema <emphasis>antes</emphasis> de que 
	  el sistema arranque.  Por desgracia &os; no soporta a&uacute;n 
	  la inserci&oacute;n en caliente de tarjetas PCMCIA durante la 
	  instalaci&oacute;n.</para>

	<para>Tendr&aacute; que conocer tambi&eacute;n la direcci&oacute;n 
	  IP de la red, la m&aacute;scara de red correcta para la clase de 
	  su red y el nombre de su m&aacute;quina.  Si va a instalar 
	  mediante una conexi&oacute;n PPP y no tiene IP est&aacute;tica no 
	  se preocupe, su ISP puede asignarle una IP temporal 
	  din&aacute;micamente.  Su administrador de sistemas seguramente 
	  puede ayudarle con la configuraci&oacute;n de su red.  Si va a 
	  intentar conectarse con otras m&aacute;quinas mediante sus 
	  nombres en lugar de sus direcciones IP necesitar&aacute; los 
	  datos de un servidor de nombres y es posible que necesite 
	  tambi&eacute;n la direcci&oacute;n de un <quote>gateway</quote> 
	  (si usa PPP vale con la direcci&oacute;n IP de su proveedor).  
	  Si va a instalar por FTP a trav&eacute;s de un proxy HTTP 
	  necesitar&aacute; la direcci&oacute;n del proxy.  
	  Si no sabe qu&eacute; pueden significar todas (o la mayor&iacute;a) 
	  de estas preguntas hable con su administrador de sistemas o con su 
	  ISP <emphasis>antes</emphasis> de intentar instalar &os; de esta 
	  forma.</para>

	<sect3>
	  <title>Antes de instalar via NFS</title>

	  <indexterm>
	    <primary>installation</primary>
	    <secondary>network</secondary>
	    <tertiary>NFS</tertiary>
	  </indexterm>
	  <para>La instalaci&oacute;n por NFS es bastante sencilla.  
	    S&oacute;lo tendr&aacute; que copiar los ficheros de la 
	    distribuci&oacute;n a un servidor NFS, seleccionar NFS como 
	    medio de instalaci&oacute;n y apuntar a los contenidos a donde 
	    los haya copiado.</para>

	  <para>si el servidor s&oacute;lo soporta 
	    <quote>puertos privilegiados</quote> (que suele ser la 
	    configuraci&oacute;n por defecto en estaciones de trabajo 
	    Sun) tendr&aacute; que seleccionar la opci&oacute;n 
	    <option>NFS Secure</option> en el men&uacute; 
	    <quote>Options</quote> antes de comenzar con la 
	    instalaci&oacute;n.</para>

	  <para>Si una tarjeta Ethernet de mala calidad y est&aacute; 
	    experimentando velocidades de transferencia muy bajas puede 
	    probar con el par&aacute;metro <option>NFS Slow</option>.</para>

	  <para>Para que la instalaci&oacute;n via NFS funcione el servidor 
	    debe permitir el montaje de subdirectorios.  Por ejemplo, si su 
	    distribuci&oacute;n  FreeBSD&nbsp;&rel.current; est&aacute; en 
	    <filename>ziggy:/usr/archive/stuff/FreeBSD</filename> el servidor 
	    <hostid>ziggy</hostid> tendr&aacute; que permitir que pueda 
	    montarse <filename>/usr/archive/stuff/FreeBSD</filename>, no 
	    simplemente como <filename>/usr</filename> o 
	    <filename>/usr/archive/stuff</filename>.</para>

	  <para>En el fichero <filename>/etc/exports</filename> de &os; 
	    eso puede controlarse mediante la opci&oacute;n 
	    <option>-alldirs</option>.  Puede que otros servidores NFS 
	    requieran de par&aacute;metros diferentes.  Si recibe mensajes 
	    de <errorname>permission denied</errorname> seguramente no ha 
	    activado esto correctamente.</para>
	</sect3>

      </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
