<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY dedate "$FreeBSDde: de-www/projects/newbies.sgml,v 1.25 2010/12/17 13:32:35 jkois Exp $">
<!ENTITY reference "basiert auf: 1.61">
<!ENTITY title 'Informationen f&uuml;r Einsteiger'>
<!ENTITY % navinclude.docs "INCLUDE">
<!ENTITY url.articles "../../doc/en_US.ISO8859-1/articles">
<!ENTITY url.articles.de "../../doc/de_DE.ISO8859-1/articles">
<!ENTITY url.books "../../doc/en_US.ISO8859-1/books">
<!ENTITY url.books.de "../../doc/de_DE.ISO8859-1/books">
]>

<html>
    &header;

    <p>Die folgenden Ressourcen haben schon vielen Einsteigern dabei
      geholfen, den Umgang mit &os; zu erlernen.  Korrekturen und
      Erg&auml;nzungen zu diesen Seiten senden Sie bitte an
      <a href="mailto:freebsd-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>.</p>

    <ul>
      <li><a href="#web-site">Die &os;-Internetseite verwenden</a></li>
      <li><a href="#fbsd">&os; kennenlernen</a></li>
      <li><a href="#derived">Auf &os; basierende Betriebssysteme</a></li>
      <li><a href="#unix">&unix; kennenlernen</a></li>
      <li><a href="#xwin">Das X Window-System kennenlernen</a></li>
      <li><a href="#people">Anderen Leuten helfen</a></li>
    </ul>

    <h2><a name="web-site">Die &os;-Internetseite verwenden</a></h2>

    <p>Die Internetseite ist die wichtigste Quelle f&uuml;r aktuelle
      Informationen zu &os;.  Folgende Seiten wurden von Einsteigern
      als besonders hilfreich eingestuft:</p>

    <ul>
      <li><p>Die <a href="&enbase;/search/search.html">Suchfunktion</a>
            f&uuml;r das Handbuch, die FAQ, die komplette Internetseite,
            sowie die Archive aller Mailinglisten.</p></li>

      <li><p>Die Seite <a href="&base;/docs.html">Dokumentation</a> mit Links
            zum Handbuch und zu den FAQ, zu verschiedenen Anleitungen, zu
            Informationen zur Mitarbeit am Documentation Project, zu
            Dokumenten in verschiedenen Sprachen, zu den Manualpages und
            vielen anderen Informationen.</p></li>

      <li><p>Die Seite <a href="&base;/support.html">Hilfe</a> enth&auml;lt
            Informationen &uuml;ber &os;, zu den Mailinglisten,
            Anwendergruppen, Internet- und FTP-Seiten, Release-Informationen,
            sowie Links zu Informationen &uuml;ber &unix;.</p></li>
    </ul>

    <h2><a name="fbsd">&os; kennenlernen</a></H2>

    <ul>
      <li><p>Wenn Sie &os; noch nicht installiert haben, weil nicht
            wissen, welche Version Sie installieren sollen, sollten Sie
            zuerst den Artikel <a
            href="&url.articles.de;/version-guide/index.html">Die für
            Sie passende &os;-Version bestimmen</a> lesen.  In der
            Regel wird die <a href="&u.rel.announce;">aktuelle
            Produktiv-Version</a> f&uuml;r Sie am Besten geeignet sein
            (sehen Sie im Handbuch nach, warum Sie zu diesem
            Zeitpunkt <strong>auf keinen Fall</strong> eine der anderen
            Versionen verwenden sollten.).  Bevor Sie mit der
            Installation beginnen, sollten Sie die
            <a href="&url.books.de;/handbook/install.html">
            Installationsanweisungen</a> sorgf&auml;ltig durchlesen.
            Dies gilt auch f&uuml;r alle *.TXT-Dateien, dies sich im
            FTP-Verzeichnis oder auf der Installations-CD befinden, da
            diese Informationen enthalten, die Sie f&uuml;r die
            Installation ben&ouml;tigen werden.  Sehen Sie sich auch die
            aktuelle <a href="&base;/releases/index.html">Errata-Datei</a>
            an, da diese die aktuellen Korrekturen enth&auml;lt.</p>

      <li><p>Zus&auml;tzlich gibt es einige <a href="&base;/docs/books.html#articles">
            kurze Artikel und Anleitungen</a>.  Der Artikel
            <a href="&url.articles.de;/new-users/index.html">
            Informationen für &os;- und &unix;-Einsteiger</a> ist
            besonders bei absoluten Anf&auml;ngern beliebt, da er kaum
            Grundlagenwissen voraussetzt.</p></li>

      <li><p>Wenn Sie ppp konfigurieren m&uuml;ssen, lesen Sie bitte die
            entsprechenden Abschnitte des &os; <a
            href="&url.books.de;/handbook/index.html">Handbuchs</a>,
            insbesondere das Kapitel <a
            href="&url.books.de;/handbook/ppp-and-slip.html">PPP und SLIP</a>.
            N&uuml;tzlich ist auch die
            <a href="http://www.awfulhak.org/ppp.html">ppp-Seite</a>, die
            Links zu weiteren Informationen und aktuellen &Auml;nderungen
            enth&auml;lt.</p></li>

      <li><p><a name="cfbsd" href="http://www.lemis.com/grog/Documentation/CFBSD/">
            The Complete &os;</a> von Greg Lehey, erschienen im
            O'Reilly-Verlag.  Dieses Buch setzt nur minimale
            UNIX-Kenntnisse voraus.  Schritt f&uuml;r Schritt wird
            beschrieben, wie Sie &os; installieren und einrichten.
            Au&szlig;erdem wird erkl&auml;rt, warum Sie etwas machen.</p></li>

      <li><p>Das <a href="&url.books.de;/handbook/index.html">
            &os; Handbuch</a> und die <a href="&url.books.de;/faq/index.html">
            H&auml;ufig gestellten Fragen (FAQ)</a> sind die wichtigsten
            Dokumentationen f&uuml;r &os;.  Sie enthalten viele
            Informationen sowohl f&uuml;r Einsteiger als auch f&uuml;r
            Fortgeschrittene.  Machen Sie sich keine Sorgen, wenn Sie
            manche Dinge nicht sofort verstehen.  Konzentrieren Sie sich
            zuerst auf die Installationsanweisungen sowie die Listen mit
            den Onlineressourcen.  Treten Probleme auf, sollten Sie zuerst
            in den FAQ nach einer L&ouml;sung suchen.</p></li>

      <li><p>Abonnieren Sie die Mailingliste &os;-Questions, um die
            Antworten auf Fragen zu finden, die Sie nicht zu stellen
            wagten.  Dazu f&uuml;llen Sie das Formular unter
            <a href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">
            http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions</a>
            aus.  Ein Durchsuchen der E-Mail-Archive ist &uuml;ber die
            <a href="&enbase;/search/search.html#mailinglists">Suchseite</a>
            m&ouml;glich.</p></li>

      <li><p>Die wichtigste Newsgroup f&uuml;r &os; ist <a
            href="news:comp.unix.bsd.freebsd.misc">comp.unix.bsd.freebsd.misc</a>.
            Interessant k&ouml;nnte auch <a
            href="news:comp.unix.bsd.freebsd.announce">comp.unix.bsd.freebsd.announce</a>
            sein.</p></li>

      <li><p><a href="&cgibase;/man.cgi">Manualpages</a>
            sind zwar eine gute Referenz, f&uuml;r Neulinge sind sie aber
            oft nur schwer verst&auml;ndlich.  Je mehr Sie aber mit Ihnen
            arbeiten, desto vertrauter werden Sie Ihnen werden.  Einige
            sind aber auch f&uuml;r Einsteiger sehr gut geeignet.  Zu
            diesen geh&ouml;rt die Manualpage zu ppp.</p></li>
    </ul>

    <h2><a name="derived">Auf &os; basierende Betriebssysteme</a></h2>

    <p>&os; bildet die Basis f&uuml;r diverse kommerzielle oder
     als Open Source verf&uuml;gbare Betriebssysteme.  Die in
     der folgenden Liste angef&uuml;hrten Versionen werden sehr
     h&auml;ufig eingesetzt und sind f&uuml;r &os;-Anwender
     besonders interessant.</p>

    <ul>
      <li><p><a href="http://www.pcbsd.org">PC-BSD</a> ist eine
	angepasste &os;-Version, die um ein grafisches
	Installationsprogramm sowie um verschiedene m&auml;chtige
	Konfigurationswerkzeuge erweitert wurde, um die Arbeit
	mit dem System zu vereinfachen.</p></li>

      <li><p>Bei <a href="http://www.freesbie.org/">FreeSBIE</a>
	handelt es sich um eine auf &os; basierende Live-CD.
	Dieses System wird direkt von der CD gestartet und
	erfordert keinen Zugriff auf die Festplatte.  Zus&auml;tzlich
	existiert eine Werkzeugsammlung zur Erstellung von
	Systemabbildern f&uuml;r eingebettete Systeme.</p></li>

      <li><p><a href="http://www.apple.com/macosx">Mac OS X</a> von
	Apple <a
	href="http://www.apple.com/server/macosx/technology/unix.html">
	basiert teilweise</a> auf &os; und enth&auml;lt zus&auml;tzlich
	zur propriet&auml;ren Apple-Oberfl&auml;che eine umfangreiche
	&unix;-Umgebung.</p></li>
    </ul>

    <h2><a name="unix">&unix; kennenlernen</a></h2>

    <p>Viele Probleme, die Einsteiger mit &os; haben, beruhen darauf,
      dass ihnen die zur L&ouml;sung der Probleme n&ouml;tigen
      UNIX-Befehle noch nicht bekannt sind.  Haben Sie kein
      UNIX-Hintergrundwissen, sind Sie also gleichzeitig mit zwei
      Problemen konfrontiert.  Gl&uuml;cklicherweise gibt es viele
      M&ouml;glichkeiten, diesen Lernprozess zu vereinfachen.</p>

    <ul>
      <li><p>Das Kapitel <a href="&url.books.de;/handbook/basics.html">
            &unix;-Grundlagen</a> des &os;-Handbuchs beschreibt die
            grundlegenden Befehle und Funktionalit&auml;ten des
            &os;-Betriebssystems.  Die meisten Informationen dieses
            Kapitels gelten auch f&uuml;r andere &unix;-artige
            Betriebssysteme.</p></li>

      <li><p>Es gibt zahlreiche Einsteigerb&uuml;cher, etwa die bekannte
            "Dummies"-Reihe, die in jeder
            gr&ouml;&szlig;eren Buchhandlung erh&auml;ltlich sind.
            W&auml;hlen Sie ein Buch, das Sie anspricht und sehr bald
            werden Sie in der Lage sein, auch anspruchsvollere B&uuml;cher
            zu verstehen.</p></li>

      <li><p>Ein von Einsteigern h&auml;ufig genanntes englischsprachiges
            Buch ist <a name="ufti"><em>UNIX for the Impatient</em></a>
            von Paul W. Abrahams und Bruce R. Larson, erschienen im Verlag
            Verlag Addison-Wesley.  Es kann sowohl zum Erlernen von UNIX
            als auch als Referenz verwendet werden.  Enthalten ist auch
            eine Beschreibung der UNIX-Konzepte sowie ein n&uuml;tzliches
            Kapitel zur Verwendung des X&nbsp;Window-System.</p></li>

      <li><p>Ein weiteres beliebtes Buch ist <em>UNIX Power Tools</em> von
            Jerry Peek, Tim O'Reilly und Mike Loukides, erschienen bei
            O'Reilly and Associates.  Es besteht aus einer Reihe von
            kurzen Artikeln, die jeweils ein bestimmtes Problem behandeln.
            Dabei wird stets auch auf andere Artikel verwiesen, die
            &auml;hnliche Themen behandeln.  Obwohl sich dieses Buch nicht
            speziell an Einsteiger richtet, wird es auf diese Weise
            erleichtert, die Antwort auf eine bestimmte Frage zu finden.
            Einfachere Themen finden Sie in der Regel an Beginn des Buches,
            allerdings sind auch in den anderen Abschnitten einfache kurze
            Artikel zu finden.</p></li>

      <li>
        <p>Ein <a href="http://8help.osu.edu/wks/unix_course/">UNIX
          Einsteigerkurs</a> der Ohio State University ist als HTML-,
          Postscript- und Acrobat PDF-Version verf&uuml;gbar.</p>
      </li>

      <li>
        <p>Ein <a href="http://8help.osu.edu/wks/sysadm_course/">UNIX
          Systemadministrationskurs</a> der Ohio State University
          ist als HTML-Version verf&uuml;gbar.</p>
      </li>

      <li><p><a href="http://www.mcsr.olemiss.edu/unixhelp/">UNIXhelp
            for Users</a> ist ein weiterer Einf&uuml;hrungskurs, der im
            HTML-Format verf&uuml;gbar ist und ebenfalls heruntergeladen
            werden kann.</p></li>

      <li><p>UNIX-Probleme werden in der Newsgroup <a
            href="news:comp.unix.questions">comp.unix.questions</a> sowie
            den dazugeh&ouml;renden <a
            href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/faq/">
            Frequently Asked Questions</a>
            auf der RMIT-FTP-Seite.  F&uuml;r Einsteiger
            besonders interessant sind die Abschnitte 1 und 2.</p></li>

      <li><p>Eine weitere interessante Newsgroup ist <a
            href="news:comp.unix.user-friendly">comp.unix.user-friendly</a>.
            Obwohl diese Newsgroup f&uuml;r Diskussionen &uuml;ber die
            Benutzerfreundlichkeit von UNIX gedacht ist, finden sich dort
            manchmal auch gute Informationen f&uuml;r Einsteiger.  Die <a
            href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/user-friendly">FAQ</a>
            sind auch per FTP erh&auml;ltlich.</p></li>

      <li><p>Viele weitere Internetseiten bieten Ihnen ebenfalls Anleitungen
            und Informationen zu UNIX.  Ein guter Startpunkt
            f&uuml;r Ihre Suche ist die UNIX-Seite von <a
            href="http://www.yahoo.com/Computers_and_Internet/Software/Operating_Systems/Unix/">Yahoo!</a>.</p></li>
    </ul>

    <h2><a name="xwin">Das X Window System kennenlernen</a></h2>

    <p>Das X Window-System wird von vielen Betriebssystemen, darunter
      auch &os;, verwendet.  Informationen zu X finden Sie auf den
      Internetseiten der <a href="http://www.x.org/">X.Org Foundation</a>
      oder von <a href="http://www.xfree86.org/">The XFree86 Project, Inc</a>,
      je nach dem, welche Version Sie verwenden.
      Beachten Sie aber, dass ein Gro&szlig;teil dieser Informationen aus
      Referenzinformationen besteht, die f&uuml;r Einsteiger nur schwer
      verst&auml;ndlich sind.</p>

    <ul>
    <li><p>Drei der weiter oben erw&auml;hnten B&uuml;cher enthalten
      Informationen zur Installation, Konfiguration und Verwendung
      des X&nbsp;Window-Systems und behandeln auch grundlegende Fragen:
      Das Kapitel <a href="&url.books.de;/handbook/x11.html">Das
      X-Window-System</a> des &os;-Handbuchs, <a
      href="#cfbsd">The Complete &os;</a>,
      sowie <a href="#ufti">UNIX for the Impatient</a>.</p></li>

    <li><p>Bevor Sie mit X arbeiten k&ouml;nnen, m&uuml;ssen Sie einen
      Window-Manager ausw&auml;hlen.  Besuchen Sie die Seite
      <a href="http://xwinman.org/">Window Managers for X</a>
      und lesen Sie die Einf&uuml;hrung &uuml;ber Window-Manager.
      Danach lesen Sie den Abschnitt "The Basics".  Anschlie&szlig;end
      k&ouml;nnen Sie die verschiedenen Window-Manager vergleichen, um
      sich f&uuml;r einen davon zu entscheiden.  Die meisten dieser
      Window-Manager lassen sich &uuml;ber die Ports-Sammlung
      installieren.  (Als Bonus finden Sie auf dieser Seite einen
      weiteren Einf&uuml;hrungskurs zu UNIX.)</p></li>
    </ul>

    <h2><a name="people">Anderen Leuten helfen</a></h2>

    <p>Jeder kann die &os;-Gemeinde unterst&uuml;tzen, selbst ein
     Einsteiger!  Einige arbeiten in der Advocacy Group mit, andere
     unterst&uuml;tzen das <a href="&base;/docproj/docproj.html">Documentation
     Project</a> als Korrekturleser.  Viele Einsteiger haben besondere
     F&auml;higkeiten und Kenntnisse, die sie mit anderen teilen k&ouml;nnen.
     Egal, ob diese computerbezogen sind oder nicht.  Oder sie wollen einfach
     nur neue Leute treffen und sie willkommen hei&szlig;en.  Es gibt immer
     Leute, die es m&ouml;gen, anderen zu helfen.</p>

    <p>Freunde, die &os; bereits verwenden, sind auch eine gro&szlig;e
      Hilfe.  Kein Buch kann das Gespr&auml;ch mit jemandem ersetzen, der
      die gleichen Interessen hat, &Auml;hnliches bereits geschafft hat,
      und vor den gleichen Herausforderungen steht.  Wenn nur wenige
      Ihrer Freunde &os; verwenden, verteilen Sie doch Ihre alten CDs,
      damit es mehr werden.</p>

    <p><a href="&enbase;/usergroups.html">Anwendergruppen</a> sind eine gute
      M&ouml;glichkeit, um andere &os;-Anwender zu treffen.  Gibt es
      in Ihrer Umgebung keine, k&ouml;nnen Sie vielleicht eine solche
      Gruppe gr&uuml;nden.</p>

    <p>Bevor Sie mit anderen Menschen &uuml;ber Ihre neuen F&auml;higkeiten
      diskutieren, sollte Sie vielleicht das <a
      href="http://catb.org/~esr/jargon/html/index.html">Jargon File</a>
      lesen.</p>

      &footer;
  </body>
</html>
