Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wine/_index.po
Languages: ko, ru

source: This chapter will describe how to install WINE on a FreeBSD system and how to configure WINE
ko: 이 장에서는 FreeBSD 시스템에 WINE을 설치하는 방법과 WINE을 구성하는 방법을 설명합니다
ru: Эта глава описывает, как установить WINE в системе FreeBSD и как его настроить

source: Part II. Common Tasks
ko: 파트 II. 일반적인 작업
ru: Часть II. Стандартные задачи

source: Chapter 12. WINE
ko: 12장. 와인(WINE)

source: WINE
ko: 와인(WINE)

source: Synopsis
ko: 요약
ru: Обзор

source: https://www.winehq.org/[WINE], which stands for Wine Is Not an Emulator, is technically a software translation layer. It enables to install and run some software written for Windows(R) on FreeBSD (and other) systems.
ko: https://www.winehq.org/[WINE]은 Wine Is Not an Emulator의 약자로, 엄밀히 말하면 소프트웨어 번역 레이어입니다. 이 레이어는 FreeBSD(및 기타) 시스템에서 Windows(R) 용으로 작성된 일부 소프트웨어를 설치하고 실행할 수 있게 해줍니다.

source: It operates by intercepting system calls, or requests from the software to the operating system, and translating them from Windows(R) calls to calls that FreeBSD understands. It will also translate any responses as needed into what the Windows(R) software is expecting. So in some ways, it _emulates_ a Windows(R) environment, in that it provides many of the resources Windows(R) applications are expecting.
ko: 이것은 시스템 호출 또는 소프트웨어에서 운영 체제로의 요청을 가로채서, Windows(R) 호출에서 FreeBSD가 이해할 수 있는 호출로 변환하는 방식으로 작동합니다. 또한 필요에 따라 모든 응답을 Windows(R) 소프트웨어가 기대하는 응답으로 변환합니다. 따라서 어떤 면에서는 Windows(R) 애플리케이션이 기대하는 많은 리소스를 제공한다는 점에서 Windows(R) 환경을 _에뮬레이션_합니다.
ru: Он работает, перехватывая системные вызовы, или запросы от программного обеспечения к операционной системе, и преобразует их из вызовов Windows(R) в вызовы, которые понимает FreeBSD. Он также преобразует любые ответы, если это необходимо, в то, что ожидает программное обеспечение Windows(R). Таким образом, в некотором смысле он _эмулирует_ среду Windows(R), предоставляя многие из ресурсов, которые ожидают приложения Windows(R).

source: However, it is not an emulator in the traditional sense. Many of these solutions operate by constructing an entire other computer using software processes in place of hardware. Virtualization (such as that provided by the package:emulators/qemu[] port) operates in this way. One of the benefits of this approach is the ability to install a full version of the OS in question to the emulator. It means that the environment will not look any different to applications than a real machine, and chances are good that everything will work on it. The downside to this approach is the fact that software acting as hardware is inherently slower than actual hardware. The computer built in software (called the _guest_) requires resources from the real machine (the _host_), and holds on to those resources for as long as it is running.
ko: 그러나 이는 전통적인 의미의 에뮬레이터가 아닙니다. 이러한 솔루션의 대부분은 하드웨어 대신 소프트웨어 프로세스를 사용하여 다른 컴퓨터 전체를 구성하는 방식으로 작동합니다. 가상화(package:emulators/qemu[] 포트에서 제공하는 것과 같은)는 이러한 방식으로 작동합니다. 이 접근 방식의 장점 중 하나는 에뮬레이터에 해당 OS의 정식 버전을 설치할 수 있다는 것입니다. 즉, 애플리케이션 환경이 실제 컴퓨터와 다르지 않으며 모든 것이 작동할 가능성이 높습니다. 이 접근 방식의 단점은 하드웨어 역할을 하는 소프트웨어가 본질적으로 실제 하드웨어보다 느리다는 사실입니다. 소프트웨어가 내장된 컴퓨터(_게스트_라고 함)는 실제 컴퓨터(_호스트_)의 리소스를 필요로 하며, 실행되는 동안 해당 리소스를 보유합니다.

source: The WINE Project, on the other hand, is much lighter on system's resources. It will translate system calls on the fly, so while it is difficult to be as fast as a real Windows(R) computer, it can come very close. On the other hand, WINE is trying to keep up with a moving target in terms of all the different system calls and other functionality it needs to support. As a result there may be applications that do not work as expected on WINE, will not work at all, or will not even install to begin with.
ko: 반면에 WINE 프로젝트는 시스템 리소스를 훨씬 적게 사용합니다. 시스템 호출을 즉석에서 번역하므로 실제 Windows(R) 컴퓨터만큼 빠르기는 어렵지만 매우 근접할 수 있습니다. 반면에 WINE은 지원해야 하는 모든 다양한 시스템 호출과 기타 기능의 측면에서 움직이는 목표를 따라잡기 위해 노력하고 있습니다. 그 결과 WINE에서 예상대로 작동하지 않거나 전혀 작동하지 않거나 아예 설치조차 되지 않는 애플리케이션이 있을 수 있습니다.
ru: С другой стороны, проект WINE гораздо менее требователен к ресурсам системы. Он преобразует системные вызовы на лету, поэтому, хотя и сложно достичь скорости реального компьютера с Windows(R), он может приблизиться к ней. Однако WINE вынужден успевать за движущейся целью в плане всех различных системных вызовов и другой функциональности, которую необходимо поддерживать. В результате некоторые приложения могут работать в WINE не так, как ожидается, не работать вовсе или даже не устанавливаться.

source: At the end of the day, WINE provides another option to try to get a particular Windows(R) software program running on FreeBSD. It can always serve as the first option which, if successful, offers a good experience without unnecessarily depleting the host FreeBSD system's resources.
ko: 마지막으로, WINE은 특정 Windows(R) 소프트웨어 프로그램을 FreeBSD에서 실행할 수 있는 또 다른 옵션을 제공합니다. 이 옵션은 항상 첫 번째 옵션으로 사용될 수 있으며, 성공할 경우 호스트 FreeBSD 시스템의 리소스를 불필요하게 고갈시키지 않고 좋은 경험을 제공할 수 있습니다.
ru: В конечном итоге, WINE предоставляет ещё один вариант для запуска определённого программного обеспечения Windows(R) на FreeBSD. Он всегда может служить первым вариантом, который в случае успеха обеспечивает хороший опыт работы без излишнего потребления ресурсов хостовой системы FreeBSD.

source: This chapter will describe:
ko: 이 장에서는 다음의 내용을 설명합니다:
ru: Эта глава расскажет о следующем:

source: How to install WINE on a FreeBSD system.
ko: FreeBSD 시스템에 WINE을 설치하는 방법.
ru: Как установить WINE в системе FreeBSD.

source: How WINE operates, and how it is different from other alternatives like virtualizaton.
ko: WINE의 작동 방식과 가상화 같은 다른 대안과의 차이점을 이해하기.

source: How to fine-tune WINE to the specific needs of some applications.
ko: 일부 애플리케이션의 요구에 맞게 WINE을 미세 조정하는 방법.
ru: Как настроить WINE под конкретные потребности некоторых приложений.

source: How to install GUI helpers for WINE.
ko: WINE용 GUI 도우미를 설치하는 방법.
ru: Как установить графические помощники для WINE.

source: Common tips and solutions for on FreeBSD.
ko: FreeBSD에 대한 일반적인 팁과 솔루션.

source: Considerations for WINE on FreeBSD in terms of the multi-user environment.
ko: 다중 사용자 환경 측면에서 FreeBSD의 WINE에 대한 고려 사항.
ru: Соображения по использованию WINE в FreeBSD в условиях многопользовательской среды.

source: Before reading this chapter, it will be useful to:
ko: 이 장을 읽기 전에 다음과 같은 사항을 알아두면 유용할 것입니다:
ru: Прежде чем читать эту главу, полезно:

source: Understand the crossref:basics[basics,basics of UNIX(R) and FreeBSD].
ko: crossref:basics[basics,basics of UNIX(R) and FreeBSD]를 이해합니다.
ru: Понимайте crossref:basics[basics,основы UNIX(R) и FreeBSD].

source: Know how to crossref:bsdinstall[bsdinstall,install FreeBSD].
ko: crossref:bsdinstall[bsdinstall,install FreeBSD]방법.
ru: Знать, как crossref:bsdinstall[bsdinstall,установить FreeBSD].

source: Know how to crossref:advanced-networking[advanced-networking,set up a network connection].
ko: crossref:advanced-networking[advanced-networking,set up a network connection] 방법.
ru: Уметь настраивать сетевое соединение, как описано в crossref:advanced-networking[advanced-networking,разделе по расширенной настройке сети].

source: Know how to crossref:ports[ports,install additional third-party software].
ko: crossref:ports[ports,install additional third-party software] 방법.
ru: Знать, как crossref:ports[ports,установить дополнительное стороннее программное обеспечение].

source: WINE Overview & Concepts
ko: 와인(WINE)의 개요 및 컨셉
ru: Обзор и основные концепции WINE

source: WINE is a complex system, so before running it on a FreeBSD system it is worth gaining an understanding of what it is and how it works.
ko: WINE은 복잡한 시스템이므로 FreeBSD 시스템에서 실행하기 전에 WINE이 무엇이며 어떻게 작동하는지 이해하는 것이 좋습니다.
ru: WINE — это сложная система, поэтому перед запуском на FreeBSD стоит разобраться, что она из себя представляет и как работает.

source: What is WINE?
ko: 와인이란 무엇인가요?
ru: Что такое WINE?

source: As mentioned in the <<wine-synopsis,Synopsis>> for this chapter, WINE is a compatibility layer that allows Windows(R) applications to run on other operating systems. In theory, it means these programs should run on systems like FreeBSD, macOS, and Android.
ko: 이 장의 <<wine-synopsis,Synopsis>>에서 언급했듯이, WINE은 Windows(R) 애플리케이션을 다른 운영 체제에서 실행할 수 있도록 하는 호환성 계층입니다. 이론적으로는 이러한 프로그램이 FreeBSD, macOS 및 Android와 같은 시스템에서 실행되어야 함을 의미합니다.

source: When WINE runs a Windows(R) executable, two things occur:
ko: WINE이 Windows(R) 실행 파일을 실행하면 두 가지 일이 발생합니다:
ru: Когда WINE запускает исполняемый файл Windows(R), происходят две вещи:

source: Firstly, WINE implements an environment that mimics that of various versions of Windows(R). For example, if an application requests access to a resource such as RAM, WINE has a memory interface that looks and acts (as far as the application is concerned) like Windows(R).
ko: 첫째, WINE은 다양한 버전의 Windows(R)를 모방한 환경을 구현합니다. 예를 들어, 애플리케이션이 RAM과 같은 리소스에 대한 액세스를 요청하는 경우, WINE은 (애플리케이션에 관한 한) Windows(R)처럼 보이고 작동하는 메모리 인터페이스를 제공합니다.
ru: Во-первых, WINE реализует среду, имитирующую различные версии Windows(R). Например, если приложение запрашивает доступ к ресурсу, такому как оперативная память, WINE предоставляет интерфейс памяти, который выглядит и ведёт себя (с точки зрения приложения) как Windows(R).

source: Then, once that application makes use of that interface, WINE takes the incoming request for space in memory and translates it to something compatible with the host system. In the same way when the application retrieves that data, WINE facilitates fetching it from the host system and passing it back to the Windows(R) application.
ko: 그런 다음 해당 애플리케이션이 해당 인터페이스를 사용하면 WINE은 메모리 공간에 대한 수신 요청을 받아 호스트 시스템과 호환되는 방식으로 변환합니다. 동일한 방법으로 애플리케이션이 해당 데이터를 요청하면, WINE은 호스트 시스템에서 데이터를 가져와 Windows(R) 애플리케이션으로 다시 전달하는 역할을 합니다.
ru: Затем, когда приложение использует этот интерфейс, WINE обрабатывает запрос на выделение памяти и преобразует его в формат, совместимый с хост-системой. Аналогично, когда приложение запрашивает эти данные, WINE обеспечивает их получение из хост-системы и передачу обратно в приложение Windows(R).

source: WINE and the FreeBSD System
ko: WINE과 FreeBSD 시스템
ru: WINE и система FreeBSD

source: Installing WINE on a FreeBSD system will entail a few different components:
ko: FreeBSD 시스템에 WINE을 설치하려면 몇 가지 다른 구성 요소가 필요합니다:
ru: Установка WINE в системе FreeBSD включает несколько различных компонентов:

source: FreeBSD applications for tasks such as running the Windows(R) executables, configuring the WINE sub-system, or compiling programs with WINE support.
ko: Windows(R) 실행 파일 실행하거나, WINE의 하위 시스템을 구성하고, WINE을 지원하기 위한 프로그램을 컴파일하는 FreeBSD 애플리케이션.
ru: Приложения FreeBSD для таких задач, как запуск исполняемых файлов Windows(R), настройка подсистемы WINE или компиляция программ с поддержкой WINE.

source: A large number of libraries that implement the core functions of Windows(R) (for example [.filename]#/lib/wine/api-ms-core-memory-l1-1-1.dll.so#, which is part of the aforementioned memory interface).
ko: Windows(R)의 핵심 기능을 구현하는 수많은 라이브러리 (예: 앞서 언급한 메모리 인터페이스 [.filename]#/lib/wine/api-ms-core-memory-l1-1-1.dll.so#의 일부).
ru: Большое количество библиотек, реализующих основные функции Windows(R) (например, [.filename]#/lib/wine/api-ms-core-memory-l1-1-1.dll.so#, которая является частью упомянутого интерфейса памяти).

source: A number of Windows(R) executables, which are (or mimic) common utilities (such as [.filename]#/lib/wine/notepad.exe.so#, which provides the standard Windows(R) text editor).
ko: 일반적인 유틸리티(예: 표준 Windows(R) 텍스트 편집기 [.파일명]#/lib/wine/notepad.exe.so# )를 모방한 다수의 Windows(R) 실행 파일.
ru: Ряд исполняемых файлов Windows(R), которые являются (или имитируют) распространённые утилиты (например, [.filename]#/lib/wine/notepad.exe.so#, предоставляющий стандартный текстовый редактор Windows(R)).

source: Additional Windows(R) assets, in particular fonts (like the Tahoma font, which is stored in [.filename]#share/wine/fonts/tahoma.ttf# in the install root).
ko: 추가적인 Windows(R) 자원, 특히 글꼴(예: 설치 루트의 [.filename]#share/wine/fonts/tahoma.ttf#에 저장된 타호마 글꼴).
ru: Дополнительные ресурсы Windows(R), в частности шрифты (например, шрифт Tahoma, который хранится в [.filename]#share/wine/fonts/tahoma.ttf# в корневой директории установки).

source: Graphical Versus Text Mode/Terminal Programs in WINE
ko: WINE에서 그래픽 모드/단말 대 텍스트 모드/단말 프로그램
ru: Графические и текстовые программы/терминальные программы в WINE

source: As an operating system where terminal utilities are "first-class citizens," it is natural to assume that WINE will contain extensive support for text-mode program. However, the majority of applications for Windows(R), especially the most popular ones, are designed with a graphical user interface (GUI) in mind. Therefore, WINE's utilities are designed by default to launch graphical programs.
ko: 터미널 유틸리티가 “최고”인 운영 체제를 사용하는 곳에선 WINE역시 텍스트 모드 프로그램에 대한 광범위한 지원을 포함할 것이라고 생각할 수 있습니다. 그러나 Windows(R)용 응용 프로그램들 대부분, 특히 가장 인기있는 응용 프로그램은 그래픽 사용자 인터페이스(GUI)를 염두에 두고 설계되었습니다. 따라서 WINE의 유틸리티는 기본적으로 그래픽 프로그램을 실행하도록 설계되어 있습니다.
ru: Как операционная система, где терминальные утилиты являются «приложениями первого класса», естественно предположить, что WINE будет иметь обширную поддержку текстовых программ. Однако большинство приложений для Windows(R), особенно наиболее популярные, разработаны с расчётом на графический интерфейс пользователя (GUI). Поэтому утилиты WINE по умолчанию настроены на запуск графических программ.

source: However, there are three methods available to run these so-called Console User Interface (CUI) programs:
ko: 하지만 콘솔 사용자 인터페이스(CUI) 프로그램을 실행하는 데 사용할 수 있는 세 가지 방법이 있습니다:
ru: Однако доступны три метода для запуска этих так называемых программ с интерфейсом пользователя в консоли (Console User Interface, CUI):

source: The _Bare Streams_ approach will display the output directly to standard output.
ko: _Bare Streams_ 방식은 출력을 표준 출력으로 직접 표시합니다.
ru: Подход _Bare Streams_ будет выводить данные напрямую в стандартный вывод.

source: The _wineconsole_ utility can be used with either the _user_ or _curses_ backed to utilize some of the enhancements the WINE system provides for CUI applications.
ko: _wineconsole_유틸리티는 _user_ 또는 _curses_와 함께 사용하여 WINE 시스템이 CUI 애플리케이션에 제공하는 몇 가지 향상된 기능을 활용할 수 있습니다.

source: These approaches are described in greater detail on the https://wiki.winehq.org/Wine_User%27s_Guide#Text_mode_programs_.28CUI:_Console_User_Interface.29[WINE Wiki].
ko: 이에대한 방식은 https://wiki.winehq.org/Wine_User%27s_Guide#Text_mode_programs_.28CUI:_Console_User_Interface.29[WINE Wiki]에 자세히 설명되어 있습니다.
ru: Эти методы подробно описаны на https://wiki.winehq.org/Wine_User%27s_Guide#Text_mode_programs_.28CUI:_Console_User_Interface.29[вики WINE].

source: WINE Derivative Projects
ko: 와인 파생 프로젝트
ru: Производные проекты WINE

source: WINE itself is a mature open source project, so it is little surprise it is used as the foundation of more complex solutions.
ko: WINE 자체는 성숙한 오픈 소스 프로젝트이므로 더 복잡한 솔루션의 기초로 사용되는 것은 놀라운 일이 아닙니다.
ru: WINE сам по себе является зрелым проектом с открытым исходным кодом, поэтому неудивительно, что он используется в качестве основы для более сложных решений.

source: Commercial WINE Implementations
ko: 상업용 WINE 구현
ru: Коммерческие реализации WINE

source: A number of companies have taken WINE and made it a core of their own, proprietary products (WINE's LGPL license permits this). Two of the most famous of these are as follows:
ko: 많은 회사에서 WINE을 자사 독점 제품의 핵심으로 삼고 있습니다(WINE의 LGPL 라이선스는 이를 허용합니다). 그 중 가장 유명한 두 가지는 다음과 같습니다:
ru: Некоторые компании взяли WINE и сделали его основой своих собственных проприетарных продуктов (лицензия LGPL WINE позволяет это). Два самых известных из них следующие:

source: Codeweavers CrossOver
ko: 코드위버 크로스오버(Codeweavers CrossOver)

source: This solution provides a simplified "one-click" installation of WINE, which contains additional enhancements and optimizations (although the company contributes many of these back upstream to the WINE project). One area of focus for Codeweavers is to make the most popular applications install and run smoothly.
ko: 이 솔루션은 추가 개선 사항과 최적화가 포함된 WINE의 간편한 “원클릭” 설치를 제공합니다(이 회사는 이러한 기능 중 상당수를 WINE 프로젝트에 다시 기여하고 있습니다). 코드위버가 집중하고 있는 영역은 가장 인기 있는 애플리케이션을 원활하게 설치 및 실행하는 것입니다.
ru: Это решение предлагает упрощённую установку WINE "в один клик", включающую дополнительные улучшения и оптимизации (хотя компания вносит многие из них обратно в основной проект WINE). Codeweavers сосредоточены на том, чтобы популярные приложения легко устанавливались и работали без проблем.

source: While the company once produced a native FreeBSD version of their CrossOver solution, it appears to have long been abandoned. While some resources (such as a https://www.codeweavers.com/compatibility/crossover/forum/freebsd[dedicated forum]) are still present, they also have seen no activity for some time.
ko: 한때 이 회사는 기본 FreeBSD 버전의 크로스오버 솔루션을 생산한 적이 있지만, 오래 전에 중단된 것으로 보입니다. https://www.codeweavers.com/compatibility/crossover/forum/freebsd[dedicated forum]과 같은 일부 리소스는 여전히 존재하지만, 이 역시 한동안 활동이 없었습니다.
ru: Хотя компания когда-то выпускала нативную версию своего решения CrossOver для FreeBSD, похоже, что она давно заброшена. Хотя некоторые ресурсы (например, https://www.codeweavers.com/compatibility/crossover/forum/freebsd[выделенный форум]) всё ещё доступны, на них также давно не наблюдается активности.

source: Steam Proton
ko: 스팀 프로톤(Steam Proton)

source: Gaming company Steam also uses WINE to enable Windows(R) games to install and run on other systems. it is primary target is Linux-based systems, though some support exists for macOS as well.
ko: 게임 회사인 Steam도 WINE을 사용하여 다른 시스템에서 Windows(R) 게임을 설치하고 실행할 수 있도록 합니다. 주요 대상은 Linux 기반 시스템이지만 macOS에 대한 일부 지원도 있습니다.
ru: Игровая компания Steam также использует WINE, чтобы позволить играм для Windows(R) устанавливаться и запускаться на других системах. Основной целью являются системы на базе Linux, но также существует некоторая поддержка macOS.

source: While Steam does not offer a native FreeBSD client,there are several options for using the Linux(R) client using FreeBSD's Linux Compatibility Layer.
ko: Steam은 기본 FreeBSD 클라이언트를 제공하지 않지만, FreeBSD의 Linux 호환성 계층을 사용하여 Linux(R) 클라이언트를 사용할 수 있는 몇 가지 옵션이 있습니다.

source: WINE Companion Programs
ko: WINE 컴패니언 프로그램
ru: Сопутствующие программы WINE

source: In addition to proprietary offerings, other projects have released applications designed to work in tandem with the standard, open source version of WINE. The goals for these can range from making installation easier to offering easy ways to get popular software installed.
ko: 독점 제품 외에도 다른 프로젝트에서는 표준 오픈 소스 버전의 WINE과 함께 작동하도록 설계된 애플리케이션을 출시했습니다. 이러한 애플리케이션의 목표는 WINE의 설치를 더 쉽게 만드는 것부터 인기 있는 소프트웨어를 쉽게 설치할 수 있는 방법을 제공하는 것까지 다양합니다.
ru: В дополнение к проприетарным решениям, другие проекты выпустили приложения, предназначенные для работы в связке со стандартной, открытой версией WINE. Их цели могут варьироваться от упрощения установки до предоставления удобных способов установки популярного программного обеспечения.

source: These solutions are covered in greater detail in the later section on <<wine-management-guis,GUI frontends>>, and include the following:
ko: 이러한 솔루션은 <<wine-management-guis,GUI frontends>>의 뒷부분에서 더 자세히 다루며 다음 내용을 포함합니다:

source: Alternatives to WINE
ko: WINE의 대안
ru: Альтернативы WINE

source: For FreeBSD users, some alternatives to using WINE are as follows:
ko: FreeBSD 사용자의 경우, WINE을 대신할 수 있는 몇 가지 대안은 다음과 같습니다:
ru: Для пользователей FreeBSD существуют следующие альтернативы использованию WINE:

source: Dual-Booting: A straightforward option is to run desired Windows(R) applications natively on that OS. This of course means exiting FreeBSD in order to boot Windows(R), so this method is not feasible if access to programs in both systems is required simultaneously.
ko: 듀얼 부팅: 확실하고 간단한 방법은 원하는 Windows(R) 애플리케이션을 해당 OS에서 실행하는 것입니다. 물론 이 방법은 Windows(R)를 부팅하기 위해 FreeBSD를 종료해야 하므로 두 시스템의 프로그램에 동시에 액세스해야 하는 경우 사용할 수 없습니다.
ru: Двойная загрузка: Простой вариант — запускать нужные приложения Windows(R) нативно в этой ОС. Конечно, это означает выход из FreeBSD для загрузки Windows(R), поэтому такой метод не подходит, если требуется одновременный доступ к программам в обеих системах.

source: Virtual Machines: Virtual Machines (VMs), as mentioned earlier in this chapter, are software processes that emulate full sets of hardware, on which additional operating systems (including Windows(R)) can be installed and run. Modern tools make VMs easy to create and manage, but this method comes at a cost. A good portion of the host systems resources must be allocated to each VM, and those resources cannot be reclaimed by the host as long as the VM is running. A few examples of VM managers include the open source solutions qemu, bhyve, and VirtualBox. See the chapter on <<virtualization,Virtualization>> for more detail.
ko: 가상 머신: 이 장의 앞부분에서 언급한 가상 머신(VM)은 전체 하드웨어 세트를 에뮬레이트하는 소프트웨어 프로세스로, 추가 운영 체제(Windows(R) 포함)를 설치 및 실행할 수 있습니다. 최신 툴을 사용하면 VM을 쉽게 생성하고 관리할 수 있지만 이 방법에는 대가가 따릅니다. 호스트 시스템 리소스의 상당 부분을 각 VM에 할당해야 하며, VM이 실행되는 동안에는 호스트가 해당 리소스를 회수할 수 없습니다. VM 소프트웨어의 몇 가지 예로는 오픈 소스 솔루션인 qemu, bhyve 및 VirtualBox가 있습니다. 자세한 내용은 <<virtualization,Virtualization>> 챕터를 참조하세요.

source: Remote Access: Like many other UNIX(R)-like systems, FreeBSD can run a variety of applications enabling users to remotely access Windows(R) computers and use their programs or data. In addtion to clients such as xrdp that connect to the standard Windows(R) Remote Desktop Protocol, other open source standards such as vnc can also be used (provided a compatible server is present on the other side).
ko: 원격 액세스: 다른 많은 UNIX(R)-like 시스템과 마찬가지로, FreeBSD는 다양한 애플리케이션을 실행할 수 있어 사용자가 Windows(R) 컴퓨터에 원격으로 접속하여 프로그램이나 데이터를 사용할 수 있습니다. 표준 Windows(R) 원격 데스크톱 프로토콜에 연결되는 xrdp와 같은 클라이언트 외에도 vnc와 같은 다른 오픈 소스 표준도 사용할 수 있습니다(상대방에 호환되는 서버가 있는 경우).

source: Installing WINE on FreeBSD
ko: FreeBSD에 WINE 설치하기
ru: Установка WINE на FreeBSD

source: WINE can be installed via the pkg tool, or by compiling the port(s).
ko: WINE은 pkg 도구를 통해 설치하거나 포트를 컴파일하여 설치할 수 있습니다.
ru: WINE можно установить с помощью утилиты pkg или скомпилировав порт(ы).

source: WINE Prerequistes
ko: WINE의 요구사항
ru: Предварительные требования для WINE

source: Before installing WINE itself, it is useful to have the following pre-requisites installed.
ko: WINE 자체를 설치하기 전에 다음 사전 요구 사항을 설치하는 것이 좋습니다.
ru: Прежде чем устанавливать WINE, рекомендуется установить следующие программы.

source: A GUI
ko: GUI
ru: Графический пользовательский интерфейс

source: Most Windows(R) programs are expecting to have a graphical user interface available. If WINE is installed without one present, its dependencies will include the Wayland compositor, and so a GUI will be installed along with WINE. But it is useful to have the GUI of choice installed, configured, and working correctly before installing WINE.
ko: 대부분의 Windows(R) 프로그램은 그래픽 사용자 인터페이스를 사용합니다. 그래픽 사용자 인터페이스가 설치되어 있지 않은 상태에서 WINE을 설치하면 종속 요소에 Wayland 컴포지터가 포함되므로 GUI가 WINE과 함께 설치됩니다. 그러나 WINE을 설치하기 전에 먼저 원하는 GUI를 설치, 구성 및 올바르게 작동하도록 하는 것이 도움이 됩니다.
ru: Большинство программ Windows(R) ожидают наличия графического пользовательского интерфейса. Если WINE устанавливается без него, его зависимости будут включать композитор Wayland, и тогда графический интерфейс будет установлен вместе с WINE. Однако полезно установить, настроить и проверить работу предпочитаемого графического интерфейса до установки WINE.
