Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wine/_index.po
Languages: ko, ru

source: It may, depending on the application being run. As mentioned in the section describing `winecfg`, some built-in WINE DLLs and other libraries can be overridden by providing a path to an alternate version. Provided the Windows(R) partition or drive is mounted to the FreeBSD system and accessible to the user, configuring some of these overrides will use native Windows(R) libraries and may decrease the chance of unexpected behavior.
ko: 실행 중인 애플리케이션에 따라 다를 수 있습니다. ‘winecfg’를 설명하는 섹션에서 언급했듯이, 일부 내장 WINE DLL 및 기타 라이브러리는 대체 버전에 대한 경로를 제공하여 재정의할 수 있습니다. Windows(R) 파티션 또는 드라이브가 FreeBSD 시스템에 마운트되어 있고 사용자가 액세스할 수 있는 경우, 이러한 재정의 중 일부를 구성하면 기본 Windows(R) 라이브러리를 사용하므로 예기치 않은 동작이 발생할 가능성을 줄일 수 있습니다.
ru: В зависимости от запускаемого приложения это возможно. Как упоминалось в разделе, описывающем `winecfg`, некоторые встроенные DLL WINE и другие библиотеки могут быть заменены указанием пути к альтернативной версии. При условии, что раздел или диск Windows(R) подключен к системе FreeBSD и доступен пользователю, настройка некоторых из этих переопределений будет использовать родные библиотеки Windows(R), что может снизить вероятность неожиданного поведения.

source: Application-Specific
ko: 특정 애플리케이션에 대한 내용
ru: Зависимые от программы

source: Where is the Best Place to see if Application X Works on WINE?
ko: 애플리케이션 X가 WINE에서 작동하는지 확인하기 가장 좋은 곳은 어디인가요?
ru: Где лучше всего проверить, работает ли приложение X в WINE?

source: The first step in determining compatibility should be the https://appdb.winehq.org/[WINE AppDB]. This is a compilation of reports of programs working (or not) on all supported platforms, although (as previously mentioned), solutions for one platform are often applicable to others.
ko: 호환성을 결정하는 첫 번째 단계는 https://appdb.winehq.org/[WINE AppDB]입니다. 이는 지원되는 모든 플랫폼에서 작동하는(또는 작동하지 않는) 프로그램에 대한 보고서의 모음이지만, 앞서 언급했듯이 한 플랫폼에 대한 솔루션이 다른 플랫폼에도 적용될 수 있는 경우가 많습니다.
ru: Первым шагом в определении совместимости должен быть https://appdb.winehq.org/[WINE AppDB]. Это сборник отчетов о работе (или неработоспособности) программ на всех поддерживаемых платформах, хотя (как упоминалось ранее) решения для одной платформы часто применимы и к другим.

source: Is There Anything That Will Help Games Run Better?
ko: 게임 실행을 개선하는 데 도움이 되는 방법이 있나요?
ru: Есть ли что-то, что поможет играм работать лучше?

source: Perhaps. Many Windows(R) games rely on DirectX, a proprietary Microsoft graphics layer. However there are projects in the open source community attempting to implement support for this technology.
ko: 그럴지도 모르죠. 많은 Windows(R) 게임은 Microsoft의 독점 그래픽 레이어인 DirectX에 의존합니다. 그러나 오픈 소스 커뮤니티에는 이 기술을 지원하려는 프로젝트가 있습니다.
ru: Возможно. Многие игры для Windows(R) зависят от DirectX, проприетарного графического слоя Microsoft. Однако в сообществе открытого исходного кода существуют проекты, направленные на реализацию поддержки этой технологии.

source: The _dxvk_ project, which is an attempt to implement DirectX using the FreeBSD-compatible Vulkan graphics sub-system, is one such. Although its primary target is WINE on Linux, https://forums.freebsd.org/threads/what-about-gaming-on-freebsd.723/page-9[some FreeBSD users report] compiling and using dxvk.
ko: FreeBSD와 호환되는 벌칸 그래픽 하위 시스템을 사용하여 DirectX를 구현하려는 시도인 _dxvk_ 프로젝트가 그 중 하나입니다. 이 프로젝트의 주요 대상은 Linux의 WINE이지만, https://forums.freebsd.org/threads/what-about-gaming-on-freebsd.723/page-9[일부 FreeBSD 사용자가 보고한 바에 따르면] dxvk를 컴파일하여 사용할 수 있습니다.
ru: Проект _dxvk_, представляющий собой попытку реализации DirectX с использованием совместимой с FreeBSD графической подсистемы Vulkan, является одним из таких. Хотя его основная цель — WINE на Linux, https://forums.freebsd.org/threads/what-about-gaming-on-freebsd.723/page-9[некоторые пользователи FreeBSD сообщают] о компиляции и использовании dxvk.

source: In addition, work is under way on a https://www.freshports.org/emulators/wine-proton/[wine-proton port]. This will bring the work of Valve, developer of the Steam gaming platform, to FreeBSD. Proton is a distribution of WINE designed to allow many Windows(R) games to run on other operating systems with minimal setup.
ko: 또한 https://www.freshports.org/emulators/wine-proton/[wine-proton port]에 대한 작업도 진행 중입니다. 이 포트는 Steam 게임 플랫폼 개발사인 Valve의 작업을 FreeBSD로 가져올 것입니다. Proton은 최소한의 설정으로 다른 운영 체제에서 많은 Windows(R) 게임을 실행할 수 있도록 설계된 와인 배포판입니다.
ru: В дополнение, ведётся работа над портом https://www.freshports.org/emulators/wine-proton/[wine-proton]. Это позволит использовать наработки Valve, разработчика игровой платформы Steam, в FreeBSD. Proton — это дистрибутив WINE, предназначенный для запуска многих игр под Windows(R) на других операционных системах с минимальными настройками.

source: Is There Anywhere FreeBSD WINE Users Gather to Exchange Tips and Tricks?
ko: FreeBSD 와인 사용자들이 모여서 팁과 요령을 교환할 수 있는 곳이 있나요?
ru: Есть ли место, где пользователи FreeBSD WINE собираются для обмена советами и хитростями?

source: There are plenty of places FreeBSD users discuss issues related to WINE that can be searched for solutions:
ko: FreeBSD 사용자들이 WINE과 관련된 문제를 논의하고 해결책을 찾을 수 있는 많은 장소가 있습니다:
ru: Существует множество мест, где пользователи FreeBSD обсуждают вопросы, связанные с WINE, и где можно поискать решения:

source: https://forums.freebsd.org/[The FreeBSD forums], particularly the _Installation and Maintenance of Ports or Packages_ or _Emulation and virtualization_ forums.
ko: https://forums.freebsd.org/[FreeBSD 포럼], 특히 _Installation and Maintenance of Ports or Packages_ 또는 _Emulation and virtualization_ 포럼을 참조하세요.
ru: https://forums.freebsd.org/[Форумы FreeBSD], в частности разделы _Установка и обслуживание портов или пакетов_ и _Эмуляция и виртуализация_.

source: https://wiki.freebsd.org/IRC/Channels[FreeBSD IRC channels] including #freebsd (for general support), #freebsd-games, and others.
ko: #freebsd (for 일반적 지원), #freebsd-games 등을 포함한 https://wiki.freebsd.org/IRC/Channels[FreeBSD IRC channels].
ru: https://wiki.freebsd.org/IRC/Channels[Каналы FreeBSD в IRC], включая #freebsd (для общих вопросов поддержки), #freebsd-games и другие.

source: https://discord.gg/2CCuhCt[The BSD World Discord server's] channels including _bsd-desktop_, _bsd-gaming_, _bsd-wine_, and others.
ko: _bsd-desktop_, _bsd-gaming_, _bsd-wine_, 그리고 기타를 포함한 https://discord.gg/2CCuhCt[The BSD World Discord server’s] 채널.
ru: https://discord.gg/2CCuhCt[Discord-сервер BSD World] с каналами, такими как _bsd-desktop_, _bsd-gaming_, _bsd-wine_ и другими.

source: Other OS Resources
ko: 기타 OS 리소스
ru: Ресурсы других ОС

source: There are a number of resources focused on other operating systems that may be useful for FreeBSD users:
ko: FreeBSD 사용자에게 유용할 수 있는 다른 운영 체제에 초점을 맞춘 여러 리소스가 있습니다:
ru: Существует множество ресурсов, посвящённых другим операционным системам, которые могут быть полезны пользователям FreeBSD:

source: https://wiki.winehq.org/[The WINE Wiki] has a wealth of information on using WINE, much of which is applicable across many of WINE's supported operating systems.
ko: https://wiki.winehq.org/[WINE WIKI]에는 와인 사용에 대한 풍부한 정보가 있으며, 이 중 상당수는 와인에서 지원되는 많은 운영 체제에 적용 가능합니다.
ru: https://wiki.winehq.org/[Вики WINE] содержит множество информации об использовании WINE, большая часть которой применима во многих поддерживаемых WINE операционных системах.

source: Similarly, the documentation available from other OS projects can also be of good value. https://wiki.archlinux.org/index.php/wine[The WINE page] on the Arch Linux Wiki is a particularly good example, although some of the "Third-party applications" (i.e., "companion applications") are obviously not available on FreeBSD.
ko: 마찬가지로, 다른 OS 프로젝트에서 제공하는 문서도 좋은 자료가 될 수 있습니다. https://wiki.archlinux.org/index.php/wine[아치 리눅스 위키의 와인 페이지]는 특히 좋은 예이지만, 일부 “타사 응용 프로그램”(즉, “컴패니언 응용 프로그램”)은 FreeBSD에서 사용할 수 없습니다.

source: Finally, Codeweavers (a developer of a commercial version of WINE) is an active upstream contributor. Oftentimes answers to questions in https://www.codeweavers.com/support/forums[their support forum] can be of aid in troubleshooting problems with the open source version of WINE.
ko: 마지막으로, Codeweavers(상용 버전의 WINE 개발사)는 활발한 업스트림 기여자입니다. 종종 https://www.codeweavers.com/support/forums[지원 포럼]의 질문에 대한 답변이 오픈 소스 버전의 WINE 문제를 해결하는 데 도움이 될 수 있습니다.
ru: Наконец, Codeweavers (разработчик коммерческой версии WINE) активно участвует в разработке основной версии. Часто ответы на вопросы в https://www.codeweavers.com/support/forums[их форуме поддержки] могут помочь в решении проблем с открытой версией WINE.

source: Chapter 13. WINE
ru: Глава 13. WINE

source: https://www.winehq.org/[WINE], which stands for Wine Is Not an Emulator, is technically a software translation layer. It allows installing and running software written for Windows(R) on FreeBSD (and other) systems.
ru: https://www.winehq.org/[WINE], что расшифровывается как Wine Is Not an Emulator (WINE — это не эмулятор), технически является программным уровнем трансляции. Он позволяет устанавливать и запускать программное обеспечение, написанное для Windows(R), в системах FreeBSD (и других).

source: However, it is not an emulator in the traditional sense. Many of these solutions operate by constructing an entirely separate computer using software processes in place of hardware. Virtualization (such as that provided by the package:emulators/qemu[] port) operates in this way. One of the benefits of this approach is the ability to install a full version of the OS in question to the emulator. It means that the environment will not look any different to applications than a real machine, and chances are good that everything will work on it. The downside to this approach is the fact that software acting as hardware is inherently slower than actual hardware. The computer built in software (called the _guest_) requires resources from the real machine (the _host_), and holds on to those resources for as long as it is running.
ru: Однако это не эмулятор в традиционном смысле. Многие из этих решений работают, создавая полностью отдельный компьютер с использованием программных процессов вместо аппаратного обеспечения. Виртуализация (например, предоставляемая портом `package:emulators/qemu[]`) работает именно так. Одно из преимуществ этого подхода — возможность установить полную версию соответствующей ОС в эмулятор. Это означает, что среда для приложений не будет отличаться от реальной машины, и высока вероятность, что всё будет работать. Недостаток этого подхода заключается в том, что программное обеспечение, имитирующее аппаратное, по своей природе медленнее реального оборудования. Компьютер, созданный программно (называемый _гостевым_), требует ресурсов от реальной машины (называемой _хостовой_) и удерживает эти ресурсы всё время своей работы.

source: How WINE operates, and how it is different from other alternatives like virtualization.
ru: Как работает WINE и чем он отличается от других альтернатив, таких как виртуализация.

source: Common tips and solutions for using WINE on FreeBSD.
ru: Общие советы и решения по использованию WINE в FreeBSD.

source: As mentioned in the crossref:wine[wine-synopsis,Synopsis] for this chapter, WINE is a compatibility layer that allows Windows(R) applications to run on other operating systems. In theory, it means these programs should run on systems like FreeBSD, macOS, and Android.
ru: Как упоминалось в crossref:wine[wine-synopsis,Обзоре] этой главы, WINE — это уровень совместимости, который позволяет приложениям Windows(R) работать в других операционных системах. Теоретически это означает, что такие программы должны работать в системах, подобных FreeBSD, macOS и Android.

source: The _wineconsole_ utility can be used with either the _user_ or _curses_ backend to utilize some of the enhancements the WINE system provides for CUI applications.
ru: Утилита _wineconsole_ может использоваться с бэкендом _user_ или _curses_ для использования некоторых улучшений, которые система WINE предоставляет для CUI-приложений.

source: While Steam does not offer a native FreeBSD client, there are several options for using the Linux(R) client using FreeBSD's Linux Compatibility Layer.
ru: Хотя Steam не предлагает нативный клиент для FreeBSD, существует несколько вариантов использования клиента для Linux(R) с помощью слоя совместимости с Linux в FreeBSD.

source: These solutions are covered in greater detail in the later section on crossref:wine[wine-management-guis,GUI frontends], and include the following:
ru: Эти решения подробно рассмотрены в разделе crossref:wine[wine-management-guis,Графические интерфейсы управления] и включают следующее:

source: Virtual Machines: Virtual Machines (VMs), as mentioned earlier in this chapter, are software processes that emulate full sets of hardware, on which additional operating systems (including Windows(R)) can be installed and run. Modern tools make VMs easy to create and manage, but this method comes at a cost. A good portion of the host systems resources must be allocated to each VM, and those resources cannot be reclaimed by the host as long as the VM is running. A few examples of VM managers include the open source solutions qemu, bhyve, and VirtualBox. See the chapter on crossref:virtualization[virtualization,Virtualization] for more detail.
ru: Виртуальные машины: Виртуальные машины (ВМ), как упоминалось ранее в этой главе, представляют собой программные процессы, эмулирующие полные наборы аппаратного обеспечения, на которых могут быть установлены и запущены дополнительные операционные системы (включая Windows(R)). Современные инструменты упрощают создание и управление ВМ, но этот метод имеет свою цену. Значительная часть ресурсов хост-системы должна выделяться каждой ВМ, и эти ресурсы не могут быть возвращены хост-системой, пока ВМ работает. Некоторые примеры менеджеров ВМ включают открытые решения qemu, bhyve и VirtualBox. Подробнее см. в главе crossref:virtualization[virtualization,Вирутализация].

source: Remote Access: Like many other UNIX(R)-like systems, FreeBSD can run a variety of applications enabling users to remotely access Windows(R) computers and use their programs or data. In addition to clients such as xrdp that connect to the standard Windows(R) Remote Desktop Protocol, other open source standards such as vnc can also be used (provided a compatible server is present on the other side).
ru: Удаленный доступ: Как и многие другие UNIX(R)-подобные системы, FreeBSD может запускать различные приложения, позволяющие пользователям удаленно подключаться к компьютерам с Windows(R) и использовать их программы или данные. Помимо клиентов, таких как xrdp, которые подключаются к стандартному протоколу Windows(R) Remote Desktop, также могут использоваться другие открытые стандарты, например, vnc (при условии наличия совместимого сервера на другой стороне).

source: The `winetricks` tool is a cross-platform, general purpose helper program for WINE. It is not developed by the WINE project proper, but rather maintained on https://github.com/Winetricks/winetricks[GitHub] by a group of contributors. It contains some automated "recipes" for getting common applications to work on WINE, both by optimizing the settings as well as acquiring some DLL libraries automatically.
ru: Инструмент `winetricks` — это кроссплатформенная вспомогательная программа общего назначения для WINE. Он разрабатывается не самим проектом WINE, а поддерживается группой участников на https://github.com/Winetricks/winetricks[GitHub]. `winetricks` содержит автоматизированные "рецепты" для запуска распространённых приложений в WINE, включая оптимизацию настроек и автоматическую загрузку некоторых DLL-библиотек.

source: https://codeberg.org/Alexander88207/Mizutamari[Mizutamari] is an application similar to `winetricks`, although it was inspired by the https://lutris.net/[Lutris] gaming system for Linux. But while it is focused on games, there are also non-gaming applications available for install through Mizutamari.
ru: https://codeberg.org/Alexander88207/Mizutamari[Mizutamari] — это приложение, похожее на `winetricks`, хотя вдохновлено игровой системой https://lutris.net/[Lutris] для Linux. Однако, в отличие от неё, Mizutamari ориентировано не только на игры: через него также можно установить и приложения неигрового характера.

source: Installing Mizutamari
ru: Установка Mizutamari

source: To install Mizutamari's binary package, issue the following command:
ru: Для установки бинарного пакета Mizutamari выполните следующую команду:

source: Mizutamari is available in the FreeBSD Ports system. However, instead of looking in the _emulators_ section of Ports or binary packages, look for it in the _games_ section.
ru: Mizutamari доступен в системе портов FreeBSD. Однако вместо поиска в разделе _emulators_ портов или двоичных пакетов ищите его в разделе _games_.

source: Using Mizutamari
ru: Использование Mizutamari

source: Mizutamari's usage is quite similar to that of `winetricks`. When using it for the first time, launch it from the command line (or a desktop environment runner applet) with:
ru: Использование Mizutamari очень похоже на использование `winetricks`. При первом запуске выполните его из командной строки (или с помощью апплета запуска окружения рабочего стола) командой:

source: Depending on the setup of the FreeBSD machine, Mizutamari may display a message urging the install of native graphics drivers.
ru: В зависимости от настройки машины FreeBSD, Mizutamari может отображать сообщение с рекомендацией установить родные графические драйверы.

source: The application's window should then appear, which amounts to a "main menu" with all its options. Many of the items are the same as `winetricks`, although Mizutamari offers some additional, helpful options such as opening its data folder (_Open Mizutamari Folder_) or running a specified program (_Run a executable in prefix_).
ru: Затем должно появиться окно приложения, которое представляет собой «главное меню» со всеми его опциями. Многие пункты совпадают с `winetricks`, хотя Mizutamari предлагает некоторые дополнительные полезные опции, такие как открытие папки с данными (_Open Mizutamari Folder_) или запуск указанной программы (_Run a executable in prefix_).

source: To select one of Mizutamari's supported applications to install, select _Installation_, and click _OK_. This will display a list of applications Homura can install automatically. Select one, and click _OK_ to start the process.
ru: Чтобы выбрать одно из поддерживаемых приложений Mizutamari для установки, выберите _Установка_ и нажмите _OK_. Это отобразит список приложений, которые Homura может установить автоматически. Выберите нужное приложение и нажмите _OK_, чтобы начать процесс.

source: As a first step Mizutamari will download the selected program. A notification may appear in supported desktop environments.
ru: В качестве первого шага Mizutamari загрузит выбранную программу. В поддерживаемых рабочих средах может появиться уведомление.

source: Next, Mizutamari will install any prerequisites for the selected program. This may involve downloading and extracting a fair number of files, the details of which will show in dialogs.
ru: Затем Mizutamari установит все необходимые зависимости для выбранной программы. Это может включать загрузку и распаковку значительного количества файлов, подробности чего будут отображаться в диалоговых окнах.

source: The installation may end with a simple desktop notification or message in the terminal, depending on how Mizutamari was launched. But in either case Mizutamari should return to the main screen. To confirm the installation was successful, select _Launcher_, and click _OK_.
ru: Установка может завершиться простым уведомлением на рабочем столе или сообщением в терминале, в зависимости от того, как был запущен Mizutamari. Однако в любом случае Mizutamari должен вернуться на главный экран. Чтобы подтвердить успешность установки, выберите _Launcher_ и нажмите _OK_.

source: As shown in the section on WINE Configuration, WINE provides the ability to attach additional drives to a given prefix. In this way, applications can be installed to a common location, while each user will still have a prefix where individual settings may be kept (depending on the program). This is a good setup if there are relatively few applications to be shared between users, and they are programs that require few custom tweaks changes to the prefix in order to function.
ru: Как показано в разделе о настройке WINE, WINE предоставляет возможность подключения дополнительных дисков к заданному префиксу. Таким образом, приложения можно устанавливать в общее место, в то время как у каждого пользователя останется префикс, где могут храниться индивидуальные настройки (в зависимости от программы). Это хорошая конфигурация, если нужно использовать совместно между пользователями относительно немного приложений, и это программы, которые требуют минимальных изменений в префиксе для работы.

source: Similarly, the documentation available from other OS projects can also be of good value. https://wiki.archlinux.org/title/wine[The WINE page] on the Arch Linux Wiki is a particularly good example, although some of the "Third-party applications" (i.e., "companion applications") are obviously not available on FreeBSD.
ru: Аналогично, документация других проектов операционных систем также может быть полезной. https://wiki.archlinux.org/title/wine[Страница о WINE] в Arch Linux Wiki является особенно хорошим примером, хотя некоторые из «Сторонних приложений» (т.е. «вспомогательных приложений») очевидно недоступны в FreeBSD.
