Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wine/_index.po
Languages: ko, ru

source: However, it is wise to ensure that they do not access any of the same WINE prefixes. Each of these solutions applies workarounds and makes changes to the registries based on known workarounds to existing WINE issues in order to make a given application run smoothly. Allowing both `winetricks` and Homura to access the same prefix could lead to some of these being overwritten, with the result being some or all applications do not work as expected.
ko: 그러나 동일한 WINE 접두사에 액세스하지 않도록 하는 것이 현명합니다. 이러한 각 솔루션은 특정 애플리케이션을 원활하게 실행하기 위해 기존 WINE 문제에 대한 알려진 해결 방법을 기반으로 해결 방법을 적용하고 레지스트리를 변경합니다. `winetricks`과 호무라가 모두 동일한 접두사에 액세스할 수 있도록 허용하면 이 중 일부를 덮어쓰게 되어 결과적으로 일부 또는 모든 애플리케이션이 예상대로 작동하지 않을 수 있습니다.
ru: Однако разумно убедиться, что они не обращаются к одним и тем же префиксам WINE. Каждое из этих решений применяет обходные пути и вносит изменения в реестры на основе известных исправлений существующих проблем WINE, чтобы обеспечить бесперебойную работу конкретного приложения. Если разрешить и `winetricks`, и Homura доступ к одному и тому же префиксу, это может привести к перезаписи некоторых из этих изменений, в результате чего некоторые или все приложения не будут работать должным образом.

source: WINE in Multi-User FreeBSD Installations
ko: 다중 사용자 FreeBSD 환경에서 WINE 설치
ru: WINE в многопользовательских установках FreeBSD

source: Issues with Using a Common WINE Prefix
ko: 일반적인 WINE 접두사 사용 시 발생하는 문제
ru: Проблемы при использовании общего префикса WINE

source: Like most UNIX(R)-like operating systems, FreeBSD is designed for multiple users to be logged in and working at the same time. On the other hand, Windows(R) is multi-user in the sense that there can be multiple user accounts set up on one system. But the expectation is that only one will be using the physical machine (a desktop or laptop PC) at any given moment.
ko: 대부분의 UNIX(R)와 유사한 운영체제와 마찬가지로, FreeBSD는 여러 사용자가 동시에 로그인하여 작업할 수 있도록 설계되었습니다. 반면, Windows(R)는 하나의 시스템에 여러 사용자 계정을 설정할 수 있다는 점에서는 다중 사용자에 해당합니다. 그러나 특정 순간에는 단 한 명만 물리적 시스템(데스크톱 또는 노트북 PC)을 사용한다는 제한이 있습니다.
ru: Как и большинство UNIX(R)-подобных операционных систем, FreeBSD разработана для одновременной работы нескольких пользователей. С другой стороны, Windows(R) является многопользовательской в том смысле, что в системе может быть создано несколько учетных записей. Однако предполагается, что физический компьютер (настольный или портативный ПК) в любой момент времени будет использовать только один пользователь.

source: More recent consumer versions of Windows(R) have taken some steps to improve the OS in multi-user scenarios. But it is still largely structured around a single-user experience. Furthermore, the measures the WINE project has taken to create a compatible environment means, unlike FreeBSD applications (including WINE itself), it will resemble this single-user environment.
ko: 최신 소비자 버전의 Windows(R)는 다중 사용자 시나리오에서 OS를 개선하기 위해 몇 가지 조치를 취했습니다. 하지만 여전히 단일 사용자 환경을 중심으로 구성되어 있습니다. 또한, 호환 가능한 환경을 만들기 위해 WINE 프로젝트가 취한 조치는 (WINE 자체를 포함한), 다른 FreeBSD 애플리케이션과 달리 WINE의 동작은 이러한 단일 사용자 환경과 유사하다는 것을 의미합니다.
ru: Более новые несерверные версии Windows(R) предприняли некоторые шаги для улучшения ОС в сценариях с несколькими пользователями. Однако система по-прежнему в основном ориентирована на однопользовательскую работу. Более того, меры, принятые проектом WINE для создания совместимой среды, означают, что, в отличие от приложений FreeBSD (включая сам WINE), она будет напоминать эту однопользовательскую среду.

source: So it follows that each user will have to maintain their own set of configurations, which is potentially good. Yet it is advantageous to install applications, particularly large ones like office suites or games, only once. Two examples of reasons to do this are maintenance (software updates need only be applied once) and efficiency in storage (no duplicated files).
ko: 따라서 각 사용자는 자신만의 구성을 유지해야 하는데, 이는 잠재적으로 좋은 일입니다. 그러나 특히 오피스 제품군이나 게임과 같은 대용량 애플리케이션은 한 번만 설치하는 것이 유리합니다. 유지 관리(소프트웨어 업데이트는 한 번만 적용하면 됨)와 저장 공간 효율성(중복 파일 없음)이 두 가지 이유입니다.
ru: Следовательно, каждый пользователь должен будет поддерживать свой собственный набор конфигураций, что потенциально хорошо. Однако выгодно устанавливать приложения, особенно крупные, такие как офисные пакеты или игры, только один раз. Две причины для этого: обслуживание (обновления ПО нужно применять только один раз) и эффективность использования хранилища (отсутствие дублирования файлов).

source: There are two strategies to minimize the impact of multiple WINE users in the system.
ko: 시스템에서 여러 WINE 사용자가 미치는 영향을 최소화하기 위한 두 가지 전략이 있습니다.
ru: Существует две стратегии для минимизации влияния множества пользователей WINE в системе.

source: Installing Applications to a Common Drive
ko: 공용 드라이브에 응용 프로그램 설치
ru: Установка приложений на общий диск

source: As shown in the section on WINE Configuration, WINE provides the ability to attach additional drives to a given prefix. In this way, applications can be installed to a common location, while each user will still have an prefix where individual settings may be kept (depending on the program). This is a good setup if there are relatively few applications to be shared between users, and they are programs that require few custom tweaks changes to the prefix in order to function.
ko: WINE 구성 섹션에 나와 있는 것처럼, WINE은 주어진 접두사에 추가 드라이브를 연결할 수 있는 기능을 제공합니다. 이렇게 하면 애플리케이션을 공용 위치에 설치할 수 있지만, 각 사용자는 프로그램에 따라 개별 설정을 유지할 수 있는 접두사를 계속 갖게 됩니다. 이 설정은 사용자 간에 공유할 애플리케이션이 상대적으로 적고, 작동을 위해 접두사를 사용자 지정으로 변경할 필요가 거의 없는 프로그램인 경우에 유용합니다.

source: The steps to make install applications in this way are as follows:
ko: 이러한 방식으로 애플리케이션을 설치하는 단계는 다음과 같습니다:
ru: Необходимо сделать следующие шаги для установки приложений таким способом:

source: First, set up a shared location on the system where the files will be stored, such as [.filename]#/mnt/windows-drive_d/#. Creating new directories is described in the man:mkdir[1] manual page.
ko: 먼저 [.filename]#/mnt/windows-drive_d/#와 같이 파일을 저장할 공유 위치를 시스템에 설정합니다. 새 디렉터리를 만드는 방법은 man:mkdir[1] 매뉴얼 페이지에 설명되어 있습니다.
ru: Сначала настройте общее место в системе, где будут храниться файлы, например, [.filename]#/mnt/windows-drive_d/#. Создание новых каталогов описано в руководстве man:mkdir[1].

source: Next, set permissions for this new directory to allow only desired users to access it. One approach to this is to create a new group such as "windows," add the desired users to that group (see the sub-section on groups in the crossref:basics[users-groups,Users and Basic Account Management] section), and set to the permissions on the directory to `770` (the section on crossref:basics[permissions,Permissions] illustrates this process).
ko: 그런 다음, 원하는 사용자만 액세스할 수 있도록 이 새 디렉터리에 대한 권한을 설정합니다. 이를 위한 한 가지 방법은 ‘windows’와 같은 새 그룹을 만들고 원하는 사용자를 해당 그룹에 추가한 다음(crossref:basics[users-groups,Users and Basic Account Management] 섹션의 그룹에 대한 하위 섹션 참조) 디렉터리에 대한 권한을 `770`으로 설정하는 것입니다(crossref:basics[permissions,Permissions] 섹션에 이 프로세스가 설명되어 있습니다).
ru: Далее установите разрешения для этого нового каталога, чтобы разрешить доступ только нужным пользователям. Один из подходов — создать новую группу, например, "windows", добавить нужных пользователей в эту группу (см. подраздел о группах в разделе crossref:basics[users-groups,Пользователи и основы управления учетными записями]) и установить разрешения для каталога в `770` (раздел crossref:basics[permissions,Разрешения] описывает этот процесс).

source: Finally, add the location as a drive to the user's prefix using the `winecfg` as described in the above section on WINE Configuration in this chapter.
ko: 마지막으로, 이 장의 WINE 구성 섹션에서 설명한 대로 `winecfg`를 사용하여 사용자 접두사에 위치를 드라이브로 추가합니다.
ru: Наконец, добавьте выбранное расположение как диск в префикс пользователя с помощью `winecfg`, как описано в разделе выше о настройке WINE в этой главе.

source: Once complete, applications can be installed to this location, and subsequently run using the assigned drive letter (or the standard UNIX(R)-style directory path). However, as noted above, only one user should be running these applications (which may be accessing files within their installation directory) at the same time. Some applications may also exhibit unexpected behavior when run by a user who is not the owner, despite being a member of the group that should have full "read/write/execute" permissions for the entire directory.
ko: 설치가 완료되면 이 위치에 애플리케이션을 설치한 다음 할당된 드라이브 문자(또는 표준 UNIX(R) 스타일 디렉토리 경로)를 사용하여 실행할 수 있습니다. 그러나 위에서 언급했듯이 한 명의 사용자만 이러한 애플리케이션(설치 디렉터리 내의 파일에 액세스할 수 있음)을 실행해야 합니다. 일부 애플리케이션은 전체 디렉터리에 대한 전체 ‘읽기/쓰기/실행’ 권한이 있어야 하는 그룹의 구성원임에도 불구하고 소유자가 아닌 사용자가 실행하면 예기치 않은 동작이 나타날 수도 있습니다.
ru: По завершении приложения могут быть установлены в этом расположении и затем запущены с использованием назначенной буквы диска (или стандартного пути к каталогу в стиле UNIX(R)). Однако, как упоминалось выше, только один пользователь должен запускать эти приложения (которые могут обращаться к файлам в их каталоге установки) одновременно. Некоторые приложения также могут демонстрировать неожиданное поведение при запуске пользователем, который не является владельцем, несмотря на то что он входит в группу, которая должна иметь полные права "чтения/записи/исполнения" для всего каталога.

source: Using a Common Installation of WINE
ko: WINE의 공용 설치 사용하기
ru: Использование общей установки WINE

source: If, on the other hand, there are many applications to be shared, or they require specific tuning in order to work correctly, a different approach may be required. In this method, a completely separate user is created specifically for the purposes of storing the WINE prefix and all its installed applications. Individual users are then granted permission to run programs as this user using the man:sudo[8] command. The result is that these users can launch a WINE application as they normally would, only it will act as though launched by the newly-created user, and therefore use the centrally-maintained prefix containing both settings and programs. To accomplish this, take the following steps:
ko: 반면에 공유할 애플리케이션이 많거나 올바르게 작동하기 위해 특정 튜닝이 필요한 경우 다른 접근 방식이 필요할 수 있습니다. 이 방법에서는 WINE 접두사와 설치된 모든 애플리케이션을 저장하기 위한 목적으로 완전히 별도의 사용자가 생성됩니다. 그런 다음 개별 사용자에게 man:sudo[8] 명령을 사용하여 이 사용자로 프로그램을 실행할 수 있는 권한을 부여합니다. 그 결과 이러한 사용자는 평소와 같이 WINE 애플리케이션을 실행할 수 있지만 새로 생성된 사용자가 실행한 것처럼 동작하므로 설정과 프로그램이 모두 포함된 중앙에서 유지 관리되는 접두사를 사용할 수 있습니다. 이렇게 하려면 다음 단계를 수행합니다:
ru: С другой стороны, если требуется совместное использование множества приложений или они нуждаются в особой настройке для корректной работы, может потребоваться другой подход. В этом методе создается отдельный пользователь исключительно для хранения префикса WINE и всех установленных приложений. Затем отдельным пользователям предоставляется право запускать программы от имени этого пользователя с помощью команды man:sudo[8]. В результате эти пользователи могут запускать приложения WINE как обычно, но они будут работать так, как если бы их запустил вновь созданный пользователь, и, следовательно, использовать централизованно поддерживаемый префикс, содержащий настройки и программы. Для реализации этого выполните следующие действия:

source: Create a new user with the following command (as `root`), which will step through the required details:
ko: 다음 명령(`root`로)을 사용하여 새 사용자를 생성하면 필요한 세부 정보를 단계별로 안내합니다:
ru: Создайте нового пользователя следующей командой (от имени `root`), которая выполнит все необходимые шаги:

source: Enter the username (e.g., _windows_) and Full name ("Microsoft Windows"). Then accept the defaults for the remainder of the questions. Next, install the `sudo` utility using binary packages with the following:
ko: 사용자 이름(예: _windows_)과 전체 이름(“Microsoft Windows”)을 입력합니다. 그런 다음 나머지 질문에 대한 기본값을 수락합니다. 다음으로 바이너리 패키지를 사용하여 다음과 같이 `sudo` 유틸리티를 설치합니다:
ru: Введите имя пользователя (например, _windows_) и полное имя ("Microsoft Windows"). Затем примите значения по умолчанию для оставшихся вопросов. Далее установите утилиту `sudo` из бинарных пакетов с помощью следующей команды:

source: Once installed, edit [.filename]#/etc/sudoers# as follows:
ko: 설치가 되었으면 [.filename]#/etc/sudoers#를 다음과 같이 수정합니다:
ru: После установки отредактируйте файл [.filename]#/etc/sudoers# следующим образом:

source: The result of these changes is the users named in the _User_Alias_ section are permitted to run the programs listed in the _Cmnd Alias_ section using the resources listed in the _Defaults_ section (the current display) as if they were the user listed in the final line of the file. In other words, users designates as _WINDOWS_USERS_ can run the WINE and `winecfg` applications as user _windows_. As a bonus, the configuration here means they will not be required to enter the password for the _windows_ user.
ko: 이러한 변경의 결과로 _User_Alias_ 섹션에 지정된 사용자는 파일의 마지막 줄에 나열된 사용자처럼 _Defaults_ 섹션(현재 표시)에 나열된 리소스를 사용하여_Cmnd Alias_ 섹션에 나열된 프로그램을 실행하도록 허용됩니다. 즉, _WINDOWS_USERS_로 지정한 사용자는 사용자 _windows_로 WINE 및 `winecfg` 애플리케이션을 실행할 수 있습니다. 보너스로, 이 구성은 _windows_ 사용자의 암호를 입력할 필요가 없다는 것을 의미합니다.
ru: Результатом этих изменений является разрешение пользователям, указанным в разделе _User_Alias_, запускать программы, перечисленные в разделе _Cmnd Alias_, используя ресурсы, указанные в разделе _Defaults_ (текущий дисплей), как если бы они были пользователем, указанным в последней строке файла. Другими словами, пользователи, обозначенные как _WINDOWS_USERS_, могут запускать приложения WINE и `winecfg` от имени пользователя _windows_. В качестве бонуса данная конфигурация означает, что им не потребуется вводить пароль пользователя _windows_.

source: Next provide access to the display back to the _windows_ user, as whom the WINE programs will be running:
ko: 그런 다음 WINE 프로그램을 실행할 _windows_ 사용자에게 디스플레이에 대한 액세스 권한을 다시 부여합니다:
ru: Далее предоставьте доступ к дисплею пользователю _windows_, от имени которого будут запускаться программы WINE:

source: This should be added to the list of commands run either at login or when the default graphical environment starts. Once all the above are complete, a user configured as one of the `WINDOW_USERS` in [.filename]#sudoers# can run programs using the shared prefix with the following command:
ko: 로그인 시 또는 기본 그래픽 환경이 시작될 때 실행되는 명령 목록에 다음 명령을 추가해야 합니다. 위의 모든 작업이 완료되면 [.filename]#sudoers#에서 `WINDOW_USERS` 중 하나로 구성된 사용자는 다음 명령과 함께 공유 접두사를 사용하여 프로그램을 실행할 수 있습니다:
ru: Это следует добавить в список команд, выполняемых либо при входе в систему, либо при запуске графической среды по умолчанию. После завершения всех вышеуказанных действий пользователь, настроенный как один из `WINDOW_USERS` в [.filename]#sudoers#, может запускать программы с использованием общего префикса следующей командой:

source: it is worth noting that multiple users accessing this shared environment at the same time is still risky. However, consider also that the shared environment can itself contain multiple prefixes. In this way an administrator can create a tested and verified set of programs, each with its own prefix. At the same time, one user can play a game while another works with office programs without the need for redundant software installations.
ko: 이 방식을 사용해도 여러 사용자가 동시에 공유 환경에 액세스하는 것은 여전히 위험하다는 점에 유의할 필요가 있습니다. 그러나 공유 환경 자체에 여러 접두사가 포함될 수 있다는 점도 고려하세요. 이러한 방식으로 관리자는 각각 고유한 접두사를 사용하여 테스트되고 검증된 프로그램 집합을 만들 수 있습니다. 동시에 한 사용자가 게임을 플레이하는 동안 다른 사용자는 소프트웨어를 중복 설치할 필요 없이 오피스 프로그램을 사용할 수 있습니다.
ru: Стоит отметить, что одновременный доступ нескольких пользователей к этой общей среде всё ещё сопряжён с рисками. Однако также учтите, что сама общая среда может содержать несколько префиксов. Таким образом, администратор может создать протестированный и проверенный набор программ, каждая со своим префиксом. В то же время один пользователь может играть в игру, а другой — работать с офисными программами без необходимости избыточной установки программного обеспечения.

source: WINE on FreeBSD FAQ
ko: FreeBSD에서 WINE에 관한 FAQ
ru: Часто задаваемые вопросы о WINE на FreeBSD

source: The following section describes some frequently asked questions, tips/tricks, or common issues in running WINE on FreeBSD, along with their respective answers.
ko: 다음 섹션에서는 몇 가지 자주 묻는 질문, 팁/요령 또는 FreeBSD에서 와인을 실행할 때 흔히 발생하는 문제와 그에 대한 답변을 설명합니다.
ru: Следующий раздел описывает некоторые часто задаваемые вопросы, советы, хитрости или распространённые проблемы при запуске WINE в FreeBSD, а также соответствующие ответы на них.

source: Basic Installation and Usage
ko: 기본 설치와 사용
ru: Базовая установка и использование

source: How to Install 32-bit and 64-bit WINE on the Same System?
ko: 동일한 시스템에 32비트 및 64비트 WINE을 설치하는 방법은?
ru: Как установить 32-битный и 64-битный WINE в одной системе?

source: As described earlier in this section, the wine and i386-wine packages conflict with one another, and therefore cannot be installed on the same system in the normal way. However, multiple installs can be achieved using mechanisms like chroots/jails, or by building WINE from source (note this does _not_ mean building the port).
ko: 이 섹션의 앞부분에서 설명한 것처럼 와인 패키지와 i386-wine 패키지는 서로 충돌하므로 일반적인 방법으로는 동일한 시스템에 설치할 수 없습니다. 그러나 chroots/jails과 같은 메커니즘을 사용하거나 소스에서 WINE을 빌드하여 여러 번 설치할 수 있습니다(포트를 빌드하는 것을 의미하지는 않음에 유의하세요).
ru: Как упоминалось ранее в этом разделе, пакеты wine и i386-wine конфликтуют друг с другом, поэтому их нельзя установить на одну систему обычным способом. Однако можно выполнить несколько установок, используя такие механизмы, как chroots/клетки, или собрав WINE из исходных кодов (обратите внимание, что это _не_ означает сборку порта).

source: Can DOS Programs Be Run on WINE?
ko: 와인에서 DOS 프로그램을 실행할 수 있나요?
ru: Можно ли запускать программы DOS в WINE?

source: They can, as "Console User Interface" applications as mentioned earlier in this section. However, there is an arguably better method for running DOS software: package:emulators/dosbox[DOSBox]. On the other hand, there is little reason not to at least try it. Simply create a new prefix, install the software, and if it does not work delete the prefix.
ko: 이 섹션의 앞부분에서 언급한 것처럼 “콘솔 사용자 인터페이스” 애플리케이션으로 사용할 수 있습니다. 그러나 DOS 소프트웨어를 실행하는 더 좋은 방법이 있습니다. package:emulators/dosbox[DOSBox]. 하지만 시도해 보지 않을 이유도 없습니다. 새 접두사를 생성하고 소프트웨어를 설치한 다음 작동하지 않으면 접두사를 삭제하기만 하면 됩니다.
ru: Они могут работать как приложения с "Console User Interface", как упоминалось ранее в этом разделе. Однако существует, возможно, лучший способ запуска ПО для DOS: package:emulators/dosbox[DOSBox]. С другой стороны, нет причин хотя бы не попробовать. Просто создайте новый префикс, установите программное обеспечение, и если оно не заработает — удалите префикс.

source: Should the package:emulators/wine-devel[] Package/Port be Installed to Use the Development Version of WINE Instead of Stable?
ko: 안정 버전이 아닌 개발 버전의 WINE을 사용하려면 package:emulators/wine-devel[] 패키지/포트를 설치해야 하나요?
ru: Нужно ли устанавливать пакет package:emulators/wine-devel[] для использования версии WINE для разработчиков вместо стабильной?

source: Yes, installing this version will install the "development" version of WINE. As with the 32- and 64-bit versions, they cannot be installed together with the stable versions unless additional measures are taken.
ko: 예, 그 버전을 설치하면 WINE의 “개발” 버전이 설치됩니다. 32비트 및 64비트 버전과 마찬가지로 추가 조치를 취하지 않는 한 안정 버전과 함께 설치할 수 없습니다.
ru: Да, установка этой версии приведет к установке "разрабатываемой" версии WINE. Как и в случае с 32- и 64-разрядными версиями, их нельзя установить вместе со стабильными версиями без принятия дополнительных мер.

source: Note that WINE also has a "Staging" version, which contains the most recent updates. This was at one time available as a FreeBSD port; however, it has since been removed. It can be compiled directly from source however.
ko: WINE에는 최신 업데이트가 포함된 “스테이징(Staging)” 버전도 있습니다. 이 버전은 한때 FreeBSD 포트로 제공되었지만 현재는 제거되었습니다. 하지만 소스에서 직접 컴파일할 수 있습니다.
ru: Обратите внимание, что у WINE также есть "Staging" версия, которая содержит самые последние обновления. Ранее она была доступна как порт FreeBSD, но затем была удалена. Тем не менее, её можно скомпилировать непосредственно из исходного кода.

source: Install Optimization
ko: 최적화 설치
ru: Оптимизации установленного WINE

source: How Should Windows(R) Hardware (e.g., Graphics) Drivers be Handled?
ko: Windows(R) 하드웨어(예: 그래픽) 드라이버는 어떻게 처리해야 하나요?
ru: Что делать с драйверами Windows(R) (например, графическими)?

source: Operating system drivers transfer commands between applications and hardware. WINE emulates a Windows(R) environment, including the drivers, which in turn use FreeBSD's native drivers for this transfer. it is not advisable to install Windows(R) drivers, as the WINE system is designed to use the host systems drivers. If, for example, a graphics card that benefits from dedicated drivers, install them using the standard FreeBSD methods, not Windows(R) installers.
ko: 운영 체제 드라이버는 응용 프로그램과 하드웨어 간에 명령을 전송합니다. WINE은 드라이버를 포함한 Windows(R) 환경을 에뮬레이션하며, 이 전송을 위해 FreeBSD의 기본 드라이버를 사용합니다. WINE 시스템은 호스트 시스템 드라이버를 사용하도록 설계되었으므로 Windows(R) 드라이버를 설치하는 것은 바람직하지 않습니다. 예를 들어 전용 드라이버를 사용하는 그래픽 카드의 경우, Windows(R) 설치 프로그램이 아닌 표준 FreeBSD 방법을 사용하여 설치하십시오.
ru: Драйверы операционной системы передают команды между приложениями и оборудованием. WINE эмулирует среду Windows(R), включая драйверы, которые, в свою очередь, используют собственные драйверы FreeBSD для этой передачи. Устанавливать драйверы Windows(R) не рекомендуется, так как система WINE предназначена для использования драйверов хостовой системы. Если, например, видеокарта требует специализированных драйверов, их следует устанавливать стандартными методами FreeBSD, а не установщиками Windows(R).

source: Is There a way to Make Windows(R) Fonts Look Better?
ko: Windows(R) 글꼴을 더 보기 좋게 만들 수 있는 방법이 있나요?
ru: Есть ли способ улучшить отображение шрифтов Windows(R)?

source: A user on the FreeBSD forums suggests this configuration to fix out-of-the-box look of WINE fonts, which can be slightly pixelated.
ko: FreeBSD 포럼의 한 사용자가 약간 픽셀화될 수 있는 WINE 글꼴의 기본 모양을 수정하기 위해 이 구성을 제안했습니다.
ru: Пользователь на форумах FreeBSD предлагает следующую конфигурацию для исправления стандартного вида шрифтов в WINE, которые могут быть слегка пикселизированы.

source: According to https://forums.freebsd.org/threads/make-wine-ui-fonts-look-good.68273/[a post in the FreeBSD Forums], adding the following to [.filename]#.config/fontconfig/fonts.conf# will add anti-aliasing and make text more readable.
ko: https://forums.freebsd.org/threads/make-wine-ui-fonts-look-good.68273/[FreeBSD 포럼의 게시물]에 따르면 [.filename]#.config/fontconfig/fonts.conf#에 다음을 추가하면 앤티 앨리어싱이 추가되고 텍스트 가독성이 향상됩니다.
ru: Согласно https://forums.freebsd.org/threads/make-wine-ui-fonts-look-good.68273/[сообщению на FreeBSD Forums], добавление следующего в [.filename]#.config/fontconfig/fonts.conf# включит сглаживание и улучшит читаемость текста.

source: Does Having Windows(R) Installed Elsewhere on a System Help WINE Operate?
ko: 시스템의 다른 곳에 Windows(R)를 설치하면 WINE 작동에 도움이 되나요?
ru: Помогает ли наличие Windows(R), установленной в другом месте системы, работе WINE?
