Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wine/_index.po
Languages: ko, ru

source: The Windows(R) operating system has for some time had a default web browser pre-installed: Internet Explorer. As a result, some applications work under the assumption that there will always be something capable of displaying web pages. In order to provide this functionality, the WINE layer includes a web browser component using the Mozilla project's Gecko engine. When WINE is first launched it will offer to download and install this, and there are reasons users might want it do so (these will be covered in a later chapter). But they can also install it prior to installing WINE, or alongside the install of WINE proper.
ko: Windows(R) 운영 체제에는 한동안 기본 웹 브라우저: 인터넷 익스플로러가 사전 설치되어 있었습니다. 따라서 일부 애플리케이션은 웹 페이지를 표시할 수 있는 무언가가 항상 존재한다는 가정 하에 작동합니다. 이 기능을 제공하기 위해 WINE 레이어에는 Mozilla 프로젝트의 Gecko 엔진을 사용하는 웹 브라우저 구성 요소가 포함되어 있습니다. WINE을 처음 실행하면 이 컴포넌트를 다운로드하여 설치하라는 메시지가 표시되며, 사용자가 이를 원할 수 있는 몇 가지 이유가 있습니다(이후 장에서 다룰 예정임). 하지만 WINE을 설치하기 전 또는 WINE 설치와 함께 설치할 수도 있습니다.
ru: Операционная система Windows(R) уже долгое время поставляется с предустановленным веб-браузером по умолчанию — Internet Explorer. В результате некоторые приложения работают в предположении, что всегда будет доступно средство для отображения веб-страниц. Чтобы обеспечить эту функциональность, слой WINE включает компонент веб-браузера, использующий движок Gecko проекта Mozilla. При первом запуске WINE предложит загрузить и установить его, и у пользователей могут быть причины согласиться на это (эти причины будут рассмотрены в одной из следующих глав). Однако пользователи также могут установить этот компонент до установки WINE или параллельно с основной установкой WINE.

source: Install this package with the following:
ko: 다음의 패키지를 먼저 설치합니다:
ru: Установите этот пакет с помощью следующей команды:

source: Alternately, compile the port with the following:
ko: 또는 다음을 사용하여 포트를 컴파일합니다:
ru: В качестве альтернативы, соберите порт с помощью следующей команды:

source: This port installs the MONO framework, an open source implementation of Microsoft's .NET. Including this with the WINE installation will make it that much more likely that any applications written in .NET will install and run on the system.
ko: 이 포트는 Microsoft .NET의 오픈 소스 구현인 MONO 프레임워크를 설치합니다. 이 포트를 WINE 설치에 포함하면 .NET으로 작성된 모든 애플리케이션이 시스템에서 설치 및 실행될 가능성이 훨씬 높아집니다.
ru: Этот порт устанавливает фреймворк MONO, открытую реализацию .NET от Microsoft. Включение его в установку WINE увеличивает вероятность того, что приложения, написанные на .NET, будут устанавливаться и работать в системе.

source: To install the package:
ko: 패키지를 설치하려면:
ru: Для установки пакета:

source: To compile from the ports collection:
ko: 포트 컬렉션에서 컴파일하려면:
ru: Для компиляции из коллекции портов:

source: Installing WINE via FreeBSD Package Repositories
ko: FreeBSD 패키지 리포지토리를 통해 WINE 설치하기
ru: Установка WINE через репозитории пакетов FreeBSD

source: With the pre-requisites in place, install WINE via package with the following command:
ko: 사전 요구 사항이 준비되면 다음 명령을 사용하여 패키지를 통해 WINE을 설치합니다:
ru: Имея выполненные предварительные условия, установите WINE через пакет следующей командой:

source: Alternately compile the WINE sub-system from source with the following:
ko: 또는 다음을 사용하여 소스에서 WINE 하위 시스템을 컴파일합니다:
ru: Альтернативно можно собрать подсистему WINE из исходного кода следующим образом:

source: Concerns of 32- Versus 64-Bit in WINE Installations
ko: WINE 설치 시 32비트와 64비트의 차이점
ru: Проблемы 32- и 64-битных версий в установках WINE

source: Like most software, Windows(R) applications made the upgrade from the older 32-bit architecture to 64 bits. And most recent software is written for 64-bit operating systems, although modern OSes can sometimes continue to run older 32-bit programs as well. FreeBSD is no different, having had support for 64-bit since the 5.x series.
ko: 대부분의 소프트웨어와 마찬가지로 Windows(R) 응용 프로그램도 구형 32비트 아키텍처에서 64비트로 업그레이드되었습니다. 그리고 최신 소프트웨어는 대부분 64비트 운영 체제용으로 작성되었지만, 최신 OS에서는 구형 32비트 프로그램도 계속 실행할 수 있습니다. FreeBSD 역시 5.x 시리즈부터 64비트를 지원해 왔습니다.
ru: Как и большинство программного обеспечения, приложения Windows(R) перешли с устаревшей 32-битной архитектуры на 64-битную. Большинство современного ПО разрабатывается для 64-битных операционных систем, хотя современные ОС иногда могут запускать и старые 32-битные программы. FreeBSD не является исключением, поддерживая 64-битную архитектуру начиная с серии 5.x.

source: However, using old software no longer supported by default is a common use for emulators, and users commonly turn to WINE to play games and use other programs that do not run properly on modern hardware. Fortunately, FreeBSD can support all three scenarios:
ko: 그러나 기본적으로 더 이상 지원되지 않는 오래된 소프트웨어를 사용하는 것은 에뮬레이터의 일반적인 용도이며, 사용자는 일반적으로 최신 하드웨어에서 제대로 실행되지 않는 게임을 플레이하고 다른 프로그램을 사용하기 위해 WINE을 사용합니다. 다행히도 FreeBSD는 이 세 가지 시나리오를 모두 지원할 수 있습니다:
ru: Однако использование устаревшего программного обеспечения, которое больше не поддерживается по умолчанию, является распространённым случаем применения эмуляторов. Пользователи часто обращаются к WINE для запуска игр и других программ, которые не работают корректно на современном оборудовании. К счастью, FreeBSD поддерживает все три сценария:

source: On modern, 64-bit machine and want to run 64-bit Windows(R) software, simply install the ports mentioned in the above sections. The ports system will automatically install the 64-bit version.
ko: 최신 64비트 컴퓨터에서 64비트 Windows(R) 소프트웨어를 실행하려면 위 섹션에 언급된 포트를 설치하기만 하면 됩니다. 포트 시스템이 자동으로 64비트 버전을 설치합니다.
ru: На современных 64-битных машинах, если требуется запускать 64-битное программное обеспечение Windows(R), достаточно установить порты, упомянутые в вышеуказанных разделах. Система портов автоматически установит 64-битную версию.

source: Alternately, users might have an older 32-bit machine that they do not want to run with its original, now non-supported software. They can install the 32-bit (i386) version of FreeBSD, then install the ports in the above sections.
ko: 또는 사용자는 오리지널 소프트웨어로 실행하고 싶지 않은, 현재는 지원되지 않는 구형 32비트 머신을 가지고 있을 수도 있습니다. 이 경우 32비트(i386) 버전의 FreeBSD를 설치한 다음 위 섹션의 포트를 설치할 수 있습니다.
ru: Альтернативно, у пользователей может быть старая 32-разрядная машина, на которой они не хотят запускать оригинальное, теперь уже неподдерживаемое программное обеспечение. Они могут установить 32-разрядную (i386) версию FreeBSD, а затем установить порты из вышеуказанных разделов.

source: Running a First WINE Program on FreeBSD
ko: FreeBSD에서 첫 WINE 프로그램 실행하기
ru: Запуск первой программы в WINE на FreeBSD

source: Now that WINE is installed, the next step is to try it out by running a simple program. An easy way to do this is to download a self-contained application, i.e., one can simply unpack and run without any complex installation process.
ko: 이제 WINE이 설치되었으므로 다음 단계는 간단한 프로그램을 실행하여 사용해 보는 것입니다. 복잡한 설치 과정 없이 간단히 압축을 풀고 실행할 수 있는 독립형 애플리케이션을 다운로드하는 것이 가장 쉬운 방법입니다.
ru: Теперь, когда WINE установлен, следующий шаг — попробовать его в работе, запустив простую программу. Простой способ сделать это — скачать автономное приложение, то есть такое, которое можно просто распаковать и запустить без сложного процесса установки.

source: So-called "portable" versions of applications are good choices for this test, as are programs that run with only a single executable file.
ko: 소위 “포터블” 버전의 애플리케이션은 단일 실행 파일로만 실행되며 이 테스트에 적합한 선택입니다.
ru: Так называемые "портативные" версии приложений хорошо подходят для этого теста, как и программы, которые работают с одним исполняемым файлом.

source: Running a Program from the Command Line
ko: 명령줄에서 프로그램 실행하기
ru: Запуск программы из командной строки

source: There are two different methods to launch a Windows program from the terminal. The first, and most straightforward is to navigate to the directory containing the program's executable ([.filename]#.EXE#) and issue the following:
ko: 터미널에서 Windows 프로그램을 실행하는 방법에는 두 가지가 있습니다. 가장 간단한 첫 번째 방법은 프로그램의 실행 파일이 들어 있는 디렉토리([.filename]#.EXE#)로 이동하여 다음과 같이 실행하는 것입니다:
ru: Существует два различных способа запуска программ Windows из терминала. Первый и наиболее простой — перейти в каталог с исполняемым файлом программы ([.filename]#.EXE#) и выполнить следующую команду:

source: For applications that take command-line arguments, add them after the executable as usual:
ko: 명령줄 인수를 사용하는 애플리케이션의 경우 평소처럼 실행 파일 뒤에 인수를 추가합니다:
ru: Для приложений, принимающих аргументы командной строки, добавьте их после исполняемого файла, как обычно:

source: Alternately, supply the full path to the executable to use it in a script, for example:
ko: 또는 스크립트에서 사용하려면 실행 파일의 전체 경로를 입력합니다, 예를들어:
ru: Другой способ — укажите полный путь к исполняемому файлу, чтобы использовать его в скрипте, например:

source: Running a Program from a GUI
ko: GUI 환경에서 프로그램 실행하기
ru: Запуск программы из графического интерфейса

source: After installation graphical shells should be updated with new associations for Windows executable ([.filename]#.EXE#) files. It will now be possible to browse the system using a file manager, and launch the Windows application in the same way as other files and programs (either a single- or double-click, depending on the desktop's settings).
ko: 설치 후 그래픽 셸은 Windows 실행 파일([.filename]#.EXE#)에 대한 새로운 연결로 업데이트되어야 합니다. 이제 파일 관리자를 사용하여 시스템을 탐색하고 다른 파일 및 프로그램과 동일한 방식으로 Windows 애플리케이션을 실행할 수 있습니다(데스크톱 설정에 따라 한 번 또는 두 번 클릭).
ru: После установки графические оболочки должны быть обновлены с новыми ассоциациями для исполняемых файлов Windows ([.filename]#.EXE#). Теперь можно будет просматривать систему с помощью файлового менеджера и запускать Windows-приложения так же, как другие файлы и программы (одинарным или двойным щелчком, в зависимости от настроек рабочего стола).

source: On most desktops, check to make sure this association is correct by right-clicking on the file, and looking for an entry in the context menu to open the file. One of the options (hopefully the default one) will be with the *Wine Windows Program Loader*, as shown in the below screenshot:
ko: 대부분의 데스크톱에서 파일을 마우스 오른쪽 버튼으로 클릭하고 컨텍스트 메뉴에서 파일을 열 항목을 찾아 이 연결이 올바른지 확인하세요. 아래 스크린샷과 같이 *Wine Windows Program Loader*가 옵션 중 하나(기본값이길 빕니다)로 표시되어 있을 것입니다:
ru: На большинстве рабочих столов проверьте правильность этой ассоциации, щёлкнув правой кнопкой мыши на файле и найдя пункт в контекстном меню для его открытия. Один из вариантов меню (будем надеяться, выбираемый по умолчанию) будет *Wine Windows Program Loader*, как показано на рисунке ниже:

source: In the event the program does not run as expected, try launching it from the command line and review any messages displayed in the terminal to troubleshoot.
ko: 프로그램이 예상대로 실행되지 않는 경우, 명령줄에서 프로그램을 실행하고 터미널에 표시되는 메시지를 검토하여 문제를 해결하세요.
ru: В случае, если программа не работает должным образом, попробуйте запустить её из командной строки и просмотрите сообщения, отображаемые в терминале, для устранения неполадок.

source: In the event WINE is not the default application for [.filename]#.EXE# files after install, check the MIME associate for this extension in the current desktop environment, graphical shell, or file manager.
ko: 설치 후 [.filename]#.EXE# 파일에 대한 기본 애플리케이션이 WINE이 아닌 경우 현재 데스크톱 환경, 그래픽 셸 또는 파일 관리자에서 이 확장자에 대한 MIME 연관자를 확인하세요.
ru: В случае, если WINE не является приложением по умолчанию для файлов [.filename]#.EXE# после установки, проверьте ассоциацию MIME для этого расширения в текущем окружении рабочего стола, графической оболочке или файловом менеджере.

source: Configuring WINE Installation
ko: 와인 설치 구성하기
ru: Настройка установленного WINE

source: With an understanding of what WINE is and how it works at a high level, the next step to effectively using it on FreeBSD is becoming familiar with its configuration. The following sections will describe the key concept of the _WINE prefix_, and illustrate how it is used to control the behavior of applications run through WINE.
ko: WINE이 무엇이고 어떻게 작동하는지에 대해 이해했다면, FreeBSD에서 효과적으로 사용하기 위한 다음 단계는 그 구성에 익숙해지는 것입니다. 다음 섹션에서는 _WINE 접두사_의 핵심 개념을 설명하고, 이 접두사가 WINE을 통해 실행되는 애플리케이션의 동작을 제어하는 데 어떻게 사용되는지 설명합니다.
ru: Понимая, что такое WINE и как он работает на высоком уровне, следующий шаг к эффективному использованию на FreeBSD — это знакомство с его настройкой. В следующих разделах будет описано ключевое понятие _префикса WINE_ и показано, как он используется для управления поведением приложений, запускаемых через WINE.

source: WINE Prefixes
ko: 와인 접두사
ru: Префиксы WINE

source: A WINE _prefix_ is a directory, usually located beneath the default location of [.filename]#$HOME/.wine# though it can be located elsewhere. The prefix is a set of configurations and support files used by the wine to configure and run the Windows(R) environment a given application needs. By default, a brand new WINE installation will create the following structure when first launched by a user:
ko: 와인 _접두사_는 디렉터리로, 일반적으로 기본 위치인 [.filename]#$HOME/.wine# 아래에 위치하지만 다른 위치에 존재할 수도 있습니다. 접두사는 와인에서 특정 애플리케이션에 필요한 Windows(R) 환경을 구성하고 실행하는 데 사용하는 구성 및 지원 파일의 집합입니다. 기본적으로 새로운 WINE 설치는 사용자가 처음 시작할 때 다음과 같은 구조를 생성합니다:
ru: Префикс WINE — это каталог, обычно расположенный в стандартном месте [.filename]#$HOME/.wine#, хотя может находиться и в другом месте. Префикс представляет собой набор конфигураций и вспомогательных файлов, используемых WINE для настройки и запуска среды Windows(R), необходимой для работы конкретного приложения. По умолчанию при первом запуске WINE пользователем создаётся следующая структура:

source: [.filename]#.update-timestamp#: contains the last modified date of [.filename]#file /usr/share/wine/wine.inf#. It is used by WINE to determine if a prefix is out of date, and automatically update it if needed.
ko: [.filename]#.update-timestamp#: [.filename]#file /usr/share/wine/wine.inf#의 마지막 수정 날짜를 포함합니다. 이 정보는 WINE에서 접두사가 오래되었는지 확인하고 필요한 경우 자동으로 업데이트하는 데 사용됩니다.
ru: [.filename]#.update-timestamp#: содержит дату последнего изменения файла [.filename]#/usr/share/wine/wine.inf#. Используется WINE для определения устаревания префикса и его автоматического обновления при необходимости.

source: [.filename]#dosdevices/#: contains information on mappings of Windows(R) resources to resources on the host FreeBSD system. For example, after a new WINE installation, this should contain at least two entries which enable access to the FreeBSD filesystem using Windows(R)-style drive letters:
ko: [.filename]#dosdevices/#: Windows(R) 리소스와 호스트 FreeBSD 시스템의 리소스 매핑에 대한 정보를 포함합니다. 예를 들어, 새 WINE을 설치한 후에는 Windows(R) 스타일 드라이브 문자를 사용하여 FreeBSD 파일 시스템에 액세스할 수 있는 항목이 최소 두 개 이상 포함되어야 합니다:
ru: [.filename]#dosdevices/#: содержит информацию о сопоставлениях ресурсов Windows(R) с ресурсами в основной системе FreeBSD. Например, после новой установки WINE здесь должны быть как минимум две записи, обеспечивающие доступ к файловой системе FreeBSD с использованием букв дисков в стиле Windows(R):

source: [.filename]#c:@#: A link to [.filename]#drive_c# described below.
ko: [.filename]#c:@#: 아래에 설명된 [.filename]#drive_c#에 대한 링크.
ru: [.filename]#c:@#: Ссылка на [.filename]#drive_c#, описанный ниже.

source: [.filename]#z:@#: A link to the root directory of the system.
ko: [.filename]#z:@#: 시스템의 루트 디렉터리로 연결되는 링크.
ru: [.filename]#z:@#: Ссылка на корневой каталог системы.

source: [.filename]#drive_c/#: emulates the main (i.e., [.filename]#C:#) drive of a Windows(R) system. It contains a directory structure and associated files mirroring that of standard Windows(R) systems. A fresh WINE prefix will contain Windows(R) 10 directories such as _Users_ and _Windows_ that holds the OS itself. Furthermore, applications installed within a prefix will be located in either _Program Files_ or _Program Files (x86)_, depending on their architecture.
ko: [.filename]#drive_c/#: Windows(R) 시스템의 기본(즉, [.filename]#C:#) 드라이브를 에뮬레이트합니다. 여기에는 표준 Windows(R) 시스템과 동일한 디렉토리 구조와 관련 파일이 포함됩니다. 새로운 WINE 접두사에는 _Users_ 및 _Windows_와 같은 Windows(R) 10 디렉터리가 포함되며, 이 디렉터리에는 OS 자체가 들어 있습니다. 또한 접두사 내에 설치된 애플리케이션은 아키텍처에 따라 _Program Files_ 또는 _Program Files (x86)_에 위치하게 됩니다.
ru: [.filename]#drive_c/#: эмулирует основной диск (то есть [.filename]#C:#) системы Windows(R). Он содержит структуру каталогов и связанные файлы, отражающие стандартную структуру Windows(R). В новом префиксе WINE будут присутствовать каталоги Windows(R) 10, такие как _Users_ и _Windows_, в котором находится сама ОС. Кроме того, приложения, установленные в префиксе, будут располагаться в _Program Files_ или _Program Files (x86)_ в зависимости от их архитектуры.

source: [.filename]#system.reg#: This Registry file contains information on the Windows(R) installation, which in the case of WINE is the environment in [.filename]#drive_c#.
ko: [.filename]#system.reg#: 이 레지스트리 파일에는 Windows(R) 설치에 대한 정보가 포함되어 있으며, WINE의 경우 [.filename]#drive_c# 안의 환경입니다.
ru: [.filename]#system.reg#: Этот файл реестра содержит информацию об установке Windows(R), которая в случае WINE представляет собой окружение в [.filename]#drive_c#.

source: [.filename]#user.reg#: This Registry file contains the current user's personal configurations, made either by varous software or through the use of the Registry Editor.
ko: [.filename]#user.reg#: 이 레지스트리 파일에는 다양한 소프트웨어 또는 레지스트리 편집기를 사용하여 만든 현재 사용자의 개인 구성이 포함되어 있습니다.
ru: [.filename]#user.reg#: Этот файл реестра содержит персональные настройки текущего пользователя, созданные различным программным обеспечением или через использование редактора реестра.

source: [.filename]#userdef.reg#: This Registry file is a default set of configurations for newly-created users.
ko: [.filename]#userdef.reg#: 이 레지스트리 파일은 새로 만든 사용자를 위한 기본 구성 집합입니다.
ru: [.filename]#userdef.reg#: Этот файл реестра содержит набор конфигураций по умолчанию для вновь создаваемых пользователей.

source: Creating and Using WINE Prefixes
ko: WINE 접두사 생성 및 사용하기
ru: Создание и использование префиксов WINE

source: While WINE will create a default prefix in the user's [.filename]#$HOME/.wine/#, it is possible to set up multiple prefixes. There are a few reasons to do this:
ko: WINE은 사용자의 [.filename]#$HOME/.wine/#에 기본 접두사를 생성하지만, 여러 접두사를 설정할 수도 있습니다. 이렇게 하는 데에는 몇 가지 이유가 있습니다:
ru: Хотя WINE создаст префикс по умолчанию в каталоге [.filename]#$HOME/.wine/# пользователя, можно настроить несколько префиксов. Для этого есть несколько причин:

source: The most common reason is to emulate different versions of Windows(R), according to the compatibility needs of the software in question.
ko: 가장 일반적인 이유는 해당 소프트웨어의 호환성 요구 사항에 따라 다양한 버전의 Windows(R)를 에뮬레이트하기 위해서입니다.
ru: Наиболее распространённая причина — эмуляция различных версий Windows(R) в соответствии с требованиями совместимости используемого программного обеспечения.

source: In addition, it is common to encounter software that does not work correctly in the default environment, and requires special configuration. it is useful to isolate these in their own, custom prefixes, so the changes do not impact other applications.
ko: 또한 기본 환경에서 제대로 작동하지 않고 특별한 구성이 필요한 소프트웨어가 종종 확인되는데, 이러한 경우 변경 사항이 다른 애플리케이션에 영향을 미치지 않도록 고유한 사용자 지정 접두사로 분리하는 것이 유용합니다.
ru: Кроме того, часто встречается программное обеспечение, которое некорректно работает в стандартном окружении и требует специальной настройки. Полезно изолировать такие программы в собственных пользовательских префиксах, чтобы изменения не влияли на другие приложения.

source: Similarly, copying the default or "main" prefix into a separate "testing" one in order to evaluate an application's compatibility can reduce the chance of corruption.
ko: 마찬가지로 애플리케이션의 호환성을 평가하기 위해 기본 또는 ‘메인’ 접두사를 별도의 ‘테스트’ 접두사로 복사하면 손상 가능성을 줄일 수 있습니다.
ru: Аналогично, копирование стандартного или "основного" префикса в отдельный "тестовый" для проверки совместимости приложения может снизить вероятность повреждения.

source: Creating a prefix from the terminal requires the following command:
ko: 터미널에서 접두사를 만들려면 다음 명령이 필요합니다:
ru: Создание префикса из терминала требует выполнения следующей команды:

source: This will run the `winecfg` program, which can be used to configure wine prefixes (more on this in a later section). But by providing a directory path value for the `WINEPREFIX` environment variable, a new prefix is created at that location if one does not already exist.
ko: 그러면 와인 접두사를 구성하는 데 사용할 수 있는 `winecfg` 프로그램이 실행됩니다(자세한 내용은 뒷부분에서 설명합니다). 그러나 `WINEPREFIX` 환경 변수에 디렉토리 경로 값을 제공하면 접두사가 아직 없는 경우 해당 위치에 새 접두사가 생성됩니다.
ru: Это запустит программу `winecfg`, которую можно использовать для настройки префиксов wine (подробнее об этом в следующем разделе). Однако, указав путь к каталогу в переменной окружения `WINEPREFIX`, можно создать новый префикс по этому пути, если он ещё не существует.

source: Supplying the same variable to the wine program will similarly cause the selected program to be run with the specified prefix:
ko: 와인 프로그램에도 동일한 변수를 제공하면 마찬가지로 선택한 프로그램이 지정된 접두사를 사용하여 실행됩니다:
ru: Предоставление той же переменной программе wine аналогично приведет к запуску выбранной программы с указанным префиксом:

source: Configuring WINE Prefixes with winecfg
ko: winecfg로 와인 접두사 구성하기
ru: Настройка префиксов WINE с помощью winecfg

source: As described above WINE includes a tool called `winecfg` to configure prefixes from within a GUI. It contains a variety of functions, which are detailed in the sections below. When `winecfg` is run from within a prefix, or provided the location of a prefix within the `WINEPREFIX` variable, it enables the configuration of the selected prefix as described in the below sections.
ko: 위에서 설명한 것처럼 와인에는 GUI 내에서 접두사를 구성할 수 있는 `winecfg`라는 도구가 포함되어 있습니다. 이 도구에는 다양한 기능이 포함되어 있으며, 아래 섹션에서 자세히 설명합니다. 접두사 내에서 `winecfg`를 실행하거나 `WINEPREFIX` 변수 내에 접두사 위치를 제공하면 아래 섹션에 설명된 대로 선택한 접두사를 구성할 수 있습니다.
ru: Как упоминалось выше, WINE включает инструмент под названием `winecfg` для настройки префиксов через графический интерфейс. Он содержит множество функций, которые подробно описаны в следующих разделах. Когда `winecfg` запускается внутри префикса или ему указывается расположение префикса через переменную `WINEPREFIX`, он позволяет настраивать выбранный префикс, как описано в разделах ниже.

source: Selections made on the _Applications_ tab will affect the scope of changes made in the _Libraries_ and _Graphics_ tabs, which will be limited to the application selected. See the section on https://wiki.winehq.org/Wine_User%27s_Guide#Using_Winecfg[Using Winecfg] in the WINE Wiki for more details.
ko: _Applications_ 탭에서 선택한 사항은 _Libraries_ 및 _Graphics_ 탭의 변경 범위에 영향을 미치며, 이는 선택한 응용 프로그램으로 제한됩니다. 자세한 내용은 WINE 위키의 https://wiki.winehq.org/Wine_User%27s_Guide#Using_Winecfg[Winecfg 사용] 섹션을 참조하세요.
ru: Выбор на вкладке _Приложения (Applications)_ влияет на область изменений, вносимых на вкладках _Библиотеки (Libraries)_ и _Графика (Graphics)_, которые будут ограничены выбранным приложением. Подробнее см. раздел https://wiki.winehq.org/Wine_User%27s_Guide#Using_Winecfg[Использование Winecfg] в вики WINE.

source: Applications
ko: 응용 프로그램
ru: Приложения (Applications)

source: The _Applications_ contains controls enabling the association of programs with a particular version of Windows(R). On first start-up the _Application settings_ section will contain a single entry: _Default Settings_. This corresponds to all the default configurations of the prefix, which (as the disabled _Remove application_ button implies) cannot be deleted.
ko: _응용 프로그램(Applications)_에는 특정 버전의 Windows(R)와 프로그램을 연결할 수 있는 컨트롤이 포함되어 있습니다. 처음 시작할 때 _Application settings_ 섹션에는 단일 항목이 포함됩니다: _Default Settings_. 이는 접두사의 모든 기본 구성에 해당하며, (비활성화된 _Remove application_ 버튼에서 알 수 있듯이) 삭제할 수 없습니다.
ru: В разделе _Приложения (Applications)_ находятся элементы управления, позволяющие связать программы с определенной версией Windows(R). При первом запуске в разделе _Настройки приложений (Application settings)_ будет только одна запись: _Настройки по умолчанию (Default Settings)_. Она соответствует всем конфигурациям префикса по умолчанию, которые (как подразумевает неактивная кнопка _Удалить приложение (Remove application)_) нельзя удалить.
