Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wine/_index.po
Languages: ko, ru

source: But additional applications can be added with the following process:
ko: 그러나 다음 과정을 통해 추가 애플리케이션을 추가할 수 있습니다:
ru: Однако дополнительные приложения можно добавить с помощью следующего процесса:

source: Click the _Add application_ button.
ko: _Add application_ 버튼을 클릭합니다.
ru: Нажмите кнопку _Добавить приложение (Add application)_.

source: Use the provided dialog to select the desired program's executable.
ko: 제공된 대화 상자를 사용하여 원하는 프로그램의 실행 파일을 선택합니다.
ru: Используйте предоставленное диалоговое окно для выбора исполняемого файла нужной программы.

source: Select the version of Windows(R) to be used with the selected program.
ko: 선택한 프로그램과 함께 사용할 Windows(R) 버전을 선택합니다.
ru: Выберите версию Windows(R) для использования с выбранной программой.

source: Libraries
ko: 라이브러리
ru: Библиотеки (Libraries)

source: WINE provides a set of open source library files as part of its distribution that provide the same functions as their Windows(R) counterparts. However, as noted earlier in this chapter, the WINE project is always trying to keep pace with new updates to these libraries. As a result, the versions that ship with WINE may be missing functionality that the latest Windows(R) programs are expecting.
ko: WINE은 배포의 일부로 Windows(R) 버전과 동일한 기능을 제공하는 오픈 소스 라이브러리 파일 세트를 제공합니다. 그러나 이 장의 앞부분에서 언급했듯이 WINE 프로젝트는 항상 이러한 라이브러리의 새로운 업데이트에 발맞추기 위해 노력하고 있습니다. 따라서 WINE과 함께 제공되는 버전에는 최신 Windows(R) 프로그램에서 기대하는 기능이 누락될 수 있습니다.
ru: WINE предоставляет набор библиотечных файлов с открытым исходным кодом в составе своей дистрибуции, которые выполняют те же функции, что и их аналоги в Windows(R). Однако, как уже отмечалось ранее в этой главе, проект WINE постоянно стремится идти в ногу с новыми обновлениями этих библиотек. В результате, версии, поставляемые с WINE, могут не иметь функциональности, которую ожидают последние программы для Windows(R).

source: However, `winecfg` makes it possible specify overrides for the built-in libraries, particularly there is a version of Windows(R) available on the same machine as the host FreeBSD installation. For each library to be overridden, do the following:
ko: 그러나 `winecfg`를 사용하면 내장 라이브러리에 대한 오버라이드를 지정할 수 있으며, 특히 호스트 FreeBSD 설치와 동일한 시스템에서 사용할 수 있는 Windows(R) 버전이 있는 경우 더욱 그렇습니다. 재정의할 각 라이브러리에 대해 다음을 수행합니다:
ru: Однако `winecfg` позволяет указать переопределения для встроенных библиотек, особенно если на той же машине, где установлена FreeBSD, доступна версия Windows(R). Для каждой библиотеки, которую нужно переопределить, выполните следующее:

source: Open the _New override for library_ drop-down and select the library to be replaced.
ko: _New override for library_ 드롭다운을 열고 대체할 라이브러리를 선택합니다.
ru: Откройте выпадающий список _Новое переопределение для библиотеки (New override for library)_ и выберите библиотеку, которую нужно заменить.

source: Click the _Add_ button.
ko: _Add_ 버튼을 클릭합니다.
ru: Нажмите кнопку _Добавить (Add)_.

source: The new override will appear in the _Existing overrides_ list, notice the _native, builtin_ designation in parentheses.
ko: 새 오버라이드는 _Existing overrides_ 목록에 표시되며, 괄호 안에 _native, builtin_이라는 명칭이 표시됩니다.
ru: Новое переопределение появится в списке _Существующие переопределения (Existing overrides)_, обратите внимание на обозначение _native, builtin_ в скобках.

source: Click to select the library.
ko: 라이브러리를 선택해 클릭하세요.
ru: Нажмите, чтобы выбрать библиотеку.

source: Click the _Edit_ button.
ko: _Edit_ 버튼을 클릭하세요.
ru: Нажмите кнопку _Правка (Edit)_.

source: Use the provided dialog to select a corresponding library to be used in place of the built-in one.
ko: 제공된 대화 상자를 사용하여 기본 제공 라이브러리 대신 사용할 해당 라이브러리를 선택합니다.
ru: Используйте предоставленное диалоговое окно для выбора соответствующей библиотеки, которая будет использоваться вместо встроенной.

source: Be sure to select a file that is truly the corresponding version of the built-in one, otherwise there may be unexpected behavior.
ko: 내장된 파일의 해당 버전에 맞는 파일을 선택해야 하며, 그렇지 않으면 예기치 않은 동작이 발생할 수 있습니다.
ru: Убедитесь, что выбранный файл действительно соответствует версии встроенного, иначе возможно непредвиденное поведение.

source: Graphics
ko: 그래픽
ru: Графика (Graphics)

source: The _Graphics_ tab provides some options to make the windows of programs run via WINE operate smoothly with FreeBSD:
ko: _Graphics_ 탭은 WINE을 통해 실행되는 프로그램의 창이 FreeBSD에서 원활하게 작동하도록 하기 위한 몇 가지 옵션을 제공합니다:
ru: Вкладка _Графика (Graphics)_ предоставляет несколько опций для обеспечения плавной работы окон программ, запущенных через WINE, в FreeBSD:

source: Automatic mouse capture when windows are full-screen.
ko: 창이 전체 화면일 때 자동 마우스 캡처.
ru: Автоматический захват мыши при полноэкранном режиме окон.

source: Allowing the FreeBSD window manager to decorate the windows, such as their title bars, for programs running via WINE.
ko: WINE을 통해 실행되는 프로그램의 제목 표시줄과 같은 창을 FreeBSD 창 관리자가 꾸밀 수 있도록 허용.
ru: Разрешение оконному менеджеру FreeBSD оформлять окна, например, их заголовки, для программ, работающих через WINE.

source: Allowing the window manager to control windows for programs running via WINE, such as running resizing functions on them.
ko: 창 관리자가 WINE을 통해 실행되는 프로그램의 창을 제어할 수 있도록 허용(예: 크기 조정 기능 실행).
ru: Разрешение оконному менеджеру управлять окнами программ, работающих через WINE, например, выполнение функций изменения их размера.

source: Create an emulated virtual desktop, within which all WINE programs will run. If this item is selected, the size of the virtual desktop can be specified using the _Desktop size_ input boxes.
ko: 모든 WINE 프로그램이 실행될 에뮬레이트된 가상 데스크톱을 생성. 이 항목을 선택하면 _Desktop size_ 입력 상자를 사용하여 가상 데스크톱의 크기를 지정할 수 있습니다.
ru: Создать эмулированный виртуальный рабочий стол, в пределах которого будут запускаться все программы WINE. Если этот пункт выбран, размер виртуального рабочего стола можно указать с помощью полей ввода _Размер рабоче (Desktop size)го стола_.

source: Setting the screen resolution for programs running via WINE.
ko: WINE을 통해 실행되는 프로그램의 화면 해상도 설정.
ru: Установка разрешения экрана для программ, работающих через WINE.

source: Desktop Integration
ko: 데스크톱 통합
ru: Интеграция с рабочим столом (Desktop Integration)

source: This tab allows configuration of the following items:
ko: 이 탭에서는 다음 항목을 구성할 수 있습니다:
ru: Эта вкладка позволяет настроить следующие элементы:

source: The theme and related visual settings to be used for programs running via WINE.
ko: WINE을 통해 실행되는 프로그램에 사용할 테마 및 관련 시각적 설정.
ru: Тему и связанные визуальные настройки, используемые для программ, работающих через WINE.

source: Whether the WINE sub-system should manage MIME types (used to determine which application opens a particular file type) internally.
ko: WINE 하위 시스템에서 특정 파일 형식을 여는 애플리케이션을 결정하는 데 사용되는 MIME 유형을 내부적으로 관리해야 하는지 여부.
ru: Должна ли подсистема WINE управлять типами MIME (используемыми для определения, какое приложение открывает файлы определённого типа) внутри себя.

source: Mappings of directories in the host FreeBSD system to useful folders within the Windows(R) environment. To change an existing association, select the desired item and click _Browse_, then use the provided dialog to select a directory.
ko: 호스트 FreeBSD 시스템의 디렉터리를 Windows(R) 환경 내의 유용한 폴더에 매핑. 기존 연결을 변경하려면 원하는 항목을 선택하고 _Browse_를 클릭한 다음 제공된 대화 상자를 사용하여 디렉터리를 선택합니다.
ru: Сопоставление каталогов в основной системе FreeBSD с полезными папками в среде Windows(R). Чтобы изменить существующую ассоциацию, выберите нужный элемент и нажмите _Просмотреть (Browse)_, затем используйте предоставленный диалог для выбора каталога.

source: Drives
ko: 드라이브
ru: Накопители (Drives)

source: The _Drives_ tab allows linking of directories in the host FreeBSD system to drive letters in the Windows(R) environment. The default values in this tab should look familiar, as they are displaying the contents of [.filename]#dosdevices/# in the current WINE prefix. Changes made via this dialog will reflect in [.filename]#dosdevices#, and properly-formatted links created in that directory will display in this tab.
ko: _Drives_ 탭은 호스트 FreeBSD 시스템의 디렉터리를 Windows(R) 환경의 드라이브 문자에 연결할 수 있게 해줍니다. 이 탭의 기본값은 현재 WINE 접두사에 [.filename]#dosdevices/#의 내용을 표시하므로 익숙하게 보일 것입니다. 이 대화 상자를 통해 변경한 내용은 [.filename]#dosdevices/#에 반영되며, 해당 디렉터리에서 생성된 올바른 형식의 링크가 이 탭에 표시됩니다.
ru: Вкладка _Накопители (Drives)_ позволяет связывать каталоги в основной системе FreeBSD с буквами дисков в среде Windows(R). Значения по умолчанию на этой вкладке должны выглядеть знакомо, так как они отображают содержимое [.filename]#dosdevices/# в текущем префиксе WINE. Изменения, сделанные через это диалоговое окно, отобразятся в [.filename]#dosdevices#, а правильно оформленные ссылки, созданные в этом каталоге, будут показаны на этой вкладке.

source: To create a new entry, such as for a CD-ROM (mounted at [.filename]#/mnt/cdrom#), take the following steps:
ko: CD-ROM([.filename]#/mnt/cdrom#에 마운트됨)과 같은 새 항목을 만들려면 다음 단계를 수행합니다:
ru: Чтобы создать новую запись, например, для CD-ROM (монтированного в [.filename]#/mnt/cdrom#), выполните следующие действия:

source: Click the _Add _ button.
ko: _Add _ 버튼을 클릭합니다.
ru: Нажмите кнопку _Добавить (Add)_.

source: In the provided dialog, choose a free drive letter.
ko: 제공된 대화 상자에서 사용 가능한 드라이브 문자를 선택합니다.
ru: В предоставленном диалоговом окне выберите свободную букву диска.

source: Click _OK_.
ko: _OK_를 클릭합니다.
ru: Нажмите _OK_.

source: Fill in the _Path_ input box by either typing the path to the resource, or click _Browse _ and use the provided dialog to select it.
ko: _Path_ 입력 상자에 리소스 경로를 입력하거나 _Browse _를 클릭하고 제공된 대화 상자를 사용하여 경로를 선택합니다.
ru: Заполните поле ввода _Путь (Path)_, введя путь к ресурсу вручную или нажав _Просмотр (Browse)_ и выбрав его в открывшемся диалоговом окне.

source: By default WINE will autodetect the type of resource linked, but this can be manually overridden. See https://wiki.winehq.org/Wine_User%27s_Guide#Drive_Settings[the section in the WINE Wiki] for more detail on advanced options.
ko: 기본적으로 WINE은 연결된 리소스 유형을 자동으로 감지하지만 수동으로 재정의할 수 있습니다. 고급 옵션에 대한 자세한 내용은 https://wiki.winehq.org/Wine_User%27s_Guide#Drive_Settings[WINE Wiki의 섹션]을 참조하세요.
ru: По умолчанию WINE автоматически определяет тип связанного ресурса, но это можно переопределить вручную. Дополнительные сведения о расширенных настройках см. в https://wiki.winehq.org/Wine_User%27s_Guide#Drive_Settings[соответствующем разделе вики WINE].

source: Audio
ko: 오디오
ru: Звук (Audio)

source: This tab contains some configurable options for routing sound from Windows(R) programs to the native FreeBSD sound system, including:
ko: 이 탭에는 Windows(R) 프로그램에서 기본 FreeBSD 사운드 시스템으로 사운드를 라우팅하기 위한 몇 가지 구성 가능한 옵션이 포함되어 있습니다:
ru: Эта вкладка содержит некоторые настраиваемые параметры для маршрутизации звука из программ Windows(R) в родную звуковую систему FreeBSD, включая:

source: Driver selection
ko: 드라이버 선택
ru: Выбор драйвера

source: Default device selection
ko: 기본 디바이스 선택
ru: Выбор устройства по умолчанию

source: Sound test
ko: 사운드 테스트
ru: Звуковой тест

source: About
ko: 소개
ru: О программе (About)

source: The final tab contains information on the WINE project, including a link to the website. It also allows entry of (entirely optional) user information, although this is not sent anywhere as it is in other operating systems.
ko: 마지막 탭에는 웹사이트 링크를 포함하여 WINE 프로젝트에 대한 정보가 포함되어 있습니다. 또한 다른 운영 체제에서와 마찬가지로 어디에도 전송되지 않지만 (전적으로 선택 사항인) 사용자 정보를 입력할 수 있습니다.
ru: Последняя вкладка содержит информацию о проекте WINE, включая ссылку на веб-сайт. Также она позволяет ввести (совершенно необязательные) пользовательские данные, хотя они никуда не отправляются, в отличие от других операционных систем.

source: WINE Management GUIs
ko: 와인 관리 GUI
ru: Графические программы для управления WINE

source: While the base install of WINE comes with a GUI configuration tool in `winecfg`, it is main purpose is just that: strictly configuring an existing WINE prefix. There are, however, more advanced applications that will assist in the initial installation of applications as well as optimizing their WINE environments. The below sections include a selection of the most popular.
ko: WINE의 기본 설치에는 `winecfg`에 GUI 구성 도구가 함께 제공되지만, 이 도구의 주된 목적은 기존 WINE 접두사를 엄격하게 구성하는 것입니다. 그러나 애플리케이션의 초기 설치와 WINE 환경 최적화에 도움이 되는 고급 애플리케이션이 있습니다. 아래 섹션에는 가장 인기 있는 몇 가지가 포함되어 있습니다.
ru: Хотя базовая установка WINE включает графический инструмент настройки `winecfg`, его основное назначение строго ограничивается конфигурацией существующего префикса WINE. Однако существуют более продвинутые приложения, которые помогают не только в первоначальной установке программ, но и в оптимизации их окружения WINE. В следующих разделах представлен выбор наиболее популярных из них.

source: The `winetricks` tool is a cross-platform, general purpose helper program for WINE. It is not developed by the WINE project proper, but rather maintained on https://github.com/Winetricks/winetricks[Github] by a group of contributors. It contains some automated "recipes" for getting common applications to work on WINE, both by optimizing the settings as well as acquiring some DLL libraries automatically.
ko: `winetricks` 도구는 WINE을 위한 크로스 플랫폼 범용 도우미 프로그램입니다. 이 도구는 WINE 프로젝트에서 직접 개발한 것이 아니라 여러 기여자 그룹이 https://github.com/Winetricks/winetricks[Github]에서 유지 관리하고 있습니다. 이 도구에는 설정을 최적화하고 일부 DLL 라이브러리를 자동으로 가져와서 일반적인 애플리케이션이 WINE에서 작동하도록 하는 몇 가지 자동화된 ‘레시피’가 포함되어 있습니다.

source: Installing winetricks
ko: winetricks 설치하기
ru: Установка winetricks

source: To install `winetricks` on a FreeBSD using binary packages, use the following commands (note `winetricks` requires either the i386-wine or i386-wine-devel package, and is therefore not installed automatically with other dependencies):
ko: 바이너리 패키지를 사용하여 FreeBSD에 `winetricks`를 설치하려면 다음 명령을 사용합니다(`winetricks`에는 i386-wine 또는 i386-wine-devel 패키지가 필요하나, 다른 종속성 패키지와 함께 자동으로 설치되지 않음에 유의하세요):
ru: Для установки `winetricks` в FreeBSD с использованием бинарных пакетов выполните следующие команды (обратите внимание, что `winetricks` требует наличия пакета i386-wine или i386-wine-devel и поэтому не устанавливается автоматически с другими зависимостями):

source: To compile it from source, issue the following in the terminal:
ko: 소스에서 컴파일하려면 터미널에서 다음을 실행합니다:
ru: Чтобы скомпилировать его из исходного кода, выполните следующую команду в терминале:

source: If a manual installation is required, refer to the https://github.com/Winetricks/winetricks[Github] account for instructions.
ko: 수동 설치가 필요한 경우 https://github.com/Winetricks/winetricks[Github]에서 지침을 참조하세요.
ru: Если требуется ручная установка, обратитесь к https://github.com/Winetricks/winetricks[аккаунту на Github] для получения инструкций.

source: Using winetricks
ko: winetricks 사용하기
ru: Использование winetricks

source: Run `winetricks` with the following command:
ko: 다음 명령으로 `winetricks`를 실행하세요:
ru: Выполните `winetricks` следующей командой:

source: Note: this should be in a 32-bit prefix to run `winetricks`. Launching `winetricks` displays a window with a number of choices, as follows:
ko: 참고: `winetricks`를 실행하려면 32비트 접두사를 입력해야 합니다. `winetricks`를 실행하면 다음과 같이 여러 가지 선택 항목이 있는 창이 표시됩니다:
ru: Примечание: для запуска `winetricks` требуется 32-битный префикс. При запуске `winetricks` отображается окно с несколькими вариантами выбора, как показано ниже:

source: Selecting either _Install an application_, _Install a benchmark_, or _Install a game_ shows a list with supported options, such as the one below for applications:
ko: _Install an application_, _Install a benchmark_또는 _Install a game_를 선택하면 아래 애플리케이션의 경우와 같이 지원되는 옵션이 포함된 목록이 표시됩니다:
ru: Выбор любого из пунктов _Установить приложение_, _Установить тест производительности_ или _Установить игру_ отображает список доступных вариантов, например, такой, как показанный ниже список приложений:

source: Selecting one or more items and clicking _OK_ will start their installation process(es). Initially, some messages that appear to be errors may show up, but they're actually informational alerts as `winetricks` configures the WINE environment to get around known issues for the application:
ko: 하나 이상의 항목을 선택하고 _OK_를 클릭하면 해당 설치 프로세스가 시작됩니다. 처음에는 오류로 보이는 일부 메시지가 표시될 수 있지만, 실제로는 `winetricks`가 애플리케이션의 알려진 문제를 해결하기 위해 WINE 환경을 구성하는 과정에서 나타나는 정보 경고입니다:
ru: Выбор одного или нескольких элементов и нажатие _OK_ запустит процесс(ы) их установки. Вначале могут появиться сообщения, которые выглядят как ошибки, но на самом деле это информационные предупреждения, так как `winetricks` настраивает среду WINE для обхода известных проблем приложения:

source: Once these are circumvented, the actual installer for the application will be run:
ko: 이 과정의 우회가 끝나면 애플리케이션의 실제 인스톨러가 실행됩니다:
ru: После обхода этих препятствий будет запущен настоящий установщик приложения:

source: Once the installation completes, the new Windows application should be available from the desktop environment's standard menu (shown in the screenshot below for the LXQT desktop environment):
ko: 설치가 완료되면 데스크톱 환경의 표준 메뉴에서 새 Windows 애플리케이션을 사용할 수 있어야 합니다(아래 스크린샷은 LXQT 데스크톱 환경의 경우):
ru: После завершения установки новое приложение Windows должно быть доступно в стандартном меню среды рабочего стола (как показано на скриншоте ниже для среды рабочего стола LXQT):

source: In order to remove the application, run `winetricks` again, and select _Run an uninstaller_.
ko: 애플리케이션을 제거하려면 `winetricks`를 다시 실행한 후 _Run an uninstaller_을 선택하세요.
ru: Чтобы удалить приложение, снова запустите `winetricks` и выберите _Запустить удаление инсталляции (Run an uninstaller)_.

source: A Windows(R)-style dialog will appear with a list of installed programs and components. Select the application to be removed, then click the _Modify/Remove_ button.
ko: 설치된 프로그램 및 구성 요소 목록과 함께 Windows(R) 스타일의 대화 상자가 나타납니다. 제거할 애플리케이션을 선택한 다음 _Modify/Remove_ 버튼을 클릭합니다.
ru: Появится диалоговое окно в стиле Windows(R) со списком установленных программ и компонентов. Выберите приложение для удаления и нажмите кнопку _Изменить/Удалить (Modify/Remove)_.

source: This will run the applications built-in installer, which should also have the option to uninstall.
ko: 이렇게 하면 애플리케이션 기본 제공 설치 프로그램이 실행되며, 제거 옵션도 나타납니다.
ru: Это запустит встроенный установщик приложения, который также должен иметь возможность удаления.

source: Homura is an application similar to `winetricks`, although it was inspired by the https://lutris.net/[Lutris] gaming system for Linux. But while it is focused on games, there are also non-gaming applications available for install through Homura.
ko: 호무라는 `winetricks`와 유사한 애플리케이션이지만, 리눅스용 https://lutris.net/[Lutris] 게임 시스템에서 영감을 얻었습니다. 하지만 게임에 초점을 맞추고 있지만, 호무라를 통해 설치할 수 있는 비게임 애플리케이션도 있습니다.

source: Installing Homura
ko: 호무라 설치하기

source: To install Homura's binary package, issue the following command:
ko: 호무라의 바이너리 패키지를 설치하려면 다음 명령을 실행합니다:

source: Homura is available in the FreeBSD Ports system. However, than the _emulators_ section of Ports or binary packages, look for it in the _games_ section.
ko: 호무라는 FreeBSD 포트 시스템에서 설치할 수 있습니다. 그러나 포트나 바이너리 패키지의 _emulators_ 섹션이 아닌 _games_ 섹션에서 찾아보세요.

source: Using Homura
ko: 호무라 사용하기

source: Homura's usage is quite similar to that of `winetricks`. When using it for the first time, launch it from the command line (or a desktop environment runner applet) with:
ko: 호무라의 사용법은 `winetricks`와 매우 유사합니다. 처음 사용할 때는 명령줄(또는 데스크톱 환경 런처 애플릿)에서 다음과 같이 실행하세요:

source: This should result in a friendly welcome message. Click _OK_ to continue.
ko: 그러면 친절한 환영 메시지가 표시됩니다. 계속하려면 _OK_을 클릭합니다.
ru: Должно появиться дружественное приветственное сообщение. Нажмите _OK_ для продолжения.

source: The program will also offer to place a link in the application menu of compatible environments:
ko: 또한 이 프로그램은 호환되는 환경의 애플리케이션 메뉴에 링크를 배치할 수도 있습니다:
ru: Программа также предложит разместить ссылку в меню приложений совместимых сред:

source: Depending on the setup of the FreeBSD machine, Homura may display a message urging the install of native graphics drivers.
ko: FreeBSD 머신의 설정에 따라 Homura는 기본 그래픽 드라이버 설치를 요청하는 메시지를 표시할 수 있습니다.

source: The application's window should then appear, which amounts to a "main menu" with all its options. Many of the items are the same as `winetricks`, although Homura offers some additional, helpful options such as opening its data folder (_Open Homura Folder_) or running a specified program (_Run a executable in prefix_).
ko: 그러면 모든 옵션이 있는 “메인 메뉴”에 해당하는 애플리케이션 창이 나타납니다. 대부분의 항목은 `winetricks`과 동일하지만, 호무라는 데이터 폴더 열기(_Open Homura Folder_) 또는 지정된 프로그램 실행(_Run a executable in prefix_)과 같은 몇 가지 유용한 추가 옵션을 제공합니다.

source: To select one of Homura's supported applications to install, select _Installation_, and click _OK_. This will display a list of applications Homura can install automatically. Select one, and click _OK_ to start the process.
ko: 호무라가 지원하는 애플리케이션 중 하나를 선택하여 설치하려면 _Installation_를 선택한 후 _OK_을 클릭합니다. 그러면 호무라가 자동으로 설치할 수 있는 애플리케이션 목록이 표시됩니다. 하나를 선택하고 _OK_를 클릭하여 프로세스를 시작합니다.

source: As a first step Homura will download the selected program. A notification may appear in supported desktop environments.
ko: 첫 번째 단계로 호무라가 선택한 프로그램을 다운로드합니다. 지원되는 데스크톱 환경에서는 알림이 표시될 수 있습니다.

source: The program will also create a new prefix for the application. A standard WINE dialog with this message will display.
ko: 이 프로그램은 응용 프로그램의 새 접두사도 생성합니다. 이 메시지가 포함된 표준 WINE 대화 상자가 표시됩니다.
ru: Программа также создаст новый префикс для приложения. Появится стандартное диалоговое окно WINE с этим сообщением.

source: Next, Homura will install any prerequisites for the selected program. This may involve downloading and extracting a fair number of files, the details of which will show in dialogs.
ko: 다음으로 호무라는 선택한 프로그램에 대한 전제 조건을 설치합니다. 여기에는 상당한 수의 파일 다운로드 및 압축 풀기가 포함될 수 있으며, 자세한 내용은 대화 상자에 표시됩니다.

source: Downloaded packages are automatically opened and run as required.
ko: 다운로드한 패키지는 필요에 따라 자동으로 열리고 실행됩니다.
ru: Загруженные пакеты автоматически открываются и запускаются по мере необходимости.

source: The installation may end with a simple desktop notification or message in the terminal, depending on how Homura was launched. But in either case Homura should return to the main screen. To confirm the installation was successful, select _Launcher_, and click _OK_.
ko: 호무라를 실행한 방법에 따라 설치가 터미널의 간단한 데스크톱 알림 또는 메시지로 끝날 수 있습니다. 그러나 어떤 경우든 호무라는 메인 화면으로 돌아와야 합니다. 설치가 성공적으로 완료되었는지 확인하려면 _Launcher_를 선택하고 _OK_을 클릭합니다.

source: This will display a list of installed applications.
ko: 설치된 애플리케이션 목록이 표시됩니다.
ru: Это выведет список установленных приложений.

source: To run the new program, select it from the list, and click _OK_. To uninstall the application, select _Uninstallation_ from the main screen, which will display a similar list. Select the program to be removed, and click _OK_.
ko: 새 프로그램을 실행하려면 목록에서 해당 프로그램을 선택하고 _OK_를 클릭합니다. 애플리케이션을 제거하려면 메인 화면에서 _Uninstallation_을 선택하면 비슷한 목록이 표시됩니다. 제거할 프로그램을 선택하고 _OK_를 클릭합니다.
ru: Чтобы запустить новую программу, выберите её из списка и нажмите _OK_. Для удаления приложения выберите пункт _Удаление_ на главном экране, после чего отобразится аналогичный список. Выберите программу для удаления и нажмите _OK_.

source: Running Multiple Management GUIs
ko: 다중 관리 GUI 실행하기
ru: Запуск нескольких графических интерфейсов управления

source: it is worth noting that the above solutions are not mutually exclusive. it is perfectly acceptable, even advantageous, to have both installed at the same time, as they support a different set of programs.
ko: 위의 솔루션은 상호 배타적이지 않으며, 서로 다른 프로그램 세트를 지원하므로 두 솔루션을 동시에 설치하는 것이 완벽하게 허용되고 심지어 유리할 수도 있다는 점에 유의할 필요가 있습니다.
ru: Стоит отметить, что приведенные выше решения не являются взаимоисключающими. Вполне допустимо и даже выгодно иметь оба пакета установленными одновременно, так как они поддерживают разные наборы программ.
