Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wayland/_index.po
Languages: ko, ru

source: The compositor should now start and display a background image along with a menu bar at the top of the screen. Wayfire will attempt to list installed compatible applications for the desktop and present them in this drop-down menu; for example, if the XFCE-4 file manager is installed, it will show up in this drop-down menu. If a specific application is compatible and valuable enough for a keyboard shortcut, it may be mapped to a keyboard sequence using the [.filename]#wayfire.ini# configuration file. Wayfire also has a configuration tool named Wayfire Config Manager. It is located in the drop-down menu bar but may also be started through a terminal by issuing the following command:
ko: 이제 컴포지터가 시작되고 화면 상단에 메뉴 모음과 함께 배경 이미지가 표시됩니다. Wayfire는 데스크톱에 설치된 호환 가능한 애플리케이션을 나열하여 이 드롭다운 메뉴에 표시하려고 시도합니다(예: XFCE-4 파일 관리자가 설치된 경우 이 드롭다운 메뉴에 표시됨). 특정 애플리케이션이 키보드 단축키와 호환되고 충분히 가치 있는 경우, [.filename]#wayfire.ini# 구성 파일을 사용하여 키보드 시퀀스에 매핑할 수 있습니다. Wayfire에는 Wayfire Config Manager라는 구성 도구도 있습니다. 이 도구는 드롭다운 메뉴 모음에 있지만 터미널을 통해 다음 명령을 실행하여 시작할 수도 있습니다:
ru: Теперь композитор должен запуститься и отобразить фоновое изображение вместе с панелью меню в верхней части экрана. Wayfire попытается перечислить установленные совместимые приложения для рабочего стола и отобразит их в этом выпадающем меню; например, если установлен файловый менеджер XFCE-4, он появится в этом меню. Если конкретное приложение совместимо и достаточно важно для назначения горячей клавиши, его можно привязать к комбинации клавиш с помощью конфигурационного файла [.filename]#wayfire.ini#. Wayfire также имеет инструмент настройки под названием Wayfire Config Manager. Он доступен в выпадающем меню, но его также можно запустить через терминал, выполнив следующую команду:

source: Various Wayfire configuration options, including the composite special effects, maybe enabled, disabled, or configured through this application. In addition, for a more user-friendly experience, a background manager, panel, and docking application may be enabled in the configuration file:
ko: 합성 특수 효과를 포함한 다양한 Wayfire 구성 옵션은 이 애플리케이션을 통해 활성화, 비활성화 또는 구성할 수 있습니다. 또한 보다 사용자 친화적인 환경을 위해 구성 파일에서 백그라운드 관리자, 패널 및 도킹 애플리케이션을 활성화할 수 있습니다:
ru: Различные параметры конфигурации Wayfire, включая специальные эффекты композитора, могут быть включены, отключены или настроены через это приложение. Кроме того, для более удобного взаимодействия, в конфигурационном файле могут быть активированы менеджер фона, панель и док-приложение:

source: Changes made through `wcm` will overwrite custom changes in the [.filename]#wayfire.ini# configuration file. The [.filename]#wayfire.ini# file is highly recommended to be backed up so any essential changes may be restored.
ko: `wcm`을 통해 변경한 내용은 [.filename]#wayfire.ini# 구성 파일을 덮어씁니다. 필수 변경 사항을 복원할 수 있도록 [.filename]#wayfire.ini# 파일을 백업하는 것을 적극 권장합니다.
ru: Изменения, внесенные через `wcm`, перезапишут пользовательские настройки в конфигурационном файле [.filename]#wayfire.ini#. Настоятельно рекомендуется создать резервную копию файла [.filename]#wayfire.ini#, чтобы можно было восстановить важные изменения.

source: Finally, the default launcher listed in the [.filename]#wayfire.ini# is package:x11/wf-shell[] which may be replaced with other panels if desired by the user.
ko: 마지막으로 [.filename]#wayfire.ini#에 나열된 기본 런처는 package:x11/wf-shell[]이며, 사용자가 원하는 경우 다른 패널로 대체할 수 있습니다.
ru: Наконец, стандартный лаунчер, указанный в [.filename]#wayfire.ini#, — это package:x11/wf-shell[], который может быть заменён другими панелями по желанию пользователя.

source: The Hikari Compositor
ko: Hikari 컴포지터
ru: Композитор Hikari

source: The Hikari compositor uses several concepts centered around productivity, such as sheets, workspaces, and more. In that way, it resembles a tiling window manager. Breaking this down, the compositor starts with a single workspace, which is similar to virtual desktops. Hikari uses a single workspace or virtual desktop for user interaction. The workspace is made up of several views, which are the working windows in the compositor grouped as either sheets or groups. Both sheets and groups are made up of a collection of views; again, the windows that are grouped together. When switching between sheets or groups, the active sheet or group will become known collectively as the workspace. The manual page will break this down into more information on the functions of each but for this document, just consider a single workspace utilizing a single sheet. Hikari installation will comprise of a single package, package:x11-wm/hikari[], and a terminal emulator `alacritty`:
ko: Hikari 컴포지터는 시트, 작업 공간 등 생산성을 중심으로 한 몇 가지 개념을 사용합니다. 그런 면에서 타일링 창 관리자와 비슷합니다. 이를 세분화하면 컴포지터는 가상 데스크톱과 유사한 단일 작업 공간에서 시작됩니다. Hikari는 사용자 상호 작용을 위해 단일 작업 공간 또는 가상 데스크톱을 사용합니다. 작업 공간은 시트 또는 그룹으로 그룹화된 컴포지터의 다양한 뷰로 구성됩니다. 시트와 그룹은 모두 보기 모음으로 구성되며, 다시 한 번 그룹화된 창으로 구성됩니다. 시트 또는 그룹 간에 전환할 때 활성 시트 또는 그룹을 통칭하여 작업 공간으로 표시됩니다. 설명서 페이지에서 각 기능에 대해 자세히 설명하지만 이 문서에서는 단일 시트를 사용하는 단일 작업 공간을 고려하십시오. Hikari 설치는 단일 패키지인 package:x11-wm/hikari[] 및 터미널 에뮬레이터 `alacritty`로 구성됩니다:
ru: Композитор Hikari использует несколько концепций, ориентированных на продуктивность, такие как листы (sheets), рабочие пространства (workspaces) и другие. В этом отношении он напоминает тайловый оконный менеджер. Если разбирать подробнее, композитор начинается с одного рабочего пространства, которое аналогично виртуальным рабочим столам. Hikari использует одно рабочее пространство (или виртуальный рабочий стол) для взаимодействия с пользователем. Рабочее пространство состоит из нескольких представлений (views) — это рабочие окна в композиторе, сгруппированные либо в листы (sheets), либо в группы (groups). И листы, и группы состоят из набора представлений — то есть окон, объединённых вместе. При переключении между листами или группами активный лист или группа становятся рабочим пространством. В руководстве (man-странице) эти функции описаны более подробно, но в данном документе достаточно рассматривать одно рабочее пространство с одним листом. Установка Hikari включает один пакет package:x11-wm/hikari[] и терминальный эмулятор `alacritty`:

source: Other shells, such as `kitty` or the Plasma `Terminal`, will function under Wayland. Users should experiment with their favorite terminal editor to validate compatibility.
ko: `kitty`나 Plasma의 `Terminal`과 같은 다른 셸은 wayland에서 작동합니다. 사용자는 선호하는 터미널 편집기로 실험하여 호환성을 확인해야 합니다.
ru: Другие оболочки, такие как `kitty` или `Terminal` в Plasma, будут работать под Wayland. Пользователям стоит поэкспериментировать с предпочитаемым терминальным редактором, чтобы проверить совместимость.

source: Hikari uses a configuration file, [.filename]#hikari.conf#, which could either be placed in the XDG_RUNTIME_DIR or specified on startup using the `-c` parameter. An autostart configuration file is not required but may make the migration to this compositor a little easier. Beginning the configuration is to create the Hikari configuration directory and copy over the configuration file for editing:
ko: Hikari는 구성 파일인 [.filename]#hikari.conf#을 사용하는데, 이 파일은 XDG_RUNTIME_DIR에 위치하거나 시작 시 `-c` 파라미터를 사용하여 지정할 수 있습니다. 자동 시작 구성 파일은 필수는 아니지만 이 컴포지터로의 마이그레이션을 조금 더 쉽게 할 수 있습니다. 구성의 시작은 Hikari 구성 디렉터리를 생성하고 편집할 구성 파일을 복사하는 것입니다:
ru: Hikari использует файл конфигурации [.filename]#hikari.conf#, который может быть размещен либо в XDG_RUNTIME_DIR, либо указан при запуске с помощью параметра `-c`. Файл конфигурации автозапуска не обязателен, но может немного упростить переход на этот композитор. Начало настройки заключается в создании каталога конфигурации Hikari и копировании файла конфигурации для редактирования:

source: The configuration is broken out into various stanzas such as ui, outputs, layouts, and more. For most users, the defaults will function fine; however, some important changes should be made. For example, the $TERMINAL variable is normally not set within the user's environment. Changing this variable or altering the [.filename]#hikari.conf# file to read:
ko: 구성은 UI, 출력, 레이아웃 등과 같은 다양한 스탠자로 나뉩니다. 대부분의 사용자에게는 기본값이 잘 작동하지만 몇 가지 중요한 변경이 필요합니다. 예를 들어, $TERMINAL 변수는 일반적으로 사용자 환경 내에서 설정되지 않습니다. 이 변수를 변경하거나 [.filename]#hikari.conf# 파일을 읽을 수 있도록 변경하세요:
ru: Конфигурация разбита на различные разделы, такие как `ui`, `outputs`, `layouts` и другие. Для большинства пользователей значений по умолчанию будет достаточно, однако некоторые важные изменения всё же стоит внести. Например, переменная `$TERMINAL` обычно не установлена в окружении пользователя. Измените эту переменную или отредактируйте файл [.filename]#hikari.conf#, указав:

source: Will launch the `alacritty` terminal using the bound key press. While going through the configuration file, it should be noted that the capital letters are used to map keys out for the user. For example, the kbd:[L] key for starting the terminal kbd:[L+Return] is actually the previously discussed super key or Windows logo key. Therefore, holding the kbd:[L/super/Windows] key and pressing kbd:[Enter] will open the specified terminal emulator with the default configuration. Mapping other keys to applications require an action definition to be created. For this, the action item should be listed in the actions stanza, for example:
ko: 바인딩된 키 누름을 사용하여 `alacritty` 터미널을 실행합니다. 구성 파일을 살펴보는 동안 대문자가 사용자를 위해 키를 매핑하는 데 사용된다는 점에 유의해야 합니다. 예를 들어, 터미널을 시작하기 위한 kbd:[L] 키는 실제로는 앞서 설명한 슈퍼 키 또는 Windows 로고 키입니다. 따라서 kbd:[L/super/Windows] 키를 누른 상태에서 kbd:[Enter]를 누르면 기본 구성으로 지정된 터미널 에뮬레이터가 열립니다. 다른 키를 애플리케이션에 매핑하려면 동작 정의를 생성해야 합니다. 이를 위해 작업 항목은 예를 들어 작업 스탠자에 나열되어야 합니다:
ru: Запустит терминал `alacritty` при нажатии связанной клавиши. При изучении конфигурационного файла следует обратить внимание, что заглавные буквы используются для сопоставления клавиш пользователю. Например, клавиша kbd:[L] для запуска терминала kbd:[L+Return] на самом деле является ранее упомянутой клавишей super или клавишей с логотипом Windows. Таким образом, удерживая kbd:[L/super/Windows] и нажимая kbd:[Enter], вы откроете указанный эмулятор терминала с конфигурацией по умолчанию. Для сопоставления других клавиш приложениям необходимо создать определение действия. Для этого пункт действия должен быть указан в разделе actions, например:

source: Then an action may be mapped under the keyboard stanza, which is defined within the bindings stanza:
ko: 그런 다음 바인딩 스탠자 내에 정의된 키보드 스탠자 아래에 액션을 매핑할 수 있습니다:
ru: Затем действие может быть отображено в разделе `keyboard`, который определен внутри раздела `bindings`:

source: After Hikari is restarted, holding the Windows logo button and pressing the kbd:[b] key on the keyboard will start the web browser. The compositor does not have a menu bar, and it is recommended the user set up, at minimal, a terminal emulator before migration. The manual page contains a great deal of documentation it should be read before performing a full migration. Another positive aspect about Hikari is that, while migrating to the compositor, Hikari can be started in the Plasma and GNOME desktop environments, allowing for a test-drive before completely migrating.
ko: Hikari가 재시작된 후 Windows 로고 버튼을 누른 상태에서 키보드의 kbd:[b] 키를 누르면 웹 브라우저가 시작됩니다. 컴포저에는 메뉴 표시줄이 없으므로 마이그레이션하기 전에 터미널 에뮬레이터를 최소한으로 설정하는 것이 좋습니다. 설명서 페이지에는 전체 마이그레이션을 수행하기 전에 읽어야 할 많은 문서가 포함되어 있습니다. Hikari의 또 다른 긍정적인 측면은 컴포지터로 마이그레이션하는 동안 Plasma 및 GNOME 데스크톱 환경에서 Hikari를 시작할 수 있어 완전히 마이그레이션하기 전에 테스트할 수 있다는 점입니다.
ru: После перезапуска Hikari удержание кнопки с логотипом Windows и нажатие клавиши kbd:[b] на клавиатуре запустит веб-браузер. Композитор не имеет строки меню, и рекомендуется настроить, как минимум, терминальный эмулятор перед миграцией. Руководство содержит множество документации, его следует прочитать перед полной миграцией. Ещё один положительный аспект Hikari заключается в том, что при переходе на этот композитор его можно запускать в средах рабочего стола Plasma и GNOME, что позволяет опробовать его перед полной миграцией.

source: Locking the screen in Hikari is easy because a default [.filename]#pam.d# configuration file and unlock utility are bundled with the package. The key binding for locking the screen is kbd:[L] (Windows logo key)+ kbd:[Shift] + kbd:[Backspace]. It should be noted that all views not marked public will be hidden. These views will never accept input when locked but beware of sensitive information being visible. For some users, it may be easier to migrate to a different screen locking utility such as swaylock-effects, discussed in this section. To start Hikari, use the following command:
ko: Hikari에서 화면을 잠그는 것은 기본 [.filename]#pam.d# 구성 파일과 잠금 해제 유틸리티가 패키지에 번들로 제공되므로 쉽습니다. 화면 잠금을 위한 키 바인딩은 kbd:[L](Windows 로고 키)+ kbd:[Shift] + kbd:[Backspace]입니다. 공개로 표시되지 않은 모든 보기는 숨겨집니다. 이러한 보기는 잠긴 상태에서는 입력을 허용하지 않으므로 민감한 정보가 표시되지 않도록 주의하세요. 일부 사용자의 경우 이 섹션에서 설명하는 swaylock-effects와 같은 다른 화면 잠금 유틸리티로 마이그레이션하는 것이 더 쉬울 수 있습니다. Hikari를 시작하려면 다음 명령을 사용합니다:
ru: Заблокировать экран в Hikari просто, так как пакет включает файл конфигурации [.filename]#pam.d# и утилиту разблокировки. Сочетание клавиш для блокировки экрана — kbd:[L] (клавиша с логотипом Windows)+ kbd:[Shift] + kbd:[Backspace]. Следует отметить, что все представления, не помеченные как публичные, будут скрыты. Эти представления не будут принимать ввод, когда экран заблокирован, но будьте осторожны с отображением конфиденциальной информации. Некоторым пользователям может быть проще перейти на другую утилиту блокировки экрана, например swaylock-effects, которая обсуждается в этом разделе. Чтобы запустить Hikari, используйте следующую команду:

source: The Sway Compositor
ko: Sway 컴포지터
ru: Композитор Sway

source: The Sway compositor is a tiling compositor that attempts to replace the i3 windows manager. It should work with the user's current i3 configuration; however, new features may require some additional setup.
ru: Композитор Sway — это тайловый композитор, предназначенный для замены оконного менеджера i3. Он должен работать с текущей конфигурацией i3 пользователя, однако для использования новых функций может потребоваться дополнительная настройка.

source: Before starting the Sway installation, ensure that a graphics card (GPU) is installed and configured correctly. Refer to the section crossref:x11[x-graphic-card-drivers,drivers for your graphics hardware] for guidance. This step is essential for the Sway compositor to function properly.
ru: Перед установкой Sway убедитесь, что графическая карта (GPU) установлена и настроена правильно. Обратитесь к разделу crossref:x11[x-graphic-card-drivers,драйверы для вашего графического оборудования] для получения инструкций. Этот шаг необходим для корректной работы композитора Sway.

source: In the forthcoming examples, a fresh installation without migrating any i3 configuration will be assumed. To install Sway and valuable components, issue the following command as the root user:
ru: В следующих примерах предполагается новая установка без переноса каких-либо конфигураций i3. Для установки Sway и полезных компонентов выполните следующую команду от имени пользователя root:

source: For a basic configuration file, issue the following commands and then edit the configuration file after it is copied:
ko: 기본 구성 파일의 경우 다음 명령을 실행한 다음 구성 파일을 복사한 후 편집합니다:
ru: Для базового файла конфигурации выполните следующие команды, а затем отредактируйте файл конфигурации после его копирования:

source: The base configuration file has many defaults, which will be fine for most users. Several important changes should be made like the following:
ko: 기본 구성 파일에는 대부분의 사용자에게 적합한 기본값이 많이 포함되어 있습니다. 다음과 같이 몇 가지 중요한 사항을 변경해야 합니다:
ru: Базовый файл конфигурации содержит множество настроек по умолчанию, которые подойдут большинству пользователей. Однако следует внести несколько важных изменений, таких как:

source: In the previous example, the `xkb` rules for man:evdev[4] events are loaded, and the $mod key is set to the Windows logo key for the key bindings. Next, the terminal emulator was set to be `alacritty`, and a screen lock command was defined; more on this later. The output keyword, the mode, the position, a background wallpaper, and Sway is also told to stretch this wallpaper to fill out the screen. Finally, `swayidle` is set to daemonize and lock the screen after a timeout of 300 seconds, placing the screen or monitor into sleep mode after 600 seconds. The locked background color of 000000, which is black, is also defined here. Using swaylock-effects, a clock may also be displayed with the `--clock` parameter. See the manual page for more options. The man:sway-output[5] manual page should also be reviewed; it includes a great deal of information on customing the output options available.
ru: В предыдущем примере загружаются правила `xkb` для событий man:evdev[4], а клавиша $mod устанавливается в значении логотипа Windows для привязки клавиш. Далее эмулятор терминала был установлен как `alacritty`, и определена команда блокировки экрана; подробнее об этом позже. Ключевое слово `output`, режим, позиция, фоновое изображение, а также Sway указано растягивать это изображение для заполнения экрана. Наконец, `swayidle` настроен на работу в режиме демона и блокировку экрана после таймаута в 300 секунд, переводя экран или монитор в режим сна после 600 секунд. Здесь также определён цвет заблокированного фона 000000, что соответствует чёрному. С использованием swaylock-effects можно также отображать часы с параметром `--clock`. Дополнительные параметры см. на странице руководства. Также следует ознакомиться с man:sway-output[5]; она содержит множество информации по настройке доступных параметров вывода.

source: While in Sway, to bring up a menu of applications, hold the Windows logo key (mod) and press the kbd:[d] key. The menu may be navigated using the arrow keys on the keyboard. There is also a method to manipulate the layout of the bar and add a tray; read the man:sway-bar[5] manual page for more information. The default configuration adds a date and time to the upper right-hand corner. See the `Bar` stanza in the configuration file for an example. By default, the configuration does not include locking the screen outside of the example above, enabling a lockout timer. Creating a lock key binding requires the following line to the `Key bindings` section:
ko: Sway에서 애플리케이션 메뉴를 불러오려면 Windows 로고 키(mod)를 누른 상태에서 kbd:[d] 키를 누릅니다. 메뉴는 키보드의 화살표 키를 사용하여 탐색할 수 있습니다. 바의 레이아웃을 조작하고 트레이를 추가하는 방법도 있습니다. 자세한 내용은 man:sway-bar[5] 매뉴얼 페이지를 참조하세요. 기본 구성은 오른쪽 상단에 날짜와 시간을 추가합니다. 예제는 구성 파일의 `Bar` 스탠자를 참조하세요. 기본적으로 구성에는 위의 예시 외에 화면 잠그기, 잠금 타이머 활성화가 포함되지 않습니다. 잠금 키 바인딩을 생성하려면 `Key bindings` 섹션에 다음 줄을 추가해야 합니다:
ru: В Sway, чтобы вызвать меню приложений, удерживайте клавишу с логотипом Windows (mod) и нажмите kbd:[d]. Меню можно перемещаться с помощью клавиш со стрелками на клавиатуре. Также есть способ изменить расположение панели и добавить трей; подробнее см. на man:sway-bar[5]. В стандартной конфигурации в верхнем правом углу отображается дата и время. Пример можно найти в разделе `Bar` конфигурационного файла. По умолчанию конфигурация не включает блокировку экрана, за исключением приведённого выше примера, а также таймер блокировки. Для создания привязки клавиши блокировки добавьте следующую строку в раздел `Key bindings`:

source: Now the screen may be locked using the combination of holding the Windows logo key, pressing and holding shift, and finally pressing return. When Sway is installed, whether from a package or the FreeBSD Ports Collection, a default file for [.filename]#pam.d# was installed. The default configuration should be acceptable for most users, but more advanced options are available. Read through the PAM documentation for more information.
ko: 이제 Windows 로고 키를 누른 상태에서 Shift 키를 길게 누른 다음 마지막으로 Return 키를 누르는 조합으로 화면을 잠글 수 있습니다. 패키지로 설치하든 FreeBSD 포트 컬렉션으로 설치하든, Sway가 설치되면 [.filename]#pam.d#의 기본 파일이 설치됩니다. 기본 구성은 대부분의 사용자에게 적합하지만 고급 옵션을 사용할 수 있습니다. 자세한 내용은 PAM 설명서를 읽어보세요.
ru: Теперь экран можно заблокировать с помощью комбинации: удерживая клавишу с логотипом Windows, нажать и удерживать Shift, а затем нажать Enter. При установке Sway, будь то из пакета или коллекции портов FreeBSD, устанавливается файл по умолчанию для [.filename]#pam.d#. Конфигурация по умолчанию подходит для большинства пользователей, но доступны и более продвинутые варианты. Для получения дополнительной информации ознакомьтесь с документацией PAM.

source: Finally, to exit Sway and return to the shell, hold the Windows logo key, the shift key, and press the kbd:[e] key. A prompt will be displayed with an option to exit Sway. During migration, Sway can be started through a terminal emulator on an X11 desktop such as Plasma. This makes testing different changes and key bindings a little easier prior to fully migrating to this compositor. To start Sway, issue the following command:
ko: 마지막으로 Sway를 종료하고 셸로 돌아가려면 Windows 로고 키와 Shift 키를 누른 상태에서 kbd:[e] 키를 누릅니다. Sway를 종료할 수 있는 항목이 있는 프롬프트가 표시됩니다. 마이그레이션하는 동안 Plasma와 같은 X11 데스크톱의 터미널 에뮬레이터를 통해 Sway를 시작할 수 있습니다. 이렇게 하면 이 컴포지터로 완전히 마이그레이션하기 전에 다양한 변경 사항과 키 바인딩을 좀 더 쉽게 테스트할 수 있습니다. Sway를 시작하려면 다음 명령을 실행합니다:
ru: Наконец, чтобы выйти из Sway и вернуться к оболочке, удерживайте клавишу с логотипом Windows, клавишу Shift и нажмите kbd:[e]. Появится запрос с возможностью выхода из Sway. Во время миграции Sway можно запустить через эмулятор терминала в X11-окружении, например, Plasma. Это упрощает тестирование различных изменений и сочетаний клавиш перед полным переходом на этот композитор. Чтобы запустить Sway, выполните следующую команду:

source: Using Xwayland
ko: Xwayland 사용하기
ru: Использование Xwayland

source: When installing Wayland, the `Xwayland` binary should have been installed unless Wayland was built without X11 support. If the [.filename]#/usr/local/bin/Xwayland# file does not exist, install it using the following command:
ko: Wayland를 설치할 때, X11을 지원하지 않는 Wayland를 빌드한 경우가 아니라면 `Xwayland` 바이너리가 설치되어 있어야 합니다. [.filename]#/usr/local/bin/Xwayland# 파일이 존재하지 않는 경우 다음 명령을 사용하여 설치하세요:
ru: При установке Wayland бинарный файл `Xwayland` должен быть установлен, если только Wayland не собран без поддержки X11. Если файл [.filename]#/usr/local/bin/Xwayland# отсутствует, установите его с помощью следующей команды:

source: The development version of Xwayland is recommended and was most likely installed with the Wayland package. Each compositor has a method of enabling or disabling this feature.
ko: Xwayland의 개발 버전이 권장되며 Wayland 패키지와 함께 설치되었을 가능성이 높습니다. 각 컴포지터에는 이 기능을 활성화 또는 비활성화하는 방법이 있습니다.
ru: Рекомендуется использовать разрабатываемую версию Xwayland, которая, скорее всего, была установлена вместе с пакетом Wayland. Каждый композитор имеет свой способ включения или отключения этой функции.

source: Once `Xwayland` has been installed, configure it within the chosen compositor. For Wayfire, the following line is required in the [.filename]#wayfire.ini# file:
ko: `Xwayland`가 설치되면 선택한 컴포지터 내에서 구성합니다. Wayfire의 경우 [.filename]#wayfire.ini# 파일에 다음 줄이 필요합니다:
ru: После установки `Xwayland` настройте его в выбранном композиторе. Для Wayfire в файле [.filename]#wayfire.ini# требуется следующая строка:

source: For the Sway compositor, `Xwayland` should be enabled by default. Even so, it is recommended to manually add a configuration line in the [.filename]#~/.config/sway/config# like the following:
ru: Для композитора Sway `Xwayland` должен быть включен по умолчанию. Тем не менее, рекомендуется вручную добавить строку конфигурации в файл [.filename]#~/.config/sway/config#, например, следующую:
