Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wayland/_index.po
Languages: ko, ru

source: This chapter describes how to install and configure Wayland and compositors on FreeBSD, which provides a graphical user environment
ko: 이 장에서는 그래픽 사용자 환경을 제공하는 FreeBSD에 wayland와 컴포지터를 설치하고 구성하는 방법을 설명합니다
ru: Эта глава описывает, как установить и настроить Wayland и композиторы на FreeBSD, что обеспечивает графическую пользовательскую среду

source: Part I. Getting Started
ko: 파트 I. 시작하기
ru: В начале

source: Chapter 6. Wayland
ko: 6장. Wayland
ru: Глава 6. Wayland

source: Wayland on FreeBSD
ko: FreeBSD의 wayland
ru: Wayland на FreeBSD

source: Synopsis
ru: Обзор

source: An installation of FreeBSD using bsdinstall does not automatically install a graphical user interface. This chapter describes how to select, install, and configure a Wayland compositor, which provides a graphical environment.
ru: Установка FreeBSD с помощью bsdinstall не включает автоматически графический интерфейс пользователя. В этой главе описано, как выбрать, установить и настроить композитор Wayland, который предоставляет графическую среду.

source: Before reading this chapter, you should:
ru: Прежде чем читать эту главу, вы должны:

source: Know how to install crossref:ports[ports,additional third-party software].
ru: Знать, как установить crossref:ports[ports,дополнительное стороннее программное обеспечение].

source: How to identify and configure crossref:x11[x-graphic-card-drivers,drivers for your graphics hardware].
ru: Как определить и настроить crossref:x11[x-graphic-card-drivers,драйверы для вашего графического оборудования].

source: After reading this chapter, you will know:
ru: Прочитав эту главу, вы будете знать:

source: How to configure FreeBSD to host a Wayland graphical environment.
ru: Как настроить FreeBSD для размещения графической среды Wayland.

source: How to install and configure a Wayland compositor.
ru: Как установить и настроить композитор Wayland.

source: How to run programs designed for the older X Window System.
ru: Как запускать программы, предназначенные для старой версии X Window System.

source: How to configure remote desktop access to a Wayland graphical environment.
ru: Как настроить удаленный доступ к графической среде Wayland.

source: Wayland Overview
ru: Обзор Wayland

source: Wayland is a communication protocol that can replace a display server such as Xorg. It differs from Xorg in several important ways. First, Wayland is only a protocol that acts as an intermediary between clients using a mechanism which removes the dependency on an X server. Xorg includes both the X11 protocol, used to run remote displays, and the X server, used to accept connections and display windows. Under Wayland, the compositor or window manager provides the display server instead of a traditional X server.
ru: Wayland — это коммуникационный протокол, который может заменить сервер дисплеев, такой как X.org. Он отличается от X.org несколькими важными способами. Во-первых, Wayland — это только протокол, который выступает в роли посредника между клиентами, используя механизм, который устраняет зависимость от X-сервера. X.org включает в себя как протокол X11, используемый для работы с удалёнными дисплеями, так и X-сервер, который принимает соединения и отображает окна. В случае с Wayland, композитор или оконный менеджер предоставляет сервер дисплеев вместо традиционного X-сервера.

source: Since Wayland is not an X server, traditional X screen connections will need to utilize other methods such as VNC or RDP for remote desktop management. Second, Wayland can manage composite communications between clients and a compositor as a separate entity which does not need to support the X protocols.
ko: Wayland는 X 서버가 아니므로 기존 X 화면 연결은 원격 데스크톱 관리를 위해 VNC 또는 RDP와 같은 다른 방법을 활용해야 합니다. 둘째, Wayland는 X 프로토콜을 지원할 필요가 없는 별도의 엔티티로서 클라이언트와 컴포지터 간의 컴포지트 통신을 관리할 수 있습니다.
ru: Поскольку Wayland не является X-сервером, для удалённого управления рабочим столом традиционные соединения с экраном X потребуют использования других методов, таких как VNC или RDP. Во-вторых, Wayland может управлять композитными взаимодействиями между клиентами и композитором как отдельная сущность, которой не требуется поддержка протоколов X.

source: Wayland is relatively new, and not all software has been updated to run natively without `Xwayland` support. Because Wayland does not provide the X server, and expects compositors to provide that support, X11 window managers that do not yet support Wayland will require that `Xwayland` is not started with the `-rootless` parameter. The `-rootless` parameter, when removed, will restore X11 window manager support.
ko: Wayland는 비교적 새롭고, 모든 소프트웨어가 `Xwayland` 지원 없이 실행되도록 업데이트된 것은 아닙니다. Wayland는 X 서버를 제공하지 않으며 컴포저가 해당 지원을 제공할 것으로 예상하기 때문에, 아직 Wayland를 지원하지 않는 X11 윈도우 관리자는 `-rootless` 매개 변수를 사용하여 `Xwayland`를 시작하지 않아야 합니다. `-rootless` 매개 변수를 제거하면 X11 창 관리자 지원이 복원됩니다.
ru: Wayland относительно нов, и не все программы были обновлены для нативной работы без поддержки `Xwayland`. Поскольку Wayland не предоставляет X-сервер, а ожидает, что композиторы обеспечат эту поддержку, оконные менеджеры X11, которые ещё не поддерживают Wayland, потребуют, чтобы `Xwayland` не запускался с параметром `-rootless`. Удаление параметра `-rootless` восстановит поддержку оконных менеджеров X11.

source: The current NVIDIA(R) driver should work with most wlroots compositors, but it may be a little unstable and not support all features at this time. Volunteers to help work on the NVIDIA(R) DRM are requested.
ru: Текущий драйвер NVIDIA(R) должен работать с большинством композиторов wlroots, но может быть немного нестабильным и не поддерживать все функции на данный момент. Требуются добровольцы для помощи в работе над NVIDIA(R) DRM.

source: Currently, a lot of software will function with minimal issues on Wayland, including Firefox. And a few desktops are also available, such as the Compiz Fusion replacement, known as Wayfire, and the i3 window manager replacement, Sway.
ko: 현재 Firefox를 포함한 많은 소프트웨어가 wayland에서 최소한의 문제만 일으키며 작동합니다. 또한 Wayfire로 알려진 Compiz Fusion 대체품과 i3 창 관리자 대체품인 Sway와 같은 몇 가지 데스크톱도 사용할 수 있습니다.
ru: В настоящее время множество программного обеспечения, включая Firefox, работает с минимальными проблемами в Wayland. Также доступны несколько окружений рабочего стола, например, замена Compiz Fusion под названием Wayfire и замена менеджера окон i3 — Sway.

source: As of May, 2021, plasma5-kwin does support Wayland on FreeBSD. To use Plasma under Wayland, use the `startplasma-wayland` parameter to `ck-launch-session` and tie in dbus with: `dbus-launch --exit-with-x11 ck-launch-session startplasma-wayland` to get it working.
ru: По состоянию на май 2021 года plasma5-kwin поддерживает Wayland в FreeBSD. Для использования Plasma под Wayland используйте параметр `startplasma-wayland` с `ck-launch-session` и подключите dbus следующим образом: `dbus-launch --exit-with-x11 ck-launch-session startplasma-wayland`, чтобы заставить это работать.

source: For compositors, a kernel supporting the man:evdev[4] driver must exist to utilize the keybinding functionality. This is built into the [.filename]#GENERIC# kernel by default; however, if it has been customized and man:evdev[4] support was stripped out, the man:evdev[4] module will need to be loaded. In addition, users of `Wayland` will need to be members of the `video` group. To quickly make this change, use the `pw` command:
ko: 컴포지터의 경우, 키 바인딩 기능을 활용하려면 man:evdev[4] 드라이버를 지원하는 커널이 존재해야 합니다. 이 기능은 기본적으로 [.filename]#GENERIC# 커널에 내장되어 있지만, 커스터마이징을 통해 man:evdev[4] 지원이 제거된 경우 man:evdev[4] 모듈을 로드해야 합니다. 또한 `Wayland` 사용자는 `video` 그룹의 구성원이어야 합니다. 이 변경을 빠르게 수행하려면 `pw` 명령을 사용합니다:
ru: Для композиторов необходимо наличие ядра с поддержкой драйвера man:evdev[4] для использования функциональности привязки клавиш. Он включён по умолчанию в ядро [.filename]#GENERIC#; однако, если ядро было изменено и поддержка man:evdev[4] была удалена, потребуется загрузить модуль man:evdev[4]. Кроме того, пользователям `Wayland` необходимо быть членами группы `video`. Чтобы быстро внести это изменение, используйте команду `pw`:

source: Installing Wayland is simple; there is not a great deal of configuration for the protocol itself. Most of the composition will depend on the chosen compositor. By installing `seatd` now, a step is skipped as part of the compositor installation and configuration as `seatd` is needed to provide non-root access to certain devices.
ko: Wayland 설치는 간단합니다. 프로토콜 자체에 대한 구성이 많지 않습니다. 대부분의 구성은 선택한 컴포지터에 따라 달라집니다. 지금 'seatd'를 설치하면 특정 장치에 비루트 액세스를 제공하기 위해 'seatd'가 필요하므로 컴포저 설치 및 구성 단계를 건너뛸 수 있습니다.
ru: Установка Wayland проста; сам протокол не требует значительной настройки. Большая часть композиции будет зависеть от выбранного композитора. Установив `seatd` сейчас, можно пропустить один шаг в процессе установки и настройки композитора, так как `seatd` необходим для предоставления непривилегированного доступа к некоторым устройствам.

source: All of the compositors described here should work with package:graphics/drm-kmod[] open source drivers; however, the NVIDIA(R) graphics cards may have issues when using the proprietary drivers. Begin by installing the following packages:
ru: Все описанные здесь композиторы должны работать с драйверами с открытым исходным кодом package:graphics/drm-kmod[]; однако видеокарты NVIDIA(R) могут иметь проблемы при использовании проприетарных драйверов. Для начала установите следующие пакеты:

source: Once the protocol and supporting packages have been installed, a compositor must create the user interface. Several compositors will be covered in the following sections. All compositors using Wayland will need a runtime directory defined in the environment. Since FreeBSD 14.1, this is created and defined automatically. For previous versions, this is achieved with the following command in the bourne shell:
ru: После установки протокола и необходимых пакетов, композитор должен создать пользовательский интерфейс. В следующих разделах будут рассмотрены несколько композиторов. Все композиторы, использующие Wayland, требуют наличия runtime-каталога, определённого в окружении. Начиная с FreeBSD 14.1, он создаётся и определяется автоматически. Для более ранних версий это можно сделать с помощью следующей команды в оболочке bourne:

source: It is important to note that most compositors will search the XDG_RUNTIME_DIR directory for the configuration files. In the examples included here, a parameter will be used to specify a configuration file in [.filename]#~/.config# to keep temporary files and configuration files separate. It is recommended that an alias be configured for each compositor to load the designated configuration file.
ko: 대부분의 컴포지터는 XDG_RUNTIME_DIR 디렉터리에서 설정 파일을 검색한다는 점에 유의해야 합니다. 여기에 포함된 예제에서는 임시 파일과 구성 파일을 분리하기 위해 [.filename]#~/.config#에 구성 파일을 지정하는 파라미터를 사용합니다. 각 컴포지터가 지정된 구성 파일을 로드하도록 별칭을 구성하는 것이 좋습니다.
ru: Важно отметить, что большинство композиторов ищут файлы конфигурации в каталоге `XDG_RUNTIME_DIR`. В приведённых здесь примерах будет использоваться параметр для указания файла конфигурации в [.filename]#~/.config#, чтобы разделить временные файлы и файлы конфигурации. Рекомендуется настроить псевдоним для каждого композитора, чтобы загружать указанный файл конфигурации.

source: It has been reported that ZFS users may experience issues with some Wayland clients because they need access to `posix_fallocate()` in the runtime directory. While the author could not reproduce this issue on their ZFS system, a recommended workaround is not to use ZFS for the runtime directory and instead use `tmpfs` for the [.filename]#/var/run# directory. In this case, the `tmpfs` file system is used for [.filename]#/var/run# and mounted through the command `mount -t tmpfs tmpfs /var/run` command and then make this change persist across reboots through [.filename]#/etc/fstab#. The XDG_RUNTIME_DIR environment variable could be configured to use [.filename]#/var/run/user/$UID# and avoid potential pitfalls with ZFS. Consider that scenario when reviewing the configuration examples in the following sections.
ko: ZFS 사용자는 런타임 디렉터리에서 `posix_fallocate()`에 액세스해야 하기 때문에 일부 Wayland 클라이언트에서 문제가 발생할 수 있다는 보고가 있었습니다. 작성자가 ZFS 시스템에서 이 문제를 재현할 수는 없었지만, 권장되는 해결 방법은 런타임 디렉터리에 ZFS를 사용하지 않고 대신 [.filename]#/var/run# 디렉터리에 `tmpfs`를 사용하는 것입니다. 이 경우, `tmpfs` 파일 시스템을 [.filename]#/var/run#에 사용하고 `mount -t tmpfs tmpfs /var/run` 명령을 통해 마운트한 다음, 재부팅 시에도 이 변경 사항이 [.filename]#/etc/fstab#을 통해 지속되도록 합니다. XDG_RUNTIME_DIR 환경 변수를 [.filename]#/var/run/user/$UID#를 사용하도록 구성하여 ZFS의 잠재적인 함정을 피할 수 있습니다. 다음 섹션의 구성 예제를 검토할 때 이 시나리오를 고려하세요.
ru: Сообщается, что пользователи ZFS могут столкнуться с проблемами при работе с некоторыми клиентами Wayland, так как им требуется доступ к `posix_fallocate()` в runtime-директории. Хотя автор не смог воспроизвести эту проблему на своей системе с ZFS, рекомендуемым решением является отказ от использования ZFS для runtime-директории и использование `tmpfs` для [.filename]#/var/run#. В этом случае файловая система `tmpfs` используется для [.filename]#/var/run# и монтируется командой `mount -t tmpfs tmpfs /var/run`, после чего это изменение можно сделать постоянным после перезагрузок через [.filename]#/etc/fstab#. Переменная окружения XDG_RUNTIME_DIR может быть настроена на использование [.filename]#/var/run/user/$UID#, чтобы избежать потенциальных проблем с ZFS. Учитывайте этот сценарий при изучении примеров конфигурации в следующих разделах.

source: The seatd daemon helps manage access to shared system devices for non-root users in compositors; this includes graphics cards. For traditional X11 managers, `seatd` is not needed, such as both Plasma and GNOME, but for the Wayland compositors discussed here, it will need enabled on the system and be running before starting a compositor environment. To enable and start the `seatd` daemon now, and on system initialization:
ko: seatd 데몬은 컴포지터에서 루트가 아닌 사용자의 공유 시스템 장치에 대한 액세스를 관리하는 데 도움이 되며, 여기에는 그래픽 카드가 포함됩니다. Plasma나 GNOME과 같은 기존 X11 관리자의 경우 `seatd`가 필요하지 않지만, 여기서 설명하는 Wayland 컴포지터의 경우 컴포지터 환경을 시작하기 전에 시스템에서 활성화하고 실행 중이어야 합니다. 바로 시스템 초기화 시 `seatd` 데몬을 활성화하고 시작하려면 다음과 같이 하세요:
ru: Демон seatd помогает управлять доступом к общим системным устройствам для непривилегированных пользователей в композиторах; это включает графические карты. Для традиционных менеджеров X11, таких как Plasma и GNOME, `seatd` не требуется, но для обсуждаемых здесь композиторов Wayland он должен быть включён в системе и работать перед запуском окружения композитора. Чтобы включить и запустить демон `seatd` сейчас и при инициализации системы:

source: Afterward, a compositor, which is similar to an X11 desktop, will need to be installed for the GUI environment. Three are discussed here, including basic configuration options, setting up a screen lock, and recommendations for more information.
ko: 그 후에는 X11 데스크톱과 유사한 컴포지터를 설치해야 GUI 환경을 사용할 수 있습니다. 여기에서는 기본 구성 옵션, 화면 잠금 설정, 추가 정보에 대한 권장 사항 등 세 가지에 대해 설명합니다.
ru: После этого необходимо установить композитор, который аналогичен рабочему столу X11, для графической среды. Здесь рассматриваются три варианта, включая базовые настройки, настройку блокировки экрана и рекомендации для получения дополнительной информации.

source: The Wayfire Compositor
ko: Wayfire 컴포지터
ru: Композитор Wayfire

source: Wayfire is a compositor that aims to be lightweight and customizable. Several features are available, and it brings back several elements from the previously released Compiz Fusion desktop. All of the parts look beautiful on modern hardware. To get Wayfire up and running, begin by installing the required packages:
ko: Wayfire는 가볍고 사용자 정의가 가능한 컴포지터를 지향합니다. 여러 가지 기능을 사용할 수 있으며 이전에 출시된 Compiz Fusion 데스크톱의 여러 요소를 재사용합니다. 모든 부분이 최신 하드웨어에서 아름답게 보입니다. Wayfire를 시작하고 실행하려면 필요한 패키지를 설치하는 것으로 시작하세요:
ru: Wayfire — это композитор, который стремится быть легковесным и настраиваемым. Доступно несколько функций, и он возвращает некоторые элементы из ранее выпущенного рабочего стола Compiz Fusion. Все части выглядят красиво на современном оборудовании. Чтобы запустить Wayfire, начните с установки необходимых пакетов:

source: The `alacritty` package provides a terminal emulator. Still, it is not completely required as other terminal emulators such as `kitty`, and XFCE-4 `Terminal` have been tested and verified to work under the Wayfire compositor. Wayfire configuration is relatively simple; it uses a file that should be reviewed for any customizations. To begin, copy the example file over to the runtime environment configuration directory and then edit the file:
ko: `Alacritty` 패키지는 터미널 에뮬레이터를 제공합니다. 하지만 `kitty`와 같은 다른 터미널 에뮬레이터와 XFCE-4 `Terminal`이 Wayfire 컴포지터에서 작동하는 것으로 테스트 및 검증되었기 때문에 반드시 필요한 것은 아닙니다. Wayfire 구성은 비교적 간단하며, 커스터마이징을 위해 검토해야 하는 파일을 사용합니다. 시작하려면 예제 파일을 런타임 환경 구성 디렉터리에 복사한 다음 파일을 편집합니다:
ru: Пакет `alacritty` предоставляет эмулятор терминала. Однако он не является строго обязательным, так как другие эмуляторы терминалов, такие как `kitty` и `Terminal` XFCE-4, были протестированы и подтверждены для работы под композитором Wayfire. Конфигурация Wayfire относительно проста; она использует файл, который следует изучить перед внесением любых изменений. Для начала скопируйте пример файла в директорию конфигурации среды выполнения, а затем отредактируйте файл:

source: The defaults for most users should be fine. Within the configuration file, items like the famous `cube` are pre-configured, and there are instructions to help with the available settings. A few primary settings of note include:
ko: 대부분의 사용자에게는 기본값으로 충분합니다. 구성 파일에는 유명한 `cube`와 같은 항목이 미리 구성되어 있으며, 사용 가능한 설정에 도움이 되는 지침이 있습니다. 몇 가지 주요 설정은 다음과 같습니다:
ru: Настройки по умолчанию подойдут большинству пользователей. В файле конфигурации уже предустановлены параметры, такие как известный `cube`, а также приведены инструкции по доступным настройкам. Вот несколько основных параметров, на которые стоит обратить внимание:

source: In this example, from the configuration file, the screen's output should be the listed mode at the listed hertz. For example, the mode should be set to `widthxheight@refresh_rate`. The position places the output at a specific pixel location specified. The default should be fine for most users. Finally, transform sets a background transform, and scale will scale the output to the specified scale factor. The defaults for these options are generally acceptable; for more information, see the documentation.
ko: 이 예제에서는 구성 파일에서 화면 출력의 주파수는 나열된 모드중 하나가 되어야 합니다. 예를 들어, 모드는 `widthxheight@refresh_rate`로 설정해야 합니다. 위치는 지정된 특정 픽셀 위치에 출력을 배치합니다. 대부분의 사용자에게는 기본값이 적합할 것입니다. 마지막으로 트랜스폼은 배경 트랜스폼을 설정하고 스케일은 지정된 배율로 출력의 배율을 조정합니다. 이러한 옵션의 기본값이 적당하며 자세한 내용은 설명서를 참조하세요.
ru: В этом примере из файла конфигурации вывод на экран должен соответствовать указанному режиму с указанной частотой. Например, параметр mode должен быть установлен как `ширинаxвысота@частота_обновления`. Параметр position размещает вывод в указанной позиции (в пикселях). Значение по умолчанию подходит для большинства пользователей. Наконец, transform задаёт фоновое преобразование, а scale масштабирует вывод до указанного коэффициента. Значения по умолчанию для этих параметров обычно приемлемы; дополнительную информацию см. в документации.

source: As mentioned, Wayland is new, and not all applications work with the protocol yet. At this time, `sddm` does not appear to support starting and managing compositors in Wayland. The `swaylock` utility has been used instead in these examples. The configuration file contains options to run `swayidle` and `swaylock` for idle and locking of the screen.
ko: 앞서 언급했듯이 Wayland는 새로운 프로토콜이며 아직 모든 애플리케이션이 이 프로토콜에서 작동하는 것은 아닙니다. 현재 `sddm`은 Wayland에서 컴포지터 시작 및 관리를 지원하지 않는 것으로 보입니다. 이 예제에서는 `swaylock` 유틸리티를 대신 사용했습니다. 구성 파일에는 화면 유휴 상태 및 잠금을 위해 `swayidle` 및 `swaylock`을 실행하는 옵션이 포함되어 있습니다.
ru: Как уже упоминалось, Wayland — это новая технология, и не все приложения пока работают с этим протоколом. На данный момент `sddm` не поддерживает запуск и управление композиторами в Wayland. В этих примерах вместо него использовалась утилита `swaylock`. Файл конфигурации содержит параметры для запуска `swayidle` и `swaylock` для управления простоем и блокировкой экрана.

source: This option to define the action to take when the system is idle is listed as:
ko: 시스템이 유휴 상태일 때 수행할 작업을 정의하는 이 옵션은 다음과 같이 나열됩니다:
ru: Эта опция для определения действия при простое системы указана как:

source: And the lock timeout is configured using the following lines:
ko: 잠금 시간 제한은 다음 줄을 사용하여 구성합니다:
ru: И таймаут блокировки настраивается с помощью следующих строк:

source: The first option will lock the screen after 300 seconds, and after another 300, the screen will shut off through the `dpms_timeout` option.
ko: 첫 번째 옵션은 300초 후에 화면을 잠그고, 300초가 더 지나면 'dpms_timeout' 옵션을 통해 화면이 꺼집니다.
ru: Первый вариант заблокирует экран через 300 секунд, а через следующие 300 секунд экран выключится с помощью опции `dpms_timeout`.

source: One final thing to note is the <super> key. Most of the configuration mentions this key, and it is the traditional `Windows` key on the keyboard. Most keyboards have this super key available; however, it should be remapped within this configuration file if it is not available. For example, to lock the screen, press and hold the super key, the kbd:[shift] key, and press the kbd:[escape] key. Unless the mappings have changed, this will execute the swaylock application. The default configuration for `swaylock` will show a grey screen; however, the application is highly customizable and well documented. In addition, since the swaylock-effects is the version that was installed, there are several options available such as the blur effect, which can be seen using the following command:
ru: Последнее, на что стоит обратить внимание, — это клавиша <super>. В большинстве конфигураций упоминается эта клавиша, и она соответствует традиционной клавише `Windows` на клавиатуре. На большинстве клавиатур эта клавиша super доступна; однако, если её нет, её следует переназначить в этом конфигурационном файле. Например, чтобы заблокировать экран, зажмите клавишу super, клавишу kbd:[shift] и нажмите клавишу kbd:[escape]. Если сопоставления не изменены, это запустит приложение swaylock. Конфигурация по умолчанию для `swaylock` отображает серый экран; однако приложение легко настраивается и хорошо документировано. Кроме того, поскольку была установлена версия swaylock-effects, доступно несколько дополнительных возможностей, таких как эффект размытия, который можно увидеть, используя следующую команду:

source: There is also the `--clock` parameter which will display a clock with the date and time on the lock screen. When package:x11/swaylock-effects[] was installed, a default [.filename]#pam.d# configuration was included. It provides the default options that should be fine for most users. More advanced options are available; see the PAM documentation for more information.
ko: 잠금 화면에 날짜와 시간이 표시된 시계를 표시하는 `--clock` 매개변수도 있습니다. package:x11/swaylock-effects[]를 설치할 때 기본 [.filename]#pam.d# 구성이 포함되어 있습니다. 대부분의 사용자에게 적합한 기본 옵션을 제공합니다. 더 고급 옵션을 사용할 수 있으며 자세한 내용은 PAM 설명서를 참조하세요.
ru: Также есть параметр `--clock`, который отображает часы с датой и временем на экране блокировки. При установке пакета package:x11/swaylock-effects[] включается конфигурация [.filename]#pam.d# по умолчанию. Она предоставляет стандартные настройки, которые подойдут большинству пользователей. Доступны и более расширенные варианты; дополнительную информацию можно найти в документации PAM.

source: At this point, it is time to test Wayfire and see if it can start up on the system. Just type the following command:
ko: 이제 Wayfire를 테스트하고 시스템에서 시작할 수 있는지 확인할 차례입니다. 다음 명령을 입력하기만 하면 됩니다:
ru: На этом этапе пришло время протестировать Wayfire и проверить, сможет ли он запуститься в системе. Просто введите следующую команду:
