Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/wayland/_index.po
Languages: ko, ru

source: Finally, for Hikari, no changes are needed. Support for `Xwayland` is build in by default. To disable that support, rebuild the package from the ports collection and disable Xwayland support at that time.
ko: 마지막으로 Hikari의 경우 변경이 필요하지 않습니다. `Xwayland`에 대한 지원은 기본적으로 빌드되어 있습니다. 해당 지원을 비활성화하려면 포트 컬렉션에서 패키지를 다시 빌드하고 이때 Xwayland 지원을 비활성화합니다.
ru: Наконец, для Hikari не требуется никаких изменений. Поддержка `Xwayland` включена по умолчанию. Чтобы отключить эту поддержку, пересоберите пакет из коллекции портов и отключите поддержку Xwayland во время сборки.

source: After these changes are made, start the compositor at the command line and execute a terminal from the key bindings. Within this terminal, issue the `env` command and search for the `DISPLAY` variables. If the compositor was able to properly start the Xwayland X server, these environment variables should look similar to the following:
ko: 이러한 변경이 완료되면 명령줄에서 컴포지터를 시작하고 키 바인딩에서 터미널을 실행합니다. 이 터미널에서 `env` 명령을 실행하고 `DISPLAY` 변수를 검색합니다. 컴포지터가 Xwayland X 서버를 정상적으로 시작할 수 있었다면, 환경 변수는 다음과 유사하게 보일 것입니다:
ru: После внесения этих изменений запустите композитор из командной строки и откройте терминал с помощью назначенных клавиш. В этом терминале выполните команду `env` и найдите переменные `DISPLAY`. Если композитор успешно запустил X-сервер Xwayland, эти переменные окружения должны выглядеть примерно следующим образом:

source: In this output, there is a default Wayland display and a display set for the Xwayland server. Another method to verify that `Xwayland` is functioning properly is to use install and test the small package:[x11/eyes] and check the output. If the `xeyes` application starts and the eyes follow the mouse pointer, Xwayland is functioning properly. If an error such as the following is displayed, something happened during the `Xwayland` initialization and it may need reinstalled:
ru: В этом выводе есть дисплей Wayland по умолчанию и дисплей, настроенный для сервера Xwayland. Другой способ проверить, что `Xwayland` работает корректно, — установить и протестировать небольшой package:[x11/eyes], а затем проверить вывод. Если приложение `xeyes` запускается и глаза следят за указателем мыши, значит, Xwayland работает правильно. Если же отображается ошибка, например, следующая, значит, что-то произошло во время инициализации `Xwayland`, и, возможно, его потребуется переустановить:

source: A security feature of Wayland is that, without running an X server, there is not another network listener. Once `Xwayland` is enabled, this security feature is no longer applicable to the system.
ko: Wayland의 보안상 특징은 X 서버를 실행하지 않으면 다른 네트워크 리스너가 없다는 것입니다.`Xwayland`가 활성화되면 이 보안 기능은 더 이상 시스템에 적용되지 않습니다.
ru: Одной из особенностей безопасности Wayland является отсутствие дополнительного сетевого слушателя при отсутствии запущенного X-сервера. После включения `Xwayland` данная особенность безопасности перестает применяться в системе.

source: For some compositors, such as Wayfire, `Xwayland` may not start properly. As such, `env` will show the following information for the `DISPLAY` environment variables:
ko: Wayfire와 같은 일부 컴포지터의 경우, `Xwayland`가 제대로 시작되지 않을 수 있습니다. 따라서 `env`는 `DISPLAY` 환경 변수에 대해 다음과 같은 정보를 표시합니다:
ru: Для некоторых композиторов, таких как Wayfire, `Xwayland` может не запуститься правильно. В таком случае, `env` покажет следующую информацию о переменных окружения `DISPLAY`:

source: Even though `Xwayfire` was installed and configured, X11 applications will not start giving a display issue. To work around this, verify that there is already an instance of `Xwayland` using a UNIX socket through these two methods. First, check the output from `sockstat` and search for X11-unix:
ko: `Xwayfire`가 설치 및 구성되었음에도 불구하고 X11 응용 프로그램에서 디스플레이 문제를 알리지 않습니다. 이 문제를 해결하려면 다음 두 가지 방법을 통해 UNIX 소켓을 사용하는 `Xwayland` 인스턴스가 이미 있는지 확인합니다. 먼저 `sockstat`의 출력을 확인하여 X11-unix를 검색합니다:
ru: Хотя `Xwayfire` был установлен и настроен, приложения X11 не запускаются, выдавая ошибку дисплея. Чтобы обойти эту проблему, убедитесь, что уже существует экземпляр `Xwayland`, использующий UNIX-сокет, с помощью двух методов. Сначала проверьте вывод команды `sockstat` и найдите X11-unix:

source: There should be something similar to the following information:
ko: 다음 정보와 비슷한 내용이 있어야 합니다:
ru: Должна быть информация, аналогичная следующей:

source: This suggests the existence of an X11 socket. This can be further verified by attempting to execute `Xwayland` manually within a terminal emulator running under the compositor:
ko: 이것은 X11 소켓의 존재를 암시합니다. 컴포지터에서 실행 중인 터미널 에뮬레이터에서 `Xwayland`를 수동으로 실행해 보면 이를 추가로 확인할 수 있습니다:
ru: Это указывает на наличие сокета X11. Это можно дополнительно проверить, попытавшись вручную запустить `Xwayland` в эмуляторе терминала, работающем под композитором:

source: If an X11 socket is already available, the following error should be presented to the user:
ko: X11 소켓을 이미 사용할 수 있는 경우 사용자에게 다음 오류가 표시되어야 합니다:
ru: Если сокет X11 уже доступен, пользователю должно быть показано следующее сообщение об ошибке:

source: Since there is an active X display available using display zero, the environment variable was just set improperly, to fix this, change the `DISPLAY` environment variable to `:0` and attempt to execute the application again. The following example uses package:mail/claws-mail[] as the application which needs the `Xwayland` service:
ko: 디스플레이 0을 사용하여 사용할 수 있는 활성화된 X 디스플레이가 있으므로, 환경 변수가 잘못 설정된 것으로 판단할 수 있습니다. 이 문제를 해결하려면 `DISPLAY` 환경 변수를 `:0`으로 변경하고 애플리케이션을 다시 실행해 보시기 바랍니다. 다음 예제는 `Xwayland` 서비스가 필요한 애플리케이션으로 package:mail/claws-mail[]을 사용합니다:
ru: Поскольку доступен активный X-дисплей с использованием дисплея ноль, переменная окружения была просто задана неправильно. Чтобы исправить это, измените переменную окружения `DISPLAY` на `:0` и попробуйте запустить приложение снова. В следующем примере используется пакет package:mail/claws-mail[] в качестве приложения, которому требуется сервис `Xwayland`:

source: After this change, the package:mail/claws-mail[] application should now start using `Xwayland` and function as expected.
ko: 변경 후 package:mail/claws-mail[] 애플리케이션은 이제 `Xwayland`를 사용하기 시작하고 예상대로 작동합니다.
ru: После этого изменения приложение package:mail/claws-mail[] должно начать использовать `Xwayland` и работать как ожидается.

source: Remote Desktop Using VNC
ko: VNC를 사용한 원격 데스크톱
ru: Удаленный рабочий стол с использованием VNC

source: Earlier in this document it was noted that Wayland does not provide the same X server style access as Xorg provides. Instead, users are free to pick and choose a remote desktop protocol such as RDP or VNC. The FreeBSD Ports collection includes the `wayvnc`, which will support wlroots based compositors such as the ones discussed here. This application may be installed using:
ko: 이 문서의 앞부분에서 Wayland는 Xorg가 제공하는 것과 동일한 X 서버 스타일의 액세스를 제공하지 않는다고 언급했습니다. 대신, 사용자는 RDP나 VNC와 같은 원격 데스크톱 프로토콜을 자유롭게 선택할 수 있습니다. FreeBSD 포트 컬렉션에는 여기서 설명한 것과 같은 wlroots 기반 컴포지터를 지원하는 `wayvnc`가 포함되어 있습니다. 이 애플리케이션은 다음을 사용하여 설치할 수 있습니다:
ru: Ранее в этом документе упоминалось, что Wayland не предоставляет такой же доступ в стиле X-сервера, как Xorg. Вместо этого пользователи могут выбрать любой протокол удаленного рабочего стола, например RDP или VNC. Коллекция портов FreeBSD включает `wayvnc`, который поддерживает композиторы на основе wlroots, такие как рассмотренные здесь. Это приложение можно установить с помощью:

source: Unlike some other packages, `wayvnc` does not come with a configuration file. Thankfully, the manual page documents the important options and they may be extrapolated into a simple configuration file:
ko: 다른 패키지와 달리 `wayvnc`에는 구성 파일이 제공되지 않습니다. 다행히도 설명서 페이지에 중요한 옵션이 문서화되어 있으며 간단한 구성 파일로 추정할 수 있습니다:
ru: В отличие от некоторых других пакетов, `wayvnc` не поставляется с файлом конфигурации. К счастью, справочная страница содержит описание важных параметров, и их можно использовать для создания простого файла конфигурации:

source: The key files will need to be generated, and it is highly recommended they be used for increased security of the connection. When invoked, wayvnc will search for the configuration file in [.filename]#~/.config/wayvnc/config#. This could be overwritten using the `-C configuration_file` option when starting the server. Thus, to start the `wayvnc` server, issue the following command:
ko: 키 파일을 생성해야 하며, 연결 보안을 강화하기 위해 키 파일을 사용하는 것이 좋습니다. 이 함수가 호출되면 wayvnc는 [.filename]#~/.config/wayvnc/config#에서 구성 파일을 검색합니다. 서버를 시작할 때 `-C configuration_file` 옵션을 사용하여 이 파일을 덮어쓸 수 있습니다. 따라서 `wayvnc` 서버를 시작하려면 다음 명령을 실행합니다:
ru: Необходимо сгенерировать ключевые файлы, и настоятельно рекомендуется их использовать для повышения безопасности соединения. При запуске wayvnc будет искать файл конфигурации в [.filename]#~/.config/wayvnc/config#. Это можно переопределить с помощью опции `-C файл_конфигурации` при запуске сервера. Таким образом, чтобы запустить сервер `wayvnc`, выполните следующую команду:

source: At the time of this writing, there is no rc.d script to start `wayvnc` on system initialization. If that functionality is desired, a local startup file will need to be created. This is probably a feature request for the port maintainer.
ko: 이 글을 쓰는 시점에는 시스템 초기화 시 `wayvnc`를 시작하는 rc.d 스크립트가 없습니다. 이 기능을 원한다면 로컬 시작 파일을 만들어야 합니다. 이는 아마도 포트 관리자에게 기능 요청이 필요할 것입니다.
ru: На момент написания этого документа нет rc.d-скрипта для запуска `wayvnc` при инициализации системы. Если требуется такая функциональность, необходимо создать локальный стартовый файл. Вероятно, это следует оформить как запрос на добавление функции для сопровождающего порта.

source: Wayland Login Manager
ko: Wayland 로그인 관리자
ru: Логин менеджер Wayland

source: While several login managers exist and are slowly migrating to Wayland, one option is the package:x11/ly[] text user interface (TUI) manager. Needing minimal configuration, `ly` will start Sway, Wayfire, and others by presenting a login window on system initialization. To install `ly`, issue the following command:
ko: 여러 로그인 관리자가 존재하며 서서히 Wayland로 마이그레이션되고 있지만, 한 가지 옵션은 package:x11/ly[] 텍스트 사용자 인터페이스(TUI) 관리자입니다. 최소한의 구성이 필요한 `ly`는 시스템 초기화 시 로그인 창을 표시하여 Sway, Wayfire 등을 시작합니다. `ly`를 설치하려면 다음 명령을 실행합니다:
ru: Хотя существует несколько менеджеров входа в систему, которые постепенно переходят на Wayland, одним из вариантов является текстовый менеджер входа package:x11/ly[]. Требуя минимальной настройки, `ly` запускает Sway, Wayfire и другие окружения, отображая окно входа при инициализации системы. Для установки `ly` выполните следующую команду:

source: There will be some configuration hints presented, the import steps are to add the following lines to [.filename]#/etc/gettytab#:
ko: 몇 가지 구성 힌트가 표시되며, 가져오기 단계는 [.filename]#/etc/gettytab#에 다음 줄을 추가하는 것입니다:
ru: Будут представлены некоторые подсказки по настройке, основные шаги - добавить следующие строки в [.filename]#/etc/gettytab#:

source: And then modify the ttyv1 line in [.filename]#/etc/ttys# to match the following line:
ko: 그런 다음 [.filename]#/etc/ttys#의 ttyv1 줄을 다음과 일치하도록 수정합니다:
ru: И затем измените строку ttyv1 в файле [.filename]#/etc/ttys#, чтобы она соответствовала следующей строке:

source: After a system reboot, a login should appear. To configure specific settings, such as language and edit [.filename]#/usr/local/etc/ly/config.ini#. At minimal, this file should have the designated tty that was previously specified in [.filename]#/etc/ttys#.
ko: 시스템을 재부팅하면 로그인 화면이 나타납니다. 언어와 같은 특정 설정을 구성하고 [.filename]#/usr/local/etc/ly/config.ini#를 편집하려면 다음과 같이 하세요. 최소한 이 파일에는 이전에 [.filename]#/etc/ttys#에 지정한 tty가 있어야 합니다.
ru: После перезагрузки системы должно появиться приглашение на вход. Для настройки конкретных параметров, таких как язык, отредактируйте файл [.filename]#/usr/local/etc/ly/config.ini#. Как минимум, в этом файле должен быть указан tty, который был ранее задан в [.filename]#/etc/ttys#.

source: If setting ttyv0 up as the login terminal, it may be required to press the kbd:[alt] and kbd:[F1] keys to properly see the login window.
ko: ttyv0를 로그인 터미널로 설정한 경우, 로그인 창이 제대로 표시되려면 kbd:[alt] 및 kbd:[F1] 키를 눌러야 할 수 있습니다.
ru: Если для терминала ttyv0 настроен вход в систему, может потребоваться нажать клавиши kbd:[alt] и kbd:[F1], чтобы корректно отображалось окно входа.

source: When the login window appears, using the left and right arrows will swap through different, supported, window managers.
ko: 로그인 창이 나타나면 왼쪽 및 오른쪽 화살표를 사용하여 지원되는 다른 창 관리자로 전환할 수 있습니다.
ru: Когда появляется окно входа, использование стрелок влево и вправо позволяет переключаться между различными поддерживаемыми оконными менеджерами.

source: Useful Utilities
ko: 유용한 유틸리티
ru: Полезные утилиты

source: One useful Wayland utility which all compositors can make use of is the waybar. While Wayfire does come with a launch menu, an easy-to-use and fast taskbar is a good accessory for any compositor or desktop manager. A Wayland compatible taskbar that is fast and easy to configure is waybar. To install the package and a supporting audio control utility, issue the following command:
ko: 모든 컴포지터가 사용할 수 있는 유용한 wayland 유틸리티 중 하나는 waybar입니다. Wayfire에는 시작 메뉴가 제공되지만, 사용하기 쉽고 빠른 작업 표시줄은 모든 컴포지터 또는 데스크톱 관리자에게 좋은 액세서리입니다. 빠르고 쉽게 구성할 수 있는 wayland 호환 작업 표시줄은 waybar입니다. 패키지와 지원 오디오 제어 유틸리티를 설치하려면 다음 명령을 실행합니다:
ru: Один полезный инструмент для Wayland, который могут использовать все композиторы, — это `waybar`. Хотя Wayfire и поставляется с меню запуска, удобная и быстрая панель задач — это полезное дополнение для любого композитора или менеджера рабочего стола. `waybar` — это совместимая с Wayland панель задач, которая быстро работает и легко настраивается. Чтобы установить пакет и вспомогательную утилиту управления аудио, выполните следующую команду:

source: To create the configuration directory and copy over a default configuration file, execute the following commands:
ko: 구성 디렉터리를 만들고 기본 구성 파일을 복사하려면 다음 명령을 실행합니다:
ru: Для создания каталога конфигурации и копирования стандартного файла конфигурации выполните следующие команды:

source: The `lavalauncher` utility provides a launch bar for various applications. There is no example configuration file provided with the package, so the following actions must be taken:
ko: `lavalauncher` 유틸리티는 다양한 애플리케이션을 위한 시작 표시줄을 제공합니다. 패키지와 함께 제공되는 예제 구성 파일은 없으므로 다음 작업을 수행해야 합니다:
ru: Утилита `lavalauncher` предоставляет панель запуска для различных приложений. Вместе с пакетом не поставляется пример файла конфигурации, поэтому необходимо выполнить следующие действия:

source: An example configuration file that only includes Firefox, and is placed on the right, is below:
ko: 오른쪽에 Firefox만 포함된 구성 파일의 예는 다음과 같습니다:
ru: Пример файла конфигурации, который включает только Firefox и расположен справа, приведен ниже:

source: Wayland Synopsis
ko: Wayland 시놉시스

source: Wayland is a new display server, but it differs from Xorg in several important ways. First, Wayland is only a protocol that acts as an intermediary between clients using a different mechanism which removes the dependency on an X server. Xorg includes both the X11 protocol, used to run remote displays and the X server will accept connections and display windows. Under Wayland, the compositor or window manager provides the display server instead of a traditional X server.
ko: Wayland는 새로운 디스플레이 서버이지만, 몇 가지 중요한 점에서 Xorg와 다릅니다. 첫째, Wayland는 X 서버에 대한 의존성을 제거하는 다른 메커니즘을 사용하여 클라이언트 간의 중개자 역할을 하는 프로토콜일 뿐입니다. Xorg에는 원격 디스플레이를 실행하는 데 사용되는 X11 프로토콜이 모두 포함되어 있으며, X 서버는 연결과 디스플레이 창을 수락합니다. Wayland에서는 컴포저 또는 창 관리자가 기존 X 서버 대신 디스플레이 서버를 제공합니다.

source: The current NVidia driver should work with most wl-roots compositors, but it may be a little unstable and not support all features at this time. Volunteers to help work on the NVidia DRM are requested.
ko: 현재 NVidia 드라이버는 대부분의 wl-roots 컴포지터에서 작동해야 하지만 현재로서는 약간 불안정하고 모든 기능을 지원하지 않을 수 있습니다. NVidia DRM 작업을 도와줄 자원자가 필요합니다.

source: As of May, 2021, plasma5-kwin does support Wayland on FreeBSD. To use Plasma under Wayland, use the `startplasma-wayland` parameter to `ck-launch-session` and tie in dbus with: `ck-launch-session dbus-run-session startplasma-wayland` to get it working.
ko: 2021년 5월 현재, plasma5-kwin은 FreeBSD의 Wayland를 지원합니다. Wayland에서 플라즈마를 사용하려면, `startplasma-wayland` 매개변수를 `ck-launch-session`에 사용하고 dbus에 연결하세요: `ck-launch-session dbus-run-session startplasma-wayland`로 연결하면 작동합니다.

source: All of the compositors described here should work with package:graphics/drm-kmod[] open source drivers; however, the NVidia graphics cards may have issues when using the proprietary drivers. Begin by installing the following packages:
ko: 여기에 설명된 모든 컴포지터는 package:graphics/drm-kmod[] 오픈 소스 드라이버와 함께 작동해야 하지만, NVidia 그래픽 카드의 경우 독점 드라이버를 사용할 때 문제가 발생할 수 있습니다. 다음 패키지를 설치하여 시작하세요:

source: Once the protocol and supporting packages have been installed, a compositor must create the user interface. Several compositors will be covered in the following sections. All compositors using Wayland will need a runtime directory defined in the environment, which can be achieved with the following command in the bourne shell:
ko: 프로토콜과 지원 패키지가 설치되면 컴포지터가 사용자 인터페이스를 생성해야 합니다. 다음 섹션에서는 몇 가지 컴포지터를 다룰 것입니다. Wayland를 사용하는 모든 컴포지터는 환경에 정의된 런타임 디렉터리가 필요하며, 이는 bourne 셸에서 다음 명령으로 구현할 수 있습니다:

source: One final thing to note is the <super> key. Most of the configuration mentions this key, and it is the traditional `Windows` key on the keyboard. Most keyboards have this super key available; however, it should be remapped within this configuration file if it is not available. For example, to lock the screen, press and hold the super key, the kbd:[shift] key, and press the kbd:[escape] key. nless the mappings have changed, this will execute the swaylock application. The default configuration for `swaylock` will show a grey screen; however, the application is highly customizable and well documented. In addition, since the swaylock-effects is the version that was installed, there are several options available such as the blur effect, which can be seen using the following command:
ko: 마지막으로 주목해야 할 것은 <super> 키입니다. 대부분의 설정에서 이 키를 언급하고 있으며, 이 키는 키보드의 전통적인 `Windows` 키입니다. 대부분의 키보드에서 이 슈퍼 키를 사용할 수 있지만, 사용할 수 없는 경우 이 구성 파일 내에서 다시 매핑해야 합니다. 예를 들어, 화면을 잠그려면 슈퍼 키인 kbd:[shift] 키를 길게 누른 상태에서 kbd:[escape] 키를 누릅니다. 매핑이 변경되지 않는 한, 이렇게 하면 swaylock 애플리케이션이 실행됩니다. 'swaylock'의 기본 구성은 회색 화면으로 표시되지만, 이 애플리케이션은 사용자 정의가 가능하고 문서화되어 있습니다. 또한, 설치된 버전에 따라 다음 명령을 사용하여 확인할 수 있는 흐림 효과와 같은 몇 가지 옵션을 사용할 수 있습니다:

source: The Sway compositor is a tiling compositor that attempts to replace the i3 windows manager. It should work with the user's current i3 configuration; however, new features may require some additional setup. In the forthcoming examples, a fresh installation without migrating any i3 configuration will be assumed. To install Sway and valuable components, issue the following command as the root user:
ko: Sway 컴포지터는 i3 윈도우 매니저를 대체하려는 타일 형태의 컴포지터입니다. 사용자의 현재 i3 구성과 함께 작동해야 하지만 새로운 기능을 사용하려면 몇 가지 추가 설정이 필요할 수 있습니다. 다음 예제에서는 i3 구성을 마이그레이션하지 않고 새로 설치하는 것으로 가정합니다. Sway 및 주요 구성 요소를 설치하려면 루트 사용자로 다음 명령을 실행합니다:

source: In the previous example, the `xkb` rules for man:evdev[4] events are loaded, and the $mod key is set to the Windows logo key for the key bindings. Next, the terminal emulator was set to be `alacritty`, and a screen lock command was defined; more on this later. The output keyword, the mode, the position, a background wallpaper, and Sway is also told to stretch this wallpaper to fill out the screen. Finally, `swaylock` is set to daemonize and lock the screen after a timeout of 300 seconds, placing the screen or monitor into sleep mode after 600 seconds. The locked background color of 000000, which is black, is also defined here. Using swaylock-effects, a clock may also be displayed with the `--clock` parameter. See the manual page for more options. The man:sway-output[5] manual page should also be reviewed; it includes a great deal of information on customing the output options available.
ko: 이전 예제에서는 man:evdev[4] 이벤트에 대한 `xkb` 규칙이 로드되고 $mod 키가 키 바인딩을 위해 Windows 로고 키로 설정되었습니다. 다음으로 터미널 에뮬레이터를 `alacritty`로 설정하고 화면 잠금 명령을 정의했습니다(이에 대해서는 나중에 자세히 설명합니다). 출력 키워드, 모드, 위치, 배경 배경화면, 그리고 이 배경화면을 늘려서 화면을 채우도록 Sway도 지정했습니다. 마지막으로 `swaylock`은 300초의 시간 초과 후 화면을 데몬화하여 잠그고 600초 후에 화면 또는 모니터를 절전 모드로 전환하도록 설정했습니다. 잠긴 배경색인 000000(검은색)도 여기에서 정의됩니다. swaylock-effects를 사용하면 `--clock` 매개변수를 사용하여 시계를 표시할 수도 있습니다. 더 많은 옵션은 매뉴얼 페이지를 참조하세요. 사용 가능한 출력 옵션 사용자 지정에 대한 많은 정보가 포함된 man:sway-output[5] 매뉴얼 페이지도 검토해야 합니다.

source: For the Sway compositor, `Xwayland` should be enabled by default. Even so, it is recommened to manually add a configuration line in the [.filename]#~/.config/sway/config# like the following:
ko: Sway 컴포지터의 경우 기본적으로 `Xwayland`가 활성화되어 있어야 합니다. 그렇더라도 다음과 같이 [.filename]#~/.config/sway/config#에 구성 줄을 수동으로 추가하는 것을 권장합니다:

source: In this output, there is a default Wayland display and a display set for the Xwayland server. Another method to verify that `Xwayland` is functioning properly is to use install and test the small package:[x11/eyes] and check the output. If the `xeyes` application starts and the eyes follow the mouse pointer, Xwayland is functioning properly. If an error such as the following is displayed, something happened during the `Xwayland` intitialization and it may need reinstalled:
ko: 이 출력에는 기본 wayland 디스플레이와 Xwayland 서버용 디스플레이가 설정되어 있습니다. `Xwayland`가 제대로 작동하는지 확인하는 또 다른 방법은 작은 package:[x11/eyes]를 설치 및 테스트하고 출력을 확인하는 것입니다. `xeyes` 애플리케이션이 시작되고 마우스 포인터를 따라 눈이 움직인다면 Xwayland가 정상적으로 작동하는 것입니다. 아래와 같은 에러가 표시된다면 `Xwayland` 초기화 과정에서 문제가 발생한 것이며 재설치가 필요할 수 있습니다:
