Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/partiv.po
Languages: ko, ru

source: Part IV. Network Communication
ko: 파트 IV. 네트워크 통신
ru: Часть IV. Сетевое взаимодействие

source: Network Communication
ko: 네트워크 통신
ru: Сетевые коммуникации

source: FreeBSD is one of the most widely deployed operating systems for high performance network servers. The chapters in this part cover:
ko: FreeBSD는 고성능 네트워크 서버를 위해 가장 널리 배포된 운영체제중 하나입니다. 이 파트의 챕터는 다음의 내용을 다룹니다:
ru: FreeBSD является одной из наиболее широко используемых операционных систем для высокопроизводительных сетевых серверов. Главы в этом разделе охватывают:

source: Serial communication
ko: 시리얼 통신
ru: Передача данных по последовательному порту

source: `PPP` and `PPP` over Ethernet
ko: 이더넷을 통한 PPP 와 PPP
ru: `PPP` и `PPP` через Ethernet

source: Electronic Mail
ko: 전자메일
ru: Электронная почта

source: Running Network Servers
ko: 네트워크 서버 실행하기
ru: Работа с сетевыми серверами

source: Firewalls
ko: 방화벽
ru: Межсетевые экраны

source: Other Advanced Networking Topics
ko: 기타 고급 네트워크 관련 주제
ru: Другие темы сложной сетевой настройки

source: These chapters are designed to be read when the information is needed. They do not need to be read in any particular order, nor is it necessary to read all of them before using FreeBSD in a network environment.
ko: 이 챕터는 필요시 읽을 수 있도록 구성되었습니다. 이 챕터는 특별한 순서에 맞춰 읽을 필요가 없으며 네트워크 환경에서 FreeBSD를 사용하기 전에 모든 파트를 읽어야 할 필요도 없습니다.
ru: Эти главы предназначены для ознакомления по мере необходимости. Их не обязательно читать в определённом порядке, а также нет необходимости прочитывать все из них перед использованием FreeBSD в сетевом окружении.
