Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/linux-users/_index.po
Languages: es, pt_br, ru

source: Since FreeBSD is developed as a complete operating system, user-installed applications are not considered to be part of the "base" system. User-installed applications are generally installed using extref:{handbook}[Packages or Ports, ports-using]. In order to keep them separate from the base system, user-installed applications are installed under [.filename]#/usr/local/#. Therefore, user-installed binaries reside in [.filename]#/usr/local/bin/#, configuration files are in [.filename]#/usr/local/etc/#, and so on.
es: Puesto que FreeBSD se desarrolla como un sistema operativo completo, las aplicaciones instaladas por el usuario no se consideran parte del sistema "base". Las aplicaciones instaladas por el usuario normalmente se instalan mediante extref:{handbook}[Paquetes o Ports, ports-using]. Para mantenerlos separados del sistema base, estas aplicaciones se instalan en [.filename]#/usr/local/#. Por lo tanto, los binarios instalados por el usuario se encuentran en [.filename]#/usr/local/bin/#, los ficheros de configuración en [.filename]#/usr/local/etc/#, y así sucesivamente.
pt_br: Como o FreeBSD é desenvolvido como um sistema operacional completo, os aplicativos instalados pelo usuário não são considerados parte do sistema "base". Os aplicativos instalados pelo usuário geralmente são instalados usando extref:{handbook}[Pacotes ou Ports, ports-using]. Para mantê-los separados do sistema base, os aplicativos instalados pelo usuário são instalados em [.filename]#/usr/local/#. Portanto, os binários instalados pelo usuário residem em [.filename]#/usr/local/bin/#, os arquivos de configuração estão em [.filename]#/usr/local/etc/# e assim por diante.
ru: Поскольку FreeBSD разрабатывается как полноценная операционная система, пользовательские приложения не считаются частью «базовой» системы. Пользовательские приложения обычно устанавливаются с помощью extref:{handbook}ports/[Пакетов или Портов, ports-using]. Чтобы отделить их от базовой системы, пользовательские приложения устанавливаются в [.filename]#/usr/local/#. Таким образом, исполняемые файлы пользовательских приложений находятся в [.filename]#/usr/local/bin/#, конфигурационные файлы — в [.filename]#/usr/local/etc/# и так далее.

source: Services are enabled by adding an entry for the service in [.filename]#/etc/rc.conf#. The system defaults are found in [.filename]#/etc/defaults/rc.conf# and these default settings are overridden by settings in [.filename]#/etc/rc.conf#. Refer to man:rc.conf[5] for more information about the available entries. When installing additional applications, review the application's install message to determine how to enable any associated services.
es: Los servicios se habilitan añadiendo una entrada para el servicio en [.filename]#/etc/rc.conf#. Los predeterminados del sistema se encuentran en [.filename]#/etc/defaults/rc.conf# a los que se anteponen los servicios en [.filename]#/etc/rc.conf#. Consulta man:rc.conf[5] para más información acerca de las entradas disponibles. Cuando instales aplicaciones adicionales, revisa los mensajes de instalación de la aplicación para determinar cómo activar cualquier servicio que tenga asociado.
pt_br: Os serviços são ativados adicionando uma entrada para o serviço em [.filename]#/etc/rc.conf#. As configurações padrão do sistema são encontradas no [.filename]#/etc/defaults/rc.conf# e essas configurações padrão são substituídas por configurações definidas no [.filename]#/etc/rc.conf#. Consulte man:rc.conf[5] para obter mais informações sobre as entradas disponíveis. Ao instalar aplicativos adicionais, revise a mensagem de instalação do aplicativo para determinar como ativar quaisquer serviços associados.
ru: Сервисы включаются путем добавления соответствующей записи в файл [.filename]#/etc/rc.conf#. Системные параметры по умолчанию находятся в файле [.filename]#/etc/defaults/rc.conf#, а настройки по умолчанию переопределяются параметрами из файла [.filename]#/etc/rc.conf#. Подробнее о доступных параметрах можно узнать в man:rc.conf[5]. При установке дополнительных приложений ознакомьтесь с сообщением установки, чтобы определить, как включить связанные сервисы.

source: The following entries in [.filename]#/etc/rc.conf# enable man:sshd[8], enable Apache 2.4, and specify that Apache should be started with SSL.
es: Las siguientes entradas en [.filename]#/etc/rc.conf# activan man:sshd[8], activan Apache 2.4, y especifican que Apache debería arrancar con SSL.
pt_br: As seguintes entradas em [.filename]#/etc/rc.conf# habilitam o man:sshd[8], habilitam o Apache 2.4 e especificam que o Apache deve ser iniciado com SSL.
ru: Следующие записи в [.filename]#/etc/rc.conf# включают man:sshd[8], активируют Apache 2.4 и указывают, что Apache должен запускаться с SSL.

source: # enable SSHD sshd_enable="YES" # enable Apache with SSL apache24_enable="YES" apache24_flags="-DSSL"
es: # activa SSHD sshd_enable="YES" # activa Apache con SSL apache24_enable="YES" apache24_flags="-DSSL"

source: Once a service has been enabled in [.filename]#/etc/rc.conf#, it can be started without rebooting the system:
es: Una vez que un servicio ha sido activado en [.filename]#/etc/rc.conf#, puede iniciarse sin reiniciar el sistema:
pt_br: Depois que um serviço foi habilitado no [.filename]#/etc/rc.conf#, ele pode ser iniciado sem reiniciar o sistema:
ru: После включения службы в [.filename]#/etc/rc.conf# её можно запустить без перезагрузки системы:

source: If a service has not been enabled, it can be started from the command line using `onestart`:
es: Si un servicio no se ha habilitado, se puede arrancar desde la línea de comando utilizando `onestart`:
pt_br: Se um serviço não tiver sido habilitado, ele pode ser iniciado a partir da linha de comando usando o comando `onestart`:
ru: Если служба не была включена, её можно запустить из командной строки с помощью `onestart`:

source: Network Configuration
es: Configuración de la Red
pt_br: Configuração de Rede
ru: Настройка сети

source: Instead of a generic _ethX_ identifier that Linux(R) uses to identify a network interface, FreeBSD uses the driver name followed by a number. The following output from man:ifconfig[8] shows two Intel(R) Pro 1000 network interfaces ([.filename]#em0# and [.filename]#em1#):
es: En lugar de un identificador genérico _ethX_ que Linux(R) utiliza para identificar un interfaz de red, FreeBSD utiliza el nombre del controlador seguido de un número. Lo siguiente salida del comando man:ifconfig[8] muestra dos interfaces de red Intel(R) Pro 1000 ([.filename]#em0# y [.filename]#em1#):
pt_br: Em vez de um identificador genérico _ethX_ que o Linux(R) usa para identificar uma interface de rede, o FreeBSD usa o nome do driver seguido por um número. A saída a seguir do man:ifconfig[8] mostra duas interfaces de rede Intel(R) Pro 1000 ([.filename]#em0# e [.filename]#em1#):
ru: Вместо общего идентификатора _ethX_, который используется в Linux(R) для обозначения сетевого интерфейса, FreeBSD использует имя драйвера с последующим числом. Следующий вывод из man:ifconfig[8] показывает два сетевых интерфейса Intel(R) Pro 1000 ([.filename]#em0# и [.filename]#em1#):

source: An IP address can be assigned to an interface using man:ifconfig[8]. To remain persistent across reboots, the IP configuration must be included in [.filename]#/etc/rc.conf#. The following [.filename]#/etc/rc.conf# entries specify the hostname, IP address, and default gateway:
es: Se puede asignar una dirección IP a un interfaz utilizando man:ifconfig[8]. Para que permanezca de forma persistente entre arranques, la configuración IP se debe incluir en [.filename]#/etc/rc.conf#. Las siguientes entradas en [.filename]#/etc/rc.conf# especifican el nombre del host, dirección IP, y la pasarela por defecto:
pt_br: Um endereço IP pode ser atribuído a uma interface usando o comando man:ifconfig[8]. Para que a configuração de IP permaneça persistente através das reinicializações, ela deve ser incluída no [.filename]#/etc/rc.conf#. As seguintes entradas no [.filename]#/etc/rc.conf# especificam o nome do host, o endereço IP e o gateway padrão:
ru: IP-адрес может быть назначен интерфейсу с помощью man:ifconfig[8]. Чтобы настройки сохранялись после перезагрузки, конфигурация IP должна быть указана в [.filename]#/etc/rc.conf#. Следующие записи в [.filename]#/etc/rc.conf# задают имя хоста, IP-адрес и шлюз по умолчанию:

source: Use the following entries to instead configure an interface for DHCP:
es: Utiliza las siguientes entradas si en su lugar quieres configurar un interfaz con DHCP:
pt_br: Use as seguintes entradas para configurar uma interface para utilizar DHCP:
ru: Используйте следующие записи для настройки интерфейса через DHCP:

source: FreeBSD does not use Linux(R) IPTABLES for its firewall. Instead, FreeBSD offers a choice of three kernel level firewalls:
es: FreeBSD no utiliza como firewall el IPTABLES de Linux(R). En su lugar, FreeBSD ofrece tres posibles firewalls a nivel de kernel:
pt_br: O FreeBSD não usa o IPTABLES do Linux(R) para o seu firewall. Em vez disso, o FreeBSD oferece uma escolha de três firewalls em nível de kernel:
ru: FreeBSD не использует Linux(R) IPTABLES для своего межсетевого экрана. Вместо этого FreeBSD предлагает выбор из трёх межсетевых экранов на уровне ядра:

source: PF is developed by the OpenBSD project and ported to FreeBSD. PF was created as a replacement for IPFILTER and its syntax is similar to that of IPFILTER. PF can be paired with man:altq[4] to provide QoS features.
es: PF es desarrollado por el proyecto OpenBSD y ha sido portado a FreeBSD. PF se creó como reemplazo de IPFILTER y su sintaxis es muy similar a la que tenía este último. PF se puede usar junto con man:altq[4] para proporcionar características QoS.
pt_br: O PF é desenvolvido pelo projeto OpenBSD e portado para o FreeBSD. O PF foi criado como um substituto para o IPFILTER e sua sintaxe é semelhante à do IPFILTER. O PF pode ser combinado com o man:altq[4] para fornecer recursos de QoS.
ru: PF разработан проектом OpenBSD и портирован в FreeBSD. PF был создан как замена для IPFILTER, и его синтаксис схож с синтаксисом IPFILTER. PF может использоваться совместно с man:altq[4] для обеспечения функций QoS.

source: This sample PF entry allows inbound SSH:
es: Este ejemplo de entrada de PF permite conexiones entrantes SSH:
pt_br: Este exemplo de regra do PF permite as conexões de entrada do SSH:
ru: Этот пример записи PF разрешает входящий SSH:

source: IPFILTER is the firewall application developed by Darren Reed. It is not specific to FreeBSD and has been ported to several operating systems including NetBSD, OpenBSD, SunOS, HP/UX, and Solaris.
es: IPFILTER es el firewall desarrollado por Darren Reed. No es específico de FreeBSD y se ha portado a varios sistemas operativos, incluidos NetBSD, OpenBSD, SunOS, HP/UX y Solaris.
pt_br: O IPFILTER é o aplicativo de firewall desenvolvido por Darren Reed. Não é específico do FreeBSD e foi portado para vários sistemas operacionais, incluindo NetBSD, OpenBSD, SunOS, HP/UX e Solaris.
ru: IPFILTER — это приложение для межсетевого экрана, разработанное Дарреном Ридом. Оно не является специфичным для FreeBSD и было портировано на несколько операционных систем, включая NetBSD, OpenBSD, SunOS, HP/UX и Solaris.

source: The IPFILTER syntax to allow inbound SSH is:
es: La sintaxis de IPFILTER utilizada para permitir conexiones entrantes de SSH es:
pt_br: A sintaxe do IPFILTER para permitir o recebimento de conexões no SSH é a seguinte:
ru: Синтаксис IPFILTER для разрешения входящего SSH:

source: IPFW is the firewall developed and maintained by FreeBSD. It can be paired with man:dummynet[4] to provide traffic shaping capabilities and simulate different types of network connections.
es: IPFW es el firewall desarrollado y mantenido por FreeBSD. Se puede utilizar junto con man:dummynet[4] para proporcionar capacidades de perfilado de tráfico y simular distintos tipos de conexiones de red.
pt_br: O IPFW é o firewall desenvolvido e mantido pelo FreeBSD. Ele pode ser combinado com o man:dummynet[4] para fornecer recursos de controle de tráfego e simular diferentes tipos de conexões de rede.
ru: IPFW — это межсетевой экран, разработанный и поддерживаемый FreeBSD. Он может быть использован совместно с man:dummynet[4] для обеспечения возможностей управления трафиком и имитации различных типов сетевых соединений.

source: The IPFW syntax to allow inbound SSH would be:
es: La sintaxis de IPFW para permitir conexiones entrantes de SSH sería:
pt_br: A sintaxe do IPFW para permitir a entrada de conexões SSH é a seguinte:
ru: Синтаксис IPFW для разрешения входящего SSH будет следующим:

source: Updating FreeBSD
es: Actualizando FreeBSD
pt_br: Atualizando o FreeBSD
ru: Обновление FreeBSD

source: There are two methods for updating a FreeBSD system: from source or binary updates.
es: Hay dos métodos para actualizar un sistema FreeBSD: a partir del código fuente o mediante la actualización de los binarios.
pt_br: Existem dois métodos para atualizar um sistema FreeBSD: a partir do código-fonte ou a partir de atualizações binárias.
ru: Существует два метода обновления системы FreeBSD: из исходного кода или бинарные обновления.

source: Updating from source is the most involved update method, but offers the greatest amount of flexibility. The process involves synchronizing a local copy of the FreeBSD source code with the FreeBSD Git repository. Once the local source code is up-to-date, a new version of the kernel and userland can be compiled.
es: Actualizar desde código fuente es el método más complejo pero el que ofrece mayor flexibilidad. El proceso implica la sincronización de una copia local del código fuente de FreeBSD con los repositorios Git de FreeBSD. Una vez actualizado el código fuente, se pueden compilar nuevas versiones de las utilidades y el kernel.
pt_br: Atualizar a partir do código-fonte é o método de atualização mais complexo, mas oferece a maior flexibilidade. O processo envolve sincronizar uma cópia local do código-fonte do FreeBSD com o repositório Git do FreeBSD. Assim que o código-fonte local estiver atualizado, uma nova versão do kernel e do userland pode ser compilada.
ru: Обновление из исходного кода — это наиболее сложный метод обновления, но он предоставляет наибольшую гибкость. Процесс включает синхронизацию локальной копии исходного кода FreeBSD с репозиторием FreeBSD Git. После того как локальный исходный код обновлён, можно скомпилировать новую версию ядра и пользовательского пространства.

source: Binary updates are similar to using `yum` or `apt-get` to update a Linux(R) system. In FreeBSD, man:freebsd-update[8] can be used fetch new binary updates and install them. These updates can be scheduled using man:cron[8].
es: Las actualizaciones binarias son similares a utilizar `yum` o `apt-get` para actualizar un sistema Linux(R). En FreeBSD, se puede utilizar man:freebsd-update[8] para obtener e instalar actualizaciones binarias. Estas actualizaciones se pueden programar utilizando man:cron[8].
pt_br: As atualizações binárias são semelhantes ao uso do `yum` ou do `apt-get` para atualizar um sistema Linux(R). No FreeBSD, o man:freebsd-update[8] pode ser usado para buscar novas atualizações binárias e instalá-las. Essas atualizações podem ser agendadas usando o man:cron[8].
ru: Двоичные обновления аналогичны использованию `yum` или `apt-get` для обновления системы Linux(R). В FreeBSD, man:freebsd-update[8] может быть использован для получения и установки новых двоичных обновлений. Эти обновления могут быть запланированы с помощью man:cron[8].

source: When using man:cron[8] to schedule updates, use `freebsd-update cron` in the man:crontab[1] to reduce the possibility of a large number of machines all pulling updates at the same time:
es: Cuando se use man:cron[8] para planificar actualizaciones, utiliza `freebsd-update cron` en man:crontab[1] para reducir la posibilidad de un gran número de máquinas obteniendo las actualizaciones todas al mismo tiempo:
pt_br: Ao usar o man:cron[8] para agendar atualizações, use o `freebsd-update cron` no man:crontab[1] para reduzir a possibilidade de que um grande número de máquinas busque atualizações ao mesmo tempo:
ru: При использовании man:cron[8] для планирования обновлений используйте `freebsd-update cron` в man:crontab[1], чтобы снизить вероятность одновременного скачивания обновлений большим количеством машин:

source: For more information on source and binary updates, refer to extref:{handbook}[the chapter on updating, updating-upgrading-freebsdupdate] in the FreeBSD Handbook.
es: Para más información sobre las actualizaciones binarias, consulta extref:{handbook}[el capítulo sobre actualizaciones, updating-upgrading-freebsdupdate] en el FreeBSD Handbook.
pt_br: Para obter mais informações sobre as atualizações a partir do código-fonte e a partir de binários, consulte o extref:{handbook}[capítulo sobre atualizações, updating-upgrading-freebsdupdate] do Handbook do FreeBSD.
ru: Для получения дополнительной информации об обновлениях исходного кода и бинарных обновлениях обратитесь к extref:{handbook}cutting-edge/[главе об обновлениях, updating-upgrading-freebsdupdate] в Руководстве FreeBSD.

source: procfs: Gone But Not Forgotten
es: procfs: Desaparecido Pero No Olvidado
pt_br: procfs: desaparecido, mas não esquecido
ru: procfs: ушёл, но не забыт

source: In some Linux(R) distributions, one could look at [.filename]#/proc/sys/net/ipv4/ip_forward# to determine if IP forwarding is enabled. In FreeBSD, man:sysctl[8] is instead used to view this and other system settings.
es: En algunas distribuciones Linux(R), uno puede mirar en [.filename]#/proc/sys/net/ipv4/ip_forward# para determinar si IP forwarding está activado. En FreeBSD, se usa man:sysctl[8] para ver esta y otras configuraciones del sistema.
pt_br: Em algumas distribuições Linux(R), é possível verificar se o encaminhamento de IP está habilitado verificando o arquivo [.filename]#/proc/sys/net/ipv4/ip_forward#. No FreeBSD, o comando man:sysctl[8] é utilizado para visualizar essa e outras configurações do sistema.
ru: В некоторых дистрибутивах Linux(R) можно посмотреть файл [.filename]#/proc/sys/net/ipv4/ip_forward#, чтобы определить, включена ли IP-маршрутизация. В FreeBSD вместо этого используется man:sysctl[8] для просмотра этого и других системных параметров.

source: For example, use the following to determine if IP forwarding is enabled on a FreeBSD system:
es: Por ejemplo, utiliza lo siguiente para determinar si IP forwarding está activado en un sistema FreeBSD:
pt_br: Por exemplo, use o seguinte comando para verificar se o encaminhamento de IP está habilitado em um sistema FreeBSD:
ru: Например, используйте следующую команду, чтобы определить, включена ли IP-переадресация в системе FreeBSD:

source: Use `-a` to list all the system settings:
es: Usa `-a` para listar toda la configuración del sistema:
pt_br: Use a opção `-a` para listar todas as configurações do sistema:
ru: Используйте `-a` для вывода всех системных настроек:

source: If an application requires procfs, add the following entry to [.filename]#/etc/fstab#:
es: Si una aplicación necesita procfs, añade la siguiente línea a [.filename]#/etc/fstab#:
pt_br: Se um aplicativo requer o uso do procfs, adicione a seguinte entrada ao arquivo [.filename]#/etc/fstab#:
ru: Если приложению требуется procfs, добавьте следующую запись в [.filename]#/etc/fstab#:

source: Including `noauto` will prevent [.filename]#/proc# from being automatically mounted at boot.
es: Incluir `noauto` impedirá que [.filename]#/proc# se monte de forma automática al arrancar.
pt_br: Incluir o parâmetro `noauto` faz com que o diretório [.filename]#/proc# não seja montado automaticamente durante a inicialização do sistema.
ru: Добавление `noauto` предотвратит автоматическое монтирование [.filename]#/proc# при загрузке.

source: To mount the file system without rebooting:
es: Para montar el sistema de archivos sin reiniciar:
pt_br: Para montar o sistema de arquivos sem reiniciar o sistema:
ru: Чтобы подключить файловую систему без перезагрузки:

source: Common Commands
es: Comandos Comunes
pt_br: Comandos Comuns
ru: Распространенные команды

source: Some common command equivalents are as follows:
es: Algunos equivalentes de los comandos comunes son los siguientes:
pt_br: Alguns comandos comuns e equivalentes são os seguintes:
ru: Некоторые эквиваленты распространённых команд приведены ниже:

source: Linux(R) command (Red Hat/Debian)
es: Comando Linux(R) (Red Hat/Debian)
pt_br: Comando Linux(R) (Red Hat/Debian)
ru: Команда Linux(R) (Red Hat/Debian)

source: FreeBSD equivalent
es: Equivalente FreeBSD
pt_br: Equivalente FreeBSD
ru: Эквивалент FreeBSD

source: Purpose
es: Propósito
pt_br: Propósito
ru: Назначение

source: Install package from remote repository
es: Instalar un paquete de un repositorio remoto
pt_br: Instala um pacote a partir de um repositório remoto
ru: Установить пакет из удалённого репозитория

source: Install local package
es: Instalar un paquete local
pt_br: Instala um pacote local
ru: Установить локальный пакет

source: List installed packages
es: Listar paquetes instalados
pt_br: Lista os pacotes instalados
ru: Список установленных пакетов

source: List PCI devices
es: Listar dispositivos PCI
pt_br: Lista os dispositivos PCI
ru: Перечислить устройства PCI

source: List loaded kernel modules
es: Listar módulos del kernel cargados
pt_br: Lista os módulos do kernel carregados
ru: Перечислить загруженные модули ядра

source: Load/Unload kernel modules
es: Cargar/Descargar módulos del kernel
pt_br: Carrega / Descarrega módulos do kernel
ru: Загрузка/выгрузка модулей ядра

source: Trace system calls
es: Trazar llamadas al sistema
pt_br: Rastrea as chamadas de sistema
ru: Трассировка системных вызовов

source: Conclusion
es: Conclusión
pt_br: Conclusão
ru: Заключение

source: This document has provided an overview of FreeBSD. Refer to the extref:{handbook}[FreeBSD Handbook] for more in-depth coverage of these topics as well as the many topics not covered by this document.
es: Este documento ha proporcionado un resumen de FreeBSD. Consulta el extref:{handbook}[FreeBSD Handbook] para una cobertura más en profundidad sobre estos temas así como de muchos de los temas no cubiertos en este documento.
pt_br: Este documento forneceu uma visão geral do FreeBSD. Consulte o extref:{handbook}[Handbook do FreeBSD] para obter uma cobertura mais detalhada desses tópicos, bem como de muitos outros tópicos não abordados por este documento.
ru: Этот документ предоставил обзор FreeBSD. Для более детального изучения этих тем, а также многих других, не рассмотренных в данном документе, обратитесь к extref:{handbook}[Руководству FreeBSD].

source: Ports
pt_br: Árvore de Ports
ru: Порты

source: A complete list of all available ports and packages can be found https://ports.freebsd.org[here].
ru: Полный список всех доступных портов и пакетов можно найти https://ports.freebsd.org[здесь].
