Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/linux-users/_index.po
Languages: es, pt_br, ru

source: This document is intended to quickly familiarize intermediate to advanced Linux® users with the basics of FreeBSD.
es: Este documento está pensado para que usuarios intermedios o avanzados de Linux(R) se familiaricen rápido con el funcionamiento básico de FreeBSD.
pt_br: Este documento destina-se a familiarizar rapidamente os usuários intermediários a avançados do Linux® com os conceitos básicos do FreeBSD.
ru: Этот документ предназначен для быстрого ознакомления с основами FreeBSD пользователей Linux® среднего и продвинутого уровня.

source: FreeBSD Quickstart Guide for Linux® Users
es: Guía Rápida de FreeBSD para Usuarios de Linux(R)
pt_br: Guia de Início Rápido do FreeBSD para Usuários do Linux®
ru: Быстрое руководство по FreeBSD для пользователей Linux®

source: FreeBSD Quickstart Guide for Linux(R) Users
es: Guía Rápida de FreeBSD para Usuarios de Linux(R)
pt_br: Guia de Início Rápido do FreeBSD para Usuários do Linux(R)
ru: Быстрое руководство по FreeBSD для пользователей Linux(R)

source: Abstract
es: Resumen
pt_br: Resumo
ru: Аннотация

source: This document is intended to quickly familiarize intermediate to advanced Linux(R) users with the basics of FreeBSD.
es: Este documento está pensado para que usuarios intermedios y avanzados de Linux(R) se familiaricen rápidamente con el funcionamiento de FreeBSD.
pt_br: Este documento tem como objetivo familiarizar rapidamente os usuários intermediários a avançados do Linux(R) com os conceitos básicos do FreeBSD.
ru: Этот документ предназначен для быстрого ознакомления с основами FreeBSD пользователей Linux(R) среднего и продвинутого уровня.

source: Introduction
es: Introducción
pt_br: Introdução
ru: Введение

source: This document highlights some of the technical differences between FreeBSD and Linux(R) so that intermediate to advanced Linux(R) users can quickly familiarize themselves with the basics of FreeBSD.
es: Este documento resalta algunas de las diferencias técnicas entre FreeBSD y Linux(R) de forma que los usuarios intermedios y avanzados de Linux(R) se puedan familiarizar con el funcionamiento básico de FreeBSD.
pt_br: Este documento destaca algumas das diferenças técnicas entre o FreeBSD e o Linux(R) para que os usuários intermediários a avançados do Linux® possam se familiarizar rapidamente com os conceitos básicos do FreeBSD.
ru: В этом документе освещаются некоторые технические различия между FreeBSD и Linux(R), чтобы пользователи Linux(R) среднего и продвинутого уровней могли быстро ознакомиться с основами FreeBSD.

source: This document assumes that FreeBSD is already installed. Refer to the extref:{handbook}[Installing FreeBSD, bsdinstall] chapter of the FreeBSD Handbook for help with the installation process.
es: Este documento asume que FreeBSD ya está instalado. Consulta el capítulo extref:{handbook}[Instalar FreeBSD, bsdinstall] del FreeBSD Handbook para obtener ayuda con el proceso de instalación.
pt_br: Este documento pressupõe que o FreeBSD já está instalado. Consulte o capítulo extref:{handbook}[Instalando o FreeBSD, bsdinstall] no Handbook para obter ajuda com o processo de instalação.
ru: Этот документ предполагает, что FreeBSD уже установлена. Для получения помощи по процессу установки обратитесь к главе extref:{handbook}[Установка FreeBSD, bsdinstall] Руководства FreeBSD.

source: Default Shell
es: Shell por Defecto
pt_br: Shell Padrão
ru: Стандартная оболочка

source: Linux(R) users are often surprised to find that Bash is not the default shell in FreeBSD. In fact, Bash is not included in the default installation. Instead, the Bourne shell-compatible man:sh[1] as the default user shell. The root shell is man:tcsh[1] by default on FreeBSD 13 and earlier and man:sh[1] on FreeBSD 14 and later. man:sh[1] is very similar to Bash but with a much smaller feature-set. Generally shell scripts written for man:sh[1] will run in Bash, but the reverse is not always true.
es: Los usuarios de Linux(R) normalmente se sorprenden al ver que Bash no es el shell por defecto en FreeBSD. De hecho, Bash no se incluye en la instalación por defecto. En su lugar, se usa por defecto el shell compatible con Bourne man:sh[1] para los usuarios. El shell por defecto para root es man:tcsh[1] en FreeBSD 13 y anteriores y man:sh[1] en FreeBSD 14 y posteriores man:sh[1] es muy similar a Bash pero con muchas menos funcionalidades. Normalmente los shell scripts escritos para man:sh[1] se podrán ejecutar en Bash, pero a la inversa no es siempre cierto.
pt_br: Usuários de Linux(R) muitas vezes se surpreendem ao descobrir que o Bash não é a shell padrão no FreeBSD. Na verdade, o Bash não está incluído na instalação padrão. Em vez disso, a shell compatível com o shell Bourne, man:sh[1], é a shell padrão dos usuários. Por padrão a shell do usuário root é a man:tcsh[1] no FreeBSD 13 e nas versões anteriores, já no FreeBSD 14 e versões posteriores é a man:sh[1]. A man:sh[1] é muito semelhante ao Bash, mas com um conjunto de recursos muito menor. Geralmente, os scripts de shell escritos para aman:sh[1] serão executados no Bash, mas o contrário nem sempre é verdadeiro.
ru: Пользователи Linux(R) часто удивляются, обнаружив, что Bash не является оболочкой по умолчанию в FreeBSD. На самом деле, Bash не включён в стандартную установку. Вместо этого используется совместимая с Bourne shell оболочка man:sh[1] в качестве оболочки пользователя по умолчанию. Оболочка root — это man:tcsh[1] по умолчанию в FreeBSD 13 и более ранних версиях и man:sh[1] в FreeBSD 14 и позднее. Оболочка man:sh[1] очень похожа на Bash, но имеет гораздо меньший набор возможностей. Как правило, скрипты, написанные для man:sh[1], будут работать в Bash, но обратное не всегда верно.

source: However, Bash and other shells are available for installation using the FreeBSD extref:{handbook}[Packages and Ports Collection, ports].
es: Sin embargo, Bash y otros shells están disponibles para su instalación utilizando los extref:{handbook}[Paquetes y la Colección de Ports, ports] de FreeBSD.
pt_br: No entanto, o Bash e outros shells estão disponíveis para instalação usando a extref:{handbook}[Coleção de Pacotes e Ports do FreeBSD, ports].
ru: Однако Bash и другие оболочки доступны для установки через extref:{handbook}[Коллекцию портов и пакетов FreeBSD, ports].

source: After installing another shell, use man:chsh[1] to change a user's default shell. It is recommended that the `root` user's default shell remain unchanged since shells which are not included in the base distribution are installed to [.filename]#/usr/local/bin#. In the event of a problem, the file system where [.filename]#/usr/local/bin# is located may not be mounted. In this case, `root` would not have access to its default shell, preventing `root` from logging in and fixing the problem.
es: Después de instalar otro shell, utiliza man:chsh[1] para cambiar el shell por defecto del usuario. Se recomienda que no se cambie el shell por defecto del usuario root ya que los shells que no se incluyen en la distribución base se instalan en [.filename]#/usr/local/bin#. En caso de que haya un problema, el sistema de ficheros donde se encuentra [.filename]#/usr/local/bin# podría no ser montado. En ese caso, `root` podría no tener acceso a su shell por defecto, evitando que pueda iniciar sesión y arreglar el problema.
pt_br: Após instalar outro shell, use o man:chsh[1] para mudar o shell padrão do usuário. É recomendado que o shell padrão do usuário `root` permaneça inalterado, já que shells que não estão incluídas na distribuição base são instalados em [.filename]#/usr/local/bin#. Em caso de problema, o sistema de arquivos onde o [.filename]#/usr/local/bin# está localizado pode não estar montado. Nesse caso, o usuário `root` não teria acesso ao seu shell padrão, o que impediria o `root` de fazer login e corrigir o problema.
ru: После установки другой оболочки используйте man:chsh[1], чтобы изменить оболочку пользователя по умолчанию. Рекомендуется оставить оболочку пользователя `root` без изменений, поскольку оболочки, не входящие в базовую поставку, устанавливаются в [.filename]#/usr/local/bin#. В случае возникновения проблемы файловая система, в которой находится [.filename]#/usr/local/bin#, может быть не смонтирована. В такой ситуации у `root` не будет доступа к своей оболочке по умолчанию, что помешает ему войти в систему и устранить проблему.

source: Packages and Ports: Adding Software in FreeBSD
es: Paquetes y Ports: Instalar Software en FreeBSD
pt_br: Pacotes e Ports: Adicionando Softwares no FreeBSD
ru: Пакеты и порты: установка программ в FreeBSD

source: FreeBSD provides two methods for installing applications: binary packages and compiled ports. Each method has its own benefits:
es: FreeBSD proporciona dos métodos para instalar aplicaciones: paquetes binarios y ports compilados. Cada método tiene sus propias ventajas:
pt_br: O FreeBSD oferece dois métodos para instalar aplicativos: pacotes binários e ports compilados. Cada método tem seus próprios benefícios:
ru: FreeBSD предоставляет два метода установки приложений: бинарные пакеты и скомпилированные порты. Каждый метод имеет свои преимущества:

source: Binary Packages
es: Paquetes Binarios
pt_br: Pacotes Binários
ru: Бинарные пакеты

source: Faster installation as compared to compiling large applications.
es: Instalación más rápida comparado con la compilación de aplicaciones de gran tamaño.
pt_br: Instalação mais rápida em comparação à compilação de aplicativos grandes.
ru: Быстрая установка по сравнению с компиляцией крупных приложений.

source: Does not require an understanding of how to compile software.
es: No es necesario saber cómo compilar software.
pt_br: Não requer compreensão de como compilar o software.
ru: Не требует понимания того, как компилировать программное обеспечение.

source: No need to install a compiler.
es: No es necesario instalar un compilador.
pt_br: Não é necessário instalar um compilador.
ru: Нет необходимости устанавливать компилятор.

source: Ability to customize installation options.
es: Posibilidad de personalizar las opciones de instalación.
pt_br: Capacidade de personalizar as opções de instalação.
ru: Возможность настройки параметров установки.

source: Custom patches can be applied.
es: Se pueden aplicar parches personalizados.
pt_br: Possibilidade de aplicar patches personalizados.
ru: Могут быть применены пользовательские патчи.

source: If an application installation does not require any customization, installing the package is sufficient. Compile the port instead whenever an application requires customization of the default options. If needed, a custom package can be compiled from ports using `make package`.
es: Si la instalación de una aplicación no necesita ninguna personalización, instalar el paquete es suficiente. En cambio, compila el port cuando una aplicación requiera personalización de las opciones por defecto. Si es necesario, se puede compilar un paquete personalizado a partir de ports utilizando `make package`.
pt_br: Se a instalação de um aplicativo não requer personalização, a instalação do pacote é suficiente. Compile o port sempre que um aplicativo exigir personalização das opções padrão. Se necessário, um pacote personalizado pode ser compilado a partir do ports usando o comando `make package`.
ru: Если установка приложения не требует дополнительной собственной настройки, достаточно установить пакет. Собирайте порт, если приложению требуется изменение параметров, заданных в пакетах по умолчанию. При необходимости собственный пакет можно собрать из портов с помощью `make package`.

source: A complete list of all available ports and packages can be found https://www.freebsd.org/ports/[here].
es: https://www.freebsd.org/ports/[Aquí] se puede encontrar una lista completa de todos los ports y paquetes disponibles.
pt_br: Uma lista completa de todos os ports e pacotes disponíveis pode ser encontrada https://www.freebsd.org/ports/[aqui].

source: Packages
es: Paquetes
pt_br: Pacotes
ru: Пакеты

source: Packages are pre-compiled applications, the FreeBSD equivalents of [.filename]#.deb# files on Debian/Ubuntu based systems and [.filename]#.rpm# files on Red Hat/Fedora based systems. Packages are installed using `pkg`. For example, the following command installs Apache 2.4:
es: Los paquetes son aplicaciones precompiladas, los equivalentes en FreeBSD de los ficheros [.filename]#.deb# de sistemas basados en Debian/Ubuntu y los ficheros [.filename]#.rpm# files en los sistemas basados en Red Hat/Fedora. Los paquetes se instalan utilizando `pkg`. Por ejemplo, el siguiente comando instala Apache 2.4:
pt_br: Pacotes são aplicativos pré-compilados, os equivalentes no FreeBSD dos arquivos [.filename]#.deb# em sistemas baseados em Debian/Ubuntu e [.filename]#.rpm# em sistemas baseados em Red Hat/Fedora. Os pacotes são instalados usando o comando `pkg`. Por exemplo, o seguinte comando instala o Apache 2.4:
ru: Пакеты — это предварительно скомпилированные приложения, эквиваленты файлов [.filename]#.deb# в системах на основе Debian/Ubuntu и файлов [.filename]#.rpm# в системах на основе Red Hat/Fedora. Пакеты устанавливаются с помощью `pkg`. Например, следующая команда устанавливает Apache 2.4:

source: For more information on packages refer to section 5.4 of the FreeBSD Handbook: extref:{handbook}[Using pkgng for Binary Package Management, pkgng-intro].
es: Para más información acerca de paquetes consulta la sección 5.4 del FreeBSD Handbook: extref:{handbook}[Usar pkgng para la Gestión de Paquetes Binarios, pkgng-intro].
pt_br: Para mais informações sobre pacotes, consulte a seção 5.4 do Handbook do FreeBSD: extref:{handbook}[Usando o pkgng para Gerenciamento de Pacotes Binários, pkgng-intro].
ru: Для получения дополнительной информации о пакетах обратитесь к разделу 4.4 Руководства FreeBSD: extref:{handbook}ports/[Использование pkg для управления бинарными пакетами, pkgng-intro].

source: The FreeBSD Ports Collection is a framework of [.filename]#Makefiles# and patches specifically customized for installing applications from source on FreeBSD. When installing a port, the system will fetch the source code, apply any required patches, compile the code, and install the application and any required dependencies.
es: La Colección de Ports de FreeBSD es un framework de [.filename]#Makefiles# y parches específicamente personalizados para instalar aplicaciones con su código fuente en FreeBSD. Al instalar un port, el sistema buscará el código fuente, aplicará los parches necesarios, compilará el código e instalará la aplicación y las dependencias necesarias.
pt_br: A Coleção de Ports do FreeBSD é um conjunto de [.filename]#Makefiles# e patches específicos para instalar aplicativos a partir do código-fonte no FreeBSD. Ao instalar um port, o sistema buscará o código-fonte, aplicará os patches necessários, compilando o código e instalando o aplicativo e quaisquer dependências necessárias.
ru: Коллекция портов FreeBSD — это набор [.filename]#Makefile# и патчей, специально адаптированных для установки приложений из исходного кода в FreeBSD. При установке порта система загрузит исходный код, применит необходимые патчи, скомпилирует код и установит приложение вместе с требуемыми зависимостями.

source: The Ports Collection, sometimes referred to as the ports tree, can be installed to [.filename]#/usr/ports# using link:{handbook}mirrors/#git[Git]. Detailed instructions for installing the Ports Collection can be found in extref:{handbook}[section 4.5.1, ports-using-installation-methods] of the FreeBSD Handbook.
es: La Colección de Ports, a veces llamada árbol de ports (ports tree), se puede instalar en [.filename]#/usr/ports# utilizando link:{handbook}mirrors/#git[Git]. Se pueden encontrar instrucciones detalladas para instalar la Colección de Ports en la extref:{handbook}[sección 4.5.1, ports-using-installation-methods] del FreeBSD Handbook.
pt_br: A Coleção de Ports, às vezes referida como árvore de ports, pode ser instalada em [.filename]#/usr/ports# usando o link:{handbook}mirrors/#git[Git]. Instruções detalhadas para a instalação da Coleção de Ports podem ser encontradas na extref:{handbook}[seção 4.5.1, ports-using-installation-methods] do Handbook do FreeBSD.
ru: Коллекция портов, иногда называемая деревом портов, может быть установлена в [.filename]#/usr/ports# с помощью link:{handbook}mirrors/#git[Git]. Подробные инструкции по установке Коллекции портов можно найти в extref:{handbook}ports/[разделе 4.5.1, ports-using-installation-methods] Руководства FreeBSD.

source: To compile a port, change to the port's directory and start the build process. The following example installs Apache 2.4 from the Ports Collection:
es: Para compilar un port, cambia al directorio del port e inicia el proceso de construcción. El siguiente ejemplo instala Apache 2.4 desde la Colección de Ports:
pt_br: Para compilar um port, mude para o diretório do port e inicie o processo de compilação. O seguinte exemplo instala o Apache 2.4 a partir da Coleção de Ports:
ru: Для сборки порта перейдите в его каталог и запустите процесс сборки. В следующем примере устанавливается Apache 2.4 из коллекции портов:

source: A benefit of using ports to install software is the ability to customize the installation options. This example specifies that the mod_ldap module should also be installed:
es: Un beneficio de usar ports para instalar software es la posibilidad de personalizar las opciones de instalación. Este ejemplo especifica que el módulo mod_ldap debería instalarse también:
pt_br: Um benefício de usar o ports para instalar software é a capacidade de personalizar as opções de instalação. Este exemplo especifica que o módulo mod_ldap também deve ser instalado:
ru: Преимущество использования портов для установки программного обеспечения заключается в возможности настройки параметров установки. В этом примере указано, что также должен быть установлен модуль mod_ldap:

source: Refer to extref:{handbook}[Using the Ports Collection, ports-using] for more information.
es: Consulta extref:{handbook}[Usar la Colección de Ports, ports-using] para más información.
pt_br: Para mais informações, consulte extref:{handbook}[Usando a Coleção de Ports, ports-using] no Handbook do FreeBSD.
ru: Обратитесь к extref:{handbook}ports/[Использование коллекции портов, ports-using] для получения дополнительной информации.

source: System Startup
es: Inicio del Sistema
pt_br: Inicialização do Sistema
ru: Загрузка системы

source: Many Linux(R) distributions use the SysV init system, whereas FreeBSD uses the traditional BSD-style man:init[8]. Under the BSD-style man:init[8], there are no run-levels and [.filename]#/etc/inittab# does not exist. Instead, startup is controlled by man:rc[8] scripts. At system boot, [.filename]#/etc/rc# reads [.filename]#/etc/rc.conf# and [.filename]#/etc/defaults/rc.conf# to determine which services are to be started. The specified services are then started by running the corresponding service initialization scripts located in [.filename]#/etc/rc.d/# and [.filename]#/usr/local/etc/rc.d/#. These scripts are similar to the scripts located in [.filename]#/etc/init.d/# on Linux(R) systems.
es: Muchas distribuciones Linux(R) utilizan el sistema de arranque de SysV, mientras que FreeBSD utiliza el man:init[8] tradicional de BSD. Bajo el man:init[8] tradicional de BSD, no hay niveles de ejecución (run-levels) y no existe [.filename]#/etc/inittab#. En su lugar, el arranque se controla con scripts man:rc[8]. Cuando el sistema arranca, [.filename]#/etc/rc# lee [.filename]#/etc/rc.conf# y [.filename]#/etc/defaults/rc.conf# para determinar qué servicios se tienen que arrancar. Los servicios especificados se arrancan ejecutando el script de inicialización correspondiente situado en [.filename]#/etc/rc.d/# y [.filename]#/usr/local/etc/rc.d/#. Estos scripts son parecidos a los que se encuentran en [.filename]#/etc/init.d/# en los sistemas Linux(R).
pt_br: Muitas distribuições Linux(R) usam o sistema SysV init, enquanto o FreeBSD usa o tradicional estilo BSD de man:init[8]. Sob o estilo BSD de man:init[8], não há run-levels e o arquivo [.filename]#/etc/inittab# não existe. Em vez disso, a inicialização é controlada pelos scripts man:rc[8]. No boot do sistema, o arquivo [.filename]#/etc/rc# lê os arquivos [.filename]#/etc/rc.conf# e [.filename]#/etc/defaults/rc.conf# para determinar quais serviços devem ser iniciados. Os serviços especificados são então iniciados executando os scripts de inicialização de serviço correspondentes localizados em [.filename]#/etc/rc.d/# e [.filename]#/usr/local/etc/rc.d/#. Esses scripts são semelhantes aos scripts localizados em [.filename]#/etc/init.d/# nos sistemas Linux(R).
ru: Многие дистрибутивы Linux(R) используют систему инициализации SysV, тогда как FreeBSD использует традиционный BSD-стиль man:init[8]. В BSD-стиле man:init[8] нет уровней запуска (run-levels), и файл [.filename]#/etc/inittab# отсутствует. Вместо этого запуск системы управляется сценариями man:rc[8]. При загрузке системы [.filename]#/etc/rc# читает [.filename]#/etc/rc.conf# и [.filename]#/etc/defaults/rc.conf#, чтобы определить, какие службы должны быть запущены. Указанные службы затем запускаются путем выполнения соответствующих сценариев инициализации, расположенных в [.filename]#/etc/rc.d/# и [.filename]#/usr/local/etc/rc.d/#. Эти сценарии аналогичны сценариям, расположенным в [.filename]#/etc/init.d/# в системах Linux(R).

source: The scripts found in [.filename]#/etc/rc.d/# are for applications that are part of the "base" system, such as man:cron[8], man:sshd[8], and man:syslog[3]. The scripts in [.filename]#/usr/local/etc/rc.d/# are for user-installed applications such as Apache and Squid.
es: Los scripts que se encuentran en [.filename]#/etc/rc.d/# son para aplicaciones que forman parte del sistema "base", como man:cron[8], man:sshd[8], y man:syslog[3]. Los scripts en [.filename]#/usr/local/etc/rc.d/# son para aplicaciones instaladas por el usuario como Apache y Squid.
pt_br: Os scripts encontrados em [.filename]#/etc/rc.d/# são relacionados aos aplicativos que fazem parte do sistema "base", como man:cron[8], man:sshd[8] e man:syslog[3]. Os scripts em [.filename]#/usr/local/etc/rc.d/# são relacionados aos aplicativos instalados pelo usuário, como o Apache e o Squid.
ru: Скрипты, расположенные в [.filename]#/etc/rc.d/#, предназначены для приложений, входящих в "базовую" систему, таких как man:cron[8], man:sshd[8] и man:syslog[3]. Скрипты в [.filename]#/usr/local/etc/rc.d/# предназначены для пользовательских приложений, таких как Apache и Squid.
