Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/weblate/_index.po
Languages: pt_br, ru

source: How to join the FreeBSD translators team and translate online on Weblate
pt_br: Como entrar para a equipe de tradutores do FreeBSD e traduzir online no Weblate
ru: Как присоединиться к команде переводчиков FreeBSD и переводить онлайн в Weblate

source: Chapter 10. Weblate Translations
pt_br: Capítulo 10. Traduções Weblate
ru: Глава 10. Переводы в Weblate

source: Weblate Translations
pt_br: Traduções Weblate
ru: Переводы в Weblate

source: Introduction
pt_br: Introdução
ru: Введение

source: This chapter describes some basic steps for joining the FreeBSD translators team, translating online on Weblate or offline, and some simple suggestions on translating, proofreading, and testing. It's focused on the translation part.
pt_br: Este capítulo descreve alguns passos básicos para ingressar na equipe de tradutores do FreeBSD, traduzindo online no Weblate ou offline, e algumas sugestões simples sobre tradução, revisão e teste. O foco é na parte da tradução.
ru: Эта глава описывает основные шаги для присоединения к команде переводчиков FreeBSD, перевода онлайн в Weblate или офлайн, а также содержит простые рекомендации по переводу, вычитке и тестированию. Основное внимание уделено части, связанной с переводом.

source: The original documents (articles and books) are in the {main-site}[documentation portal].
pt_br: Os documentos originais (artigos e livros) estão no {main-site-en}[portal de documentação].
ru: Исходные документы (статьи и книги) находятся на {main-site}[портале документации].

source: https://weblate.org/en/[Weblate] is web-based open-source software focused on localization; the FreeBSD project runs a local instance.
pt_br: https://weblate.org/en/[Weblate] é um software web de código aberto com foco em idiomas; o projeto FreeBSD possui uma instância local.
ru: https://weblate.org/en/[Weblate] — это веб-ориентированное программное обеспечение с открытым исходным кодом, специализирующееся на локализации. Проект FreeBSD поддерживает собственный экземпляр.

source: How to Become a FreeBSD Translator
pt_br: Como se Tornar um Tradutor do FreeBSD
ru: Как стать переводчиком FreeBSD

source: Following are simple steps to start translating articles and books of the FreeBSD Documentation Project.
pt_br: A seguir seguem os passos para começar a traduzir artigos e livros do Projeto de Documentação do FreeBSD.
ru: Вот простые шаги для начала перевода статей и книг проекта документации FreeBSD.

source: Create an account on the https://translate-dev.freebsd.org/[FreeBSD Weblate instance] with an email address or your GitHub account.
pt_br: Crie uma conta na https://translate-dev.freebsd.org/[instância Weblate do FreeBSD] com um endereço de e-mail ou sua conta GitHub.
ru: Создайте учетную запись на https://translate-dev.freebsd.org/[FreeBSD Weblate] с помощью электронной почты или вашего аккаунта GitHub.

source: Subscribe to the {freebsd-translators}.
pt_br: Inscreva-se na {freebsd-translators}.
ru: Подписаться на список рассылки {freebsd-translators}.

source: Introduce yourself and ask to join a language team. If the language team does not exist, ask to create it. The self-introduction is essential. It raises your chances of being approved for write access.
pt_br: Apresente-se e peça para participar de uma equipe de idiomas. Se a equipe de idiomas não existir, peça para criá-la. A auto-apresentação é essencial. Isso aumenta suas chances de ser aprovado para acesso de escrita.
ru: Представьтесь и попросите присоединиться к языковой команде. Если языковая команда не существует, попросите создать её. Самопредставление обязательно. Оно увеличивает шансы на одобрение доступа на запись.

source: Login to https://translate-dev.freebsd.org/[Weblate] with the new account.
pt_br: Acesse o https://translate-dev.freebsd.org/[Weblate] com a nova conta.
ru: Войдите в https://translate-dev.freebsd.org/[Weblate] с новым аккаунтом.

source: Find the language team and choose an initial document to translate.
pt_br: Encontre a equipe de idiomas e escolha um documento inicial para traduzir.
ru: Найдите языковую команду и выберите первый документ для перевода.

source: Create a Bugzilla account to submit the translations after finishing a document. The Documentation project is also accepting GitHub Pull Requests with translation submissions.
pt_br: Crie uma conta no Bugzilla para enviar as traduções depois de terminar um documento. O projeto de documentação também está aceitando Pull Requests do GitHub com envio de traduções.
ru: Создайте учетную запись в Bugzilla, чтобы отправлять переводы после завершения работы над документом. Проект документации также принимает Pull Requests на GitHub с переводами.

source: All translation files and documents must follow https://www.freebsd.org/copyright/freebsd-doc-license/[The FreeBSD Documentation License]; if this is unacceptable, please do not sign up or send any patches or translations.
pt_br: Todos os arquivos de tradução e documentos devem seguir a https://www.freebsd.org/copyright/freebsd-doc-license/[Licença de Documentação do FreeBSD]; se isso não for aceitável, por favor, não se inscreva ou envie patches ou traduções.
ru: Все файлы переводов и документы должны соответствовать https://www.freebsd.org/copyright/freebsd-doc-license/[Лицензии документации FreeBSD]; если это неприемлемо, пожалуйста, не регистрируйтесь и не присылайте никаких исправлений или переводов.

source: Introduce Yourself
pt_br: Apresente-se
ru: Представьтесь

source: Please provide a brief self-introduction on the {freebsd-translators} to initiate the process of granting access. This will enable a language coordinator or administrator to provide the necessary permissions for the new user of Weblate to start translating.
pt_br: Forneça uma breve auto-apresentação na {freebsd-translators} para iniciar o processo de concessão de acesso. Isso permitirá que um coordenador ou administrador de idiomas forneça as permissões necessárias para que o novo usuário do Weblate comece a traduzir.
ru: Предоставьте краткое самопредставление в рассылке {freebsd-translators}, чтобы начать процесс предоставления доступа. Это позволит координатору языка или администратору выдать необходимые права новому пользователю Weblate для начала перевода.

source: Following is an example of how such an email could look.
pt_br: A seguir está um exemplo de como tal e-mail poderia parecer.
ru: Ниже приведен пример того, как может выглядеть такое письмо.

source: Name: Name (use preferred name) Location: City, country (optional) Login: username or email (essential) Language: Language to translate (essential) Profession or student status: (optional) About You: (free format -- info which you feel comfortable sharing with others: company, school, other affiliation, historical qualifications, other projects you have worked on, level and type of computer skills, other relevant skills, etc.) You and the FreeBSD Project: (free format: other FreeBSD projects of interest, comments, etc.)
pt_br: Name: Name (usar nome preferido) Location: City, country (opcional) Login: username or email (essencial) Language: Language to translate (essencial) Profession or student status: (opcional) About You: (formato livre -- informações com as quais você se sente à vontade para compartilhar others: empresa, escola, outra afiliação, habilitações históricas, outras projetos em que você trabalhou, nível e tipo de conhecimento de informática, outras habilidades relevantes, etc.) You and the FreeBSD Project: (formato livre: outros projetos FreeBSD de interesse, comentários, etc.)

source: Login to Weblate
pt_br: Entrar no Weblate
ru: Вход в Weblate

source: Open https://translate-dev.freebsd.org/[] and `Sign in`.
pt_br: Abra https://translate-dev.freebsd.org/[] e `Entre`.
ru: Откройте https://translate-dev.freebsd.org/[] и `Войдите` (Sign in).

source: Weblate Login
pt_br: Login Weblate
ru: Логин в Webleate

source: Use a username, email address, or GitHub account to log in.
pt_br: Use um nome de usuário, endereço de e-mail ou conta do GitHub para fazer login.
ru: Используйте имя пользователя, адрес электронной почты или учетную запись GitHub для входа.

source: The user profile contains your preferences, name, and email address. The name and address will be used in commits; keep this information accurate.
pt_br: O perfil do usuário contém suas preferências, nome e endereço de e-mail. O nome e o endereço serão usados nos commits; mantenha esta informação atualizada.
ru: Профиль пользователя содержит ваши предпочтения, имя и адрес электронной почты. Имя и адрес будут использоваться в коммитах; сохраняйте эту информацию актуальной.

source: On the FreeBSD Weblate instance, all translations will be committed to https://github.com/freebsd/freebsd-doc-translate[freebsd-doc-translate] (an intermediate repository on GitHub), not directly to https://github.com/freebsd/freebsd-doc[freebsd-doc]. Translators must take the PO gettext files (`.po`), converting them to `.adoc` and submit it via https://bugs.freebsd.org/bugzilla/[Bugzilla] or https://github.com/freebsd/freebsd-doc/pulls[GitHub] to get the translated document published or updated in the documentation portal. See more in the following sections.
pt_br: Na instância Weblate do FreeBSD, todas as traduções serão enviadas para o https://github.com/freebsd/freebsd-doc-translate[freebsd-doc-translate] (um repositório intermediário no GitHub), e não diretamente para o https://github.com/freebsd/freebsd-doc[freebsd-doc]. Os tradutores devem pegar os arquivos PO gettext (`.po`), converte-los para `.adoc` e submete-los via https://bugs.freebsd.org/bugzilla/[Bugzilla] ou https://github.com/freebsd/freebsd-doc/pulls[GitHub] para publicar ou atualizar o documento traduzido no portal de documentação. Veja mais nas seções a seguir.
ru: На экземпляре Weblate FreeBSD все переводы будут зафиксированы в https://github.com/freebsd/freebsd-doc-translate[freebsd-doc-translate] (промежуточном репозитории на GitHub), а не напрямую в https://github.com/freebsd/freebsd-doc[freebsd-doc]. Переводчики должны брать файлы PO gettext (`.po`), преобразовывать их в `.adoc` и отправлять через https://bugs.freebsd.org/bugzilla/[Bugzilla] или https://github.com/freebsd/freebsd-doc/pulls[GitHub], чтобы переведённый документ был опубликован или обновлён в портале документации. Подробнее см. в следующих разделах.

source: Weblate will commit daily, at least to `freebsd-doc-translate`, if any new strings are translated.
pt_br: O Weblate irá enviar os commits diariamente, pelo menos, para o `freebsd-doc-translate`, se quaisquer novas strings forem traduzidas.
ru: Weblate будет фиксировать изменения ежедневно, как минимум в `freebsd-doc-translate`, если есть новые переведённые строки.

source: Find a Language Team to Join In
pt_br: Encontre uma Equipe de Idiomas para Participar
ru: Найти команду локализации для участия

source: Click `Projects`, choose `Documentation`, then click `Languages`, and see all the available languages.
pt_br: Clique em `Projetos`, escolha `Documentação`, depois clique em `Idiomas` e veja todos os idiomas disponíveis.
ru: Нажмите `Проекты`, выберите `Документация`, затем нажмите `Языки` и увидите все доступные языки.

source: Weblate Languages
pt_br: Idiomas Weblate
ru: Языки в Weblate

source: Note that some languages and translated documents already exist in the documentation portal and repositories.
pt_br: Observe que alguns idiomas e documentos traduzidos já existem no portal de documentação e repositórios.
ru: Обратите внимание, что некоторые языки и переведённые документы уже доступны в портале документации и репозиториях.

source: If the desired language for translation is not available in Weblate, please contact the https://www.freebsd.org/docproj/translations/[language coordinators] before asking to create a new language. If there is no answer, then write to the {doceng}.
pt_br: Se o idioma desejado para tradução não estiver disponível no Weblate, entre em contato com os https://www.freebsd.org/docproj/translations/[coordenadores de idiomas] antes de solicitar a criação de um novo idioma. Se não houver resposta, entre em contato com a {doceng}.
ru: Если желаемый язык для перевода недоступен в Weblate, пожалуйста, свяжитесь с https://www.freebsd.org/docproj/translations/[координаторами по языкам], прежде чем запрашивать создание нового языка. Если ответа не последует, обратитесь по адресу: {doceng}.

source: Translating Online on Weblate
pt_br: Traduzindo Online no Weblate
ru: Перевод онлайн на Weblate

source: Translating documents online proves to be the easiest method for document translation on FreeBSD, as it allows users to collaborate on the same file, distributing the workload.
pt_br: Traduzir documentos online tende a ser o método mais fácil para tradução de documentos no FreeBSD, pois permite que os usuários trabalhem no mesmo arquivo, distribuindo a carga de trabalho.
ru: Перевод документов онлайн оказывается наиболее простым способом перевода документации в FreeBSD, так как позволяет пользователям совместно работать над одним файлом, распределяя нагрузку.

source: Once a coordinator or administrator grants access to a specific language for a username, the save button will be enabled, so that this user can start translating.
pt_br: Assim que um coordenador ou administrador conceder acesso a um idioma específico para um usuário, o botão salvar será habilitado para que esse usuário possa começar a traduzir.
ru: После того как координатор или администратор предоставит пользователю доступ к определённому языку, кнопка сохранения станет активной, и пользователь сможет начать перевод.

source: Weblate Documents
pt_br: Documentos Weblate
ru: Weblate Документы

source: Weblate has a set of links that lead to actual translation. The translation is further divided into individual checks, like `Untranslated` or `Needing review`. If the whole document is translated without any error, `All translations` link is still available in case a review is necessary. Alternatively, the search field can be used to find a specific string or term.
pt_br: O Weblate possui um conjunto de links que levam à tradução. A tradução é dividida em verificações individuais, como `Não traduzido` ou `Precisando de revisão`. Se todo o documento estiver traduzido sem nenhum erro, o link `Todas as traduções` ainda estará disponível caso uma revisão seja necessária. Como alternativa, o campo de pesquisa pode ser usado para localizar uma string ou termo específico.
ru: В Weblate есть набор ссылок, ведущих к непосредственному переводу. Перевод далее разделён на отдельные проверки, такие как `Не переведено` или `Требует проверки`. Если весь документ переведён без ошибок, ссылка `Все переводы` всё равно доступна на случай, если потребуется проверка. Также можно воспользоваться полем поиска, чтобы найти конкретную строку или термин.

source: In the https://docs.weblate.org/en/latest/user/translating.html#translation-projects[Weblate documentation], there is more info about translations, like keyboard shortcuts and other tips about the translation tool.
pt_br: Na https://docs.weblate.org/en/latest/user/translating.html#translation-projects[documentação do Weblate], há mais informações sobre traduções, como atalhos de teclado e outras dicas sobre a ferramenta de tradução.
ru: В https://docs.weblate.org/en/latest/user/translating.html#translation-projects[документации Weblate] содержится дополнительная информация о переводах, например, сочетания клавиш и другие советы по работе с инструментом перевода.

source: Translating Offline
pt_br: Traduzindo Offline
ru: Перевод в автономном режиме

source: Weblate on FreeBSD uses PO gettext files for translations. Users familiar with PO gettext files that want to translate offline can download and upload the translations through the document page on Weblate by clicking in the `Files` section.
pt_br: O Weblate no FreeBSD usa arquivos PO gettext para traduções. Os usuários familiarizados com os arquivos PO gettext que desejam traduzir offline podem baixar e enviar as traduções através da página do documento no Weblate clicando na seção `Arquivos`.
ru: Weblate на FreeBSD использует файлы перевода PO gettext. Пользователи, знакомые с файлами PO gettext, которые хотят переводить офлайн, могут загружать и выгружать переводы на странице документа в Weblate, выбрав пункт в меню `Files`.

source: Translation based on Automatic Suggestions
pt_br: Tradução baseada em Sugestões Automáticas
ru: Перевод на основе автоматических предложений

source: Languages using Weblate before the migration to Hugo/Asciidoctor can use this feature from Weblate to save time.
pt_br: Os idiomas que usavam Weblate antes da migração para Hugo/Asciidoctor podem usar esse recurso do Weblate para economizar tempo.
ru: Языки, использующие Weblate до миграции на Hugo/Asciidoctor, могут использовать эту функцию в Weblate для экономии времени.

source: This feature from Weblate uses the Translation Memory generated by the other components and projects on the same server. The former Weblate translations are hosted on the same server as read-only for that.
pt_br: Este recurso do Weblate usa a Memória de Tradução gerada pelos outros componentes e projetos no mesmo servidor. As antigas traduções do Weblate estão hospedadas no mesmo servidor como somente leitura por causa disso.
ru: Эта функция Weblate использует память переводов, созданную другими компонентами и проектами на том же сервере. Для этого прежние переводы Weblate сохранены на том же сервере в режиме только для чтения.

source: Strings that match `100/100` in similarity can be copied and saved directly. Other strings will need at least minor adjustment.
pt_br: Strings que correspondem a `100/100` em similaridade podem ser copiadas e salvas diretamente. Outras strings precisarão de pelo menos um pequeno ajuste.
ru: Строки, совпадающие с `100/100` по степени схожести, могут быть скопированы и сохранены напрямую. Остальным строкам потребуется как минимум незначительная корректировка.

source: Some examples:
pt_br: Alguns exemplos:
ru: Некоторые примеры:

source: Weblate Automatic Suggestions 01
pt_br: Weblate Sugestões Automáticas 01
ru: Weblate Автоматические предложения 01

source: With the migration to Hugo/Asciidoctor, documents use UTF-8. Some HTML entities should be replaced. Some strings, such as links, require changes to markup.
pt_br: Com a migração para Hugo/Asciidoctor, os documentos passaram a utilizar UTF-8. Algumas entidades HTML devem ser substituídas. Algumas strings, como links, requerem alterações na marcação.
ru: С переходом на Hugo/Asciidoctor документы используют UTF-8. Некоторые HTML-сущности следует заменить. Некоторые строки, такие как ссылки, требуют изменений в разметке.

source: Weblate Automatic Suggestions 02
pt_br: Weblate Sugestões Automáticas 02
ru: Weblate Автоматические предложения 02

source: Weblate Automatic Suggestions 03
pt_br: Weblate Sugestões Automáticas 03
ru: Weblate Автоматические предложения 03

source: Proofreading and Weblate Quality Checks
pt_br: Revisão e Verificações de Qualidade do Weblate
ru: Вычитка и проверка качества в Weblate

source: The document dashboard `Project/Language/Document` shows the translation status and string status for that document. This page is handy for proofreading and quality checks.
pt_br: O dashboard do documento `Projeto/Idioma/Documento` mostra o status da tradução e o status das strings desse documento. Esta página é útil para revisão e verificações de qualidade.
ru: Панель документа `Project/Language/Document` отображает статус перевода и состояние строк для этого документа. Эта страница удобна для вычитки и проверки качества.

source: Weblate Revision 01
pt_br: Weblate Revisão 01
ru: Weblate Ревизия 01

source: In this example, two strings are missing the full stop; following that link will show only those strings to be revised/translated.
pt_br: Neste exemplo, falta o ponto final em duas strings; clicando nesse link será mostrado apenas as strings a serem revisadas/traduzidas.
ru: В этом примере две строки пропустили точку; переход по этой ссылке покажет только те строки, которые нужно пересмотреть/перевести.

source: Weblate Revision 02
pt_br: Weblate Revisão 02
ru: Weblate Ревизия 02

source: Translators and reviewers often value observing translated strings in context.
pt_br: Tradutores e revisores geralmente gostam da visualização das strings traduzidas em seu contexto.
ru: Переводчики и рецензенты часто ценят возможность видеть переведённые строки в контексте.

source: Building the Translated Document
pt_br: Compilando o Documento Traduzido
ru: Сборка переведенного документа

source: The project does not use continuous integration and continuous delivery to build translations. There are studies to make it available.
pt_br: O projeto não usa integração contínua e entrega contínua (CI/CD) para gerar as traduções. Existem estudos para a sua disponibilização.
ru: Проект не использует непрерывную интеграцию и непрерывную поставку для сборки переводов. Ведутся исследования по внедрению этой возможности.

source: The following example uses GitHub, as Weblate is also on GitHub. Note that this repository is a read-only mirror, but Pull Requests are accepted.
pt_br: O exemplo a seguir usa o GitHub, pois o Weblate também está no GitHub. Observe que este repositório é um espelho somente leitura, mas as Pull Requests são aceitas.
ru: Следующий пример использует GitHub, так как Weblate также находится на GitHub . Обратите внимание, что этот репозиторий доступен только для чтения, но Pull Requests принимаются.

source: To build the translation locally, follow these steps:
pt_br: Para gerar a tradução localmente, siga estas etapas:
ru: Для локальной сборки перевода выполните следующие шаги:

source: Procedure: Clone the necessary repositories
pt_br: Procedimento: Clone os repositórios necessários
ru: Процедура: Клонирование необходимых репозиториев

source: Clone the `freebsd-doc` repository:
pt_br: Clone o repositório `freebsd-doc`:
ru: Клонирование репозитория `freebsd-doc`:

source: Clone the `freebsd-doc-translate` repository:
pt_br: Clone o repositório `freebsd-doc-translate`:
ru: Клонирование репозитория `freebsd-doc-translate`:

source: Procedure: Copy a translation file to `freebsd-doc`
pt_br: Procedimento: Copie um arquivo de tradução para `freebsd-doc`
ru: Процедура: Копирование файла перевода в `freebsd-doc`

source: With both repositories in place, copy the translation from `freebsd-doc-translate` to `freebsd-doc`. Example of the Committer's Guide article translation in Spanish.
pt_br: Com ambos os repositórios, copie a tradução de `freebsd-doc-translate` para `freebsd-doc`. Exemplo de tradução do artigo do Committer's Guide em espanhol.
ru: Имея оба репозитория, скопируйте перевод из `freebsd-doc-translate` в `freebsd-doc`. Пример перевода статьи Руководства для коммиттеров на испанском языке.

source: Procedure: Convert a translation file (`.po`) to `.adoc`
pt_br: Procedimento: Converter um arquivo de tradução (`.po`) para `.adoc`
ru: Процедура: Преобразование файла перевода (`.po`) в `.adoc`

source: Go to the root of `freebsd-doc`.
pt_br: Vá para a raiz do `freebsd-doc`.
ru: Перейдите в корень `freebsd-doc`.

source: Translate (convert) the `.po` file to `.adoc`
pt_br: Traduzir (converter) o arquivo `.po` para `.adoc`
ru: Преобразовать файл `.po` в `.adoc`

source: By default: only files with more than eighty percent of strings translated will be converted to `.adoc`.
pt_br: Por padrão: apenas arquivos com mais de oitenta por cento de strings traduzidas serão convertidos para `.adoc`.
ru: По умолчанию: только файлы с более чем восьмидесятью процентами переведённых строк будут преобразованы в `.adoc`.

source: To ignore that limit:
pt_br: Para ignorar esse limite:
ru: Чтобы игнорировать это ограничение:
