Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/weblate/_index.po
Languages: pt_br, ru

source: Some documents, like books, have many PO gettext files. Always copy all of them when translating and building. Files that weren't translated will be converted with the source (English) strings.
pt_br: Alguns documentos, como livros, possuem muitos arquivos PO gettext. Sempre copie todos eles ao traduzir e compilar. Arquivos que não foram traduzidos serão convertidos com as strings de origem (inglês).
ru: Некоторые документы, такие как книги, содержат множество PO-файлов gettext. Всегда копируйте их все при переводе и сборке. Файлы, которые не были переведены, будут преобразованы с исходными (английскими) строками.

source: The directory structure is fundamental. Always follow the English document directory structure.
pt_br: A estrutura de diretórios é fundamental. Siga sempre a estrutura de diretórios dos documentos em inglês.
ru: Структура каталогов является основополагающей. Всегда следуйте структуре каталогов английского документа.

source: Procedure: Build the translated document
pt_br: Procedimento: Gerar o documento traduzido
ru: Процедура: Сборка переведенного документа

source: Last, the building part.
pt_br: Por último, a parte da compilação.
ru: Наконец, часть сборки.

source: Enter the documentation directory because there is no need to build the FreeBSD website.
pt_br: Entre no diretório de documentação porque não há necessidade de compilar o site do FreeBSD.
ru: Перейдите в каталог документации, так как сборка веб-сайта FreeBSD не требуется.

source: And build the documentation. Note that `en` is always added by default when building any other language.
pt_br: E compile a documentação. Observe que `en` é sempre adicionado por padrão ao compilar qualquer outro idioma.
ru: И соберите документацию. Обратите внимание, что `en` всегда добавляется по умолчанию при сборке любого другого языка.

source: This command will build only the English and Spanish documents of the FreeBSD documentation portal. The output will be in the [.filename]#public# directory; open that in a browser. Note that some index files can redirect the browser to the online page.
pt_br: Este comando irá compilar apenas os documentos em inglês e espanhol do portal de documentação do FreeBSD. A saída estará no diretório [.filename]#public#; abra-o em um navegador. Observe que alguns arquivos de índice podem redirecionar o navegador para a página online.
ru: Эта команда соберет только английскую и испанскую документацию портала FreeBSD. Результат будет сохранен в каталоге [.filename]#public#; откройте его в браузере. Обратите внимание, что некоторые индексные файлы могут перенаправлять браузер на онлайн-страницу.

source: Another good option is to build and serve the content with Hugo's internal webserver:
pt_br: Outra boa opção é compilar e servir o conteúdo com o servidor web interno do Hugo:
ru: Еще один хороший вариант — собрать и предоставить контент с помощью встроенного веб-сервера Hugo:

source: By default, the webserver listens on `localhost`; To override this behavior, specify the desired IP address in the `BIND` parameter value.
pt_br: Por padrão, o servidor web escuta em `localhost`; Para substituir esse comportamento, especifique o endereço IP desejado no valor do parâmetro `BIND`.
ru: По умолчанию веб-сервер прослушивает `localhost`; чтобы изменить это поведение, укажите нужный IP-адрес в значении параметра `BIND`.

source: This builds and serves the content with Hugo's internal webserver and lets it open, and if any file changes, it rebuilds them automatically.
pt_br: Isso compila e serve o conteúdo com o servidor web interno de Hugo e deixa ele em espera, quando algum arquivo for alterado, ele o recompila automaticamente.
ru: Это собирает и предоставляет содержимое с помощью встроенного веб-сервера Hugo, оставляя его открытым, и при любых изменениях файлов автоматически пересобирает их.

source: To make any necessary adjustments in the translation, follow the steps below to re-sync all components:
pt_br: Para fazer os ajustes necessários na tradução, siga as etapas abaixo para sincronizar novamente todos os componentes:
ru: Чтобы внести необходимые изменения в перевод, выполните следующие шаги для повторной синхронизации всех компонентов:

source: Fix the translation string on https://translate-dev.freebsd.org/[Weblate].
pt_br: Corrija a string de tradução em https://translate-dev.freebsd.org/[Weblate].
ru: Исправьте строку перевода на https://translate-dev.freebsd.org/[Weblate].

source: Force Weblate to commit the changes on `Document/Manage/Commit` section.
pt_br: Force o Weblate a realizar o commit das alterações na aba `Document/Manage/Commit`.
ru: Заставьте Weblate зафиксировать изменения в разделе `Document/Manage/Commit`.

source: Sync the local Weblate repository `freebsd-doc-translate` with a `git pull origin main` command.
pt_br: Sincronize o repositório Weblate local `freebsd-doc-translate` com o comando `git pull origin main`.
ru: Синхронизируйте локальный репозиторий Weblate `freebsd-doc-translate` с помощью команды `git pull origin main`.

source: Copy the translation again to `freebsd-doc`.
pt_br: Copie a tradução novamente para `freebsd-doc`.
ru: Скопируйте перевод снова в `freebsd-doc`.

source: Convert the translation to .adoc with the `./tools/translate.sh` script.
pt_br: Converta a tradução para .adoc com o script `./tools/translate.sh`.
ru: Преобразуйте перевод в .adoc с помощью скрипта `./tools/translate.sh`.

source: Hugo will rebuild the file and not build the entire set if `make run` was used; or re-execute `make`.
pt_br: Hugo irá recompilar o arquivo e não todo o conjunto se `make run` foi utilizado; ou execute novamente o `make`.
ru: Hugo пересоберет файл и не будет собирать весь набор, если использовалась команда `make run`, или повторно выполнит `make`.

source: Follow the previous steps as many times as is necessary until the document is ready to be published.
pt_br: Siga os passos anteriores quantas vezes forem necessárias até que o documento esteja pronto para ser publicado.
ru: Повторяйте предыдущие шаги столько раз, сколько необходимо, пока документ не будет готов к публикации.

source: The crossref:doc-build[doc-build-rendering,Documentation Build Process] chapter includes information about rendering to HTML and PDF.
pt_br: O capítulo crossref:doc-build[doc-build-rendering,Processo de Compilação da Documentação] inclui informações sobre a renderização para HTML e PDF.
ru: Глава crossref:doc-build[doc-build-rendering,Процесс сборки документации] содержит информацию о преобразовании в HTML и PDF.

source: Submitting Translations
pt_br: Enviando Traduções
ru: Отправка переводов

source: Example of submitting an update to the Brazilian Portuguese article Committer's Guide.
pt_br: Exemplo de envio de atualização do artigo Committer's Guide em Português do Brasil.
ru: Пример отправки обновления для статьи на бразильском португальском Committer's Guide.

source: Check the repository
pt_br: Verifique o repositório
ru: Проверка репозитория

source: After following the steps in crossref:weblate[weblate-building,Building the Translated Document], go to the root of `freebsd-doc` and preview what's to be committed. For an overview of files to be changed, and differences in file content:
pt_br: Depois de seguir os passos em crossref:weblate[weblate-building,Compilando o Documento Traduzido], vá para a raiz do `freebsd-doc` e visualize o que deve ser submetido. Para obter uma visão geral dos arquivos a serem alterados e das diferenças no conteúdo do arquivo:
ru: После выполнения шагов из раздела crossref:weblate[weblate-building,Сборка переведенного документа], перейдите в корневую директорию `freebsd-doc` и просмотрите, что будет включено в коммит. Для просмотра списка изменяемых файлов и различий в их содержимом:

source: Review the output, and if any files unrelated to the Committer's Guide translation update were changed or added, take the appropriate action of reverting or removing them, respectively, before proceeding further.
pt_br: Revise a saída e, se algum arquivo não relacionado à atualização da tradução do Committer's Guide foi alterado ou adicionado, tome a ação apropriada de revertê-lo ou removê-lo, respectivamente, antes de continuar.
ru: Просмотрите вывод, и если какие-либо файлы, не связанные с обновлением перевода Руководства коммиттера, были изменены или добавлены, выполните соответствующее действие по их откату или удалению соответственно, прежде чем продолжить.

source: Always include the PO gettext file (`.po`) and the translated document in Hugo/Asciidoctor (`.adoc`).
pt_br: Sempre inclua o arquivo PO gettext (`.po`) e o documento traduzido em Hugo/Asciidoctor (`.adoc`).
ru: Всегда включайте файл PO gettext (`.po`) и переведенный документ в Hugo/Asciidoctor (`.adoc`).

source: Create a new branch and commit
pt_br: Crie uma nova branch e faça o commit
ru: Создать новую ветку и зафиксировать изменения

source: Create another branch to separate the work, which will help with future updates in the local repository.
pt_br: Crie outra branch para separar o trabalho, o que ajudará em futuras atualizações no repositório local.
ru: Создайте еще одну ветку для разделения работы, что поможет при будущих обновлениях в локальном репозитории.

source: Register the local commit.
pt_br: Registre o commit local.
ru: Зарегистрировать локальный коммит.

source: Example of commit messages for translations:
pt_br: Exemplo de mensagens de commit para traduções:
ru: Пример сообщений коммитов для переводов:

source: pt-br/committers-guide: Sync with en XXXXXXX
pt_br: pt-br/committers-guide: Sincronizar com en XXXXXXX

source: Where `XXXXXXX` is the man:git[1] revision stored in the Weblate repository [.filename]#~/freebsd-doc-translate/revision.txt#.
pt_br: Onde `XXXXXXX` é a revisão man:git[1] armazenada no repositório Weblate [.filename]#~/freebsd-doc-translate/revision.txt#.
ru: Где `XXXXXXX` — это ревизия man:git[1], хранящаяся в репозитории Weblate в файле [.filename]#~/freebsd-doc-translate/revision.txt#.

source: If it is the first translation of an article:
pt_br: Se for a primeira tradução de um artigo:
ru: Если это первый перевод статьи:

source: Add Korean translation of Leap Seconds article
pt_br: Adicionar tradução Coreana do artigo Leap Seconds

source: A message will be displayed after the commit if man:git[1] has not been configured previously. Please follow the instructions and provide the name and email address used on Weblate. This step is crucial to proper crediting of contributors.
pt_br: Uma mensagem será exibida após o commit se o man:git[1] não tiver sido configurado anteriormente. Siga as instruções e forneça o nome e o endereço de e-mail usado no Weblate. Esta etapa é crucial para creditar o trabalho dos contribuidores.
ru: После выполнения коммита будет отображено сообщение, если man:git[1] ранее не был настроен. Следуйте инструкциям и укажите имя и адрес электронной почты, используемые в Weblate. Этот шаг важен для правильного учета вклада участников.

source: Then check the entire commit, review changes, and author name and email.
pt_br: Em seguida, verifique todo o commit, revise as alterações e o nome e e-mail do autor.
ru: Затем проверьте весь коммит, просмотрите изменения, а также имя автора и адрес электронной почты.

source: Generate a patch
pt_br: Gerar um patch
ru: Сгенерировать патч

source: Next, generate a man:git-format-patch[1] file.
pt_br: Em seguida, gere um arquivo man:git-format-patch[1].
ru: Далее создайте файл man:git-format-patch[1].

source: Attach the patch [.filename]#0001-pt-br-committers-guide-Sync-with-en-XXXXXXX.patch# to a problem report in https://bugs.freebsd.org/bugzilla/[FreeBSD Bugzilla].
pt_br: Anexe o patch [.filename]#0001-pt-br-committers-guide-Sync-with-en-XXXXXXX.patch# a um relatório de problema no https://bugs.freebsd.org/bugzilla/[Bugzilla do FreeBSD].
ru: Прикрепите патч [.filename]#0001-pt-br-committers-guide-Sync-with-en-XXXXXXX.patch# к отчёту об ошибке в https://bugs.freebsd.org/bugzilla/[FreeBSD Bugzilla].

source: Include the following information in the report:
pt_br: Inclua as seguintes informações no relatório:
ru: Включите следующую информацию в отчёт:

source: Bugzilla Fields
pt_br: Campos do Bugzilla
ru: Поля Bugzilla

source: Field
pt_br: Campo
ru: Поле

source: Value
pt_br: Valor
ru: Значение

source: *product*
pt_br: *produto*
ru: *продукт (product)*

source: Documentation
pt_br: Documentação

source: *Component*
pt_br: *Componente*
ru: *Компонент (Component)*

source: Books & Articles
pt_br: Artigos e Livros

source: *Summary*
pt_br: *Resumo*
ru: *Сводка (Summary)*

source: Same as the local commit
pt_br: O mesmo que o commit local
ru: Тот же текст, что и в локальном коммите

source: *Description*
pt_br: *Descrição*
ru: *Описание (Description)*

source: State that instructions in this guide were followed, including proofreading and other necessary steps. Include things that may help with triage and progression of the report.
pt_br: Declare que as instruções deste guia foram seguidas, incluindo revisão e outras etapas necessárias. Inclua informações que podem ajudar na triagem e no progresso do relatório.
ru: Укажите, что инструкции в этом руководстве были выполнены, включая вычитку и другие необходимые шаги. Включите сведения, которые могут помочь с анализом и продвижением отчёта.

source: *CC* (Optional)
pt_br: *CC* (Opcional)
ru: *СС* (Необязательно)

source: If the language has coordinators, include their email addresses in the CC field.
pt_br: Se o idioma tiver coordenadores, inclua seus endereços de e-mail no campo CC.
ru: Если в языке есть координаторы, укажите их адреса электронной почты в поле CC.

source: For people familiar with man:git[1] and GitHub: instead of submitting the patch through https://bugs.freebsd.org/bugzilla/[Bugzilla], a https://github.com/freebsd/freebsd-doc/pulls[GitHub pull request] can be used (use the name and address that you use with Weblate).
pt_br: Para pessoas familiarizadas com man:git[1] e GitHub: em vez de enviar o patch através do https://bugs.freebsd.org/bugzilla/[Bugzilla], um https://github.com/freebsd/freebsd-doc/pulls[pull request do GitHub] pode ser usado (use o nome e o endereço de e-mail utilizado no Weblate).
ru: Для тех, кто знаком с man:git[1] и GitHub: вместо отправки исправления через https://bugs.freebsd.org/bugzilla/[Bugzilla], можно использовать https://github.com/freebsd/freebsd-doc/pulls[запрос на включение изменений (pull request) в GitHub] (укажите имя и адрес, которые вы используете в Weblate).

source: https://github.com/freebsd/freebsd-doc/ is a secondary mirror. Changes to the `doc` tree can be made only by people who have a `doc` commit bit.
pt_br: https://github.com/freebsd/freebsd-doc/ é um espelho secundário. Alterações na árvore `doc` podem ser feitas apenas por pessoas que possuem um `doc` commit bit.
ru: https://github.com/freebsd/freebsd-doc/ является вторичным зеркалом. Изменения в дереве `doc` могут вносить только люди, имеющие права на коммит (`doc commit bit`).

source: When translators keep sending good-quality patches, they can be nominated by other committers to receive write-access (a extref:{committers-guide}[doc commit bit, committer.types] for translations), a FreeBSD account, and associated perks.
pt_br: Quando os tradutores continuam enviando patches de boa qualidade, eles podem ser nomeados por outros committers para receber acesso de escrita (um extref:{committers-guide}[doc commit bit, committer.types] para traduções), uma conta FreeBSD e todas as vantagens associadas.
ru: Когда переводчики продолжают присылать качественные исправления, другие коммиттеры могут выдвинуть их для получения прав на запись (extref:{committers-guide}[бит коммита для документации, committer.types] для переводов), учётной записи FreeBSD и сопутствующих привилегий.

source: The list of extref:{contributors}[Additional FreeBSD Contributors, contrib-additional] includes non-committers whose contributions are committed to the `doc` tree.
pt_br: A lista de extref:{contributors}[Contribuidores Adicionais do FreeBSD, contrib-additional] inclui não-committers cujas contribuições são submetidas à árvore `doc`.
ru: Список extref:{contributors}[дополнительных участников FreeBSD, contrib-additional] включает некоммиттеров, чьи изменения были закоммичены в дерево `doc`.

source: If in doubt about any procedure, write to the {freebsd-translators}.
pt_br: Em caso de dúvida sobre algum procedimento, escreva para a {freebsd-translators}.
ru: Если вы сомневаетесь в каком-либо действии, напишите в {freebsd-translators}.

source: FAQ (Frequently Asked Questions)
pt_br: FAQ (Perguntas Frequentes)
ru: FAQ (Часто задаваемые Вопросы)

source: Is it necessary to translate all the Copyright messages?
pt_br: É necessário traduzir todas as mensagens de Copyright?
ru: Нужно ли переводить все сообщения об авторских правах?

source: Every language team decides this for their language; in `pt-br` (Brazilian Portuguese) team, it was decided not to translate those messages.
pt_br: Cada equipe de idiomas decide isso para o seu próprio idioma; na equipe `pt-br` (Português do Brasil), foi decidido não traduzir essas mensagens.
ru: Каждая языковая команда решает этот вопрос для своего языка; в команде `pt-br` (бразильский португальский) было решено не переводить эти сообщения.

source: Links:
ru: Ссылки:
