Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-update-server/_index.po
Languages: es, pt_br, ru

source: Keep a note of the generated key fingerprint. This value is required in [.filename]#/etc/freebsd-update.conf# for binary updates.
es: Guarda una copia de seguridad de la huella digital generada. Este valor es necesario en el archivo [.filename]#/etc/freebsd-update.conf# para las actualizaciones binarias.
pt_br: Anote a impressão digital da chave gerada. Este valor será necessário no [.filename]#/etc/freebsd-update.conf# para as atualizações binárias.
ru: Сохраните сгенерированный отпечаток ключа. Это значение требуется в [.filename]#/etc/freebsd-update.conf# для бинарных обновлений.

source: At this point, we are ready to stage a build.
es: En este punto, estamos listos para empezar el build.
pt_br: Neste ponto, estamos prontos para preparar uma compilação.
ru: На этом этапе мы готовы к подготовке сборки.

source: What follows is a sample of an _initial_ build run.
es: Lo que se muestra a continuación es un ejemplo de una ejecución de construcción _inicial_.
pt_br: A seguir, segue um exemplo da execução de uma compilação _inicial_.
ru: Ниже приведён пример _первоначальной_ сборки.

source: Then the build of the world is performed again, with world patches. A more detailed explanation may be found in [.filename]#scripts/build.subr#.
es: Entonces, se vuelve a realizar la construcción de todo (build world), con los parches de world. Puedes encontrar una explicación más detallada en [.filename]#scripts/build.subr#.
pt_br: Em seguida, a compilação do target "world" é realizada novamente, com patches de "world". Uma explicação mais detalhada pode ser encontrada em [.filename]#scripts/build.subr#.
ru: Затем выполняется сборка world с применением патчей world. Более подробное объяснение можно найти в [.filename]#scripts/build.subr#.

source: During this second build cycle, the network time protocol daemon, man:ntpd[8], is turned off. Per `{cperciva}`, Security Officer Emeritus of FreeBSD, "the https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] build code needs to identify timestamps which are stored in files so that they can be ignored when comparing builds to determine which files need to be updated. This timestamp-finding works by doing two builds 400 days apart and comparing the results."
es: Durante este segundo ciclo de construcción, el demonio del protocolo de tiempo de red, man:ntpd[8], se desactiva. Según `{cperciva}`, Security Officer Emérito de FreeBSD, "el código de construcción de https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] necesita identificar timestamps que se almacenan en ficheros de forma que se puedan ignorar cuando se comparan distintas construcciones para determinar qué ficheros se han actualizado. Este trabajo de encontrar los timestamps funciona haciendo dos construcciones separadas 400 días y comparando los resultados."
pt_br: Durante esse segundo ciclo de compilação, o daemon do protocolo de tempo de rede, man:ntpd[8], é desativado. Conforme o `{cperciva}`, Oficial de Segurança Emérito do FreeBSD, "o código de compilação do https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] precisa identificar carimbos de data/hora que são armazenados em arquivos para que eles possam ser ignorados ao comparar compilações e determinar quais arquivos precisam ser atualizados. Esse processo de localização de carimbos de data/hora funciona fazendo duas compilações com 400 dias de intervalo e comparando os resultados."
ru: В течение этого второго цикла сборки демон протокола сетевого времени, man:ntpd[8], отключен. По словам `{cperciva}`, почетного офицера безопасности FreeBSD, "код сборки https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] должен идентифицировать временные метки, хранящиеся в файлах, чтобы их можно было игнорировать при сравнении сборок для определения того, какие файлы нуждаются в обновлении. Этот поиск временных меток работает путем выполнения двух сборок с интервалом в 400 дней и сравнения результатов."

source: Finally, the build completes.
es: Finalmente, el build termina.
pt_br: Por fim, a compilação é concluída.
ru: Наконец, сборка завершена.

source: Approve the build if everything is correct. More information on determining this can be found in the distributed source file named [.filename]#USAGE#. Execute [.filename]#scripts/approve.sh#, as directed. This will sign the release, and move components into a staging area suitable for uploading.
es: Aprobar la construcción si todo es correcto. Puedes encontrar más información sobre cómo determinar si es correcto en el archivo [.filename]#USAGE#. Ejecuta [.filename]#scripts/approve.sh#, como se indica. Esto firmará la versión y moverá los componentes a un área de preparación adecuada para la subida.
pt_br: Aprove a compilação se tudo estiver correto. Mais informações sobre como determinar isso podem ser encontradas no arquivo de origem da distribuição chamado [.filename]#USAGE#. Execute [.filename]#scripts/approve.sh#, conforme indicado. Isso irá assinar a versão e mover os componentes para uma área de preparação adequada para o upload.
ru: Одобрите сборку, если всё правильно. Дополнительную информацию о том, как это определить, можно найти в распределённом исходном файле с именем [.filename]#USAGE#. Выполните [.filename]#scripts/approve.sh#, как указано. Это подпишет релиз и переместит компоненты в промежуточную область, подходящую для загрузки.

source: After the approval process is complete, the upload procedure may be started.
es: Una vez finalizado el proceso de aprobación, se puede iniciar el proceso de subida.
pt_br: Após a conclusão do processo de aprovação, o procedimento de upload pode ser iniciado.
ru: После завершения процесса утверждения можно начать процедуру загрузки.

source: In the event update code needs to be re-uploaded, this may be done by changing to the public distributions directory for the target release and updating attributes of the _uploaded_ file.
es: En el caso de que código de actualización necesite ser subido de nuevo, se puede hacer cambiando al directorio público de las distribuciones para la versión que se quiera y actualizando los atributos del fichero _uploaded_.
pt_br: Caso o código de atualização precise ser reenviado, isso pode ser feito alterando para o diretório de distribuições públicas do release de destino e atualizando os atributos do arquivo já _enviado_.
ru: В случае необходимости повторной загрузки кода обновления, это можно сделать, перейдя в публичный каталог дистрибутивов для целевого выпуска и обновив атрибуты файла _uploaded_.

source: The uploaded files will need to be in the document root of the webserver in order for updates to be distributed. The exact configuration will vary depending on the web server used. For the Apache web server, please refer to the extref:{handbook}[Configuration of Apache servers, network-apache] section in the Handbook.
es: Se necesita que los ficheros subidos se encuentren en el documento raíz del servidor web para que las actualizaciones sean distribuidas. La configuración exacta variará dependiendo del servidor web utilizado. Para el servidor web Apache, por favor lee la sección extref:{handbook}[Configuration of Apache servers, network-apache] en el Handbook.
pt_br: Os arquivos enviados precisarão estar no diretório raiz de documentos do servidor web para que as atualizações possam ser distribuídas. A configuração exata variará dependendo do servidor web utilizado. Para o servidor web Apache, consulte a seção extref:{handbook}[Configuração de servidores Apache, network-apache] no Handbook.

source: Update client's `KeyPrint` and `ServerName` in [.filename]#/etc/freebsd-update.conf#, and perform updates as instructed in the extref:{handbook}[FreeBSD Update, updating-upgrading-freebsdupdate] section of the Handbook.
es: Actualiza `KeyPrint` y `ServerName` del cliente en [.filename]#/etc/freebsd-update.conf# y actualiza según se indica en la sección extref:{handbook}[FreeBSD Update, updating-upgrading-freebsdupdate] del Handbook.
pt_br: Atualize o `KeyPrint` e o `ServerName` do cliente em [.filename]#/etc/freebsd-update.conf#, e execute as atualizações conforme instruído na seção extref:{handbook}[Atualização do FreeBSD, updating-upgrading-freebsdupdate] do Handbook.

source: In order for FreeBSD Update Server to work properly, updates for both the _current_ release and the release _one wants to upgrade to_ need to be built. This is necessary for determining the differences of files between releases. For example, when upgrading a FreeBSD system from 7.1-RELEASE to 7.2-RELEASE, updates will need to be built and uploaded to your distribution server for both versions.
es: Para que el Servidor de Actualizaciones de FreeBSD funcione correctamente, se necesita construir tanto la versión _actual_ como la versión _a la que se quiere actualizar_. Esto es necesario para determinar las diferencias entre dos versiones. Por ejemplo, cuando se actualiza un sistema FreeBSD de 7.1-RELEASE a 7.2-RELEASE, las actualizaciones necesitan construirse y subirse a tu servidor de distribución para ambas versiones.
pt_br: Para que o Servidor de Atualização do FreeBSD funcione corretamente, as atualizações tanto para o release _atual_ quanto para o release _para o qual se deseja atualizar_ precisam ser compiladas. Isso é necessário para determinar as diferenças nos arquivos entre os releases. Por exemplo, ao atualizar um sistema FreeBSD da versão 7.1-RELEASE para a versão 7.2-RELEASE, as atualizações precisarão ser compiladas e enviadas para o seu servidor de distribuição para ambas as versões.
ru: Для корректной работы сервера обновлений FreeBSD Update необходимо собирать обновления как для текущего релиза, так и для релиза, _на который планируется обновление_. Это необходимо для определения различий в файлах между релизами. Например, при обновлении системы FreeBSD с 7.1-RELEASE до 7.2-RELEASE потребуется собрать и загрузить на сервер распространения обновления для обеих версий.

source: For reference, the entire run of link:../../source/articles/freebsd-update-server/init.txt[init.sh] is attached.
es: Como referencia, se adjunta la ejecución completa de link:../../source/articles/freebsd-update-server/init.txt[init.sh].
pt_br: Para referência, toda a execução do link:../../source/articles/freebsd-update-server/init.txt[init.sh] está anexada.
ru: Для справки, полный текст выполнения link:../../source/articles/freebsd-update-server/init.txt[init.sh] прилагается.

source: Building a Patch
es: Compilar un parche
pt_br: Compilando um Patch
ru: Построение патча

source: Every time a link:https://www.FreeBSD.org/security/advisories/[security advisory] or link:https://www.FreeBSD.org/security/notices/[security notice] is announced, a patch update can be built.
es: Cada vez que se anuncia un link:https://www.FreeBSD.org/security/advisories/[security advisory] o un link:https://www.FreeBSD.org/security/notices/[security notice] se puede construir un parche de actualización.
pt_br: Toda vez que uma link:https://www.FreeBSD.org/security/advisories/[recomendação de segurança] ou um link:https://www.FreeBSD.org/security/notices/[aviso de segurança] é anunciado, uma atualização de patch pode ser compilada.
ru: Каждый раз, когда объявляется link:https://www.FreeBSD.org/security/advisories/[консультативный документ по безопасности] или link:https://www.FreeBSD.org/security/notices/[уведомление о безопасности], можно собрать обновление с исправлением.

source: For this example, 7.1-RELEASE will be used.
es: Para este ejemplo, se utilizará 7.1-RELEASE.
pt_br: Para este exemplo, o 7.1-RELEASE será usado.
ru: Для этого примера будет использоваться версия 7.1-RELEASE.

source: A couple of assumptions are made for a different release build:
es: Para una versión de lanzamiento diferente, se da por hecho un par de suposiciones:
pt_br: Algumas suposições são feitas para compilar uma release diferente:
ru: Несколько предположений сделано для другой сборки выпуска:

source: Setup the correct directory structure for the initial build.
es: Que ha configurado la estructura de directorios correcta para la compilación inicial.
pt_br: Configure a estrutura de diretórios correta para a compilação inicial.
ru: Настройка правильной структуры каталогов для первоначальной сборки.

source: Perform an initial build for 7.1-RELEASE.
es: Que ha realizado una compilación inicial para la versión 7.1-RELEASE.
pt_br: Execute uma compilação inicial para o 7.1-RELEASE.
ru: Выполните первоначальную сборку для 7.1-RELEASE.

source: Create the patch directory of the respective release under [.filename]#/usr/local/freebsd-update-server/patches/#.
es: Cree el directorio de parches para la versión correspondiente en [.filename]#/usr/local/freebsd-update-server/patches/#.
pt_br: Crie o diretório de patches do respectivo release em [.filename]#/usr/local/freebsd-update-server/patches/#.
ru: Создайте каталог с патчами соответствующего выпуска в [.filename]#/usr/local/freebsd-update-server/patches/#.

source: As an example, take the patch for man:named[8]. Read the advisory, and grab the necessary file from link:https://www.FreeBSD.org/security/advisories/[FreeBSD Security Advisories]. More information on interpreting the advisory, can be found in the extref:{handbook}[FreeBSD Handbook, security-advisories].
es: Toma como ejemplo el parche para man:named[8]. Lee la advertencia de seguridad y obtén el fichero necesario de link:https://www.FreeBSD.org/security/advisories/[FreeBSD Security Advisories]. Se puede encontrar más información acerca de cómo interpretar las advertencias en extref:{handbook}[FreeBSD Handbook, security-advisories].
pt_br: Como exemplo, considere o patch para o man:named[8]. Leia o aviso e pegue o arquivo necessário em link:https://www.FreeBSD.org/security/advisories/[Avisos de Segurança do FreeBSD]. Mais informações sobre a interpretação do aviso podem ser encontradas no extref:{handbook}[Handbook do FreeBSD, security-advisories].

source: In the https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc[security brief], this advisory is called `SA-09:12.bind`. After downloading the file, it is required to rename the file to an appropriate patch level. It is suggested to keep this consistent with official FreeBSD patch levels, but its name may be freely chosen. For this build, let us follow the currently established practice of FreeBSD and call this `p7`. Rename the file:
es: En el https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc[security brief], esta advertencia se llama `SA-09:12.bind`. Después de descargar el fichero, se necesita renombrar el fichero a un nivel de parcheado apropiado. Se sugiere mantenerlo consistente con los niveles de parche oficiales de FreeBSD, pero su nombre se puede escoger libremente. Para esta construcción, sigamos la práctica actualmente establecida en FreeBSD y llamemos a este `p7`. Renombra el fichero:
pt_br: No https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc[informe de segurança], este aviso é chamado de `SA-09:12.bind`. Após o download do arquivo, é necessário renomeá-lo para um nível de patch apropriado. É sugerido manter isso consistente com os níveis de patch oficiais do FreeBSD, mas seu nome pode ser escolhido livremente . Para esta compilação, vamos seguir a prática atualmente estabelecida do FreeBSD e chamá-la de `p7`. Renomeie o arquivo:
ru: В https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc[кратком обзоре безопасности] этот совет называется `SA-09:12.bind`. После загрузки файла необходимо переименовать его в соответствии с уровнем исправления. Рекомендуется сохранять это в соответствии с официальными уровнями исправлений FreeBSD, но имя может быть выбрано свободно. Для данной сборки давайте последуем текущей установленной практике FreeBSD и назовем его `p7`. Переименуйте файл:

source: When running a patch level build, it is assumed that previous patches are in place. When a patch build is run, it will run all patches contained in the patch directory.
es: Cuando se ejecuta la compilación del parche, se asume que los parches anteriores están en su sitio. Cuando se ejecute la compilación de los parches, se ejecutarán todos los parches que se encuentren en el directorio de parches.
pt_br: Ao executar uma compilação de nível de patch, presume-se que os patches anteriores estão em vigor. Quando uma compilação de patch é executada, ela executará todos os patches contidos no diretório de patch.
ru: При выполнении сборки уровня патча предполагается, что предыдущие патчи уже установлены. При запуске сборки патча будут выполнены все патчи, содержащиеся в каталоге патчей.

source: There can be custom patches added to any build. Use the number zero, or any other number.
es: Puede haber parches personalizados adjuntos a cualquier compilación. Usa el número cero, o cualquier otro número.
pt_br: Podem ser adicionados patches personalizados a qualquer compilação. Use o número zero ou qualquer outro número.
ru: В сборку могут быть добавлены пользовательские патчи. Используйте ноль или любое другое число.

source: It is up to the administrator of the FreeBSD Update Server to take appropriate measures to verify the authenticity of every patch.
es: Depende del administrador del Servidor de Actualizaciones de FreeBSD tomar las medidas apropiadas para verificar la autenticidad de cada parche.
pt_br: Cabe ao administrador do Servidor de Atualização do FreeBSD tomar as medidas apropriadas para verificar a autenticidade de cada patch.
ru: Задача администратора сервера FreeBSD Update — принимать соответствующие меры для проверки подлинности каждого патча.

source: At this point, a _diff_ is ready to be built. The software checks first to see if a [.filename]#scripts/init.sh# has been run on the respective release prior to running the diff build.
es: En este punto, ya se puede construir un _diff_. El software comprueba primero si se ha ejecutado un [.filename]#scripts/init.sh# en la versión respectiva antes de ejecutar la construcción del diff.
pt_br: Neste ponto, um _diff_ está pronto para ser compilado. O software verifica primeiro se um [.filename]#scripts/init.sh# foi executado no respectivo release antes de executar a compilação do _diff_.
ru: На этом этапе _diff_ готов к сборке. Программное обеспечение сначала проверяет, был ли запущен [.filename]#scripts/init.sh# для соответствующего выпуска перед выполнением сборки diff.

source: What follows is a sample of a _differential_ build run.
es: Lo siguiente es una muestra de una ejecución de construcción _differencial_.
pt_br: A seguir, segue um exemplo de execução de compilação _diferencial_.
ru: Вот пример выполнения _дифференциальной_ сборки.

source: Updates are printed, and approval is requested.
es: Se muestran las actualizaciones y se te solicita aprobación.
pt_br: As atualizações são impressas e a aprovação é solicitada.
ru: Обновления выводятся на экран, и запрашивается подтверждение.

source: Follow the same process as noted before for approving a build:
es: Sigue el mismo proceso descrito anteriormente para dar tu aprobación a una compilación:
pt_br: Siga o mesmo processo mencionado anteriormente para aprovar uma compilação:
ru: Следуйте той же процедуре, что и ранее, для подтверждения сборки:

source: After approving the build, upload the software:
es: Después de dar tu aprobación a la compilación, sube el software al servidor de actualizaciones:
pt_br: Depois de aprovar a compilação, faça o upload do software:
ru: После утверждения сборки загрузите программное обеспечение:

source: For reference, the entire run of link:../../source/articles/freebsd-update-server/diff.txt[diff.sh] is attached.
es: Se adjunta como referencia el resultado de la ejecución completa de link:../../source/articles/freebsd-update-server/diff.txt[diff.sh].
pt_br: Para referência, toda a execução do link:../../source/articles/freebsd-update-server/diff.txt[diff.sh] está anexada.
ru: Для справки, полный запуск скрипта link:../../source/articles/freebsd-update-server/diff.txt[diff.sh] прилагается.

source: Tips
es: Consejos
pt_br: Dicas
ru: Советы

source: If a custom release is built using the native `make release` extref:{releng}[procedure, release-build], freebsd-update-server code will work from your release. As an example, a release without ports or documentation can be built by clearing functionality pertaining to documentation subroutines `findextradocs ()`, `addextradocs ()` and altering the download location in `fetchiso ()`, respectively, in [.filename]#scripts/build.subr#. As a last step, change the man:sha256[1] hash in [.filename]#build.conf# under your respective release and architecture and you are ready to build off your custom release.
es: Si se construye una versión personalizada utilizando el comando nativo `make release` extref:{releng}[procedure, release-build], el código de freebsd-update-server funcionará desde tu versión. Como ejemplo, se puede construir una versión sin ports o documentación eliminando funcionalidad que hace referencia a las rutinas de documentación `findextradocs ()`, `addextradocs ()` y alterando el lugar de descarga en `fetchiso ()`, respectivamente, en in [.filename]#scripts/build.subr#. Como último paso, cambia el hash man:sha256[1] en [.filename]#build.conf# en tu versión y arquitectura específica y ya estás listo para construir tu versión personalizada.
pt_br: Se um release personalizado for compilado usando o extref:{releng}[procedimento, release-build] nativo `make release`, o código do freebsd-update-server funcionará a partir do seu release. Como exemplo, um release sem ports ou documentação pode ser criado limpando a funcionalidade referente às sub-rotinas de documentação `findextradocs ()`, `addextradocs ()` e alterando o local de download em `fetchiso ()`, respectivamente, em [.filename]#scripts/build.subr#. Como último passo, altere a chave man:sha256[1] em [.filename]#build.conf# no seu respectivo release e arquitetura e você estará pronto para compilar o seu release personalizado.
ru: Если пользовательская сборка создана с использованием стандартной процедуры `make release` extref:{releng}[procedure, release-build], код freebsd-update-server будет работать с вашей сборкой. Например, сборка без портов или документации может быть создана путем отключения функциональности, относящейся к подпрограммам документации `findextradocs ()`, `addextradocs ()`, и изменения места загрузки в `fetchiso ()` соответственно в файле [.filename]#scripts/build.subr#. В завершение измените хеш man:sha256[1] в файле [.filename]#build.conf# для соответствующей сборки и архитектуры, после чего можно приступать к сборке вашей пользовательской версии.
