Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-update-server/_index.po
Languages: es, pt_br, ru

source: Building your own freebsd-update server allows a system administrator to perform fast updates for a number of machines from a local mirror
es: Construir tu propio servidor para freebsd-update permite al administrador del sistema realizar actualizaciones rápidas para un determinado número de máquinas desde un mirror local
pt_br: Construir seu próprio servidor freebsd-update permite que um administrador de sistema realize atualizações rápidas para vários computadores a partir de um espelho local
ru: Создание собственного сервера freebsd-update позволяет системному администратору выполнять быстрые обновления для множества машин из локального зеркала

source: Build Your Own FreeBSD Update Server
es: Construye tu propio servidor de actualizaciones de FreeBSD
pt_br: Construa seu próprio servidor de atualização do FreeBSD
ru: Создайте свой собственный сервер обновлений FreeBSD

source: Abstract
es: Resumen
pt_br: Resumo
ru: Аннотация

source: This article describes building an internal FreeBSD Update Server. The https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] is written by `{cperciva}`, Security Officer Emeritus of FreeBSD. For users that think it is convenient to update their systems against an official update server, building their own FreeBSD Update Server may help to extend its functionality by supporting manually-tweaked FreeBSD releases or by providing a local mirror that will allow faster updates for a number of machines.
es: Este artículo describe cómo construir un Servidor de FreeBSD Update interno. El https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] está escrito por `{cperciva}`, Security Officer Emérito de FreeBSD. Para los usuarios que consideran adecuado actualizar sus sistemas contra un servidor de actualizaciones oficial, construir su propio Servidor de FreeBSD Update podría ayudar a extender su funcionalidad mediante el soporte de versiones de FreeBSD ajustadas a mano o proporcionando un mirror local que permitirá actualizaciones más rápidas para un determinado número de máquinas.
pt_br: Este artigo descreve a construção de um Servidor Interno de Atualização do FreeBSD. O https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] é escrito por `{cperciva}`, Oficial de Segurança Emérito do FreeBSD. Para usuários que acham conveniente atualizar seus sistemas em relação a um servidor de atualização oficial, a construção de seu próprio Servidor de Atualização do FreeBSD pode ajudar a estender sua funcionalidade ao suportar versões do FreeBSD ajustadas manualmente ou fornecer um espelho local que permitirá atualizações mais rápidas para vários computadores.
ru: В этой статье описывается создание внутреннего сервера обновлений FreeBSD. https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] написан `{cperciva}`, почетным руководителем безопасности FreeBSD. Для пользователей, которым удобно обновлять свои системы через официальный сервер обновлений, создание собственного сервера обновлений FreeBSD может помочь расширить его функциональность, поддерживая вручную модифицированные выпуски FreeBSD или предоставляя локальное зеркало, которое позволит ускорить обновления для множества машин.

source: Acknowledgments
es: Reconocimientos
pt_br: Agradecimentos
ru: Благодарности

source: This article was subsequently printed at https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf[BSD Magazine].
es: Este artículo fue imprimido posteriormente en https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf[BSD Magazine].
pt_br: Este artigo foi posteriormente impresso na revista https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf[BSD Magazine].
ru: Эта статья была впоследствии опубликована в онлайн издании https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf[BSD Magazine].

source: Introduction
es: Introducción
pt_br: Introdução
ru: Введение

source: Experienced users or administrators are often responsible for several machines or environments. They understand the difficult demands and challenges of maintaining such an infrastructure. Running a FreeBSD Update Server makes it easier to deploy security and software patches to selected test machines before rolling them out to production. It also means a number of systems can be updated from the local network rather than a potentially slower Internet connection. This article outlines the steps involved in creating an internal FreeBSD Update Server.
es: Los usuarios experimentados o administradores a menudo son responsables de múltiples máquinas o entornos. Entienden las complicadas demandas y los desafíos de mantener una infraestructura de este tipo. Ejecutar un Servidor de Actualizaciones de FreeBSD facilita la implementación de parches de seguridad y software en las máquinas de pruebas seleccionadas antes de implementarlos en producción. Esto también significa que se pueden actualizar varios sistemas desde la red local en lugar de una conexión a Internet la cual sea potencialmente más lenta. Este artículo describe los pasos necesarios para crear un servidor de actualizaciones de FreeBSD propio.
pt_br: Usuários ou administradores experientes frequentemente são responsáveis por várias máquinas ou ambientes. Eles entendem as exigências e desafios difíceis de manter essa infraestrutura. Executar um Servidor de Atualização do FreeBSD torna mais fácil implantar patches de segurança e atualizações de software para máquinas de teste selecionadas antes de implementá-los nos servidores de produção. Também significa que vários sistemas podem ser atualizados a partir da rede local em vez de uma conexão com a Internet potencialmente mais lenta. Este artigo descreve os passos envolvidos na criação de um Servidor Interno de Atualização do FreeBSD.
ru: Опытные пользователи или администраторы часто отвечают за несколько машин или окружений. Они понимают сложные требования и вызовы, связанные с поддержанием такой инфраструктуры. Запуск сервера обновлений FreeBSD упрощает развертывание исправлений безопасности и программного обеспечения на выбранных тестовых машинах перед их внедрением в рабочую среду. Это также означает, что множество систем могут быть обновлены из локальной сети, а не через потенциально медленное интернет-соединение. В этой статье описаны шаги, необходимые для создания внутреннего сервера обновлений FreeBSD.

source: Prerequisites
es: Prerequisitos
pt_br: Pré-requisitos
ru: Предварительные требования

source: To build an internal FreeBSD Update Server some requirements should be met.
es: Para construir un Servidor de Actualizaciones de FreeBSD se tienen que cumplir algunos requisitos.
pt_br: Para construir um Servidor Interno de Atualização do FreeBSD, alguns requisitos devem ser atendidos.
ru: Для создания внутреннего сервера обновлений FreeBSD необходимо выполнить некоторые требования.

source: A running FreeBSD system.
es: Un sistema FreeBSD en ejecución.
pt_br: Um sistema FreeBSD em execução.
ru: Работающая система FreeBSD.

source: At a minimum, updates require building on a FreeBSD release greater than or equal to the target release version for distribution.
es: Como mínimo, las actualizaciones requieren que cree una versión de FreeBSD que sea mayor o igual a la versión de la versión de destino para la distribución.
pt_br: No mínimo, as atualizações requerem a criação de uma versão do FreeBSD maior ou igual a versão do release alvo para a distribuição.
ru: Минимальное требование для обновлений — сборка на версии FreeBSD, которая не меньше целевой версии для распространения.

source: A user account with at least 4 GB of available space. This will allow the creation of updates for 7.1 and 7.2, but the exact space requirements may change from version to version.
es: Una cuenta de usuario con al menos 4 GB de espacio disponible. Esto permitirá la creación de actualizaciones para las versiones 7.1 y 7.2, los requisitos de espacio exactos pueden cambiar de una versión a otra.
pt_br: Uma conta de usuário com pelo menos 4 GB de espaço disponível. Isso permitirá a criação de atualizações para 7.1 e 7.2, mas os requisitos de espaço exatos podem mudar de versão para versão.
ru: Пользовательская учётная запись с как минимум 4 ГБ свободного места. Это позволит создавать обновления для версий 7.1 и 7.2, но точные требования к месту могут меняться от версии к версии.

source: An man:ssh[1] account on a remote machine to upload distributed updates.
es: Una cuneta man:ssh[1] en una máquina remota para subir los parches distribuidos.
pt_br: Uma conta man:ssh[1] em uma máquina remota para fazer o upload das atualizações que serão distribuídas.
ru: Учетная запись man:ssh[1] на удаленной машине для загрузки распределенных обновлений.

source: A web server, like extref:{handbook}[Apache, network-apache], with over half of the space required for the build. For instance, test builds for 7.1 and 7.2 consume a total amount of 4 GB, and the webserver space needed to distribute these updates is 2.6 GB.
es: Un servidor web, como extref:{handbook}[Apache, network-apache], con más de la mitad del espacio requerido para la construcción. Por ejemplo, construcciones de prueba para 7.1 y 7.2 consumen un total de 4 GB, y el espacio necesario en el servidor web para distribuir estas actualizaciones es de 2.6 GB.
pt_br: Um servidor web, como o extref:{handbook}[Apache, network-apache], com mais da metade do espaço necessário para a compilação. Por exemplo, as compilações de teste para 7.1 e 7.2 consomem uma quantidade total de 4 GB, e o espaço necessário no servidor web para distribuir essas atualizações é de 2,6 GB.

source: Basic knowledge of shell scripting with Bourne shell, man:sh[1].
es: Conocimiento básico de shell scripting con el shell Bourne, man:sh[1].
pt_br: Conhecimento básico de script shell com o shell Bourne, man:sh[1].
ru: Базовые знания написания скриптов для оболочки Bourne shell, man:sh[1].

source: Configuration: Installation & Setup
es: Configuración: Instalación & Preparación
pt_br: Configuração: Instalação e Setup
ru: Конфигурация: установка и настройка

source: Download the https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] software by installing package:devel/git[] and package:security/ca_root_nss[], and execute:
es: Descarga el software https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] instalando los paquetes package:devel/git[] y package:security/ca_root_nss[] y ejecuta:
pt_br: Faça o download do software https://github.com/freebsd/freebsd-update-build/[freebsd-update-server] instalando os pacotes package:devel/git[] e package:security/ca_root_nss[], e execute:
ru: Загрузите программное обеспечение https://github.com/freebsd/freebsd-update-build/[freebsd-update-server], установив пакеты package:devel/git[] и package:security/ca_root_nss[], и выполните:

source: Update [.filename]#scripts/build.conf# appropriately. It is sourced during all build operations.
es: Actualiza el fichero [.filename]#scripts/build.conf# apropiadamente. Se crea durante todas las operaciones de construcción (build).
pt_br: Atualize o arquivo [.filename]#scripts/build.conf# adequadamente. Ele será usado durante todas as operações de compilação.
ru: Обновите соответствующим образом файл [.filename]#scripts/build.conf#. Он используется во всех операциях сборки.

source: Here is the default [.filename]#build.conf#, which should be modified to suit your environment.
es: Aquí está el archivo [.filename]#build.conf# predeterminado, que debe ser modificado para adaptarse a su entorno.
pt_br: Aqui está o [.filename]#build.conf# padrão, que deve ser modificado para atender ao seu ambiente.
ru: Вот стандартный [.filename]#build.conf#, который следует изменить в соответствии с вашим окружением.

source: # Main configuration file for FreeBSD Update builds. The # release-specific configuration data is lower down in # the scripts tree.
pt_br: # Arquivo de configuração principal para compilações do FreeBSD Update. # Os dados de configuração específicos do lançamento estão mais abaixo # na árvore de scripts.

source: # Location from which to fetch releases export FTP=ftp://ftp2.freebsd.org/pub/FreeBSD/releases <.>
pt_br: # Local de onde buscar os releases export FTP=ftp://ftp2.freebsd.org/pub/FreeBSD/releases <.>

source: # Host platform export HOSTPLATFORM=`uname -m`
pt_br: # Plataforma do host export HOSTPLATFORM=`uname -m`

source: # Host name to use inside jails export BUILDHOSTNAME=${HOSTPLATFORM}-builder.daemonology.net <.>
pt_br: # Nome do host a ser usado dentro das jails export BUILDHOSTNAME=${HOSTPLATFORM}-builder.daemonology.net <.>

source: # Location of SSH key export SSHKEY=/root/.ssh/id_dsa <.>
pt_br: # Localização da chave privada SSH export SSHKEY=/root/.ssh/id_dsa <.>

source: # SSH account into which files are uploaded MASTERACCT=builder@wadham.daemonology.net <.>
pt_br: # Conta SSH para a qual os arquivos são enviados MASTERACCT=builder@wadham.daemonology.net <.>

source: # Directory into which files are uploaded MASTERDIR=update-master.freebsd.org <.>
pt_br: # Diretório para o qual os arquivos são enviados MASTERDIR=update-master.freebsd.org <.>

source: Parameters for consideration would be:
es: Los parámetros a considerar son:
pt_br: Os parâmetros a serem considerados seriam:
ru: Учтите возможные варианты следующих настроек:

source: This is the location where ISO images are downloaded from (by the `fetchiso()` subroutine of [.filename]#scripts/build.subr#). The location configured is not limited to FTP URIs. Any URI scheme supported by standard man:fetch[1] utility should work fine. Customizations to the `fetchiso()` code can be installed by copying the default [.filename]#build.subr# script to the release and architecture-specific area at [.filename]#scripts/RELEASE/ARCHITECTURE/build.subr# and applying local changes.
es: Este es el lugar desde donde se descargan las imágenes ISO (por la subrutina `fetchiso()`de [.filename]#scripts/build.subr#). La localización configurada no se limita a URIs FTP. Cualquier esquema URI soportado por la utilidad estándar man:fetch[1] debería funcionar bien. Se pueden instalar adaptaciones al código de `fetchiso()`copiando el script por defecto [.filename]#build.subr# a los áreas de release y específicos de la arquitectura en [.filename]#scripts/RELEASE/ARCHITECTURE/build.subr# y aplicando cambios locales.
pt_br: Este é o local de onde as imagens ISO são baixadas (pela sub-rotina `fetchiso()` do arquivo [.filename]#scripts/build.subr#). A localização configurada não se limita a URIs FTP. Qualquer esquema de URI suportado pelo utilitário padrão man:fetch[1] deve funcionar bem. Personalizações para o código `fetchiso()` podem ser instaladas copiando o arquivo padrão [.filename]#build.subr# para a área específica de release e arquitetura em [.filename]#scripts/RELEASE/ARCHITECTURE/build.subr# e aplicando alterações locais.
ru: Это место, откуда загружаются образы ISO (с помощью подпрограммы `fetchiso()` из файла [.filename]#scripts/build.subr#). Настроенное расположение не ограничивается URI FTP. Должны работать любые схемы URI, поддерживаемые стандартной утилитой man:fetch[1]. Пользовательские изменения кода `fetchiso()` можно установить, скопировав скрипт [.filename]#build.subr# по умолчанию в область, специфичную для выпуска и архитектуры, по пути [.filename]#scripts/РЕЛИЗ/АРХИТЕКТУРА/build.subr#, и применив локальные изменения.

source: The name of the build host. This information will be displayed on updated systems when issuing:
es: El nombre del host de compilación. Esta información se mostrará en los sistemas que estén actualizados cuando se ejecute el comando:
pt_br: O nome do host de compilação. Essa informação será exibida em sistemas atualizados ao emitir o comando:
ru: Имя хоста для сборки. Эта информация будет отображаться на обновленных системах при выполнении команды:

source: The SSH key for uploading files to the update server. A key pair can be created by typing `ssh-keygen -t dsa`. This parameter is optional; standard password authentication will be used as a fallback authentication method when `SSHKEY` is not defined. The man:ssh-keygen[1] manual page has more detailed information about SSH and the appropriate steps for creating and using one.
es: La clave SSH utilizada para subir los ficheros al servidor de actualizaciones. Se tiene que crear un par de claves tecleando `ssh-keygen -t dsa`. Este parámetro es opcional; se utilizará autenticación estándar por contraseña como mecanismo de reserva cuando `SSHKEY` no está definida. La página de manual de man:ssh-keygen[1] tiene información más detallada acerca de SSH y los pasos apropiados para crear y utilizar una.
pt_br: A chave SSH para enviar arquivos para o servidor de atualização. Um par de chaves pode ser criado digitando `ssh-keygen -t dsa`. Este parâmetro é opcional; a autenticação padrão por senha será usada como método de autenticação de fallback quando o `SSHKEY` não estiver definido. A página do manual man:ssh-keygen[1] contém informações mais detalhadas sobre o SSH e os passos apropriados para criar e usar uma chave.
ru: Ключ SSH для загрузки файлов на сервер обновлений. Пару ключей можно создать, выполнив команду `ssh-keygen -t dsa`. Этот параметр необязателен; стандартная аутентификация по паролю будет использоваться в качестве резервного метода, если `SSHKEY` не определён. Более подробную информацию о SSH и соответствующих шагах по созданию и использованию ключей можно найти на man:ssh-keygen[1].

source: Account for uploading files to the update server.
es: Cuenta para subir archivos al servidor de actualizaciones.
pt_br: Conta para enviar os arquivos para o servidor de atualização.
ru: Учетная запись для загрузки файлов на сервер обновлений.

source: Directory on the update server where files are uploaded to.
es: Directorio en el servidor de actualización donde se subirán los archivos.
pt_br: Diretório no servidor de atualização onde os arquivos são enviados.
ru: Каталог на сервере обновлений, в который загружаются файлы.

source: The default [.filename]#build.conf# shipped with the freebsd-update-server sources is suitable for building i386 releases of FreeBSD. As an example of building an update server for other architectures, the following steps outline the configuration changes needed for amd64:
es: El archivo [.filename]#build.conf# predeterminado incluido con el código fuente de freebsd-update-server es adecuado para compilar versiones i386 de FreeBSD. Como ejemplo de creación de un servidor de actualizaciones para otras arquitecturas, los siguientes pasos describen los cambios necesarios en la configuración para amd64:
pt_br: O [.filename]#build.conf# padrão fornecido com o código fonte do freebsd-update-server é adequado para compilar releases do FreeBSD para a arquitetura i386. Como exemplo de compilação de um servidor de atualização para outras arquiteturas, os seguintes passos resumem as alterações de configuração necessárias para a arquitetura amd64:
ru: В стандартном файле [.filename]#build.conf#, поставляемом с исходниками freebsd-update-server, задана сборка релизов FreeBSD для архитектуры i386. В качестве примера настройки сервера обновлений для других архитектур ниже приведены шаги с необходимыми изменениями конфигурации для amd64:

source: Create a build environment for amd64:
es: Cree un entorno de compilación para amd64:
pt_br: Crie um ambiente de compilação para o amd64:
ru: Создайте среду сборки для amd64:

source: Install a [.filename]#build.conf# in the newly created build directory. The build configuration options for FreeBSD 7.2-RELEASE on amd64 should be similar to:
es: Coloque el archivo [.filename]#build.conf# en el directorio de compilación que acaba de crear. Las opciones de configuración de la compilación para FreeBSD 7.2-RELEASE en la arquitectura amd64 deberían de ser similares a:
pt_br: Instale um arquivo [.filename]#build.conf# no diretório de compilação recém-criado. As opções de configuração de compilação para o FreeBSD 7.2-RELEASE em amd64 devem ser semelhantes a:
ru: Установите файл [.filename]#build.conf# в только что созданный каталог сборки. Параметры конфигурации сборки для FreeBSD 7.2-RELEASE на amd64 должны быть примерно такими:

source: The man:sha256[1] hash key for the desired release, is published within the respective link:https://www.FreeBSD.org/releases/[release announcement].
es: La clave hash man:sha256[1] para la versión deseada se publica con el respectivo link:https://www.FreeBSD.org/releases/[anuncio de lanzamiento].
pt_br: A chave hash man:sha256[1] para o release desejado está publicada dentro do respectivo link:https://www.FreeBSD.org/releases/[anúncio de release].
ru: Хеш-ключ man:sha256[1] для желаемого выпуска опубликован в соответствующем link:https://www.FreeBSD.org/releases/[анонсе выпуска].

source: To generate the "End of Life" number for [.filename]#build.conf#, refer to the "Estimated EOL" posted on the link:https://www.FreeBSD.org/security/security/[FreeBSD Security Website]. The value of `EOL` can be derived from the date listed on the web site, using the man:date[1] utility, for example:
es: Para generar el número de "End of Life" para [.filename]#build.conf#, utiliza el "Estimated EOL" publicado en el link:https://www.FreeBSD.org/security/security/[FreeBSD Security Website]. El valor de `EOL` se puede derivar de la fecha establecida en el sitio web, usando la utilidad man:date[1], por ejemplo:
pt_br: Para gerar o número "End of Life" para o arquivo [.filename]#build.conf#, consulte o "Estimated EOL" publicado no link:https://www.FreeBSD.org/security/security/[Site de Segurança do FreeBSD]. O valor de `EOL` pode ser derivado da data listada no site da web, usando o utilitário man:date[1], por exemplo:
ru: Для получения номера "End of Life" для файла [.filename]#build.conf# обратитесь к "Estimated EOL" на сайте link:https://www.FreeBSD.org/security/security/[FreeBSD Security Website]. Значение `EOL` можно вывести из даты, указанной на веб-сайте, используя утилиту man:date[1], например:

source: Building Update Code
es: Compilando el código de actualización
pt_br: Compilando o Código de Atualização
ru: Сборка кода обновления

source: The first step is to run [.filename]#scripts/make.sh#. This will build some binaries, create directories, and generate an RSA signing key used for approving builds. In this step, a passphrase will have to be supplied for the final creation of the signing key.
es: El primer paso es ejecutar [.filename]#scripts/make.sh#. Esto creará algunos binarios, creará directorios y generará una clave RSA utilizada para aprobar las compilaciones. En este paso, se deberá proporcionar una contraseña para la creación de la clave de firma.
pt_br: O primeiro passo é executar o [.filename]#scripts/make.sh#. Isso irá compilar alguns binários, criar diretórios e gerar uma chave de assinatura RSA usada para aprovar as compilações. Nesta etapa, uma frase secreta terá que ser fornecida para a criação final da chave de assinatura.
ru: Первым шагом является запуск [.filename]#scripts/make.sh#. Это приведёт к сборке некоторых бинарных файлов, созданию каталогов и генерации RSA-ключа подписи, используемого для подтверждения сборок. На этом этапе потребуется ввести парольную фразу для окончательного создания ключа подписи.
