<?xml version="1.0" encoding="ISO-8859-1" ?>

<!-- Esquema simple para las noticias del Proyecto FreeBSD.

     Dividir los elementos de tiempo en <año>, <mes>, y <dia>, de los cuales 
     cada uno cuenta con su <nombre>.

     cada elemento <dia> contiene uno o mas elementos <evento>.

     Cada <evento> contiene como opcional un <titulo> (<title>), y un <p>.
     Los elementos <p> pueden contener marcas de ancla (<a>).  Con el 
     respectivo atributo "href".
     
     La variable $base sera reemplazada con el URI necesario para obtener el 
     documento maestro de FreeBSD, y que siempre debera usarse para comenzar
     URLs en www.FreeBSD.org, o en alguno de sus servidores replica.

     Use el elemento <title>  en el caso de que el contenido de <p> sea 
     largo.  Cuando genere sinopsis de la informacion (por ejemplo; para
     sindicacion usando ficheros RDF), el contenido de <title> sera tomado
     en cuenta para su uso, sobre <p>.
-->


<news>
  <cvs:keywords xmlns:cvs="http://www.FreeBSD.org/XML/CVS" version="1.0">
    <cvs:keyword name="freebsd">
      $FreeBSD$
    </cvs:keyword>
  </cvs:keywords>

  <year>
    <name>2002</name>
        <month>
	    <name>Diciembre</name>

	    <day>
		<name>1</name>
	        
		<event>
		    <title>Disponible GNOME 2.1.3 para FreeBSD</title>

		    <p>El escritorio GNOME 2.1.3 ("Twin Pines") se encuentra
		    disponible y se han generado los <quote>ports</quote> (incluyendo los
		    componentes de GStreamer!).  Para todos aquellos que
		    deseen probar la siguiente instalaci&#243;n en la serie
		    de desarrollo 2.1 los <quote>ports</quote> est&#225;n disponibles por
		    medio de CVS An&#243;nimo  en MarcusCom.  Consulte las
		    instrucciones de los m&#243;dulos de los <quote>ports</quote>
		    en <a 
		    href="http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi">http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi</a>.
		    </p>
		</event>

		<event>
		    <title>GNOME 2 ser&#225; el escritorio GNOME por defecto en 5.0-RELEASE</title>
		    <p>GNOME 2.0.2 ser&#225; el escritorio GNOME por defecto 
		    en la tan esperada versi&#243;n de FreeBSD 5.0-RELEASE.  
		    La instalaci&#243;n por defecto tendr&#225; como opcional  
		    tanto el manejador de ventanas Sawfish como Metacity.</p>
		</event>
	    </day>
	</month>

	<month>
	  <name>Noviembre</name>

	  <day>
	      <name>24</name>

	      <event>
		  <title>Actualizaciones de Noticias FreeBSD GNOME ahora disponibles en formato RDF</title>
		  <p>Las actualizaciones de Noticias del Proyecto FreeBSD GNOME 
		      ahora est&#225;n disponibles para descargar en formato RDF.
		      Simplemente indique a su cliente RDF la direcci&#243;n
		      <a href="http://www.freebsd.org/gnome/news.rdf">
			  http://www.freebsd.org/gnome/news.rdf</a>.
		  </p>
	      </event>
	  </day>

	  <day>
		<name>12</name>

	  <event>
		  <title>El escritorio GNOME 2.1.2 disponible para FreeBSD</title>
		  <p>El escritorio GNOME 2.1.2 ("Life Preserver"), est&#225;#225;
		      disponible y ya se cuenta con <quote>ports</quote> de la mayor parte.  
		      Existen a&#250;n algunos asuntos por resolver en FreeBSD  con
		      respecto a GStreamer y algunos de los nuevos
		      m&#243;dulos,  como la bandeja del sistema, que a&#250;n no han
		      sido portados.  Para todos aquellos que deseen probar esta
		      &#250;ltima versi&#243;n los <quote>ports</quote>  est&#225;n disponibles
		      por medio de CVS An&#243;nimo en MarcusCom.    Consulte las
		      instrucciones de los m&#243;dulos de los <quote>ports</quote>
		      en <a 
		      href="http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi">http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi</a>.
	      </p>
	  </event>
      </day>
	</month>

    <month>
      <name>Octubre</name>

      <day>
        <name>26</name>

      <event>
        <title>El escritorio GNOME 2.1.1 disponible para FreeBSD</title>

	<p>El escritorio GNOME 2.1.1 ("Flux Capacitor") ya se encuentra
	  disponible y los <quote>ports</quote>  han sido creados para quienes deseen  
	  probar esta versi&#243;n de la rama de desarrollo GNOME 2.2.
         Los <quote>ports</quote> est&#225;n disponibles por medio 
      de CVS An&#243;nimo en MarcusCom.    Consulte las instrucciones 
      de los m&#243;dulos de los <quote>ports</quote> en <a 
      href="http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi">http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi</a>.
	</p>
      </event>
      </day>

      <day>
        <name>13</name>

      <event>
        <title>EL Escritorio GNOME 2.1.0 disponible para FreeBSD</title>

	<p>El escritorio GNOME 2.1.0 ("88MPH"), ya est&#225; disponible  y los
	  <quote>ports</quote>  han sido creados para aquellos que lo deseen probar. Los <quote>ports</quote>
      est&#225;n disponibles por medio de CVS en MarcusCom a trav&#233;s del
      cvsweb ubicado en 
      <a href="http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi">
      http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi</a>. 
      Las instrucciones para obtenerlos
      est&#225;n disponibles en el propio cvsweb.</p>
      </event>
      </day>

    </month>

    <month>
      <name>Septiembre</name>

      <day>
        <name>15</name>

      <event>
        <title>Versi&#243;n Final de GNOME 2.0.2</title>

	<p>La API de desarrollo y el escritorio GNOME 2.0.2 han sido liberados
	  el d&#237;a de hoy (justo a tiempo para 4.7-RELEASE)!.  El
	  &#225;rbol de <quote>ports</quote>  est&#225;  en sincron&#237;a con 2.0.2 y hay paquetes disponibles para i386 -STABLE en 
	  <a href="http://www.marcuscom.com/downloads/packages/gnome/">
	  MarcusCom</a>.
	</p>
      </event>
      </day>

      <day>
        <name>11</name>

      <event>
        <title>Se lanza GNOME 2.0.2 RC1</title>

	<p>GNOME 2.0.2 Release Candidate 1 ("The Considerable Duck")  se
	  encuentra disponible.  El &#225;rbol de <quote>ports</quote> ya est&#225; sincronizado
	  con esta versi&#243;n y los paquetes est&#225;n disponibles en 
	  <a href="http://www.marcuscom.com/downloads/packages/gnome/">
	  MarcusCom</a>.</p>
      </event>
      </day>

    </month>

    <month>
      <name>Agosto</name>

      <day>
        <name>15</name>

      <event>
        <title>Se libera la versi&#243;n Oficial GNOME 2.0.1!</title>

	<p>El d&#237;a de hoy se liber&#243; la versi&#243;n oficial de GNOME 2.0.1.
	  Se puede obtener m&#225;s informaci&#243;n al respecto en 
	  <a href="http://www.gnome.org/start/2.0/">
	  http://www.gnome.org/start/2.0/</a>.  La colecci&#243;n de <quote>ports</quote> ya 
	  cuenta con esta versi&#243;n y se cuentan con paquetes para i386
	  -STABLE en  
	  <a href="http://www.marcuscom.com/downloads/packages/gnome/">
	  http://www.marcuscom.com/downloads/packages/gnome/</a>.
	</p>
      </event>
      </day>

      <day>
        <name>14</name>

      <event>
        <title>Paquetes para GNOME 2 Disponibles</title>

	<p>Ya se encuentran disponibles paquetes para i386 FreeBSD -STABLE
	  de GNOME 2, en:
	  <a href="http://www.marcuscom.com/downloads/packages/gnome/">
	  http://www.marcuscom.com/downloads/packages/gnome/</a>.  Los
	  paquetes est&#225;n disponibles tanto en formato .tgz  como .tbz 
	   e incluyen todo lo necesario para instalar GNOME 2 salvo  
	  XFree86.  Estos paquetes se contruyeron bajo XFree86 4.2.0, 
	  del cual existen paquetes disponibles en m&#250;ltiples lugares. 
	  Si tiene alg&#241;n problema por favor env&#237;e un correo a
	  <a href="mailto:freebsd-gnome@FreeBSD.org">
	  freebsd-gnome@FreeBSD.org</a>.
	</p>
      </event>
      </day>

      <day>
        <name>10</name>

      <event>
        <title>El escritorio GNOME 2 se ha actualizado a 2.0.1 R.C. 1</title>

	<p>Los componentes de GNOME 2 han sido actualizados a la reci&#233;n anunciada
	  GNOME 2.0.1 Release Candidate 1 ("Not Considered Harmful").
	</p>
      </event>
    </day>
  </month>

    <month>
      <name>Junio</name>

      <day>
        <name>30</name>

	<event>
	  <title>Se libera la versi&#243;n Oficial de GNOME 2.0</title>

	  <p>El equipo de FreeBSD GNOME  tiene el placer de anunciar que la
	    versi&#243;n 2.0 de GNOME ha sido portada a FreeBSD.  Esto
	    se realiza cuatro d&#237;as despu&#233;s de que el Proyecto
	    GNOME lo haya anunciado.  Consulte la documentaci&#243;n 
            para conocer los detalles de la 
	    actualizaci&#243;n necesaria para contar con el nuevo GNOME 2.0 en su sistema.</p>
	</event>
      </day>

      <day>
        <name>15</name>

	<event>
	  <title>Componentes de GNOME 2 actualizados a R.C. 1</title>

	  <p>GNOME 2 en FreeBSD ya se actualiz&#243; a RC1 ("Fever Pitch").  
	    Supuestamente &#233;sta ser&#225; la versi&#243;n final de
	    GNOME 2 que ser&#225; liberada alrededor del 21 de Junio.</p>
	</event>
      </day>

      <day>
        <name>11</name>

	<event>
	  <title>Componentes de GNOME 2 actualizados a la &#250;ltima instant&#225;nea</title>

	  <p>Los componentes de GNOME 2 han sido actualizados a la versi&#243;n "Anteriormente
	    conocida como ..." instant&#225;nea (snapshot).  Esto conlleva ciertos componentes
	    de GNOME 2.0 a 2.0.0.  El lanzamiento de GNOME 2.0 es inminente!</p>
	  </event>
	</day>
    </month>

    <month>
      <name>Mayo</name>

      <day>
        <name>28</name>

        <event>
          <title>Componentes de GNOME 2 actualizados a la &#250;ltima instant&#225;nea</title>

          <p>Los componentes de GNOME 2 han sido actualizados a la &#250;ltima
            instant&#225;nea, denominada "Stay on target!".  Se han  corregido 
            muchos errores y se han inclu&#237;do mejoras en el IGU de GNOME 2.</p>
        </event>
      </day>

      <day>
        <name>21</name>

        <event>
          <title>El port beta 5 de GNOME 2 est&#225; disponible</title>

          <p>El equipo de <a href="mailto:gnome@FreeBSD.org">FreeBSD GNOME</a>
            ha acabado el <quote>port</quote>  GNOME2 beta 5 para FreeBSD.  Todos los
            <quote>ports</quote>  existentes han sido actualizados y algunos que no estaban
            se han inclu&#237;do. La colecci&#243;n de <quote>ports</quote> de FreeBSD ahora
            contiene todos los componentes necesarios para la plataforma GNOME2,
            tanto en lo que se refiere al escritorio como para el desarrollo.</p>

          <p>El equipo ahora trabaja en mejorar la calidad del <quote>port</quote> al dar
            seguimiento a problemas espec&#237;ficos de FreeBSD y
            arregl&#225;ndolos.  Otra de las metas es proveer de paquetes binarios
            pre-compilados listos para ser usados en la versi&#243;n oficial de FreeBSD 4.6, 
            junto con GNOME 1.4.</p>
            
          <p>Invitamos a todos los usuarios a apoyarnos, enviando informes de problemas,
            haciendo parches, sugerencias, etc.</p>
        </event>
      </day>

    </month>

    <month>
      <name>Abril</name>

      <day>
        <name>26</name>

        <event>
          <title>El port de GNOME2 actualizado a beta4</title>

          <p>Todos los componentes de la Plataforma GNOME2 que est&#225;n 
            disponibles para FreeBSD han sido actualizados a la versi&#243;n
            oficial GNOME2 beta4.</p>
        </event>
      </day>

      <day>
        <name>6</name>

        <event>
          <title>El port de GNOME2 actualizado a beta3</title>
          <p>Todos los componentes de la Plataforma GNOME2 que est&#225;n 
            disponibles para FreeBSD  han sido actualizados a la versi&#243;n
            oficial GNOME2 beta 3.</p>
        </event>
      </day>

      <day>
        <name>5</name>

        <event>
          <title>Joe Clarke, nuevo <quote>committer</quote></title>

          <p><a href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a> es 
            desde ahora <quote>committer</quote> de FreeBSD (es decir, tiene 
            directo al repositorio cvs).  Su trabajo como 
            <quote>committer</quote> ser&#225; el proyecto FreeBSD GNOME, por lo que
            podemos esperar mucho m&#225;s rapidez en la resoluci&#243;n
            de problemas.  Tambi&#232;n es de esperar que 
            el proyecto de portar GNOME2 a FreeBSD (un tanto atrasado) 
            reciba un fuerte impulso. Bienvenido a bordo Joe!!!</p>
        </event>
      </day>
    </month>

    <month>
      <name>Marzo</name>

      <day>
        <name>12</name>

        <event>
          <title>Se libera Mozilla 0.9.9</title>

          <p>Mozilla 0.9.9 ha sido liberado. Se han corregido
            muchos errores y se han a&#241;adido algunas nuevas 
            caracter&#236;sticas.  El <quote>port</quote> de FreeBSD est&#225; actualizado.
            Se recomienda vivamente la actualizaci&#243;n a todos
            los usuarios.</p>
        </event>
      </day>        

      <day>
        <name>11</name>

        <event>
          <title>Los <quote>ports</quote> de GNOME2 han sido actualizados a beta2</title>

          <p>Todos los componentes de la plataforma de desarrollo de GNOME2
            ya portados a FreeBSD han sido actualizados con la &#250;ltima
            versi&#243;n disponible de la distribuci&#243;n oficial 
            GNOME2 beta2.  Gracias a 
            <a href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a> por
            su ayuda.</p>
        
	</event>
      </day>
    </month>

    <month>
      <name>Febrero</name>

      <day>
        <name>10</name>

        <event>
          <title>El trabajo de portar la plataforma GNOME2 a FreeBSD ha comenzado</title>

          <p>El equipo FreeBSD GNOME  ha comenzado en obtener las piezas
            fundamentales  para portar GNOME2 a FreeBSD.  Se espera que &#233;ste
            trabajo lleve algo de tiempo; aunque algunos <quote>ports</quote> 
            est&#225;n retrasando la disponibilidad de la 
            base de la plataforma GNOME2  se espera que est&#233;n disponibles
            muy pronto.</p>
        </event>
      </day>
    </month>

    <month>
      <name>Enero</name>

      <day>
	<name>31</name>

	<event>
	  <title>Nuevo sitio de FreeBSD GNOME ya disponible</title>

          <p>El nuevo sitio de FreeBSD GNOME ya est&#225; en la red.  Muchas
            gracias a todos los que lo han hecho posible , particularmente
 
            a <a href="mailto:marcus@marcuscom.com">Joe Marcus Clarke</a>
            y a <a
            href="mailto:john_m_cooper@yahoo.com">John Merryweather Cooper</a>.
            </p>
        </event>

      </day>

      <day>
        <name>29</name>

        <event>
          <title>Ade ha vuelto!</title>

          <p>El famoso <a href="mailto:ade@FreeBSD.org">Ade Lovett</a>, el que 
            fuera uno de los fundadores del proyecto FreeBSD GNOME y que
            por varias razones hubo de abandonar el equipo en Junio del 2001, 
            ha decidido reincorporarse al equipo.  Es una gran
            noticia  ya que a&#250;n existen muchas cosas por hacer  por lo
            que su ayuda y gran experiencia en &#233;ste campo ser&#225;n de gran 
            ayuda.</p>
        </event>

      </day>
        

      <day>
	<name>28</name>

	<event>
	  <title>Gran cantidad de componentes base de GNOME han sido actualizados</title>

          <p>Gran cantidad de componentes base de GNOME (gnomelibs, gnomecore,
            glade, etc) han sido actualizados a la &#250;ltima versi&#243;n.
            Por favor siga las <a href="docs/faq.html#q4">instrucciones</a> 
            habituales
            para actualizar su sistema.</p>
        </event>

      </day>

    </month>
  </year>
</news>
