Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/geom-class/*.po
Languages: pt_br

source: If maximum performance is not needed, a much simpler way of making a data transformation is to implement it in userland via the ggate (GEOM gate) facility. Unfortunately, there is no easy way to convert between, or even share code between the two approaches.
pt_br: Se o desempenho máximo não for necessário, uma maneira muito mais simples de fazer uma transformação de dados é implementá-lo na área do usuário por meio do recurso ggate (GEOM gate). Infelizmente, não existe uma maneira fácil de converter ou até mesmo compartilhar código entre as duas abordagens.

source: GEOM Class
pt_br: Classe GEOM

source: GEOM classes are transformations on the data. These transformations can be combined in a tree-like fashion. Instances of GEOM classes are called <emphasis>geoms</emphasis>.
pt_br: Classes GEOM são transformações nos dados. Essas transformações podem ser combinadas em uma forma de árvore. Instâncias de classes GEOM são chamadas de <emphasis>geoms</emphasis>.

source: Each GEOM class has several <quote>class methods</quote> that get called when there is no geom instance available (or they are simply not bound to a single instance):
pt_br: Cada classe GEOM possui vários <quote>métodos de classe</quote> que são chamados quando não há nenhuma instância geom disponível (ou simplesmente não estão vinculados a uma única instância):

source: <function>.init</function> is called when GEOM becomes aware of a GEOM class (when the kernel module gets loaded.)
pt_br: <function>.init</function> é chamada quando o GEOM toma conhecimento de uma classe GEOM (quando o módulo do kernel é carregado).

source: <function>.fini</function> gets called when GEOM abandons the class (when the module gets unloaded)
pt_br: <function>.fini</function> é chamada quando o GEOM abandona a classe (quando o módulo é descarregado)

source: <function>.taste</function> is called next, once for each provider the system has available. If applicable, this function will usually create and start a geom instance.
pt_br: <function>.taste</function> é chamada next, uma vez para cada provedor que o sistema tiver disponível. Se aplicável, essa função geralmente criará e iniciará uma instância geom.

source: <function>.destroy_geom</function> is called when the geom should be disbanded
pt_br: <function>.destroy_geom</function> é chamada quando o geom deve ser desfeito

source: <function>.ctlconf</function> is called when user requests reconfiguration of existing geom
pt_br: <function>.ctlconf</function> é chamado quando o usuário solicita a reconfiguração do geom existente

source: Also defined are the GEOM event functions, which will get copied to the geom instance.
pt_br: Também são definidas as funções de evento GEOM, que serão copiadas para a instância geom.

source: Field <function>.geom</function> in the <varname remap="structname">g_class</varname> structure is a LIST of geoms instantiated from the class.
pt_br: O campo <function>.geom</function> na estrutura <varname remap="structname">g_class</varname> é uma LISTA de geoms instanciados a partir da classe.

source: These functions are called from the g_event kernel thread.
pt_br: Estas funções são chamadas a partir da thread g_event do kernel.

source: The name <quote>softc</quote> is a legacy term for <quote>driver private data</quote>. The name most probably comes from the archaic term <quote>software control block</quote>. In GEOM, it is a structure (more precise: pointer to a structure) that can be attached to a geom instance to hold whatever data is private to the geom instance. Most GEOM classes have the following members:
pt_br: O nome <quote>softc</quote> é um termo legado para <quote>dados privados do driver</quote>. O nome provavelmente vem do termo arcaico <quote>bloco de controle de software</quote>. No GEOM, ele é uma estrutura (mais precisamente: ponteiro para uma estrutura) que pode ser anexada a uma instância geom para armazenar quaisquer dados que sejam privados para a instância geom. A maioria das classes GEOM possui os seguintes membros:

source: <varname>struct g_provider *provider</varname> : The <quote>provider</quote> this geom instantiates
pt_br: <varname>struct g_provider *provider</varname> : O <quote>provedor</quote> que este geom instância

source: <varname>uint16_t n_disks</varname> : Number of consumer this geom consumes
pt_br: <varname>uint16_t n_disks</varname> : Número de consumidores que este geom consome

source: <varname>struct g_consumer **disks</varname> : Array of <varname>struct g_consumer*</varname>. (It is not possible to use just single indirection because struct g_consumer* are created on our behalf by GEOM).
pt_br: <varname>struct g_consumer **disks</varname>: Array de <varname>struct g_consumer*</varname>. (Não é possível usar apenas uma única via indireta porque o struct g_consumer* é criado em nosso nome pela GEOM).

source: The <varname remap="structname">softc</varname> structure contains all the state of geom instance. Every geom instance has its own softc.
pt_br: A estrutura <varname remap="structname">softc</varname> contém todo o estado da instância geom. Cada instância geom possui seu próprio softc.

source: Metadata
pt_br: Metadados

source: Format of metadata is more-or-less class-dependent, but MUST start with:
pt_br: O formato dos metadados é mais ou menos dependente da classe, mas DEVE começar com:

source: 16 byte buffer for null-terminated signature (usually the class name)
pt_br: Buffer de 16 bytes para uma assinatura de terminação nula (geralmente o nome da classe)

source: uint32 version ID
pt_br: ID da versão uint32

source: It is assumed that geom classes know how to handle metadata with version ID's lower than theirs.
pt_br: Assume-se que as classes geom sabem como lidar com metadados com ID de versão menores que os deles.

source: Metadata is located in the last sector of the provider (and thus must fit in it).
pt_br: Os metadados estão localizados no último setor do provedor (e, portanto, devem caber nele).

source: (All this is implementation-dependent but all existing code works like that, and it is supported by libraries.)
pt_br: (Tudo isso depende da implementação, mas todo o código existente funciona assim, e é suportado por bibliotecas.)

source: Labeling/creating a GEOM
pt_br: Rotulando/criando um GEOM

source: The sequence of events is:
pt_br: A sequência de eventos é:

source: user calls <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> utility (or one of its hardlinked friends)
pt_br: o usuário chama o utilitário <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> (ou um de seus equivalentes hardlinked)

source: the utility figures out which geom class it is supposed to handle and searches for <filename>geom_<replaceable>CLASSNAME</replaceable>.so</filename> library (usually in <filename>/lib/geom</filename>).
pt_br: o utilitário descobre qual classe geom ele é suposto manipular e procura pela biblioteca <filename>geom_<replaceable>CLASSNAME</replaceable>.so </filename> (geralmente em <filename>/lib/geom</filename>).

source: it <citerefentry><refentrytitle>dlopen</refentrytitle><manvolnum>3</manvolnum></citerefentry>-s the library, extracts the definitions of command-line parameters and helper functions.
pt_br: ele <citerefentry><refentrytitle>dlopen</refentrytitle><manvolnum>3</manvolnum></citerefentry>-s a biblioteca, extrai as definições dos parâmetros da linha de comandos e funções auxiliares.

source: In the case of creating/labeling a new geom, this is what happens:
pt_br: No caso da criação/rotulação de um novo geom, isso é o que acontece:

source: <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> looks in the command-line argument for the command (usually <option>label</option>), and calls a helper function.
pt_br: O <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> procura no argumento da linha de comando pelo comando (geralmente <option>label</option>) e chama uma função auxiliar .

source: The helper function checks parameters and gathers metadata, which it proceeds to write to all concerned providers.
pt_br: A função auxiliar verifica parâmetros e reúne metadados, que são gravados em todos os provedores envolvidos.

source: This <quote>spoils</quote> existing geoms (if any) and initializes a new round of <quote>tasting</quote> of the providers. The intended geom class recognizes the metadata and brings the geom up.
pt_br: Este <quote>estraga</quote> geoms existentes (se existirem) e inicializa uma nova rodada de <quote>degustação</quote> dos provedores. A classe geom pretendida reconhece os metadados e carrega o geom.

source: (The above sequence of events is implementation-dependent but all existing code works like that, and it is supported by libraries.)
pt_br: (A sequência de eventos acima é dependente da implementação, mas todo o código existente funciona assim, e é suportado pelas bibliotecas.)

source: GEOM Command Structure
pt_br: Estrutura do Comando GEOM

source: The helper <filename>geom_CLASSNAME.so</filename> library exports <varname remap="structname">class_commands</varname> structure, which is an array of <varname remap="structname">struct g_command</varname> elements. Commands are of uniform format and look like:
pt_br: A biblioteca helper <filename>geom_CLASSNAME.so</filename> exporta a estrutura <varname remap="structname">class_commands</varname>, que é uma matriz dos elementos <varname remap="structname">struct g_command</varname>. Os comandos são uniformes no formato e se parecem com:

source: Common verbs are:
pt_br: Verbos comuns são:

source: label — to write metadata to devices so they can be recognized at tasting and brought up in geoms
pt_br: label - para gravar metadados em dispositivos para que eles possam ser reconhecidos em degustações e criados em geoms

source: destroy — to destroy metadata, so the geoms get destroyed
pt_br: destroy - para destruir metadados, para que as geoms sejam destruídas

source: Common options are:
pt_br: Opções comuns são:

source: Many actions, such as labeling and destroying metadata can be performed in userland. For this, <varname remap="structname">struct g_command</varname> provides field <varname>gc_func</varname> that can be set to a function (in the same <filename>.so</filename>) that will be called to process a verb. If <varname>gc_func</varname> is NULL, the command will be passed to kernel module, to <function>.ctlreq</function> function of the geom class.
pt_br: Muitas ações, como rotular e destruir metadados, podem ser executadas no userland. Para isso, <varname remap="structname">struct g_command</varname> fornece o campo <varname>gc_func</varname> que pode ser definido para uma função (no mesmo <filename>.so</filename>) que será chamada para processar um verbo. Se <varname>gc_func</varname> for NULL, o comando será passado para o módulo do kernel, para a função <function>.ctlreq</function> da classe geom.

source: Geoms are instances of GEOM classes. They have internal data (a softc structure) and some functions with which they respond to external events.
pt_br: Geoms são instâncias de classes GEOM. Eles possuem dados internos (uma estrutura softc) e algumas funções com as quais eles respondem a eventos externos.

source: The event functions are:
pt_br: As funções de evento são:

source: <function>.access</function> : calculates permissions (read/write/exclusive)
pt_br: <function>.acess</function>: calcula permissões (leitura / escrita / exclusiva)

source: <function>.dumpconf</function> : returns XML-formatted information about the geom
pt_br: <function>.dumpconf</function>: retorna informações formatadas em XML sobre o geom

source: <function>.orphan</function> : called when some underlying provider gets disconnected
pt_br: <function>.orphan</function>: chamado quando algum provedor subjacente é desconectado

source: <function>.spoiled</function> : called when some underlying provider gets written to
pt_br: <function>.spoiled</function>: chamado quando algum provedor subjacente é gravado

source: <function>.start</function> : handles I/O
pt_br: <function>.start</function>: lida com I/O

source: These functions are called from the <function>g_down</function> kernel thread and there can be no sleeping in this context, (see definition of sleeping elsewhere) which limits what can be done quite a bit, but forces the handling to be fast.
pt_br: Estas funções são chamadas a partir da thread <function>g_down</function> do kernel e não pode haver sleeping neste contexto, (veja a definição de sleeping em outro lugar) o que limita um pouco o que pode ser feito, mas força o manuseio a ser rápido .

source: Of these, the most important function for doing actual useful work is the <function>.start</function>() function, which is called when a BIO request arrives for a provider managed by a instance of geom class.
pt_br: Destes, a função mais importante para fazer o trabalho útil real é a função <function>.start</function>(), que é chamada quando uma requisição BIO chega para um provedor gerenciado por uma instância da classe geom.

source: GEOM Threads
pt_br: Threads GEOM

source: There are three kernel threads created and run by the GEOM framework:
pt_br: Existem três threads de kernel criados e executados pelo framework GEOM:

source: <literal>g_down</literal> : Handles requests coming from high-level entities (such as a userland request) on the way to physical devices
pt_br: <literal>g_down</literal> : trata de solicitações provenientes de entidades de alto nível (como uma solicitação do userland) no caminho para dispositivos físicos

source: <literal>g_up</literal> : Handles responses from device drivers to requests made by higher-level entities
pt_br: <literal>g_up</literal> : lida com respostas de drivers de dispositivos para solicitações feitas por entidades de nível superior

source: <literal>g_event</literal> : Handles all other cases: creation of geom instances, access counting, <quote>spoil</quote> events, etc.
pt_br: <literal>g_event</literal> : lida com todos os outros casos: criação de instâncias geom, contagem de acessos, eventos <quote>spoil</quote>, etc.

source: When a user process issues <quote>read data X at offset Y of a file</quote> request, this is what happens:
pt_br: Quando um processo do usuário emite um pedido de <quote>leitura de dados X no deslocamento Y de um arquivo</quote>, isto é o que acontece:

source: The filesystem converts the request into a struct bio instance and passes it to the GEOM subsystem. It knows what geom instance should handle it because filesystems are hosted directly on a geom instance.
pt_br: O sistema de arquivos converte o pedido em uma instância struct bio e o transmite para o subsistema GEOM. Ele sabe o que a instância geom deve manipular porque os sistemas de arquivos são hospedados diretamente em uma instância geom.

source: The request ends up as a call to the <function>.start</function>() function made on the g_down thread and reaches the top-level geom instance.
pt_br: A requisição termina como uma chamada para a função <function>.start</function>() feita para a thread g_down e atinge a instância geom de nível superior.

source: This top-level geom instance (for example the partition slicer) determines that the request should be routed to a lower-level instance (for example the disk driver). It makes a copy of the bio request (bio requests <emphasis>ALWAYS</emphasis> need to be copied between instances, with <function>g_clone_bio</function>()!), modifies the data offset and target provider fields and executes the copy with <function>g_io_request</function>()
pt_br: Essa instância geom de nível superior (por exemplo, o segmentador de partições) determina que a solicitação deve ser roteada para uma instância de nível inferior (por exemplo, o driver de disco). Ele faz uma cópia da solicitação bio (solicitações bio <emphasis>SEMPRE</emphasis> precisam ser copiadas entre instâncias, com <function>g_clone_bio</function>()!), modifica os campos de dados offset e de provedor de destino e executa a cópia com <function>g_io_request</function>()

source: The disk driver gets the bio request also as a call to <function>.start</function>() on the <literal>g_down</literal> thread. It talks to hardware, gets the data back, and calls <function>g_io_deliver</function>() on the bio.
pt_br: O driver de disco obtém a solicitação bio também como uma chamada para <function>.start</function>() na thread <literal>g_down</literal>. Ela fala com o hardware, recupera os dados e chama <function>g_io_deliver</function>() na bio.

source: Now, the notification of bio completion <quote>bubbles up</quote> in the <literal>g_up</literal> thread. First the partition slicer gets <function>.done</function>() called in the <literal>g_up</literal> thread, it uses information stored in the bio to free the cloned <varname remap="structname">bio</varname> structure (with <function>g_destroy_bio</function>()) and calls <function>g_io_deliver</function>() on the original request.
pt_br: Agora, a notificação de bio conclusão <quote>borbulha</quote> na thread <literal>g_up</literal>. Primeiro, o slicer de partição obtém <function>.done</function>() chamado na thread <literal>g_up</literal>, ele usa as informações armazenadas na bio para liberar a estrutura <varname remap="structname">bio</varname> clonada (com <function>g_destroy_bio</function>()) e chama <function>g_io_deliver</function>() no pedido original.

source: The filesystem gets the data and transfers it to userland.
pt_br: O sistema de arquivos obtém os dados e os transfere para o usuário.

source: See <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry> man page for information how the data is passed back and forth in the <varname remap="structname">bio</varname> structure (note in particular the <varname>bio_parent</varname> and <varname>bio_children</varname> fields and how they are handled).
pt_br: Veja a página de manual para o <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry> para obter informações sobre como os dados são passados para frente e para trás na estrutura <varname remap="structname">bio</varname> (observe em particular os campos <varname>bio_parent</varname> e <varname>bio_children</varname> e como eles são manipulados).

source: One important feature is: <emphasis>THERE CAN BE NO SLEEPING IN G_UP AND G_DOWN THREADS</emphasis>. This means that none of the following things can be done in those threads (the list is of course not complete, but only informative):
pt_br: Uma característica importante: <emphasis>NAS THREADS G_UP E G_DOWN NÃO SE PODE DORMIR (SELEEPING)</emphasis>. Isso significa que nenhuma das seguintes coisas pode ser feita nessas threads (a lista não é completa, mas apenas informativa):

source: Calls to <function>msleep</function>() and <function>tsleep</function>(), obviously.
pt_br: Chamadas para <function>msleep</function>() e <function>tsleep</function>(), obviamente.

source: Calls to <function>g_write_data</function>() and <function>g_read_data</function>(), because these sleep between passing the data to consumers and returning.
pt_br: Chamadas para <function>g_write_data</function>() e <function>g_read_data</function>(), porque estes dormem entre passar os dados para os consumidores e retornar.

source: Waiting for I/O.
pt_br: Esperando I/O.

source: Calls to <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry> and <function>uma_zalloc</function>() with <varname>M_WAITOK</varname> flag set
pt_br: Chamadas para <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry> e <function>uma_zalloc</function>() com o conjunto de flags <varname>M_WAITOK</varname>

source: sx and other sleepable locks
pt_br: sx e outros sleepable locks

source: This restriction is here to stop GEOM code clogging the I/O request path, since sleeping is usually not time-bound and there can be no guarantees on how long will it take (there are some other, more technical reasons also). It also means that there is not much that can be done in those threads; for example, almost any complex thing requires memory allocation. Fortunately, there is a way out: creating additional kernel threads.
pt_br: Esta restrição está aqui para impedir que o código GEOM obstrua o caminho da solicitação de I/O, já que sleeping normalmente não é limitado pelo tempo e não pode haver garantias sobre quanto tempo levará (também existem algumas outras razões mais técnicas). Isso também significa que não existe muito o que possa ser feito nessas threads; por exemplo, quase qualquer coisa complexa requer alocação de memória. Felizmente, existe uma saída: criar threads adicionais no kernel.

source: Kernel Threads for Use in GEOM Code
pt_br: Threads de kernel para uso no código GEOM

source: Kernel threads are created with <citerefentry><refentrytitle>kthread_create</refentrytitle><manvolnum>9</manvolnum></citerefentry> function, and they are sort of similar to userland threads in behavior, only they cannot return to caller to signify termination, but must call <citerefentry><refentrytitle>kthread_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
pt_br: As threads do kernel são criadas com a função <citerefentry><refentrytitle>kthread_create</refentrytitle><manvolnum>9</manvolnum></citerefentry>, e elas são semelhantes aos threads do userland no comportamento, eles somente não podem retornar ao chamador para exprimir a conclusão, mas deve chamar <citerefentry><refentrytitle>kthread_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.

source: In GEOM code, the usual use of threads is to offload processing of requests from <literal>g_down</literal> thread (the <function>.start</function>() function). These threads look like <quote>event handlers</quote>: they have a linked list of event associated with them (on which events can be posted by various functions in various threads so it must be protected by a mutex), take the events from the list one by one and process them in a big <literal>switch</literal>() statement.
pt_br: No código GEOM, o uso usual de threads é para descarregar o processamento de requisições da thread <literal>g_down</literal> (a função <function>.start</function>). Estas threads se parecem com um <quote>event handlers</quote>: elas têm uma lista encadeada de eventos associados a elas (nos quais eventos podem ser postados por várias funções em várias threads, portanto, devem ser protegidos por um mutex), pegam os eventos da lista, um por um, e processa-os em uma grande instrução <literal>switch</literal>().

source: The main benefit of using a thread to handle I/O requests is that it can sleep when needed. Now, this sounds good, but should be carefully thought out. Sleeping is well and very convenient but can very effectively destroy performance of the geom transformation. Extremely performance-sensitive classes probably should do all the work in <function>.start</function>() function call, taking great care to handle out-of-memory and similar errors.
pt_br: A principal vantagem de usar uma thread para lidar com solicitações de I/O é que ela pode dormir quando necessário. Agora, isso parece bom, mas deve ser cuidadosamente pensado. Dormir é bom e muito conveniente, mas pode ser muito efetivo em destruir o desempenho da transformação geom. As classes extremamente sensíveis ao desempenho provavelmente devem fazer todo o trabalho na chamada de função <function>.start</function>(), tomando muito cuidado para lidar com erros de falta de memória e similares.
