Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/geom-class/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Writing a GEOM Class
pt_br: Escrevendo uma classe GEOM

source: This text documents some starting points in developing GEOM classes, and kernel modules in general. It is assumed that the reader is familiar with C userland programming.
pt_br: Este texto documenta alguns pontos de partida no desenvolvimento de classes GEOM e módulos do kernel em geral. Supõe-se que o leitor esteja familiarizado com a programação C do userland.

source: Introduction
pt_br: Introdução

source: Documentation
pt_br: Documentação

source: Documentation on kernel programming is scarce — it is one of few areas where there is nearly nothing in the way of friendly tutorials, and the phrase <quote>use the source!</quote> really holds true. However, there are some bits and pieces (some of them seriously outdated) floating around that should be studied before beginning to code:
pt_br: A documentação sobre programação do kernel é escassa - é uma das poucas áreas na qual não há quase nada de tutoriais amigáveis, e a frase <quote>usa a fonte!</quote> realmente é verdadeira. No entanto, existem alguns pedaços (alguns deles seriamente desatualizados) flutuando por ai e que devem ser estudados antes de começar a codificar:

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/index.html">FreeBSD Developer's Handbook</link> — part of the documentation project, it does not contain anything specific to kernel programming, but rather some general useful information.
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/index.html">Manual do Desenvolvedor do FreeBSD</link> - parte do projeto de documentação, ele não contém nenhum informação específica para a programação do kernel, mas possui algumas informações gerais úteis.

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/index.html">FreeBSD Architecture Handbook</link> — also from the documentation project, contains descriptions of several low-level facilities and procedures. The most important chapter is 13, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/driverbasics.html">Writing FreeBSD device drivers</link>.
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/index.html">Manual de Arquitetura do FreeBSD</link> - também do projeto de documentação, contém descrições de várias instalações e procedimentos de baixo nível. O capítulo mais importante é o 13, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/driverbasics.html">Escrevendo drivers de dispositivo FreeBSD</link>.

source: The Blueprints section of <link xlink:href="http://www.freebsddiary.org">FreeBSD Diary</link> web site — contains several interesting articles on kernel facilities.
pt_br: A seção Blueprints do site do <link xlink:href="http://www.freebsddiary.org">FreeBSD Diary</link> contém vários artigos interessantes sobre os recursos do kernel.

source: The man pages in section 9 — for important documentation on kernel functions.
pt_br: As páginas de manual na seção 9 - para documentação importante sobre as funções do kernel.

source: The <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry> man page and <link xlink:href="http://phk.freebsd.dk/pubs/">PHK's GEOM slides</link> — for general introduction of the GEOM subsystem.
pt_br: A página man <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry> e os <link xlink:href="http://phk.freebsd.dk/pubs/">Slides sobre o GEOM de PHK</link> - para uma introdução geral do subsistema GEOM.

source: Man pages <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_event</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_data</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_geom</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_provider</refentrytitle><manvolnum>9</manvolnum></citerefentry> <citerefentry><refentrytitle>g_consumer</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_access</refentrytitle><manvolnum>9</manvolnum></citerefentry> &amp; others linked from those, for documentation on specific functionalities.
pt_br: Páginas de manual <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_event</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_data</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_geom</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_provider</refentrytitle><manvolnum>9</manvolnum></citerefentry> <citerefentry><refentrytitle>g_consumer</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_access</refentrytitle><manvolnum>9</manvolnum></citerefentry> &amp; outros ligados a partir deles, para documentação sobre funcionalidades específicas.

source: The <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> man page — for documentation on the coding-style conventions which must be followed for any code which is to be committed to the FreeBSD tree.
pt_br: A página do manual <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> - para documentação sobre as convenções de estilo de codificação que devem ser seguidas para qualquer código que se destine a ser incorporado na árvore do FreeBSD.

source: Preliminaries
pt_br: Preliminares

source: The best way to do kernel development is to have (at least) two separate computers. One of these would contain the development environment and sources, and the other would be used to test the newly written code by network-booting and network-mounting filesystems from the first one. This way if the new code contains bugs and crashes the machine, it will not mess up the sources (and other <quote>live</quote> data). The second system does not even require a proper display. Instead, it could be connected with a serial cable or KVM to the first one.
pt_br: A melhor maneira de fazer o desenvolvimento do kernel é ter (pelo menos) dois computadores separados. Um deles conteria o ambiente de desenvolvimento e o código fonte, e o outro seria usado para testar o código recém escrito, inicializando por meio da rede e montando seu sistema de arquivo a partir do primeiro computador. Desta forma, se o novo código contiver erros e travar a máquina, isso não irá atrapalhar o código fonte (e nem nenhum outros dado <quote>vivo</quote>). O segundo sistema nem sequer requer um monitor adequado. Em vez disso, ele pode ser conectado por meio de um cabo serial ou KVM ao primeiro computador.

source: But, since not everybody has two or more computers handy, there are a few things that can be done to prepare an otherwise <quote>live</quote> system for developing kernel code. This setup is also applicable for developing in a <link xlink:href="http://www.vmware.com/">VMWare</link> or <link xlink:href="http://www.qemu.org/">QEmu</link> virtual machine (the next best thing after a dedicated development machine).
pt_br: Mas, como nem todo mundo tem dois ou mais computadores à mão, há algumas coisas que podem ser feitas para preparar um sistema <quote>vivo </quote> para desenvolver código para o kernel. Esta configuração também é aplicável para desenvolvimento em uma máquina virtual criada com o <link xlink:href="http://www.vmware.com/">VMWare</link> ou com o <link xlink:href="http://www.qemu.org/">QEmu</link> (a próxima melhor coisa depois de uma máquina de desenvolvimento dedicada).

source: Modifying a System for Development
pt_br: Modificando um sistema para desenvolvimento

source: For any kernel programming a kernel with <option>INVARIANTS</option> enabled is a must-have. So enter these in your kernel configuration file:
pt_br: Para qualquer programação do kernel, um kernel com a opção <option>INVARIANTS</option> ativada é obrigatório. Então, digite estas linhas no seu arquivo de configuração do kernel:

source: For more debugging you should also include WITNESS support, which will alert you of mistakes in locking:
pt_br: Para ter um maior nível de depuração, você também devrá incluir o suporte ao WITNESS, o qual irá alertá-lo sobre erros relacionados a bloqueios (locking):

source: For debugging crash dumps, a kernel with debug symbols is needed:
pt_br: Para depurar despejos de memória, é necessário um kernel com símbolos de depuração:

source: With the usual way of installing the kernel (<command>make installkernel</command>) the debug kernel will not be automatically installed. It is called <filename>kernel.debug</filename> and located in <filename>/usr/obj/usr/src/sys/KERNELNAME/</filename>. For convenience it should be copied to <filename>/boot/kernel/</filename>.
pt_br: Com a maneira usual de instalar o kernel (<command>make installkernel</command>) o kernel de depuração não será instalado automaticamente. Ele é chamado de <filename>kernel.debug </filename> e fica localizado em <filename>/usr/obj/usr/src/sys/KERNELNAME/</filename>. Por conveniência, deve ser copiado para <filename>/boot/kernel/</filename>.

source: Another convenience is enabling the kernel debugger so you can examine a kernel panic when it happens. For this, enter the following lines in your kernel configuration file:
pt_br: Outra conveniência é habilitar o depurador do kernel para que você possa examinar o panic do kernel quando isso acontece. Para isso, insira as seguintes linhas no seu arquivo de configuração do kernel:

source: For this to work you might need to set a sysctl (if it is not on by default):
pt_br: Para que isso funcione, você pode precisar definir um sysctl (se ele não estiver ativado por padrão):

source: Kernel panics will happen, so care should be taken with the filesystem cache. In particular, having softupdates might mean the latest file version could be lost if a panic occurs before it is committed to storage. Disabling softupdates yields a great performance hit, and still does not guarantee data consistency. Mounting filesystem with the <quote>sync</quote> option is needed for that. For a compromise, the softupdates cache delays can be shortened. There are three sysctl's that are useful for this (best to be set in <filename>/etc/sysctl.conf</filename>):
pt_br: Kernel panics acontecerão, portanto, deve-se ter cuidado com o cache do sistema de arquivos. Em particular, ter o softupdates habilitado pode significar que a versão mais recente do arquivo pode ser perdida se um panic ocorrer antes de ser committed para armazenamento. Desativar o softupdates produz um grande impacto na performance e ainda não garante a consistência dos dados. A montagem do sistema de arquivos com a opção <quote>sync</quote> é necessária para isso. Para um compromisso, os atrasos do cache de softupdates podem ser encurtados. Existem três sysctl's que são úteis para isso (melhor ser configurado em <filename>/etc/sysctl.conf</filename>):

source: The numbers represent seconds.
pt_br: Os números representam segundos.

source: For debugging kernel panics, kernel core dumps are required. Since a kernel panic might make filesystems unusable, this crash dump is first written to a raw partition. Usually, this is the swap partition. This partition must be at least as large as the physical RAM in the machine. On the next boot, the dump is copied to a regular file. This happens after filesystems are checked and mounted, and before swap is enabled. This is controlled with two <filename>/etc/rc.conf</filename> variables:
pt_br: Para depurar os panics do kernel, os dumps do núcleo do kernel são necessários. Como um kernel panic pode tornar os sistemas de arquivos inutilizáveis, esse despejo de memória é primeiramente gravado em uma partição bruta. Normalmente, esta é a partição de swap. Essa partição deve ser pelo menos tão grande quanto a RAM física na máquina. Na próxima inicialização, o despejo é copiado para um arquivo normal. Isso acontece depois que os sistemas de arquivos são verificados e montados e antes que o swap seja ativado. Isto é controlado com duas variáveis <filename>/etc/rc.conf</filename>:

source: The <varname>dumpdev</varname> variable specifies the swap partition and <varname>dumpdir</varname> tells the system where in the filesystem to relocate the core dump on reboot.
pt_br: A variável <varname>dumpdev</varname> especifica a partição de swap e <varname>dumpdir</varname> informa ao sistema onde no sistema de arquivos ele deverá realocar o dump principal na reinicialização.

source: Writing kernel core dumps is slow and takes a long time so if you have lots of memory (&gt;256M) and lots of panics it could be frustrating to sit and wait while it is done (twice — first to write it to swap, then to relocate it to filesystem). It is convenient then to limit the amount of RAM the system will use via a <filename>/boot/loader.conf</filename> tunable:
pt_br: A gravação de core dumps é lenta e leva muito tempo, então se você tiver muita memória (&gt;256M) e muitos panics, pode ser frustrante sentar e esperar enquanto isso é feito (duas vezes - primeiro para gravar para o swap, depois para realocá-lo para o sistema de arquivos). É conveniente limitar a quantidade de RAM que o sistema usará através de uma variável do <filename>/boot/loader.conf</filename>:

source: If the panics are frequent and filesystems large (or you simply do not trust softupdates+background fsck) it is advisable to turn background fsck off via <filename>/etc/rc.conf</filename> variable:
pt_br: Se os panics são frequentes e os sistemas de arquivos são grandes (ou você simplesmente não confia em softupdates + background fsck), é aconselhável desligar o fsck em background através da variável <filename>/etc/rc.conf</filename>:

source: This way, the filesystems will always get checked when needed. Note that with background fsck, a new panic could happen while it is checking the disks. Again, the safest way is not to have many local filesystems by using another computer as an NFS server.
pt_br: Dessa forma, os sistemas de arquivos sempre serão verificados quando necessário. Observe que, com o fsck em segundo plano, um novo panic pode acontecer enquanto ele está verificando os discos. Novamente, a maneira mais segura é não ter muitos sistemas de arquivos locais, usando o outro computador como um servidor NFS.

source: Starting the Project
pt_br: Começando o projeto

source: For the purpose of creating a new GEOM class, an empty subdirectory has to be created under an arbitrary user-accessible directory. You do not have to create the module directory under <filename>/usr/src</filename>.
pt_br: Para o propósito de criar uma nova classe GEOM, um subdiretório vazio deve ser criado sob um diretório arbitrário acessível pelo usuário. Você não precisa criar o diretório do módulo em <filename>/usr/src</filename>.

source: The Makefile
pt_br: O Makefile

source: It is good practice to create <filename>Makefile</filename>s for every nontrivial coding project, which of course includes kernel modules.
pt_br: É uma boa prática criar <filename>Makefile</filename>s para cada projeto de codificação não trivial, o que obviamente inclui módulos do kernel.

source: Creating the <filename>Makefile</filename> is simple thanks to an extensive set of helper routines provided by the system. In short, here is how a minimal <filename>Makefile</filename> looks for a kernel module:
pt_br: Criar o <filename>Makefile</filename> é simples graças a um extenso conjunto de rotinas auxiliares fornecidas pelo sistema. Em suma, aqui está um exemplo de como um Makefile <filename>mínimo</filename> para um módulo do kernel se parece:

source: This <filename>Makefile</filename> (with changed filenames) will do for any kernel module, and a GEOM class can reside in just one kernel module. If more than one file is required, list it in the <envar>SRCS</envar> variable, separated with whitespace from other filenames.
pt_br: Este <filename>Makefile</filename> (com nomes de arquivos alterados) serve para qualquer módulo do kernel, e uma classe GEOM pode residir em apenas um módulo do kernel. Se mais de um arquivo for necessário, liste-o na variável <envar>SRCS</envar>, separado com espaço em branco de outros nomes de arquivos.

source: On FreeBSD Kernel Programming
pt_br: Programação do kernel do FreeBSD

source: Memory Allocation
pt_br: Alocação de memória

source: See <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry>. Basic memory allocation is only slightly different than its userland equivalent. Most notably, <function>malloc</function>() and <function>free</function>() accept additional parameters as is described in the man page.
pt_br: Veja o <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry>. A alocação básica de memória é apenas ligeiramente diferente do seu userland equivalente. Mais notavelmente, <function>malloc</function>() e <function>free</function>() aceitam parâmetros adicionais conforme descrito na página do manual.

source: A <quote>malloc type</quote> must be declared in the declaration section of a source file, like this:
pt_br: Um <quote>malloc type</quote> deve ser declarado na seção de declaração de um arquivo fonte, assim:

source: To use this macro, <filename>sys/param.h</filename>, <filename>sys/kernel.h</filename> and <filename>sys/malloc.h</filename> headers must be included.
pt_br: Para usar esta macro, os cabeçalhos <filename>sys/param.h</filename>, <filename>sys/kernel.h</filename> e <filename>sys/malloc.h</filename> devem ser incluídos.

source: There is another mechanism for allocating memory, the UMA (Universal Memory Allocator). See <citerefentry><refentrytitle>uma</refentrytitle><manvolnum>9</manvolnum></citerefentry> for details, but it is a special type of allocator mainly used for speedy allocation of lists comprised of same-sized items (for example, dynamic arrays of structs).
pt_br: Existe outro mecanismo para alocar memória, o UMA (Universal Memory Allocator). Veja <citerefentry><refentrytitle>uma</refentrytitle><manvolnum>9</manvolnum></citerefentry> para detalhes, mas ele é um tipo especial de alocador usado principalmente para alocação rápida de listas compostas de itens do mesmo tamanho (por exemplo, matrizes dinâmicas de estruturas).

source: Lists and Queues
pt_br: Listas e filas

source: See <citerefentry><refentrytitle>queue</refentrytitle><manvolnum>3</manvolnum></citerefentry>. There are a LOT of cases when a list of things needs to be maintained. Fortunately, this data structure is implemented (in several ways) by C macros included in the system. The most used list type is TAILQ because it is the most flexible. It is also the one with largest memory requirements (its elements are doubly-linked) and also the slowest (although the speed variation is on the order of several CPU instructions more, so it should not be taken seriously).
pt_br: Veja <citerefentry><refentrytitle>queue</refentrytitle><manvolnum>3</manvolnum></citerefentry>. Há MUITOS casos quando uma lista de coisas precisa ser mantida. Felizmente, essa estrutura de dados é implementada (de várias maneiras) por macros C incluídas no sistema. O tipo de lista mais usado é o TAILQ, porque é o mais flexível. É também aquele com os maiores requisitos de memória (seus elementos são duplamente vinculados) e também o mais lento (embora a variação de velocidade seja mais da ordem de várias instruções da CPU, portanto, ela não deve ser levada a sério).

source: If data retrieval speed is very important, see <citerefentry><refentrytitle>tree</refentrytitle><manvolnum>3</manvolnum></citerefentry> and <citerefentry><refentrytitle>hashinit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
pt_br: Se a velocidade de recuperação de dados for muito importante, veja <citerefentry><refentrytitle>tree</refentrytitle><manvolnum>3</manvolnum></citerefentry> e <citerefentry><refentrytitle>hashinit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.

source: Structure <varname remap="structname">bio</varname> is used for any and all Input/Output operations concerning GEOM. It basically contains information about what device ('provider') should satisfy the request, request type, offset, length, pointer to a buffer, and a bunch of <quote>user-specific</quote> flags and fields that can help implement various hacks.
pt_br: A estrutura <varname remap="structname">bio</varname> é usada para todas e quaisquer operações de Input/Output relativas ao GEOM. Ele basicamente contém informações sobre qual dispositivo ('provedor') deve satisfazer a solicitação, tipo de pedido, offset, comprimento, ponteiro para um buffer e um monte de sinalizadores <quote>específicos do usuário</quote> e campos que podem ajudar a implementar vários hacks.

source: The important thing here is that <varname remap="structname">bio</varname>s are handled asynchronously. That means that, in most parts of the code, there is no analogue to userland's <citerefentry><refentrytitle>read</refentrytitle><manvolnum>2</manvolnum></citerefentry> and <citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry> calls that do not return until a request is done. Rather, a developer-supplied function is called as a notification when the request gets completed (or results in error).
pt_br: O importante aqui é que os <varname remap="structname">bio</varname>s são tratados de forma assíncrona. Isso significa que, na maior parte do código, não há nenhum análogo as chamadas <citerefentry><refentrytitle>read</refentrytitle><manvolnum>2</manvolnum></citerefentry> e <citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry> que não retornam até que uma solicitação seja feita. Em vez disso, uma função fornecida pelo desenvolvedor é chamada como uma notificação quando a solicitação é concluída (ou resulta em erro).

source: The asynchronous programming model (also called <quote>event-driven</quote>) is somewhat harder than the much more used imperative one used in userland (at least it takes a while to get used to it). In some cases the helper routines <function>g_write_data</function>() and <function>g_read_data</function>() can be used, but <emphasis>not always</emphasis>. In particular, they cannot be used when a mutex is held; for example, the GEOM topology mutex or the internal mutex held during the <function>.start</function>() and <function>.stop</function>() functions.
pt_br: O modelo de programação assíncrona (também chamado de <quote>orientado a eventos</quote>) é um pouco mais difícil do que o imperativo muito mais usado no userland (pelo menos leva um tempo para se acostumar com isso). Em alguns casos, as rotinas auxiliares <function>g_write_data</function>() e <function>g_read_data</function>() podem ser usadas, mas <emphasis>nem sempre</emphasis>. Em particular, elas não podem ser usadas quando um mutex é mantido; por exemplo, o mutex de topologia GEOM ou o mutex interno mantido durante as funções <function>.start</function>() e <function>.stop</function>().

source: On GEOM Programming
pt_br: Programação GEOM
