freebsd/freebsd-doc/documentation/manual-pages/fr/man4/man4.i386/wt.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\" $Id: wt.4,v 1.1 2002-09-29 16:23:05 blackend Exp $
.\" Original revision: 1.12
.\"
.Dd July 10, 1995
.Dt WT 4 i386
.Os
.Sh NAME
.Nm wt
.Nd Pilote de lecteur de cartouche Archive/Wangtek
.Sh SYNOPSIS
.Cd "device wt 1"
.Pp
In
.Pa /boot/device.hints :
.Cd hint.wt.0.at="isa"
.Cd hint.wt.0.port="0x300"
.Cd hint.wt.0.irq="5"
.Cd hint.wt.0.drq="1"
.Sh DESCRIPTION
Le pilote
.Nm
fournit le support pour les cartes Archive et Wangtek suivantes:
.Pp
.Bl -item -offset indent -compact
.It
QIC-02
.It
QIC-36
.El
.Sh VOIR AUSSI
.Xr intro 4
