<!--
     The FreeBSD Documentation Project

     $FreeBSD$
     $FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/ports/chapter.sgml,v 1.2 2004/10/08 21:26:03 jesusr Exp $
-->
<!-- version del ingles traducida: 1.240 -->


<chapter id="ports">
  <title>Instalaci&oacute;n de aplicaciones: Paquetes y Ports</title>

  <sect1 id="ports-synopsis">
    <title>Sinopsis</title>

    <indexterm><primary>ports</primary></indexterm>
    <indexterm><primary>packages</primary></indexterm>

    <para>&os; viene con una excelente colecci&oacute;n de herramientas
      de sistema como parte del sistema base.  A pesar de esto, existe gran 
      cantidad de cosas que uno requiere hacer para poner las cosas realmente en
      marcha, para lo cual se necesita instalar software adicional de 
      terceros. 
      &os; ofrece dos tecnolog&iacute;as complementarias para instalar 
      software de terceros en nuestro sistema: la Colecci&oacute;n de Ports de 
      &os; y Paquetes binarios.  Cualquiera de los dos sistemas puede 
      usarse para instalar las versiones m&aacute;s recientes, de forma local o 
      directamente desde la red.</para>

    <para>Despu&eacute;s de leer este cap&iacute;tulo, usted 
      sabr&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>C&oacute;mo instalar paquetes binarios de software de terceros.</para>
      </listitem>
      <listitem>
	<para>C&oacute;mo compilar software de terceros desde la 
	  Colecci&oacute;n de Ports.</para>
      </listitem>
      <listitem>
	<para>C&oacute;mo eliminar paquetes o ports instalados 
	  previamente.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="ports-overview">
    <title>Aproximaci&oacute;n a la instalaci&oacute;n de software</title>

    <para>Si ha usado un sistema &unix; con anterioridad sabr&aacute; que el 
      procedimiento t&iacute;pico para instalar software de terceros es algo 
      similar a esto:</para>

    <procedure>
      <step>
	<para>Descargar el software, que puede distribuirse en formato de 
	  c&oacute;digo fuente, o binario.</para>
      </step>

      <step>
	<para>Desempaquetar el software de su formato de distribuci&oacute;n 
	  (normalmente en un tarball comprimido con &man.compress.1;, 
	  &man.gzip.1; o &man.bzip2.1;).</para>
      </step>

      <step>
	<para>Consultar la documentaci&oacute;n (quiz&aacute;s un fichero 
	  <filename>INSTALL</filename> o 
	  <filename>README</filename>, o los ficheros del subdirectorio 
	  <filename>doc/</filename>) para ver como instalar el software.</para>
      </step>

      <step>
	<para>Si el software es distribuido como fuente, compilarlo.  Esto 
	  puede requerir que editemos el fichero <filename>Makefile</filename> 
	  o que ejecutemos el <quote>script</quote> 
	  <command>configure</command>, entre otras cosas.</para>
      </step>

      <step>
	<para>Instalar y probar el software.</para>
      </step>
    </procedure>

    <para>Y esto solamente si todo marcha bien.  Si est&aacute; instalando un 
      software que no ha sido portado espec&iacute;ficamente para &os;, puede 
      que sea necesario editar el c&oacute;digo para que funcione 
      correctamente.
      </para>

    <para>Si lo desea puede continuar instalando software de la forma 
      <quote>tradicional</quote> en &os;, aunque &os; dispone de 
      dos tecnolog&iacute;s que le pueden ahorrar gran cantidad de tiempo y
      esfuerzo: los paquetes y los ports.  En el momento de escribir esto 
      existen m&aacute;s de &os.numports; aplicaciones de terceros.</para>

    <para>En cualquier aplicaci&oacute;n el paquete de &os; 
      es un solo fichero que tiene que descargar.  Los paquetes contienen 
      copia de los programas binarios pre-compilados de la aplicaci&oacute;n, 
      as&iacute; como cualquier fichero de configuraci&oacute;n o 
      documentaci&oacute;n.  Los paquetes descargados se pueden 
      manipular con las herramientas de gesti&oacute;n de paquetes de &os;: 
      &man.pkg.add.1;, &man.pkg.delete.1;, 
      &man.pkg.info.1;, etc.  Instalar una aplicaci&oacute;n nueva puede
      realizarse con una sola orden.</para>

    <para>Un port de &os; es una colecci&oacute;n de ficheros 
      dise&ntilde;ada para automatizar el proceso de 
      compilaci&oacute;n desde el c&oacute;digo fuente.</para>

    <para>Recuerde que existen ciertos pasos que deber&aacute; llevar a cabo 
      para compilar un programa por usted mismo (descargar, 
      desempaquetar, parchear, compilar e instalar).  Los ficheros que 
      conforman un port permiten que el sistema se encargue de todo esto.  
      Usted ejecuta un conjunto simple de &oacute;rdenes 
      y el c&oacute;digo fuente se descarga, desempaqueta, parchea, 
      compila e instala.</para>

    <para>De hecho el sistema de ports tambi&eacute;n se puede usar para crear 
      paquetes que posteriormente se pueden manipular con 
      <command>pkg_add</command> y las 
      dem&aacute;s utilidades de gesti&oacute;n de paquetes que veremos en 
      breve.</para>

    <para>Tanto el sistema de ports como el de paquetes entienden las 
      <emphasis>dependencias</emphasis>.  Suponga que desea instalar una 
      aplicaci&oacute;n que depende de que una biblioteca 
      espec&iacute;fica est&eacute; instalada.  Tanto la biblioteca como la 
      aplicaci&oacute;n existen en &os; como paquete o port.  Si utiliza 
      <command>pkg_add</command> o el sistema de ports para instalar 
      la aplicaci&oacute;n ambos notar&aacute; que la biblioteca no 
      est&aacute; instalada, y proceder&aacute;n a instalarla antes que 
      nada.</para>

    <para>Dado que ambas tecnolog&iacute;s son similares, quiz&aacute;s se 
      pregunte por qu&eacute; &os; se toma la molest&iacute;a de contar con 
      ambas.  Los Paquetes y los Ports tienen sus propias ventajas, 
      as&iacute; que cu&aacute;l utilizar depender&aacute; de su 
      elecci&oacute;n en cada momento.</para>

    <itemizedlist>
      <title>Ventajas de los paquetes</title>
      
      <listitem>
	<para>El fichero tarball de un paquete es normalmente m&aacute;s 
	  peque&ntilde;o que el tarball con el c&oacute;digo fuente de 
	  la aplicaci&oacute;n.</para>
      </listitem>

      <listitem>
	<para>Los paquetes no requieren compilaci&oacute;n.  
	  En el caso de aplicaciones grandes, como 
	  <application>Mozilla</application>,
	  <application>KDE</application>, o
	  <application>GNOME</application> este detalle puede ser importante, 
	  especialmente si usa un equipo lento.</para>
      </listitem>

      <listitem>
	<para>Los paquetes no requieren que comprenda el proceso que envuelve 
	  el compilar software bajo &os;.</para>
      </listitem>
    </itemizedlist>

    <itemizedlist>
      <title>Ventajas del sistema de Ports</title>
      
      <listitem>
	<para>Normalmente los paquetes se compilan con opciones conservadoras, 
	  en virtud del gran n&uacute;mero de equipos donde se 
	  instalar&aacute;n.  Al desde el port puede usted editar las 
	  preferencias para (por ejemplo) generar c&oacute;digo 
	  espec&iacute;fico para un procesador 
	  Pentium IV o Athlon.</para> 
      </listitem>

      <listitem>
	<para>Algunas aplicaciones tienen opciones sobre lo que pueden y lo 
	  que no pueden hacer.  Por ejemplo 
	  <application>Apache</application> se puede configurar con 
	  una gran variedad de opciones.  Al compilarlo desde los 
	  ports usted no tiene por que aceptar las opciones 
	  predefinidas, puede seleccionar que opciones desea.</para>

	<para>En algunos casos existen varios paquetes para la misma  
	  aplicaci&oacute;n con diferentes opciones.  Por ejemplo, 
	  <application>Ghostscript</application> est&aacute; disponible 
	  como paquete
	  <filename>ghostscript</filename> y como paquete  
	  <filename>ghostscript-nox11</filename>, dependiendo de si usted 
	  cuenta o no con servidor X11.  En este caso decidir puede ser 
	  sencillo, pero se puede volver un problema si hay m&aacute;s de 
	  una o dos opciones de compilaci&oacute;n.</para>
      </listitem>

      <listitem>
	<para>Las condiciones de la licencia de algunas aplicaciones 
	  prohiben la distribuci&oacute;n de binarios.  Solo permiten la 
	  distribuci&oacute;n del c&oacute;digo fuente.</para>
      </listitem>

      <listitem>
	<para>Existe gente que no conf&iacute;a en los binarios.  Al 
	  menos puede usted (en teor&iacute;a) revisar el c&oacute;digo fuente 
	  y localizar problemas potenciales.</para>
      </listitem>

      <listitem>
	<para>Si tiene parches locales necesitar&aacute; el c&oacute;digo  
	  fuente para poder aplicarlos.</para>
      </listitem>

      <listitem>
	<para>Hay gente a la que le gusta tener el c&oacute;digo fuente para 
	  poder leerlo en ratos de ocio, modificarlo, tomar partes prestadas 
	  (cuando la licencia lo permite, claro est&aacute;), etc.</para>
      </listitem>
    </itemizedlist>

    <para>Para tener constancia de los ports actualizados, suscr&iacute;base a 
      la &a.ports; y a la &a.ports-bugs;.</para>

    <warning>
      <para>Antes de instalar cualquier aplicaci&oacute;n 
        consulte <ulink url="http://vuxml.freebsd.org"></ulink> para 
        comprobar los posibles problemas de seguridad relacionados con 
	ella.</para>

      <para>Tambi&eacute;n puede instalar <filename 
        role="package">security/portaudit</filename> que autom&aacute;ticamente 
        comprobar&aacute; las vulnerabilidades conocidas de todas las 
        aplicaciones instaladas; tambi&eacute;n lo comprobar&aacute; antes de 
        compilar cualquier port.  Mientras tanto, puede usar 
        <command>portaudit -F -a</command> despu&eacute;s de instalar 
        algunos paquetes.</para>
    </warning>

    <para>El resto de este cap&iacute;tulo le explicar&aacute; c&oacute;mo 
      usar los ports y los paquetes para instalar software de terceros en 
      &os;.</para>
  </sect1>

  <sect1 id="ports-finding-applications">
    <title>C&oacute;mo encontrar aplicaciones</title>

    <para>Antes de poder instalar cualquier software debe saber qu&eacute; 
      es lo que quiere instalar y c&oacute;mo se llama la 
      aplicaci&oacute;n.</para>

    <para>La lista de software disponible para &os; crece constantemente.  
      Afortunadamente existen varias formas de localizar lo que busca:</para>

    <itemizedlist>
      <listitem>
	<para>El sitio web de FreeBSD mantiene una lista (actualizada y que 
	  admite b&uacute;squedas) de todas las  
	  aplicaciones disponibles para &os; en la direcci&oacute;n 
	  <ulink url="http://www.freebsd.org/ports/index.html">http://www.FreeBSD.org/ports/
	  </ulink>.  Esta base esta dividida en categor&iacute;as, y puede 
	  buscar por nombre (si lo sabe) o bien listar las aplicaciones 
	  disponibles en cierta categor&iacute;a.</para>
      </listitem>

      <indexterm><primary>FreshPorts</primary></indexterm>

      <listitem>
	<para>Dan Langille mantiene FreshPorts en 
	  <ulink url="http://www.FreshPorts.org/"></ulink>.  
	  FreshPorts verifica los cambios en las aplicaciones del &aacute;rbol 
	  de ports, y le permite <quote>seguir</quote> uno o m&aacute;s 
	  ports, sobre los que le enviar&aacute;n un correo cada vez 
	  que se actualicen.</para>
      </listitem>

      <indexterm><primary>FreshMeat</primary></indexterm>

      <listitem>
	<para>Si no conoce el nombre de la aplicaci&oacute;n que desea 
	  pruebe a usar un sitio como FreshMeat (<ulink  
	  url="http://www.freshmeat.net/">http://www.freshmeat.net/</ulink>) 
	  para encontrar una aplicaci&oacute;n; despu&eacute;s consulte 
	  el sitio web de &os; para ver si la aplicaci&oacute;n ha sido 
	  portada.</para>
      </listitem>

      <listitem>
	<para>Si sabe el nombre exacto del port y solo necesita saber 
          en qu&eacute; categoria est&aacute; puede usar 
          &man.whereis.1;.  Simplemente escriba <command>whereis 
          <replaceable>fichero</replaceable></command>, donde 
          <replaceable>fichero</replaceable> es el programa que quiera 
          instalar.  Si est&aacute; en su sistema, le dir&aacute; d&oacute;nde 
          est&aacute;:</para>

      <screen>&prompt.root; <userinput>whereis lsof</userinput>
lsof: /usr/ports/sysutils/lsof</screen>

      <para>Esto nos dice que <command>lsof</command> (una utilidad de 
	sistema) est&aacute; en el directorio 
	<filename>/usr/ports/sysutils/lsof</filename>.</para></listitem>

      <listitem>
	<para>Otra forma de encontrar un port en particular es usando 
        el mecanismo de b&uacute;squeda integrado en la colecci&oacute;n de 
        ports.  Para poder usar esta opci&oacute;n de b&uacute;squeda 
        debe estar en el directorio <filename>/usr/ports</filename>.  Una 
        vez en ese directorio ejecute <command>make search 
        name=<replaceable>nombre-del-programa</replaceable></command>, donde 
        <replaceable>nombre-del-programa</replaceable> es el nombre 
        del programa que desea encontrar.  Por ejemplo, si busca 
        <command>lsof</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports</userinput>
&prompt.root; <userinput>make search name=lsof</userinput>
Port:   lsof-4.56.4
Path:   /usr/ports/sysutils/lsof
Info:   Lists information about open files (similar to fstat(1))
Maint:  obrien@FreeBSD.org
Index:  sysutils
B-deps: 
R-deps: </screen>

      <para>Debe prestar especial atenci&oacute;n a la l&iacute;nea 
        <quote>Path:</quote>de la salida, porque es la que indica 
        d&oacute;nde puede encontrar el port.  El resto de informaci&oacute;n 
        no se necesita para instalar el port.</para>

      <para>Si quiere hacer una b&uacute,squeda m&aacute;s a fondo 
       utilice <command>make
       search key=<replaceable>cadena</replaceable></command> donde 
       <replaceable>cadena</replaceable> es el t&eacute;rmino que busca.  
       Podr&aacute; buscar nombres de ports, comentarios, 
       descripciones y dependencias; tambi&eacute;n se puede usar 
       para encontrar ports que tengan relaci&oacute;n con 
       alg&uacute;n tema en particular si no conoce el nombre del
       programa que busca.</para> 

      <para>En ambos casos la cadena de b&uacute;squeda no distingue entre 
       may&uacute;sculas y min&uacute;sculas.  Buscar <quote>LSOF</quote> 
       dar&aacute; los mismos resultados que buscar 
       <quote>lsof</quote>.</para>
      </listitem>

    </itemizedlist>

  </sect1>

  <sect1 id="packages-using">
    <sect1info>    
      <authorgroup>
        <author>
          <firstname>Chern</firstname>
	  <surname>Lee</surname>
	  <contrib>Texto de </contrib>
        </author>
      </authorgroup>
    <!-- 30 Mar 2001 -->
    </sect1info>

    <title>Uso del sistema de paquetes</title>

    <sect2>
      <title>Instalar un paquete</title>
      <indexterm>
        <primary>packages</primary>
        <secondary>installing</secondary>
      </indexterm>
    
      <indexterm>
        <primary><command>pkg_add</command></primary>
      </indexterm>
      <para>Puede usar &man.pkg.add.1; para instalar un 
      paquete de software bajo &os; desde un fichero local o desde 
      un servidor remoto v&iacute;a red.</para>

      <example>
        <title>Descarga de un paquete manualmente e instalaci&oacute;n en 
	  nuestro sistema</title>

        <screen>&prompt.root; <userinput>ftp -a <replaceable>ftp2.FreeBSD.org</replaceable></userinput>
Connected to ftp2.FreeBSD.org.
220 ftp2.FreeBSD.org FTP server (Version 6.00LS) ready.
331 Guest login ok, send your email address as password.
230-
230-     This machine is in Vienna, VA, USA, hosted by Verio.
230-         Questions? E-mail freebsd@vienna.verio.net.
230-
230-
230 Guest login ok, access restrictions apply.
Remote system type is UNIX.
Using binary mode to transfer files.
<prompt>ftp></prompt> <userinput>cd /pub/FreeBSD/ports/packages/sysutils/</userinput>
250 CWD command successful.
<prompt>ftp></prompt> <userinput>get lsof-4.56.4.tgz</userinput>
local: lsof-4.56.4.tgz remote: lsof-4.56.4.tgz
200 PORT command successful.
150 Opening BINARY mode data connection for 'lsof-4.56.4.tgz' (92375 bytes).
100% |**************************************************| 92375       00:00 ETA
226 Transfer complete.
92375 bytes received in 5.60 seconds (16.11 KB/s)
<prompt>ftp></prompt> <userinput>exit</userinput>
&prompt.root; <userinput>pkg_add <replaceable>lsof-4.56.4.tgz</replaceable></userinput></screen>
      </example>

      <para>Si no tiene una fuente local de paquetes (por ejemplo 
        un CDROM de &os;) probablemente la mejor 
        opci&oacute;n sea utilizar el argumento <option>-r</option> de
        &man.pkg.add.1;, que har&aacute; que determine 
        autom&aacute;ticamente el formato del objeto correcto, para 
        posteriormente descargarlo e instalarlo desde un FTP.</para>

      <indexterm>
        <primary><command>pkg_add</command></primary></indexterm>
      <screen>&prompt.root; <userinput>pkg_add -r <replaceable>lsof</replaceable></userinput></screen>

      <para>En el ejemplo anterior el paquete correspondiente se 
        descargar&aacute; e instalar&aacute; sin intervenci&oacute;n 
        del usuario.  Si desea utilizar una r&eacute;plica 
	(<quote>mirror</quote>) de paquetes que no sea el sitio principal 
        de &os; solo tiene configurar la variable de entorno 
        <envar>PACKAGESITE</envar> correctamente para 
        sobreescribir el sitio predefinido.  &man.pkg.add.1; utiliza 
        &man.fetch.1; para descargar los ficheros, tomando como 
        referencia varias variables de entorno, como 
        <envar>FTP_PASSIVE_MODE</envar>, <envar>FTP_PROXY</envar> y 
        <envar>FTP_PASSWORD</envar>.  Quiz&aacute;s deba modificar alguna de 
        estas si se encuentra detr&aacute;s de un cortafuegos, o usa un 
        proxy FTP/HTTP.  Consulte &man.fetch.3; si quiere ver una lista 
        completa.  Observe tambi&eacute;n que en el ejemplo anterior 
        usamos <literal>lsof</literal> en vez de 
	<literal>lsof-4.56.4</literal>.  
        Cuando usamos la opci&oacute;n de descarga remota no es 
        necesario especificar la versi&oacute;n del paquete.  
        &man.pkg.add.1; descargar&aacute; autom&aacute;ticamente la 
        &uacute;ltima versi&oacute;n de la aplicaci&oacute;n.</para>

      <para>Los paquetes se distribuyen en formato <filename>.tgz</filename>  
        y <filename>.tbz</filename>. Puede encontrarlos en <ulink
        url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/">
        ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/</ulink> o bien en 
        el CDROM de &os;.  Cada CD de la distribuci&oacute;n de 4 CD (y del 
        PowerPak, etc) contiene los paquetes en el directorio 
        <filename>/packages</filename>.  El orden de dicho directorio es 
        similar al &aacute;rbol de <filename>/usr/ports</filename>.  Cada 
        categor&iacute;a tiene su subdirectorio, y todos los paquetes 
        est&aacute;n en el directorio <filename>All</filename>.</para>

      <note>
	<para>&man.pkg.add.1; descargar&aacute; la &uacute;ltima 
	  versi&oacute;n de su aplicaci&oacute;n si usa &os.current; o 
	  &os.stable;, pero si usa una versi&oacute;n -RELEASE, 
	  descargar&aacute; la versi&oacute;n del paquete que se 
	  construy&oacute; con dicha versi&oacute;n.  Es posible configurar 
	  esto sobreescribiendo la variable de entorno 
	  <envar>PACKAGESITE</envar>.</para>
      </note>

      <para>Los ficheros de paquetes se destribuyen en formatos 
          <filename>.tgz</filename> y <filename>.tbz</filename>.
          Puede encontrarlos en <ulink
          url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/"></ulink>,
          o en la distribuci&oacute;n de FreeBSD en CD-ROM.  Todos los
          CDs en el set de 4 CDs de FreeBSD (y en el PowerPak, etc.)
          contienen paquetes en el directorio
          <filename>/packages</filename>.  La estructura de los
          paquetes es similar a la del arbol de
          <filename>/usr/ports</filename>.  Cada categor&iacute;a
          tiene su propio directorio, y todos los paquetes se pueden
          encontrar dentro del directorio <filename>All</filename>.
      </para>

      <para>La estructura del directorio de paquetes es id&eacute;ntica a la 
        de los ports, y funcionan como un todo para conformar el sistema de  
        paquetes/ports.
        </para>

    </sect2>

    <sect2>
      <title>Eliminar un paquete</title>
      <indexterm>
        <primary><command>pkg_delete</command></primary>
      </indexterm>
      <indexterm>
        <primary>packages</primary>
        <secondary>deleting</secondary>
      </indexterm>
      <para>Para eliminar un paquete instalado en el sistema, utilice 
	    &man.pkg.delete.1;.</para>

      <screen>&prompt.root; <userinput>pkg_delete <replaceable>xchat-1.7.1</replaceable></userinput></screen>
    </sect2>

    <sect2>
      <title>Miscel&aacute;nea</title>
      <para>Toda la informaci&oacute;n de los paquetes se guarda en 
        <filename>/var/db/pkg</filename>.  En &eacute;l encontrar&aacute; 
        la lista completa de paquetes instalados y las descripciones de 
	los mismos.</para>
    </sect2>
  </sect1>
  
  <sect1 id="ports-using">
    <title>Uso de la colecci&oacute;n de ports</title>

    <para>La siguiente secci&oacute;n incluye las instrucciones 
      b&aacute;sicas para instalar o eliminar programas mediante la 
      Colecci&oacute;n de Ports de su sistema.</para>

    <sect2 id="ports-tree">
      <title>C&oacute;mo obtener la Colecci&oacute;n de Ports</title>

      <para>Para poder instalar ports primero debe hacerse, obviamente, con 
        la Colecci&oacute;n de Ports&mdash;; en esencia est&aacute; compuesta 
        por <filename>Makefiles</filename>, parches y ficheros con la
        descripci&oacute;n de los ports y est&aacute; en 
        <filename>/usr/ports</filename>.</para>

      <para>Cuando instal&oacute; su sistema &os; el programa 
	    <application>sysinstall</application> le pregunt&oacute; si 
	    quer&iacute; instalar la Colecci&oacute;n de Ports.  
	    Si contest&oacute; que no siga estas instrucciones:</para>

      <procedure>
	<title>Mediante Sysinstall</title>

	<para>Este m&eacute;todo implica el uso de
	  <application>sysinstall</application> para 
	  instalar la Colecci&oacute;n de Ports.</para>

	<step>
	  <para>Como usuario <username>root</username> ejecute 
	    <command>sysinstall</command>
	    (<command>/stand/sysinstall</command> en cualquier versi&oacute;n 
	    previa a &os; 5.2); del siguiente modo:</para>

	  <screen>&prompt.root; <userinput>sysinstall</userinput></screen>
	</step>

	<step>
	  <para>Posici&oacute;nese en la opci&oacute;n 
	    <guimenuitem>Configure</guimenuitem> 
	    y pulse <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione la opci&oacute;n 
	  <guimenuitem>Distributions</guimenuitem>, 
	  y pulse <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione la opci&oacute;n <guimenuitem>ports</guimenuitem> 
	    y pulse la <keycap>barra espaciadora</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione el medio de instalaci&oacute;n deseado (CDROM, 
	    FTP, etc.)</para>
	</step>

	<step>
	  <para>Dir&iacute;jase a la opci&oacute;n 
	    <guimenuitem>Exit</guimenuitem>, y 
	    pulse <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Pulse <keycap>X</keycap> para salir de 
            <application>sysinstall</application>.</para>
	</step>
      </procedure>

      <para>El m&eacute;todo alternativo para obtener y mantener actualizada la 
        Colecci&oacute;n de Ports es mediante 
	<application>CVSup</application>.  
        Lea el fichero de ports para <application>CVSup</application> que 
	encontrar&aacute; en 
	<filename>/usr/share/examples/cvsup/ports-supfile</filename>.  
	Consulte el cap&iacute;tulo <link linkend="cvsup">Usar
        CVSup</link> (<xref linkend="cvsup">) para m&aacute;s
        informaci&oacute;n sobre c&oacute;mo usar 
        <application>CVSup</application> y el fichero 
        mencionado.</para>

      <procedure>
	<title>Mediante CVSup</title>

	<para>Si quiere un m&eacute;tido r&aacute;pido para obtener 
	  la Colecci&oacute;n de Ports use 
	  <application>CVSup</application>.  Si quiere mantener su 
	  &aacute;rbol de ports actualizado o bien saber m&aacute;s 
	  sobre <application>CVSup</application> lea los documentos 
	  mencionados previamente.</para>

	<step>
	  <para>Instale el port <filename role="package">net/cvsup</filename>.  
	    Consulte 
	    <link linkend="cvsup-install">Instalaci&oacute;n de CVSup</link> (<xref
	      linkend="cvsup-install">) para m&aacute;s 
	    informaci&oacute;n.</para>
	</step>

	<step>
	  <para>Como usuario <username>root</username> copie el fichero 
	    <filename>/usr/share/examples/cvsup/ports-supfile</filename> 
	    a una nueva ubicaci&oacute;n, por ejemplo al directorio 
	    <filename>/root</filename> o bien su propio directorio 
	    home.</para>
	</step>

	<step>
	  <para>Edite el fichero <filename>ports-supfile</filename>.</para>
	</step>

	<step>
	  <para>Cambie la parte <quote>CHANGE_THIS</quote> de 
	    <replaceable>CHANGE_THIS.FreeBSD.org</replaceable> por un 
	    servidor <application>CVSup</application> que le sea cercano.  
	    Consulte el el cap&iacute;tulo 
	    <link linkend="cvsup-mirrors">Mirrors de CVSup</link> (<xref
	    linkend="cvsup-mirrors">), donde encontrar&aacute; una lista 
	    completa de r&eacute;plicas de &os;</para>
	</step>

	<step>
	  <para>Ejecute <command>cvsup</command>:</para>

	  <screen>&prompt.root; <userinput>cvsup -g -L 2 <replaceable>/root/ports-supfile</replaceable></userinput></screen>
	</step>

	<step>
	  <para>Cuando ejecute esto se descargar&aacute;n y aplicar&aacute;n 
            las actualizaciones de la Colecci&oacute;n de Ports.  Este proceso 
	    no incluye la recompilaci&oacute;n de los ports de su 
	    sistema.</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="ports-skeleton">
      <title>Instalaci&oacute;n de ports</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>installing</secondary>
      </indexterm>
      <para>Al hablar de la Colecci&oacute;n de Ports lo primero que debemos 
        explicar es a qu&eacute; nos referimos cuando hablamos de un 
        <quote>esqueleto</quote> (skeleton).  En s&iacute; mismo, un 
	esqueleto de port un conjunto m&iacute;nimo de ficheros que 
	indican a &os; c&oacute;mo compilar e instalar un programa.  
        Cada esqueleto incluye:</para>

      <itemizedlist>
	<listitem>
	  <para>Un <filename>Makefile</filename>.  Este 
	    <filename>Makefile</filename> contiene varias sentencias, 
	    que le indican al sistema c&oacute;mo compilarlo y d&oacute;nde 
	    instalarlo en su sistema.</para>
	</listitem>

	<listitem>
	  <para>Un fichero <filename>distinfo</filename>.  Este fichero 
	    contiene informaci&oacute;n sobre los ficheros que se deben 
	    descargar para poder compilar el programa, as&iacute; como el 
	    identificador <quote>checksum</quote>, que se usa para comprobar 
	    mediante &man.md5.1; que la descarga ha sido correcta y que el 
	    la integridad del fichero est&aacute; garantizada.</para>
	</listitem>
	
	<listitem>
	  <para>Un directorio <filename>files</filename>.  Este directorio 
	    contiene  los parches necesarios para compilar e instalar 
	    el programa en su sistema &os;.  B&aacute;sicamente los parches 
	    son peque&ntilde;os ficheros que especifican cambios en ficheros 
	    concretos.  Su formato es en texto plano y suelen decir cosas 
	    como <quote>borra la l&iacute;nea 10</quote> o 
	    <quote>Cambia la l&iacute;nea 26 por esto...</quote>.  
	    Estos parches tambi&eacute;n se conocen como 
	    <quote>diffs</quote> ya que se generan con 
	    &man.diff.1;.</para>

	  <para>Es posible que este directorio tambi&eacute; contenga 
	    alg&uacute;n otro fichero necesario para compilar e instalar 
	    el port.</para>
	</listitem>

	<listitem>
	  <para>Un fichero <filename>pkg-descr</filename>.  Es una 
	    descripci&oacute;n m&aacute;s detallada del programa.  
	    En algunas ocasiones ocupa varias l&iacute;neas.
	    </para>
	</listitem>
	
	<listitem>
	  <para>Un fichero <filename>pkg-plist</filename>.  Es una lista de 
	    todos los ficheros que instalar&aacute; el port.  
	    Tambi&eacute;n le indica al sistema de ports qu&eacute; ficheros 
	    eliminar durante la desinstalaci&oacute;n del programa.</para>
	</listitem>
      </itemizedlist>

      <para>Algunos ports tienen otros ficheros, como 
        <filename>pkg-message</filename>.  El sistema de ports los usa para 
        gestionar situaciones especiales.  Si desea conocer los detalles, 
        incluso sobre los ports en general, consulte el libro 
	<quote>&os; Porter's Handbook</quote>.</para>

      <para>El port incluye las instrucciones de construcci&oacute;n 
        desde el c&oacute;digo fuente, pero no incluye el 
        c&oacute;digo.  Puede obtener el c&oacute;digo desde un CDROM 
        o desde Internet.  El c&oacute;digo se distribuye del modo 
        que el autor estime oportuno.  Normalmente es un fichero tar 
        comprimido con gzip, pero puede comprimirse con otra herramienta o 
        incluso no estar comprimido.  El c&oacute;digo del programa, 
        venga como venga, se llama <quote>distfile</quote>.  A 
	continuaci&oacute;n veremos los dos m&eacute;todos de 
	instalaci&oacute;n de un port.</para>

      <note>
        <para>Debe ser el usuario <username>root</username> para 
          instalar ports.</para>
      </note>

      <warning>
	<para>Antes de instalar cualquier port aseg&uacute;rese de tener la 
	  Colecci&oacute;n de Ports actualizada y de comprobar en <ulink
	  url="http://vuxml.freebsd.org/"></ulink> la existencia de posibles 
	  problemas de seguridad que pudiera tener el port.</para>

	<para>Puede realizar la comprobaci&oacute;n de seguridad 
	  con <application>portaudit</application> antes de instalar 
	  cualquier  aplicaci&oacute;n.  Esta herramienta est&aacute; 
	  la Colecci&oacute;n de Ports (<filename
	  role="package">security/portaudit</filename>).  Le rogamos 
	  que al menos considere ejecutar 
	  <command>portaudit -F</command> antes de instalar 
	  un port nuevo, para que descargue la nueva base de datos de 
	  vulnerabilidades.  Durante la comprobaci&oacute;n diaria de 
	  seguridad actualizar&aacute; la base de datos y har&aacute; una 
	  auditor&iacute;a del sistema.  Para m&aacute;s informaci&oacute;n
	  lea las p&aacute;ginas de man&uacute;al de 
	  &man.portaudit.1; y &man.periodic.8;.</para> 
      </warning>


      <sect3 id="ports-cd">
        <title>Instalaci&oacute;n de ports desde un CDROM</title>

        <indexterm>
          <primary>ports</primary>
          <secondary>installing from CDROM</secondary>
        </indexterm>
        <para>Los CDROM oficiales del Proyecto &os; ya no incluyen 
          distfiles.  Ocupan mucho espacio y se aprovecha mucho mejor 
	  si se incluyen paquetes precompilados.  Los CDROM del PowerPak 
          s&iacute; incluyen distfiles; puede comprarlos en distribuidores 
	  como <ulink url="http://www.freebsdmall.com/">FreeBSD Mall</ulink>.  
	  A lo largo de esta secci&oacute;n asumiremos que tiene un juego 
	  de CDROM de &os;.</para>

        <para>Inserte su CDROM en la unidad correspondiente.  M&oacute;ntelo 
	  en <filename>/cdrom</filename>.  (Si utiliza un punto de 
	  montaje diferente configure la variable de make 
	  <makevar>CD_MOUNTPTS</makevar>).  Para comenzar dir&iacute;jase 
	  al directorio donde est&eacute; el port que quiere 
	  instalar:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput></screen>

        <para>Una vez en el directorio <filename>lsof</filename> 
          ver&aacute; el esqueleto del port.  El siguiente paso 
          es compilar o <quote>construir</quote> el port.  Para ello 
          simplemente tecleamos <command>make</command> en la 
          l&iacute;nea de ordenes.  Hecho esto 
          ver&aacute; algo similar a lo siguiente:</para>

        <screen>&prompt.root; <userinput>make</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from file:/cdrom/ports/distfiles/.
===&gt;  Extracting for lsof-4.57
...
[salida de la descompresi&oacute;n cortada]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[salida de configure cortada]
...
===&gt;  Building for lsof-4.57
...
[salida de la compilaci&oacute;n cortada]
...
&prompt.root;</screen>

        <para>Observe que una vez que ha terminado la compilaci&oacute;n 
          regresar&aacute; a la l&iacute;nea de &oacute;rdenes.  
	  El siguiente paso es instalar el port.  Debemos a&ntilde;adir 
          una palabra a la orden <command>make</command>: 
	      <command>install</command>:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
===&gt;  Installing for lsof-4.57
...
[salida de la instalaci&oacute;n cortada]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>Una vez que regrese a la l&iacute;nea de &oacute;rdenes 
          podr&aacute; ejecutar la aplicaci&oacute;n que acaba de instalar.  
          Dado que el programa <command>lsof</command> se ejecuta con 
          privilegios vemos una advertencia de seguridad.  
          Debe tener muy en cuenta cualquier aviso que aparezca durante 
          la compilaci&oacute;n e instalaci&oacute;n.</para>

        <note>
          <para>Puede ahorrar un paso ejecutando <command>make 
            install</command> en una sola orden en lugar de ejecutar 
            <command>make</command> y <command>make install</command> 
            en dos pasos diferentes.</para>
	</note>

	<note>
	  <para>Algunas shells cuentan con una cach&eacute; de 
	    &oacute;rdenes disponibles en los directorios que aparecen 
	    en la variable de entorno <envar>PATH</envar> para agilizar 
	    las operaciones de b&uacute;squeda de los ejecutables de 
	    estos ficheros.  Si usa alguna de estas shells tecl&eacute;e 
	    <command>rehash</command> una vez que ha instalado 
	    el port para poder usar su nuevo programa.  
	    Esta orden funciona con shells como
	    <command>tcsh</command>.  Para shells como sh ejecute 
	    <filename role="package">shells/bash</filename> 
	    <command>has -r</command>.  Consulte la 
	    documentaci&oacute;n de su shell para m&aacute;s 
	    informaci&oacute;n.</para>
	</note>

        <note>
          <para>Por favor, tenga en cuenta que algunos ports tienen licencias 
            que no permiten su inclusi&oacute;n en el CDROM.  
            Probablemente es a consecuencia de un registro que se debe hacer 
            antes de la descarga, que no est&eacute; permitida la 
            redistribuci&oacute;n en CDROM o quiz&aacute;s se deba a 
	    otra raz&oacute;n.  Si quiere instalar un port que no est&aacute; 
            en el CDROM necesitar&aacute; conexi&oacute;n a Internet 
            Internet (consulte la <link  
            linkend="ports-inet">siguiente secci&oacute;n</link>).</para>
	</note>
      </sect3>

      <sect3 id="ports-inet">
      <title>Instalaci&oacute;n de ports desde Internet</title>

        <para>Como en la secci&oacute;n anterior, en esta secci&oacute;n se 
	  asume que tiene configurada su conexi&oacute;n a Internet.  
          Si no es as&iacute; deber&aacute; llevar a cabo la 
          instalaci&oacute;n 
          <link linkend="ports-cd">mediante CDROM</link>, o ponga usted una 
          copia del distfile en 
	  <filename>/usr/ports/distfiles</filename> manualmente.</para>

        <para>Instalar un port desde Internet se hace exactamente igual 
          que cuando se hace desde un CDROM.  La &uacute;nica diferencia 
          entre estos dos m&eacute;todos es que el fichero distfile se 
	  descarga desde Internet.</para>

        <para>Los pasos son id&eacute;nticos:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/.
Receiving lsof_4.57D.freebsd.tar.gz (439860 bytes): 100%
439860 bytes transferred in 18.0 seconds (23.90 kBps)
===&gt;  Extracting for lsof-4.57
...
[salida de la descompresi&oacute;n del fichero cortada]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[salida de la configuraci&oacute;n cortada]
...
===&gt;  Building for lsof-4.57
...
[salida de la compilaci&oacute;n cortada]
...
===&gt;  Installing for lsof-4.57
...
[salida de la instalaci&oacute;n cortada]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>Como puede ver la &uacute;nica diferencia es la l&iacute;nea que 
          indica desde d&oacute;nde se descarga el c&oacute;digo.</para>

	<para>El sistema de ports utiliza &man.fetch.1; para descargar los 
	  ficheros, y usa distintas varibles de entorno como 
	  <envar>FTP_PASSIVE_MODE</envar>, <envar>FTP_PROXY</envar>,  
	  y <envar>FTP_PASSWORD</envar>.  Puede ser necesario que modifique 
	  una o m&aacute;s de estas variables si est&aacute; detr&aacute;s de 
	  un cortafuegos o de un proxy FTP/HTTP.  Consulte la p&aacute;gina 
	  de manual de &man.fetch.3; si quiere ver una lista completa de 
	  las opciones.</para>

	<para>La opci&oacute;n 
	  <command>make <maketarget>fetch</maketarget></command> facilita la 
	  tarea a los usuarios que no pueden estar permanentemente 
	  conectados.  Ejecute la orden en 
	  <filename>/usr/ports</filename> y los ficheros necesarios se 
	  descargar&aacute;n autom&aacute;ticamente.  Esta orden funciona 
	  tambi&eacute;n en los subdirectorios, por ejemplo en 
	  <filename>/usr/ports/net</filename>.  
	  Si el port depende de bibliotecas o de otros ports la orden 
	  <emphasis>no</emphasis> descargar&aacute; los distfiles de 
	  las dependencias.  Reemplace 
	  <maketarget>fetch</maketarget> por 
	  <maketarget>fetch-recursive</maketarget> si quiere descargar 
	  tambi&eacute;n las dependencias del port.</para>

	<note><para>Es posible compilar todos los ports de una categoria, 
	  o incluso todos si eso es lo que quiere, ejecutando la 
	  orden <command>make</command> en <filename>/usr/ports</filename>, 
	  igual que hemos visto en 
	  <command>make<makevar>fetch</makevar></command>
	  Tenga en cuenta que puede resultar peligroso, ya que algunos 
	  ports no pueden pueden coexistir.  Por otra parte puede darse que 
	  algunos ports instalen dos ficheros distintos con el mismo 
	  nombre.</para></note>

	<para>Puede darse el caso de que necesite descargar los tarballs de 
	  un sitio que no sea <makevar>MASTER_SITES</makevar> (cuyo valor 
	  indica el repositorio desde el que se descargan los ficheros).  
	  Para cambiar el valor de la opci&oacute;n 
	  <makevar>MASTER_SITES</makevar> haga lo siguiente:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/<replaceable>directory</replaceable></userinput></screen>
        <screen>&prompt.root; <userinput>make MASTER_SITE_OVERRIDE= \
        ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/ fetch</userinput></screen>

	<para>En este ejemplo cambiamos la opci&oacute;n 
	  <makevar>MASTER_SITES</makevar>
	  a <hostid role="fqdn">ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/</hostid>.</para> 

	<para>Algunos ports permiten (o requieren) que se faciliten opciones 
	  de compilaci&oacute;n que habiliten o deshabiliten componentes de 
	  la aplicaci&oacute;n que no son necesarios, algunas opciones de 
	  seguridad o de otro tipo.  
	  <filename role="package">
	  www/mozilla</filename>, 
	  <filename role="package">security/gpgme</filename> y 
	  <filename role="package">mail/sylpheed-claws</filename> son casos 
	  t&iacute;picos.  Cuando existan estas opciones ver&aacute; un 
	  mensaje al respecto.</para>
      </sect3>  

      <sect3>
	<title>C&oacute;mo reubicar el directorio de los ports</title>

	<para>Algunas veces es &uacute;til (o imprescindible) usar 
	  diferentes distfiles y directorios de ports.  Las variables 
	  <makevar>PORTSDIR</makevar> y <makevar>PREFIX</makevar> le 
	  ayudar&aacute; con esto.  Veamos un ejemplo:</para>

        <screen>&prompt.root; <userinput>make PORTSDIR=/usr/home/ejemplo/ports install</userinput></screen>
	<para>Esto compilar&aacute; el port en 
	  <filename>/usr/home/ejemplo/ports</filename> y lo 
	  instalar&aacute; en <filename>/usr/local</filename>.</para>
        
	<screen>&prompt.root; <userinput>make PREFIX=/usr/home/ejemplo/local install</userinput></screen>
	<para>Esto compilar&aacute; el port en 
	  <filename>/usr/ports</filename> y lo 
	  instalar&aacute; en 
	  <filename>/usr/home/ejemplo/local</filename>.</para>

	<para>Y claro,</para>

        <screen>&prompt.root; <userinput>make PORTSDIR=../ports PREFIX=../local install</userinput></screen>

	<para>Combinar&aacute; los dos (es demasiado largo para escribirlo 
	  completamente pero deber&iacute;a darle una idea de c&oacute;mo 
	  se har&iacute;a).</para>
	
	<para>Tambi&eacute;n puede cambiar estas variables como parte su 
	  entorno.  En el manual de su shell encontrar&aacute; c&oacute;mo 
	  hacerlo.</para>
      </sect3>	

      <sect3>
	<title>Uso de <command>imake</command></title>

	<para>Algunos ports que usan <command>imake</command> 
	  (un componente del Sistema X Window) no funcionan correctamente 
	  con <makevar>PREFIX</makevar>, e  insistir&aacute;n en instalar 
	  en <filename>/usr/X11R6</filename>.  Del mismo modo 
	  algunos ports de Perl ignoran <makevar>PREFIX</makevar> y se 
	  instalan en el &aacute;rbol de Perl.  Hacer que estos ports 
	  respeten <makevar>PREFIX</makevar> es dif&iacute;cil y a veces 
	  imposible.</para>
	  
      </sect3>
    </sect2>

    <sect2 id="ports-removing">
      <title>C&oacute;mo desinstalar ports</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>removing</secondary>
      </indexterm>
      <para>Ahora que sabe instalar ports probablemente quiera saber 
        c&oacute;mo eliminarlos; puede que haya instalado alguno y 
        posteriormente se haya dado cuenta de que ha instalado el port 
	incorrecto.  Vamos a desinstalar el por del ejemplo anterior 
        (que, para todos aquellos que no estaban atentos,  era 
	<command>lsof</command>).  Igual que al instalar ports, lo primero 
	que debemos hacer es ubicarnos en el directorio del port que 
	deseamos eliminar del sistema, en nuestro caso 
	<filename>/usr/ports/sysutils/lsof</filename>.  
	Una vez ubicados en el directorio adecuado estamos listos para 
	eliminar <command>lsof</command>.  Para ello usaremos la orden 
	<command>make deinstall</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput>
&prompt.root; <userinput>make deinstall</userinput>
===&gt;  Deinstalling for lsof-4.57</screen>

      <para>Como ve, ha sido muy f&aacute;cil.  Ha eliminado 
        <command>lsof</command> de su sistema.  Si quiere reinstalarlo 
	ejecute <command>make reinstall</command> en el directorio 
        <filename>/usr/ports/sysutils/lsof</filename>.</para>

      <para>Las &oacute;rdenes <command>make deinstall</command> y 
        <command>make reinstall</command> no funcionan si ejecuta la 
        orden <command>make clean</command>.  Si quiere desintalar un port 
        despu&eacute;s de ejecutar <command>make clean</command> deber&aacute; 
        usar la orden &man.pkg.delete.1; como se describe en la 
	secci&oacute;n de 
        <link linkend="packages-using">Paquetes</link> del Handbook.</para>
    </sect2>
    <sect2 id="ports-disk-space">
      <title>Los ports y el espacio de disco</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>disk-space</secondary>
      </indexterm>
      <para>Usar la Colecci&oacute;n de Ports consume mucho espacio de 
        disco seg&uacute;n pasa el tiempo.  Por culpa de la tendencia del 
        &aacute;rbol de ports a crecer en tama&ntilde;o le recomendamos 
	que despu&eacute;s de compilar e instalar sofware desde los ports 
        recuerde limpiar los directorios temporales <filename
        class="directory">work</filename> mediante la orden
        <command>make <makevar>clean</makevar></command>.  Esto 
        eliminar&aacute; el directorio <filename
        class="directory">work</filename> que queda despu&eacute;s de 
        compilar e instalar un port.  Tambi&eacute;n puede eliminar los 
        ficheros de c&oacute;digo del directorio <filename
        class="directory">distfiles</filename> y los ports instalados 
        si lo estima conveniente.</para>

      <para>Algunos usuarios limitan las categor&iacute;as de ports 
	disponibles configurando el fichero 
	<filename>refuse</filename>.  De esta forma, cuando ejecutan
	la aplicaci&oacute;n <application>CVSup</application>, no 
	descargar&aacute; los ficheros de esas categor&iacute;a.  Puede 
	encontrar m&aacute;s informaci&oacute;n sobre el fichero 
	<filename>refuse</filename> en la <xref
	linkend="cvsup-refuse-file">.</para>
    </sect2>

    <sect2 id="ports-upgrading">
      <title>C&oacute;mo actualizar los ports</title>

      <indexterm>
	<primary>portupgrade</primary>
      </indexterm>
      <indexterm>
	<primary>ports</primary>
	<secondary>upgrading</secondary>
      </indexterm>
      <note>
	<para>Una vez que actualice su colecci&oacute;n de ports 
          (y antes de intentar actualizar ning&uacute;n port) 
	  deber&iacute;a leer el fichero 
	  <filename>/usr/ports/UPDATING</filename>.  Este fichero 
          describe varios problemas que los usuarios pueden encontrarse 
          y los pasos adicionales para sortearlos al actualizar 
          un port.</para>
      </note>

      <para>Mantener los ports actualizados puede ser una tarea 
	tediosa.  Por ejemplo, para actualizar un port debe ir al 
	directorio del port, compilar el port, desinstalar el 
	port viejo, instalar el port nuevo y por &uacute;ltimo limpiar 
	el directorio despu&eacute;s de compilarlo.  
	Imagine hacer esto con cinco ports: tedioso 
	&iquest;verdad?.  Esto era un gran problema para los
	administradores, pero ahora tenemos herramientas para arreglarlo.  
	Por ejemplo, la herramienta <filename
	role="package">sysutils/portupgrade</filename> se har&aacute; 
	cargo de todo esto.  Inst&aacute;leo como cualquier otro 
	port mediante la orden <command>make <makevar>install
	clean</makevar></command>.</para>

      <para>Ahora debe crear la base de datos con la orden <command>pkgdb
	-F</command>.  Esto leer&aacute; la lista de ports instalados y 
	crear&aacute; el fichero de base de datos en el directorio 
	<filename>/var/db/pkg</filename>.  Cuando ejecute la
	orden <command>portupgrade
	-a</command>, leer&aacute; esa base de datos y el fichero 
	<filename>INDEX</filename> de los ports.  Por &uacute;ltimo,  
	<application>portupgrade</application> empezar&aacute; a 
	descargar, compilar, instalar y limpiar los ports que se han 
	actualizado.  <application>portupgrade</application> incluye 
	muchas opciones para diferentes necesidades, las m&aacute;s 
	importantes se exponen m&aacute;s adelante.</para>

      <para>Si quiere actualizar una sola aplicaci&oacute;n y no la 
	base de datos completa use la orden <command>portupgrade
	<replaceable>pkgname</replaceable></command>, 
	incluyendo el parametro <option>-r</option> si 
	<application>portupgrade</application> debe actualizar 
	tambi&eacute;n todos los paquetes que dependan de este paquete, y
	<option>-R</option> si quiere que actualice todos los paquetes 
	de los que depende esta aplicaci&oacute;n.</para>

      <para>Si prefiere usar paquetes en vez de ports en la
	instalaci&oacute;n use el par&aacute;metro 
	<option>-P</option>.  Con esta opci&oacute;n 
	<application>portupgrade</application> busca 
	en los directorios locales que hay en <envar>PKG_PATH</envar>, o 
	descarga los paquetes desde internet si no los encuentra 
	en el sistema.  Si no lo encuentra en local ni en el servidor 
	remoto <application>portupgrade</application> 
	usar&aacute; los ports.  Para evitar que use los ports 
	especifique <option>-PP</option>.</para>

      <para>Si solo quiere descargar los distfiles (o paquetes si usa 
	<option>-P</option>) sin compilar o instalar nada, use 
	<option>-F</option>.  Para m&aacute;s informaci&oacute;n 
	consulte &man.portupgrade.1;.</para>

      <note>
	<para>Es importante actualizar la base de datos de paquetes 
	  regularmente mediante la orden <command>pkgdb -F</command>; 
	  De este modo corregir&aacute; inconsistencias, sobre todo cuando 
	  <application>portupgrade</application> se lo pida.  No 
	  cancele <application>portupgrade</application> mientras est&eacute; 
	  actualizando la base de datos de paquetes puesto que  
	  dejar&iacute;a una base de datos inconsistente.</para>
      </note>

      <para>Hay m&aacute;s herramientas que pueden hacer todo esto; 
        curios&eacute;e un poco en el directorio 
	<filename>ports/sysutils</filename>, a ver qu&eacute; 
	encuentra.</para>
    </sect2>
  </sect1>

  <sect1 id="ports-nextsteps">
    <title>Despu&eacute;s de instalar un port</title>

    <para>Una vez que ha instalado una nueva aplicaci&oacute;n normalmente 
      deber&aacute; leer la documentaci&oacute;n que incluye, editar los 
      ficheros de configuraci&oacute;n necesarios, asegurarse de que la 
      aplicaci&oacute;n se ejecute al arrancar el sistema (si es un 
      d&aelig;mon),etc.</para>

    <para>Obviamente los pasos exactos para configurar cada aplicaci&oacute;n 
      son distintos de una a otra.  De cualquier forma, si acaba de instalar 
      aplicaci&oacute;n y se pregunta 
      <quote>&iquest;Y ahora qu&eacute;?</quote> estos consejos puede que le 
      ayuden:</para>

    <itemizedlist>
      <listitem>
	<para>Use &man.pkg.info.1; para ver qu&eacute; ficheros se instalaron 
	  y d&oacute;nde.  Por ejemplo, si instal&oacute;n 
	  el paquete FooPackage 1.0.0, lo siguiente:</para>

	<screen>&prompt.root; <userinput>pkg_info -L foopackage-1.0.0 | less</userinput></screen>

	<para>mostrar&aacute; los ficheros instalados por el paquete.  Preste 
	  especial atenci&oacute;n a los ficheros en el directorio 
	  <filename>man/</filename>, que son las p&aacute;ginas de ayuda y los 
	  del directorio <filename>etc/</filename>, que contiene los ficheros 
	  de configuraci&oacute;n; bajo el directorio <filename>doc/</filename> 
	  podr&aacute; encontrar informaci&oacute;n m&aacute;s 
	  detallada.</para>

	<para>Si no est&aacute; seguro de qu&eacute; versi&oacute;n del 
	  paquete ha instalado, tecl&eacute;e algo as&iacute;:</para>

	<screen>&prompt.root; <userinput>pkg_info | grep -i <replaceable>foopackage</replaceable></userinput></screen>

	<para>y le ver&aacute; todos los paquetes que se llaman 
	  <replaceable>foopackage</replaceable>.  Reemplace 
	  <replaceable>foopackage</replaceable> en la l&iacute;nea de 
	  &oacute;rdenes seg&uacute;n su caso.</para>
      </listitem>

      <listitem>
	<para>Una vez que ha identificado las p&aacute;ginas de manual 
	  de la aplicaci&oacute;n rev&iacute;selas mediante &man.man.1;.  
	  Revise tambi&eacute;n los ficheros de configuraci&oacute;n, 
	  as&iacute; como cualquier otro tipo de documentaci&oacute;n 
	  incluida.</para>
      </listitem>

      <listitem>
	<para>Si la aplicaci&oacute;n tiene sitio web vis&iacute;telo.  
	  Es muy posible que encuentre m&aacute;s documentaci&oacute;n, 
	  listas de preguntas frecuentes (FAQ), etc.  Si no sabe cu&aacute;l 
	  puede ser la direcci&oacute;n del sitio web examine la 
	  salida de la orden</para>

	<screen>&prompt.root; <userinput>pkg_info <replaceable>foopackage-1.0.0</replaceable></userinput></screen>
	
	<para>A veces incluye una l&iacute;nea <literal>WWW:</literal>, que 
	  contiene la direcci&oacute;n del sitio web de la 
	  aplicaci&oacute;n.</para>
      </listitem>
      <listitem>
	<para>Los ports que deben arrancar con el sistema (como los 
	  servidores de Internet) normalmente instalaran un 
	  <quote>script</quote> de 
	  ejemplo en <filename>/usr/local/etc/rc.d</filename>.  Debe 
	  revisar este <quote>script</quote> para comprobar que todo sea 
	  correcto, editarlo o renombrarlo si fuera necesario.  Consulte 
	   <link
	   linkend="configtuning-starting-services">C&oacute;mo arrancar 
	    servicios</link> para m&aacute;s informaci&oacute;n.</para>

      </listitem>

    </itemizedlist>
  </sect1>
  <sect1 id="ports-broken">
    <title>Ports que no funcionan</title>

      <para>Si encuentra un port que no funciona hay varias cosas 
        que puede hacer:</para>

      <orderedlist>
	<listitem>
	  <para>Consulte en la 
	    <ulink url="http://www.freebsd.org/support.html#gnats">Base 
	    de datos de informes de error</ulink> si 
	    ya existe un parche que lo solucione pero a&uacute;n no se 
	    ha aplicado.  Si es el caso puede aplicar el parche en su 
	    sistema.</para>
         </listitem>

	 <listitem>
	   <para>Pida ayuda al responsable del mantenimiento 
	     (conocido como <quote>mantainer</quote>) del port.  
	     Tecl&eacute;e <command>make maintainer</command> o 
	     consulte el 
	     <filename>Makefile</filename> del port si no sabe cu&aacute;l 
	     es la direcci&oacute;n de correo del mantainer.  
	     Recuerde que debe incluir el nombre y la versi&oacute;n del 
	     port.   Env&iacute;e la l&iacute;nea que contiene 
	     <literal>&dollar;FreeBSD:</literal> al principio del 
	     <filename>Makefile</filename> del port y salida 
	     con el error que obtiene al intentar usar la 
	     aplicaci&oacute;n.</para>

          <note>
	     <para>Algunos ports no son responsabilidad de un individuo 
	       sino de <ulink
	       url="http://www.freebsd.org/doc/en_US.ISO-8859-1/articles/mailing-list-faq/article.html">una lista de correo.</ulink> 
	       Muchas, aunque no todas, tienen un aspecto parecido a 
	       <email 
	       role="nolink">freebsd-nombredelalista@FreeBSD.org</email>.  
	       Por favor, t&eacute;ngalo en cuenta cuando envie ese correo 
	       sobre el port que no funciona.</para>

            <para>Hay un caso especial: Los ports que tienen como 
	       <quote>mantainer</quote> 
               <email role="nolink">freebsd-ports@FreeBSD.org</email> en 
	       realidad no son responsabilidad de nadie.  Los parches 
	       y el soporte, caso de existir, vienen de la comunidad de 
	       usuarios y desarrolladores que est&aacute;n suscritos 
	       a la lista.  Por cierto, siempre hacen falta m&aacute;s 
	       voluntarios.</para>
	  </note>

            <para>Si no recibe respuesta utilice &man.send-pr.1; para 
	      enviar un informe de errores.  Consulte 
	      <ulink
	      url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/problem-reports/article.html">C&oacute;mo escribir informes de error</ulink>)
	      <footnote><para>
	        Hay traducci&oacute;n al castellano de este art&iacute;culo.  
		Est&aacute; aqu&iacute;: <ulink
		 url="http://www.freebsd.org/doc/es_ES.ISO8859-1/articles/problem-reports/article"></ulink>
	      </para></footnote>
	      </para>
	 </listitem>



        <listitem>
	  <para><emphasis>Arreglarlo</emphasis>. El <quote>Porter's 
	    Handbook</quote> incluye informaci&oacute;n detallada 
	    sobre la infraestructura de los ports, as&iacute; que 
	    puede arreglar un port roto o incluso enviar su propio 
	    port.</para>
	</listitem>


	<listitem>
	  <para>Descargue el paquete de alg&uacute;n sitio FTP.  El 
	    servidor <quote>principal</quote> de la colecci&oacute;n
	    de paquetes est&aacute; en el 
	    <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/">directorio
	    de paquetes</ulink> de 
	    <hostid
	    role="fqdn">ftp.FreeBSD.org</hostid> 
	    <emphasis>pero aseg&uacute;rese de mirar antes en la 
	    r&eacute;plica m&aacute;s pr&oacute;xima</emphasis>.  
	    Esta es una forma de instalar aplicaciones m&aacute;s 
	    f&aacute;cil y m&aacute;s r&aacute;pida.  
	    Instale el paquete mediante &man.pkg.add.1;.</para
	</listitem>
      </orderedlist>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
