<!--
     The FreeBSD Documentation Project

     $FreeBSD$
     $FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/ports/chapter.sgml,v 1.2 2004/10/08 21:26:03 jesusr Exp $
-->
<!-- version del ingles traducida: 1.240 -->


<chapter id="ports">
  <title>Instalaci&oacute;n de Aplicaciones: Paquetes y Ports</title>

  <sect1 id="ports-synopsis">
    <title>Sinopsis</title>

    <indexterm><primary>ports</primary></indexterm>
    <indexterm><primary>packages</primary></indexterm>
    <para>FreeBSD viene con una excelente colecci&oacute;n de herramientas
      de sistema como parte del sistema base.  A pesar de esto, existe gran 
      cantidad de cosas que uno requiere hacer para poner las cosas realmente en
      marcha, para lo cual se necesita instalar software adicional de terceros.  
      FreeBSD ofrece dos tecnolog&iacute;as complementarias para instalar 
      software de terceros en nuestro sistema: la Colecci&oacute;n de Ports de
      FreeBSD y Paquetes binarios.  Cualquiera de los dos sistemas puede ser
      usado para instalar las versiones m&aacute;s recientes, de forma local o
      directamente desde la red.</para>

    <para>Despu&eacute;s de leer este cap&iacute;tulo, usted sabr&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>Como instalar paquetes binarios de software de terceros.</para>
      </listitem>
      <listitem>
	<para>Como compilar software de terceros desde la Colecci&oacute;n de
	  Ports.</para>
      </listitem>
      <listitem>
	<para>Como eliminar paquetes o ports instalados previamente.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="ports-overview">
    <title>Aproximaci&oacute;n a la Instalaci&oacute;n de Software</title>

    <para>Si usted ha usado un sistema &unix; con anterioridad, sabr&aacute; que el
      procedimiento t&iacute;pico para instalar software de terceros es algo
      similar a esto:</para>

    <procedure>
      <step>
	<para>Descargar el software, que puede distribuirse en formato de 
	  c&oacute;digo fuente, o binario.</para>
      </step>

      <step>
	<para>Desempaquetar el software de su formato de distribuci&oacute;n 
	  (normalmente en un tarball comprimido con &man.compress.1;, &man.gzip.1;  
	  o &man.bzip2.1;).</para>
      </step>

      <step>
	<para>Ver la documentaci&oacute;n (quiz&aacute;s un fichero <filename>INSTALL</filename> o 
	  <filename>README</filename>, o los ficheros del subdirectorio 
	  <filename>doc/</filename>) para ver como instalar el software.</para>
      </step>

      <step>
	<para>Si el software es distribuido como fuente, compilarlo.  Esto puede
	  requerir que editemos el fichero <filename>Makefile</filename> o que
	  ejecutemos el script <command>configure</command>, entre otras.</para>
      </step>

      <step>
	<para>Instalar y probar el software.</para>
      </step>
    </procedure>

    <para>Y esto solamente si todo marcha bien.  Si usted esta instalando un 
      software que no ha sido portado espec&iacute;ficamente para FreeBSD, puede
      que sea necesario editar el c&oacute;digo para que trabaje correctamente.
      </para>

    <para>Si usted lo desea, puede continuar instalando software de la forma
      <quote>tradicional</quote> bajo FreeBSD.  Aunque FreeBSD le provee de
      dos tecnolog&iacute;s que le pueden ahorrar gran cantidad de tiempo y
      esfuerzo: los paquetes y ports.  En el momento de escribir esto, existen
      m&aacute;s de &os.numports; aplicaciones de terceros, que estan disponibles
      de esta manera.</para>

    <para>Para cualquier aplicaci&oacute;n, el paquete de FreeBSD
      es un solo fichero que tiene que descargar.  Los paquetes contienen copia de
      los programas binarios pre-compilados de la aplicaci&oacute;n,
      as&iacute; como cualquier fichero de configuraci&oacute;n o
      documentaci&oacute;n.  Los paquetes descargados se pueden
      manipular con las ordenes de manejo de paquetes de FreeBSD, 
      tales como: &man.pkg.add.1;, &man.pkg.delete.1;, 
      &man.pkg.info.1;, etc.  Instalar una aplicaci&oacute;n nueva puede
      realizarse con una sola orden.</para>

    <para>Un port de FreeBSD es una colecci&oacute;n de ficheros
      dise&ntilde;ada para automatizar el proceso de
      compilaci&oacute;n desde el c&oacute;digo fuente.</para>

    <para>Recuerde que existen ciertos pasos que deber&aacute; llevar a cabo 
      para compilar un programa por usted mismo (descargar,
      desempaquetar, parchear, compilar e instalar).  Los ficheros que
      conforman un port, permiten que el sistema haga esto por usted.  
      Usted ejecuta un conjunto simple de ordenes
      y el c&oacute;digo fuente se descarga, desempaqueta, parchea,
      compila e instalada.</para>

    <para>De hecho, el sistema de ports tambi&eacute;n se puede usar para crear
      paquetes que posteriormente se pueden manipular con
      <command>pkg_add</command> y las
      otras utilidades del manejo de paquetes que veremos en breve.</para>

    <para>Tanto el sistema de ports como el de paquetes entienden las 
      <emphasis>dependencias</emphasis>.  Suponga que desea instalar una 
      aplicaci&oacute;n que depende de que una librer&iacute;a 
      espec&iacute;fica este instalada.  Tanto la librer&iacute;a como la
      aplicaci&oacute;n existen en FreeBSD como paquete o port.  Si utiliza
      la orden <command>pkg_add</command> o el sistema de ports para instalar
      la aplicaci&oacute;n, ambos notaran que la librer&iacute;a no esta
      instalada, y proceder&aacute;n a instalar la librer&iacute;a en primer
      lugar.</para>

    <para>Dado que ambas tecnolog&iacute;s son similares, quiz&aacute;s se 
      pregunte por que FreeBSD se toma la molest&iacute;a de contar con ambas.  
      Los Paquetes y los Ports cuentan con sus propias ventajas, cual
      utlizar depender&aacute; de sus preferencias.</para>

    <itemizedlist>
      <title>Beneficios de los Paquetes</title>
      
      <listitem>
	<para>El fichero tarballd e un paquete es normalmente mas
	  peque&ntilde;o que el tarball con el c&oacute;digo fuente de
	  la aplicaci&oacute;n.</para>
      </listitem>

      <listitem>
	<para>Los paquetes no requieren ninguna compilaci&oacute;n
	  adicional.  Para aplicaciones grandes, como:
	  <application>Mozilla</application>,
	  <application>KDE</application>, o
	  <application>GNOME</application> puede ser importante,
	  especialmente si usa un equipo lento.</para>
      </listitem>

      <listitem>
	<para>Los paquetes no requieren que usted comprenda el proceso que envuelve
	  el compilar software bajo FreeBSD.</para>
      </listitem>
    </itemizedlist>

    <itemizedlist>
      <title>Beneficios del Sistema de Ports</title>
      
      <listitem>
	<para>Normalmente los paquetes se compilan con opciones conservadoras,
	  en virtud del gran numero de equipos donde ser&aacute;n instalados.  Al
	  instalar desde el port, usted puede editar las preferencias para (por
	  ejemplo) generar codigo especifico para un procesador
	  Pentium IV o Athlon.</para> 
      </listitem>

      <listitem>
	<para>Algunas aplicaciones tienen opciones sobre lo que pueden y lo 
	  que no pueden hacer.  Por ejemplo
	  <application>Apache</application> se puede configurar con
	  una gran variedad de opciones.  Al compilarlo desde los
	  ports usted no tiene por que aceptar las opciones
	  predefinidas, puede seleccionar que opciones desea.</para>

	<para>En algunos casos, existen varios paquetes para la misma 
	  aplicaci&oacute;n con diferentes opciones.  Por ejemplo,
	  <application>Ghostscript</application> esta disponible como paquete
	  <filename>ghostscript</filename> o bien como paquete 
	  <filename>ghostscript-nox11</filename>, dependiendo si usted cuenta o
	  no con el servidor X11.  En este caso decidir puede ser sencillo, pero esto
	  se puede volver un problema si cuenta con m&aacute;s de una o dos opciones
	  al momento de la compilaci&oacute;n.</para>
      </listitem>

      <listitem>
	<para>Las condiciones de la licencia de algunas aplicaciones prohiben la
	  distribuci&oacute;n de binarios.  Solo permiten la distribuci&oacute;n del
	  c&oacute;digo fuente.</para>
      </listitem>

      <listitem>
	<para>Existe gente que no conf&iacute;a en los binarios.  Al
	  menos con el
	  c&oacute;digo fuente, usted puede (en teor&iacute;a) revisarlo y
	  localizar problemas potenciales.</para>
      </listitem>

      <listitem>
	<para>Si cuenta con parches locales, necesitar&aacute; el c&oacute;digo 
	  fuente para poder aplicarlos.</para>
      </listitem>

      <listitem>
	<para>Existe gente que le gusta contar con el c&oacute;digo fuente, para
	  poder leerlo en ratos de ocio, modificarlo, tomar partes prestadas (si la
	  licencia lo permite, claro esta), etc.</para>
      </listitem>
    </itemizedlist>

    <para>Para tener constancia de los ports actualizados, suscribase a
      &a.ports; y a &a.ports-bugs;.</para>

    <warning>
      <para>Antes de instalar cualquier aplicaci&oacute;n, debe
        mirar <ulink url="http://vuxml.freebsd.org"></ulink> para
        comprobar los posibles problemas de seguridad relacionados con
        su aplicaci&oacute;n.</para>

      <para>Tambi&eacute;n puede instalar <filename
        role="package">security/portaudit</filename> que autom&aacute;ticamente
        comprobar&aacute; las vulnerabilidades conocidas de todas las
        aplicaciones instaladas; Tambi&eacute;n lo comprobar&aacute; antes de
        construir cualquier port.  Mientras tanto, puede usar la orden
        <command>portaudit -F -a</command> despues de haber instalado
        algunos paquetes.</para>
    </warning>

    <para>El resto de este cap&iacute;tulo le explicar&aacute; como usar los 
      ports y paquetes para instalar software de terceros en FreeBSD.</para>
  </sect1>

  <sect1 id="ports-finding-applications">
    <title>Encuentre su Aplicaci&oacute;n</title>

    <para>Antes de poder instalar cualquier software, usted debe saber que desea
      instalar y como se llama la aplicaci&oacute;n.</para>

    <para>La lista de software disponible para FreeBSD crece constantemente.  
      Afortunadamente existen varias formas de localizar lo que busca:</para>

    <itemizedlist>
      <listitem>
	<para>El sitio web de FreeBSD mantiene una base actualizada de todas las 
	  aplicaciones disponibles para FreeBSD, en la direcci&oacute;n 
	  <ulink url="http://www.freebsd.org/ports/index.html">http://www.FreeBSD.org/ports/
	  </ulink>.  Esta base esta segmentadas por categor&iacute;as, y usted puede
	  buscar por nombre (si lo sabe) o bien listar las aplicaciones disponibles
	  en cierta categor&iacute;a.</para>
      </listitem>

      <indexterm><primary>FreshPorts</primary></indexterm>

      <listitem>
	<para>Dan Langille mantiene FreshPorts, en
	  <ulink url="http://www.FreshPorts.org/"></ulink>.
	  FreshPorts verifica los cambios en las aplicaciones del &aacute;rbol de
	  ports, y le permite <quote>observar</quote> uno o m&aacute;s ports, y le
	  enviar&aacute; un correo cada vez que se actualicen.</para>
      </listitem>

      <indexterm><primary>FreshMeat</primary></indexterm>

      <listitem>
	<para>Si no conoce el nombre de la aplicaci&oacute;n que desea, pruebe usar
	  un sitio como FreshMeat (<ulink  
	  url="http://www.freshmeat.net/">http://www.freshmeat.net/</ulink>) para
	  encontrar una aplicaci&oacute;n, posteriormente mire en el sitio de
	  FreeBSD si la aplicaci&oacute;n ha sido portada.</para>
      </listitem>

      <listitem>
	<para>Si sabe el nombre exacto del port y solo necesita saber
          en que categoria esta, puede usar la orden
          &man.whereis.1;.  Simplemente escriba <command>whereis
          <replaceable>file</replaceable></command>, donde
          <replaceable>file</replaceable> es el programa que quiera
          instalar.  Si se encuentra en su sistema, le dira donde
          esta:</para>

      <screen>&prompt.root; <userinput>whereis lsof</userinput>
lsof: /usr/ports/sysutils/lsof</screen>

      <para>Esto nos dice que <command>lsof</command> (una utilidad de
	sistema) se puede encontrar en el directorio
	<filename>/usr/ports/sysutils/lsof</filename>.</para></listitem>

      <listitem>
	<para>Otra forma de encontrar un port en particular es usando
        el mecanismo de busqueda integrado en la colecci&oacute;n de
        ports.  Para usar esta opci&oacute;n de busqueda, necesitara
        estar en el directorio <filename>/usr/ports</filename>.  Una
        vez en ese directorio, ejecute <command>make search
        name=<replaceable>nombre-del-programa</replaceable></command> donde
        <replaceable>nombre-del-programa</replaceable> es el nombre
        del programa que desea encontrar.  Por ejemplo, si esta
        buscando <command>lsof</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports</userinput>
&prompt.root; <userinput>make search name=lsof</userinput>
Port:   lsof-4.56.4
Path:   /usr/ports/sysutils/lsof
Info:   Lists information about open files (similar to fstat(1))
Maint:  obrien@FreeBSD.org
Index:  sysutils
B-deps: 
R-deps: </screen>

      <para>Debe prestar especial atenci&oacute;n a la linea
        <quote>Path:</quote>de la salida, porque es la que indica
        donde puede encontrar el port.  El resto de informaci&oacute;n
        no se necesita para instalar el port, asi que no se
        cubrir&aacute; aqui.</para>

      <para>Para una busqueda mas a fondo puede usar <command>make
       search key=<replaceable>cadena</replaceable></command> donde
       <replaceable>cadena</replaceable> es el termino que desea
       encontrar.  Esto busca nombres de ports, comentarios,
       descripciones y dependencias, tambi&eacute;n se puede usar
       para encontrar ports que tengan relaci&oacute;n con
       alg&uacute;n tema en particular si no conoce el nombre del
       programa que esta buscando.</para> 

      <para>En ambos casos, la cadena de busqueda no distingue entre
       mayusculas y minusculas.  Buscar por <quote>LSOF</quote> dar&aacute;
       los mismos resultados que buscar por <quote>lsof</quote>.</para>
      </listitem>

    </itemizedlist>

  </sect1>

  <sect1 id="packages-using">
    <sect1info>    
      <authorgroup>
        <author>
          <firstname>Chern</firstname>
	  <surname>Lee</surname>
	  <contrib>Contribuido por</contrib>
        </author>
      </authorgroup>
    <!-- 30 Mar 2001 -->
    </sect1info>

    <title>Usar el Sistema de Paquetes</title>

    <sect2>
      <title>Instalar un paquete</title>
      <indexterm>
        <primary>packages</primary>
        <secondary>installing</secondary>
      </indexterm>
    
      <indexterm>
        <primary><command>pkg_add</command></primary>
      </indexterm>
      <para>Puede usar la utilidad &man.pkg.add.1; para instalar un
      paquete de software bajo FreeBSD desde un fichero local o desde
      un servidor remoto que esta en red.</para>

      <example>
        <title>Descarga de un paquete manualmente e instalaci&oacute;n en nuestro sistema</title>

        <screen>&prompt.root; <userinput>ftp -a <replaceable>ftp2.FreeBSD.org</replaceable></userinput>
Connected to ftp2.FreeBSD.org.
220 ftp2.FreeBSD.org FTP server (Version 6.00LS) ready.
331 Guest login ok, send your email address as password.
230-
230-     This machine is in Vienna, VA, USA, hosted by Verio.
230-         Questions? E-mail freebsd@vienna.verio.net.
230-
230-
230 Guest login ok, access restrictions apply.
Remote system type is UNIX.
Using binary mode to transfer files.
<prompt>ftp></prompt> <userinput>cd /pub/FreeBSD/ports/packages/sysutils/</userinput>
250 CWD command successful.
<prompt>ftp></prompt> <userinput>get lsof-4.56.4.tgz</userinput>
local: lsof-4.56.4.tgz remote: lsof-4.56.4.tgz
200 PORT command successful.
150 Opening BINARY mode data connection for 'lsof-4.56.4.tgz' (92375 bytes).
100% |**************************************************| 92375       00:00 ETA
226 Transfer complete.
92375 bytes received in 5.60 seconds (16.11 KB/s)
<prompt>ftp></prompt> <userinput>exit</userinput>
&prompt.root; <userinput>pkg_add <replaceable>lsof-4.56.4.tgz</replaceable></userinput></screen>
      </example>

      <para>Si usted no cuenta con una fuente local de paquetes (como pudiese ser
        un CDROM de FreeBSD) entonces probablemente la mejor
        opci&oacute;n sea utilizar el argumento <option>-r</option> de
        &man.pkg.add.1;.  Esto provocar&aacute; que la utilidad determine
        autom&aacute;ticamente el formato del objeto correcto, para que 
        posteriormente lo descargue y lo instale desde un sitio FTP.</para>

      <indexterm>
        <primary><command>pkg_add</command></primary></indexterm>
      <screen>&prompt.root; <userinput>pkg_add -r <replaceable>lsof</replaceable></userinput></screen>

      <para>En el ejemplo anterior, el paquete correspondiente se 
        descargar&aacute; e instalar&aacute; sin intervenci&oacute;n
        del usuario.  Si desea utilizar un mirror
        de paquetes alternativo al sitio principal de &os;, solo tiene
        que configurar <envar>PACKAGESITE</envar> correctamente, para
        sobreescribir el sitio predefinido.  &man.pkg.add.1; utiliza
        &man.fetch.1; para descargar los ficheros, 
        que toma como referencia varias variables de entorno, que incluyendo
        <envar>FTP_PASSIVE_MODE</envar>, <envar>FTP_PROXY</envar> y 
        <envar>FTP_PASSWORD</envar>.  Quiz&aacute;s deba modificar alguna de
        estas, si se encuentra detr&aacute;s de un firewall, o usa un 
        proxy FTP/HTTP.  Vea &man.fetch.3; para una lista completa.
        Tambi&eacute;n puede notar que en el ejemplo anterior
        usamos <literal>lsof</literal> en vez de <literal>lsof-4.56.4</literal>. 
        Cuando usamos la opci&oacute;n de descarga remota, no es
        necesario especificar la versi&oacute;n del paquete.
        &man.pkg.add.1; descargar&aacute; autom&aacute;ticamente la
        &uacute;ltima versi&oacute;n de la aplicaci&oacute;n.</para>

      <para>Los paquetes son distribuidos en formato <filename>.tgz</filename>  
        y <filename>.tbz</filename>. Puede encontrarlos en <ulink
        url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/">
        ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/</ulink>, o bien, en el
        CDROM de FreeBSD.  Cada CD de la distribuci&oacute;n de 4 CDs (y del 
        PowerPak, etc) contiene los paquetes en el directorio 
        <filename>/packages</filename>.  El orden de dicho directorio, es similar
        al &aacute;rbol de <filename>/usr/ports</filename>.  Cada 
        categor&iacute;a cuenta con su subdirectorio, y todos los paquetes estan
        disponibles en el directorio <filename>All</filename>.</para>

      <note>
	<para>&man.pkg.add.1; descargar&aacute; la &uacute;ltima
	  versi&oacute;n de su aplicaci&oacute;n si usa &os.current; o
	  &os.stable;. Pero si usa una versi&oacute;n -RELEASE,
	  descargar&aacute; la versi&oacute;n del paquete que se
	  construy&oacute;n con la release.  Es posible cambiar esto
	  sobreescribiendo la variable de entorno
	  <envar>PACKAGESITE</envar>.</para>
      </note>

      <para>Los ficheros de paquetes se destribuyen en formatos
          <filename>.tgz</filename> y <filename>.tbz</filename>.
          Puede encontrarlos en <ulink
          url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/"></ulink>,
          o en la distribuci&oacute;n de FreeBSD en CD-ROM.  Todos los
          CDs en el set de 4 CDs de FreeBSD (y en el PowerPak, etc.)
          contienen paquetes en el directorio
          <filename>/packages</filename>.  La estructura de los
          paquetes es similar a la del arbol de
          <filename>/usr/ports</filename>.  Cada categor&iacute;a
          tiene su propio directorio, y todos los paquetes se pueden
          encontrar dentro del directorio <filename>All</filename>.
      </para>

      <para>La estructura del directorio de paquetes es identica a la de ports; 
        estos trabajan en conjunto para formar el sistema de paquetes/ports.
        </para>

    </sect2>

    <sect2>
      <title>Eliminar un paquete</title>
      <indexterm>
        <primary><command>pkg_delete</command></primary>
      </indexterm>
      <indexterm>
        <primary>packages</primary>
        <secondary>deleting</secondary>
      </indexterm>
      <para>Para eliminar un paquete previemante instalado, utilice la utilidad
	    &man.pkg.delete.1;.</para>

      <screen>&prompt.root; <userinput>pkg_delete <replaceable>xchat-1.7.1</replaceable></userinput></screen>
    </sect2>

    <sect2>
      <title>Miscelanea</title>
      <para>Toda la informaci&oacute;n de los paquetes, se guarda en
        el directorio <filename>/var/db/pkg</filename>.  La lista de
      paquetes instalados y descripciones de los mismos se pueden
      encontrar en los ficheros dentro de este directorio.</para>
    </sect2>
  </sect1>
  
  <sect1 id="ports-using">
    <title>Usar la Colecci&oacute;n de Ports</title>

    <para>La siguiente secci&oacute;n le provee de las instrucciones 
      b&aacute;sicas para instalar o eliminar programas de su sistema, usando la
      Colecci&oacute;n de Ports.</para>

    <sect2 id="ports-tree">
      <title>Obtener la Colecci&oacute;n de Ports</title>

      <para>Antes de poder instalar ports, primero debe hacerse con la
        Colecci&oacute;n de Ports&mdash; que escencialmente esta compuesta de
        <filename>Makefiles</filename>, parches y ficheros con la
        descripci&oacute;n de los ports, ubicados en 
        <filename>/usr/ports</filename>.</para>

      <para>Cuando instal&oacute; su sistema FreeBSD, el programa
	    <application>sysinstall</application> le pregunto si deseaba instalar
	    la Colecci&oacute;n de Ports.  Si contesto que no, puede seguir estas
	    instrucciones para obtener dicha colecci&oacute;n:</para>

      <procedure>
	<title>Metodo por Sysinstall</title>

	<para>Este metodo implica el uso de
	  <application>sysinstall</application> nuevamente, para
	  instalar la Colecci&oacute;n de Ports.</para>

	<step>
	  <para>Siendo usuario <username>root</username>, ejecute
	    <command>sysinstall</command>
	    (<command>/stand/sysinstall</command> en cualquier version
	    previa a &os 5.2); como se muestra:</para>

	  <screen>&prompt.root; <userinput>sysinstall</userinput></screen>
	</step>

	<step>
	  <para>Posicionese en la opci&oacute;n <guimenuitem>Configure</guimenuitem>,
	    y presione <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione la opci&oacute;n <guimenuitem>Distributions</guimenuitem>,
	  y presione <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione la opci&oacute;n <guimenuitem>ports</guimenuitem>, y
	    presione la <keycap>Barra Espaciadora</keycap>.</para>
	</step>

	<step>
	  <para>Seleccione el medio de instalaci&oacute;n deseado, tal como CDROM, 
	    FTP, etc.</para>
	</step>

	<step>
	  <para>Dirijase a la opci&oacute;n <guimenuitem>Exit</guimenuitem>, y
	    presione <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Presione <keycap>X</keycap> para salir de
            <application>sysinstall</application>.</para>
	</step>
      </procedure>

      <para>El metodo alternativo para obtener y mantener actualizada la
        Colecci&oacute;n de Ports, es usando <application>CVSup</application>.  
        Lea el fichero de ports para <application>CVSup</application>, en
	    <filename>/usr/share/examples/cvsup/ports-supfile</filename>.  
	    Vea el cap&iacute;tulo <link linkend="cvsup">Usar
        CVSup</link> (<xref linkend="cvsup">) para m&aacute;s
        informaci&oacute;n sobre como usar
        <application>CVSup</application> y el fichero
        mencionado.</para>

      <procedure>
	<title>Metodo por CVSup</title>

	<para>Un metodo r&aacute;pido de obtener la Colecci&oacute;n de Ports
	  es usando <application>CVSup</application>.  Si desea
	  mantener su &aacute;rbol
	  de ports actualizado, o bien, aprender m&aacute;s acerca de 
	  <application>CVSup</application>, lea los documentos comentados 
	  anteriormente.</para>

	<step>
	  <para>Instale el port <filename role="package">net/cvsup</filename>.  
	    See <link linkend="cvsup-install">Instalaci&oacute;n de CVSup</link> (<xref
	      linkend="cvsup-install">) para m&aacute;s
	    informaci&oacute;n.</para>
	</step>

	<step>
	  <para>Como usuario <username>root</username>, copie el fichero 
	    <filename>/usr/share/examples/cvsup/ports-supfile</filename>
	    a una nueva ubicaci&oacute;n, como puede ser el directorio 
	    <filename>/root</filename> o bien su propio directorio home.</para>
	</step>

	<step>
	  <para>Edite el fichero <filename>ports-supfile</filename>.</para>
	</step>

	<step>
	  <para>Cambie <replaceable>CHANGE_THIS.FreeBSD.org</replaceable> a un
	    servidor <application>CVSup</application> cercano.  Mire
	    <link linkend="cvsup-mirrors">Mirrors de CVSup</link> (<xref
	    linkend="cvsup-mirrors">) para obtener una lista completa
	    de mirrors.</para>
	</step>

	<step>
	  <para>Ejecute <command>cvsup</command>:</para>

	  <screen>&prompt.root; <userinput>cvsup -g -L 2 <replaceable>/root/ports-supfile</replaceable></userinput></screen>
	</step>

	<step>
	  <para>Cuando ejecute esto, se descargaran y aplicaran las
            actualizaciones de la Colecci&oacute;n de Ports, exceptuando
            la recunstrucci&oacute;n de los ports de tu sistema..</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="ports-skeleton">
      <title>Instalar Ports</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>installing</secondary>
      </indexterm>
      <para>Al hablar de la Colecci&oacute;n de Ports, lo primero que debemos 
        comentar es; a que nos referimos cuando hablamos de un 
        <quote>esqueleto</quote> (skeleton).  En s&iacute; mismo, un esqueleto de
        port, es una serie m&iacute;nima de ficheros, que le indican a FreeBSD
        como compilar e instalar un programa.  Cada esqueleto incluye:</para>

      <itemizedlist>
	<listitem>
	  <para>Un <filename>Makefile</filename>.  Este
	    <filename>Makefile</filename> contiene 
	    varias sentencias, que le indican al sistema como compilarlo y donde
	    deber&aacute; instalarlo en su sistema.</para>
	</listitem>

	<listitem>
	  <para>Un fichero <filename>distinfo</filename>.  Este fichero contiene 
	    informaci&oacute;n de los ficheros que se deben descargar para efecto
	    de compilar el programa, as&iacute; como el identificador checksum, para
	    asegurarse se han descargado correctamente, sin corrupciones
	    usando &man.md5.1;.</para>
	</listitem>
	
	<listitem>
	  <para>Un directorio <filename>files</filename>.  Este directorio contiene 
	    los parches necesarios para compilar e instalar en su sistema FreeBSD.  
	    B&aacute;sicamente, los parches son peque&ntilde;os ficheros, que
	    incluyen algunos cambios.  Estos son en formato de texto plano, y 
	    b&aacute;sicamente dicen cosas como <quote>borra la l&iacute;nea 10</quote> 
	    o <quote>Cambia la l&iacute;nea 26 por esto...</quote>.
	    Los parches tambi&eacute;n son 
	    conocidos como <quote>diffs</quote>, ya que son generados por el 
	    programa del mismo nombre; &man.diff.1;.</para>

	  <para>Es posible que este directorio tambi&eacute; contenga algun otro
	    fichero necesario para compilar e instalar el port.</para>
	</listitem>

	<listitem>
	  <para>Un fichero <filename>pkg-descr</filename>.  Esta es una descripcion
	    m&aacute;s detallada del programa.  En ocasiones multi-l&iacute;nea.
	    </para>
	</listitem>
	
	<listitem>
	  <para>Un fichero <filename>pkg-plist</filename>.  Es una lista de 
	    todos los ficheros que instalar&aacute; el port.
	    Tambi&eacute;n le indica al sistema de ports qu&eacute; ficheros eliminar en
	    el momento de una desinstalaci&oacute;n.</para>
	</listitem>
      </itemizedlist>

      <para>Algunos ports cuentan con otros ficheros, tal como 
        <filename>pkg-message</filename>.  El sistema de ports usa estos, para
        manejar situaciones especiales.  Si desea saber m&aacute;s detalles al
        respecto, o bien de ports en general, vea el libro <quote>FreeBSD
	Porter's Handbook</quote>.</para>

      <para>El port incluye las instrucciones de construcci&oacute;n
        desde el c&oacute;digo fuente, pero no incluye el
        c&oacute;digo.  Puede obtener el c&oacute;digo desde un CD-ROM
        o desde Internet.  El c&oacute;digo se distribuye de la forma
        que el autor desee.  Normalmente es un fichero tar comprimido
        con gzip, pero puede estar comprimido con otra herramienta o
        incluso no estar comprimido.  El c&oacute;digo del programa,
        venga como venga, se llama <quote>distfile</quote>.  Los dos
        metodos para instalar un port de &os; se describen
        acontinuaci&oacute;n.</para>

      <note>
        <para>Debe ser el usuario <username>root</username> para
          instalar ports.</para>
      </note>

      <warning>
	<para>Antes de instalar cualquier port, asegurese de tener la
	  colecci&oacute;n de ports actualizada y de comprobar <ulink
	  url="http://vuxml.freebsd.org/"></ulink> los posibles
	  problemas de seguridad que pudiera tener el port.</para>

	<para>Se puede realizar la comprobaci&oacute;n de seguridad
	  con <application>portaudit</application> antes de instalar
	  cualquier  aplicaci&oacute;n.  Puede encontrar esta
	  herramienta en la colecci&oacute;n de ports (<filename
	  role="package">security/portaudit</filename>).  Considere
	  arrancar <command>portaudit -F</command> antes de instalar
	  un port nuevo, para que descargue la nueva base de datos de
	  vulnerabilidades.  Durante la comprobaci&oacute;n diaria de
	  seguridad actualizar&aacute; la base de datos y hara una
	  auditoria del sistema.  Para m&aacute;s informaci&oacute;n
	  lea las p&aacute;ginas del man&uacute;al de
	  &man.portaudit.1; y &man.periodic.8;.</para> 
      </warning>


      <sect3 id="ports-cd">
        <title>Instalar Ports desde un CDROM</title>

        <indexterm>
          <primary>ports</primary>
          <secondary>installing from CDROM</secondary>
        </indexterm>
        <para>Los CDROMs oficiales del Proyecto de FreeBSD, ya no incluyen 
          distfiles.  Ocupan mucho espacio, que en su lugar esta mejor
          utilizado en paquetes precompilados.  CDROMs como el
          PowerPak de FreeBSD, si incluyen distfiles, y puede adquirir
          estos de distribuidores como
	      <ulink url="http://www.freebsdmall.com/">FreeBSD Mall</ulink>.  Esta
	      secci&oacute;n asume que usted cuenta con un juego de CDROMs de 
	      FreeBSD.</para>

        <para>Coloque su CDROM en la unidad correspondiente.  Montelo en
	      <filename>/cdrom</filename>.  (Si utiliza un punto de
	      montaje diferente, configure la variable de make
	      <makevar>CD_MOUNTPTS</makevar>.).  Para comenzar dirijase
	      al directorio donde se localiza el port que desea instalar:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput></screen>

        <para>Una vez que este en el directorio <filename>lsof</filename>, 
          ver&aacute; el esqueleto del port.  El pr&oacute;ximo paso
          es compilar o <quote>construir</quote> el port.  Esto lo
          hacemos, simplemente tecleando <command>make</command> en la
          l&iacute;nea de ordenes.  Una vez que haya hecho esto,
          ver&aacute; algo similar a lo siguiente:</para>

        <screen>&prompt.root; <userinput>make</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from file:/cdrom/ports/distfiles/.
===&gt;  Extracting for lsof-4.57
...
[extraction output snipped]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[configure output snipped]
...
===&gt;  Building for lsof-4.57
...
[compilation output snipped]
...
&prompt.root;</screen>

        <para>Note que una vez que ha terminado la compilaci&oacute;n, 
          regresara a la l&iacute;nea ordenes.  El siguiente paso es instalar
          el port.  Para instalarlo, simplemente debemos a&ntilde;adir
          una palabra a la orden <command>make</command>, y esa palabra es
	      <command>install</command>:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
===&gt;  Installing for lsof-4.57
...
[installation output snipped]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>Una vez que regrese a la l&iacute;nea de ordenes, le ser&aacute;
          posible ejecutar la aplicaci&oacute;n que acaba de instalar.
          Dado que el programa <command>lsof</command> se ejecuta con
          privilegios, nos
          aparece una advertencia de seguridad.  Debe tomar nota de cualquier
          otra advertencia que aparezca durante la compilaci&oacute;n e
          instalaci&oacute;n.</para>

        <note>
          <para>Puede ahorrar un paso ejecutando <command>make
            install</command> en una sola orden, en lugar de ejecutar 
            <command>make</command> y <command>make install</command> 
            en dos pasos diferentes.</para>
	</note>

	<note>
	  <para>Algunos shells cuentan con una cache de ordenes disponibles bajo
	    los directorios incluidos en la variable de entorno <envar>PATH</envar>, 
	    para agilizar las operaciones de b&uacute;squeda de los ejecutables de
	    estos ficheros.  Si esta haciendo uso de alguno de estos shells, 
	    puede usar la orden <command>rehash</command> una vez que ha terminado 
	    de instalar el port, para poder hacer uso de su nuevo
	    programa.  Esta orden funciona con shells como
	    <command>tcsh</command>.  Para shells como sh puo
	    <filename role="package">shells/bash</filename> puede usar
	    la orden <command>has -r</command>.  Mire la
	    documentaci&oacute;n de su shell para obtener m&aacute;s
	    informaci&oacute;n.</para>
	</note>

        <note>
          <para>Por favor, tenga en cuenta que algunos ports cuentan con una 
            licencia que no permite su inclusi&oacute;n en el CDROM.  
            Probablemente esto es a consecuencia de un registro que se debe hacer
            previo a la descarga, que no este permitida la
            redistribuci&oacute;n en CD-ROM o cualquier otro motivo.
            Si desea instalar un port que no se 
            encuentra en el CDROM, deber&aacute; encontrarse conectado a
            Internet, para poder hacerlo (vea la <link  
            linkend="ports-inet">siguiente secci&oacute;n</link>).</para>
	</note>
      </sect3>

      <sect3 id="ports-inet">
      <title>Instalar Ports desde Internet</title>

        <para>Como en la secci&oacute;n anterior, en esta secci&oacute;n se asume
          que usted cuenta con una conexi&oacute;n configurada a
          Internet.  Si no es as&iacute;, deber&aacute; de llevar a
          cabo la instalaci&oacute;n   
          <link linkend="ports-cd">mediante CDROM</link>, o ponga una copia del 
          distfile en <filename>/usr/ports/distfiles</filename> manualmente.</para>

        <para>Instalar un port desde Internet, se hace exactamente de la
          misma forma que se hace desde un CDROM.  La &uacute;nica diferencia
          entre estos dos metodos, es que el fichero distfile es descargado de
          Internet, en lugar de tomarlo del CDROM.</para>

        <para>Los pasos que implica son identicos:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/.
Receiving lsof_4.57D.freebsd.tar.gz (439860 bytes): 100%
439860 bytes transferred in 18.0 seconds (23.90 kBps)
===&gt;  Extracting for lsof-4.57
...
[extraction output snipped]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[configure output snipped]
...
===&gt;  Building for lsof-4.57
...
[compilation output snipped]
...
===&gt;  Installing for lsof-4.57
...
[installation output snipped]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>Como puede ver, la &uacute;nica diferencia es la l&iacute;nea que
          indica de donde esta descargando el sistema el c&oacute;digo.</para>

	<para>El sistema de ports utiliza &man.fetch.1; para descargar los ficheros,
	  que hace uso de varias variables de entorno, como son 
	  <envar>FTP_PASSIVE_MODE</envar>, <envar>FTP_PROXY</envar>, 
	  y <envar>FTP_PASSWORD</envar>.  Puede ser necesario que modifique una o 
	  m&aacute;s de estas, si se encuentra detr&aacute;s de un cortafuegos 
	  (firewall), o si va a usar un proxy FTP/HTTP.  Vea la p&aacute;gina
	  de ayuda &man.fetch.3; para una lista completa de las opciones.</para>

	<para>La opci&oacute;n <command>make <maketarget>fetch</maketarget></command>
	  se provee para usuarios que no pueden estar conectados constantemente.
	  Solo se tiene que ejecutar la orden en <filename>/usr/ports</filename>
	  y los ficheros requeridos ser&aacute;n descargados. Esta orden funciona
	  tambi&eacute;n en subdirectorios, por ejemplo: <filename>/usr/ports/net</filename>.
	  Si el port tiene dependencias en librerias u otros ports, esta orden
	  <emphasis>no</emphasis> descargar&aacute; los distfiles de estos ports.
	  Remplace <maketarget>fetch</maketarget> por <maketarget>fetch-recursive
	  </maketarget> si se quiere descargar las dependencias de otro port.</para>

	<note><para>Es posible compilar los ports por categoria, o todos si se desea,
	  ejecutando la orden <command>make</command> en <filename>/usr/ports</filename>
	  usando el ya descrito m&eacute;todo de <command>make<makevar>fetch</makevar>
	  </command>. Esto puede resultar peligroso ya que algunos ports no pueden 
	  coexistir. En otros casos, algunos ports pueden instalar dos diferentes 
	  ficheros bajo el mismo nombre.</para></note>

	<para>Puede darse el caso que se necesite descargar los tarballs de otro sitio
	  diferente a <makevar>MASTER_SITES</makevar> (de donde se descargan los 
	  ficheros). Es posible renombrar la opci&oacute;n <makevar>MASTER_SITES</makevar>
	  de la siguiente manera:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/<replaceable>directory</replaceable></userinput></screen>
        <screen>&prompt.root; <userinput>make MASTER_SITE_OVERRIDE= \
        ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/ fetch</userinput></screen>

	<para>En este ejemplo cambiamos la opci&oacute;n <makevar>MASTER_SITES</makevar>
	  a <hostid role="fqdn">ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/</hostid>.</para> 

	<para>Algunos ports permiten (o requieren) que se provea opciones de 
	  compilaci&oacute;n que pueden habilitar/deshabilitar partes de la 
	  aplicaci&oacute;n que no son necesarias, algunas opciones de seguridad
	  y otros arreglos. Algunos ejemplos de estos son <filename role="package">
	  www/mozilla</filename>, <filename role="package">security/gpgme</filename> y
	  <filename role="package">mail/sylpheed-claws</filename>. Se notificar&aacute;
	  con un mensaje cuando opciones como estas estan disponibles.</para>
      </sect3>  

      <sect3>
	<title>Rehubicando el directorio de Ports</title>

	<para>Algunas veces es &uacute;til (o necesario) usar diferentes distfiles y
	  directorio de ports. Las variables <makevar>PORTSDIR</makevar> y <makevar>
	  PREFIX</makevar> pueden sustituir los recursos por defecto. Por ejemplo:</para>

        <screen>&prompt.root; <userinput>make PORTSDIR=/usr/home/example/ports install</userinput></screen>
	<para>Esto compilar&aacute; el port en 
	  <filename>/usr/home/example/ports</filename> y lo
	  instalar&aacute; en <filename>/usr/local</filename>.</para>
        
	<screen>&prompt.root; <userinput>make PREFIX=/usr/home/example/local install</userinput></screen>
	<para>Esto compilar&aacute; el port en <filename>/usr/ports</filename> y lo 
	  instalar&aacute; en <filename>/usr/home/example/local</filename>.</para>

	<para>Y claro,</para>

        <screen>&prompt.root; <userinput>make PORTSDIR=../ports PREFIX=../local install</userinput></screen>

	<para>Combinar&aacute; los dos (demasiado largo para escribirlo completamente,
	  pere debe darle una idea general).</para>
	
	<para>Es posible tambi&eacute;n cambiar estas variables como parte su su entorno.
	  Lea el manual de su consola (shell) para hacerlo.</para>
      </sect3>	

      <sect3>
	<title>Usar <command>imake</command></title>

	<para>Algunos ports que usan <command>imake</command> (como parte del Sistema
	  X Windows) no funcionan correctamente con <makevar>PREFIX</makevar>, e 
	  insistir&aacute; en instalar en <filename>/usr/X11R6</filename>. Al igual,
	  algunos ports de Perl ignoran <makevar>PREFIX</makevar> e instalan en el 
	  &aacute;rbol de Perl. Hacer que estos ports respeten <makevar>PREFIX</makevar>
	  es una tarea dif&iacute;cil y hasta imposible.</para>
	  
      </sect3>
    </sect2>

    <sect2 id="ports-removing">
      <title>Eliminar Ports Instalados</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>removing</secondary>
      </indexterm>
      <para>Ahora que sabe instalar ports, probablemente se este preguntando como
        eliminarlos, en caso de que haya instalado alguno y 
        posteriormente se de cuenta que ha instalado el port incorrecto.  Vamos a
        eliminar el ejemplo anterior (que era <command>lsof</command>, para todos 
        aquellos que no prestaron atenci&oacute;n).  Como cuando instalamos 
        ports, lo primero que debemos hacer es ubicarnos en el directorio del 
        port que deseamos eliminar, que en este caso es 
	    <filename>/usr/ports/sysutils/lsof</filename>.  Una vez que se ha ubicado
	    en este directorio, estamos listos para eliminar <command>lsof</command>.
	    Esto se hace con la orden <command>make deinstall</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput>
&prompt.root; <userinput>make deinstall</userinput>
===&gt;  Deinstalling for lsof-4.57</screen>

      <para>Esto fu&eacute; sencillo.  Ha eliminado <command>lsof</command> de
        su sistema.  Si desea reinstalarlo, lo puede hacer al ejecutar
	    <command>make reinstall</command> estando en el directorio
        <filename>/usr/ports/sysutils/lsof</filename>.</para>

      <para>Las ordenes <command>make deinstall</command> y <command>make
        reinstall</command> no funcionan una vez que ha ejecutado la orden
        <command>make clean</command>.  Si desea desintalar un port, una vez que
        ha ejecutado <command>make clean</command>, deber&aacute; hacer uso de
        la orden &man.pkg.delete.1; como se describe en la secci&oacute;n de
        <link linkend="packages-using">Paquetes del Handbook</link>.</para>
    </sect2>
    <sect2 id="ports-disk-space">
      <title>Los ports y el espacio de disco</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>disk-space</secondary>
      </indexterm>
      <para>Usar la colecci&oacute;n de ports consume espacio a lo
        largo del tiempo.  Por culpa de la tendencia del arbol de
        ports de crecer en tama&ntilde;o, despues de construir e
        instalar software desde los ports, debe recordar limpiar los
        directorios temporales <filename
        class="directory">work</filename> usando la orden
        <command>make <makevar>clean</makevar></command>.  Esto
        eliminar&aacute; el directorio <filename
        class="directory">work</filename> despues de haber construido
        e instalado el port.  Tambi&eacute;n puede eliminar los
        ficheros de c&oacute;digo del directorio <filename
        class="directory">distfiles</filename> y los ports instalados
        si fuera necesario.</para>

      <para>Algunos usuarios eligen limitar las categor&iacute;as de ports
	disponibles configurando el fichero
	<filename>refuse</filename>.  De esta forma, cuando ejecutan
	la aplicaci&oacute;n <application>CVSup</application>, no
	descargar&aacute; los ficheros de esa categor&iacute;a.  Puede
	encontrar m&aacute;s informaci&oacute;n sobre el fichero
	<filename>refuse</filename> en <xref
	linkend="cvsup-refuse-file">.</para>
    </sect2>

    <sect2 id="ports-upgrading">
      <title>Actualizar los ports</title>

      <indexterm>
	<primary>portupgrade</primary>
      </indexterm>
      <indexterm>
	<primary>ports</primary>
	<secondary>upgrading</secondary>
      </indexterm>
      <note>
	<para>Una vez que actualice su colecci&oacute;n de ports,
          antes de intentar actualizar un port, deber&iacute;a leer el fichero
	  <filename>/usr/ports/UPDATING</filename>.  Este fichero
          describe varios problemas que los usuarios pueden encontrar
          y pasos adicionales que pueden necesitar cuando se actualiza
          un port.</para>
      </note>

      <para>Mantener los ports actualizados puede ser una tarea
	tediosa.  Por ejemplo, para actualizar un port debe ir al
	directorio del port, construir el port, desinstalar el
	port viejo, instalar el port nuevo y por ultimo, limpiar
	despues de construirlo.  Imagine hacer esto con cinco ports,
	tedioso, &iquest;verdad?.  Esto era un gran problema para los
	administradores, ahora tenemos herramientas que lo hacen por
	nosotros.  Por ejemplo, la herramienta <filename
	role="package">sysutils/portupgrade</filename> lo har&aacute;
	todo por usted.  Simplemente instalelo como cualquier otro
	port, usando la orden <command>make <makevar>install
	clean</makevar></command>.</para>

      <para>Ahora cree la base de datos con la orden <command>pkgdb
	-F</command>.  Esto leera la lista de ports instalados y
	creara el fichero de base de datos en el directorio
	<filename>/var/db/pkg</filename>.  Ahora cuando ejecute la
	orden <command>portupgrade
	-a</command>, leera este y el fichero 
	<filename>INDEX</filename> de los ports.  Por ultimo, 
	<application>portupgrade</application> empezar&aacute; a
	descargar, construir, instalar y limpiar los ports que se han
	actualizado.  <application>portupgrade</application> viene con
	muchas opciones para diferentes necesidades, las m&aacute;s
	importantes se exponen debajo.</para>

      <para>Si quiere actualizar solo una aplicaci&oacute;n, no la
	base de datos completa, use la orden <command>portupgrade
	<replaceable>pkgname</replaceable></command>, 
	incluyendo el parametro <option>-r</option> si
	<application>portupgrade</application> debe actuar en todos
	los paquetes que dependan de este paquete, y
	<option>-R</option> si debe actuar en todos los paquetes
	requeridos por este paquete.</para>

      <para>Para usar paquetes en vez de ports para la
	instalaci&oacute;n, use el parametro
	<option>-P</option>.  Con esta opci&oacute;n 
	<application>portupgrade</application> busca
	en los directorios locales que hay en <envar>PKG_PATH</envar>, o
	descarga los paquetes desde internet si no se encuentran
	localmente.  Si no esta disponible el paquete localmente o en
	el servidor remoto, <application>portupgrade</application>
	usar&aacute; los ports.  Para evitar que use los ports,
	especifique <option>-PP</option>.</para>

      <para>Para solo descargar los distfiles (o paquetes si usa
	<option>-P</option>) sin construir o instalar nada, use
	<option>-F</option>.  Para m&aacute;s informaci&oacute;n mire
	&man.portupgrade.1;.</para>

      <note>
	<para>Es importante actualizar la base de datos de paquetes
	  regularmente usando la orden <command>pkgdb -F</command>
	  para arreglar inconsistencias, especificamente cuando 
	  <application>portupgrade</application> se lo pida.  No
	  cancele <application>portupgrade</application> mientras este
	  actualizando la base de datos de paquetes, esto dejaria una
	  base de datos inconsistente.</para>
      </note>

      <para>Existen otras utilidades que hacen esto, mire en el
	directorio <filename>ports/sysutils</filename> a ver que
	encuentra.</para>
    </sect2>
  </sect1>

  <sect1 id="ports-nextsteps">
    <title>Actividades Post-Instalaci&oacute;n</title>

    <para>Una vez que ha instalado una nueva aplicaci&oacute;n, normalmente
      deber&aacute; leer la documentaci&oacute;n incluida, editar los
      ficheros de configuraci&oacute;n necesarios, asegurarse de que la
      aplicaci&oacute;n se ejecute al arrancar el sistema (si es un daemonio),
      etc.</para>

    <para>Obviamente los pasos exactos para configurar cada aplicaci&oacute;n 
      varian de una a otra.  De cualquier forma, si acaba de instalar una
      nueva aplicaci&oacute;n y se pregunta 
      <quote>&iquest;Y ahora qu&eacute;?</quote>, estos consejos puede que le
      ayuden:</para>

    <itemizedlist>
      <listitem>
	<para>Use &man.pkg.info.1; para ver que ficheros se instalaron y donde.  Por
	  ejemplo, si instal&oacute; el paquete FooPackage 1.0.0, 
	  use la siguiente orden :</para>

	<screen>&prompt.root; <userinput>pkg_info -L foopackage-1.0.0 | less</userinput></screen>

	<para>mostrar&aacute; los ficheros instalados por el paquete.  Preste 
	  especial atenci&oacute;n a los ficheros en el directorio
	  <filename>man/</filename> que son las p&aacute;ginas de ayuda y los del
	  directorio <filename>etc/</filename>, que contiene los ficheros de 
	  configuraci&oacute;n, y bajo el directorio <filename>doc/</filename> 
	  podr&aacute; encontrar informaci&oacute;n m&aacute;s detallada.</para>

	<para>Si no esta seguro de que versi&oacute;n del paquete ha instalado, 
	  simplemente teclee algo as&iacute;</para>

	<screen>&prompt.root; <userinput>pkg_info | grep -i <replaceable>foopackage</replaceable></userinput></screen>

	<para>y le mostrara todos los paquetes que se llaman
	  <replaceable>foopackage</replaceable>.  Reemplace 
	  <replaceable>foopackage</replaceable> de acuerdo a sus necesidades
	  en la l&iacute;nea de ordenes.</para>
      </listitem>

      <listitem>
	<para>Una vez que ha identificado donde estan las paginas de ayuda
	  de la aplicaci&oacute;n, reviselas usando &man.man.1;.  De forma similar
	  revise los ficheros de configuraci&oacute;n, as&iacute; como cualquier 
	  documentaci&oacute;n adicional que se incluya.</para>
      </listitem>

      <listitem>
	<para>Si la aplicaci&oacute;n cuenta con un sitio web, visitelo en busca
	  de documentaci&oacute;n adicional, ficheros de preguntas frecuentes (FAQ),
	  etc.  Si no conoce la direcci&oacute;n del sitio web, vea la
	  salida de la orden</para>

	<screen>&prompt.root; <userinput>pkg_info <replaceable>foopackage-1.0.0</replaceable></userinput></screen>
	
	<para>este incluye en ocasiones una l&iacute;nea <literal>WWW:</literal>, que
	  describe el sitio web de la aplicaci&oacute;n.</para>
      </listitem>
      <listitem>
	<para>Los ports que deben arrancar con el sistema (como los
	  servidores de Internet) normalmente instalaran un script de
	  ejemplo en <filename>/usr/local/etc/rc.d</filename>.  Debe
	  revisar este script para comprobar que todo es correcto,
	  editarlo o renombrarlo si fuera necesario.  Mire <quote>Arrancar
	  servicios</quote> para m&aacute;s informaci&oacute;n.</para>
      </listitem>

    </itemizedlist>
  </sect1>
  <sect1 id="ports-broken">
    <title>Como tratar con ports rotos</title>

      <para>Si encuentra un port que no le funciona, hay varias cosas
        que puede hacer, incluyendo:</para>

      <orderedlist>
        <listitem>
	  <para>&iexcl;Arreglarlo! El <quote>Porter's
	    Handbook</quote> incluye informaci&oacute;n detallada
	    sobre la infraestructura de los
	    <quote>Ports</quote> para que pueda arreglar un port roto
	    o incluso mandar su propio port.</para>
	</listitem>

	<listitem>
	  <para>&iexcl;Quejese&mdash;<emphasis>solo por
	    email</emphasis>!  Mande un email al mantenedor del port
	    primero.  Escriba <command>make maintainer</command> o lea
	    el <filename>Makefile</filename> para encontrar la
	    direccion de email del mantenedor.  Recuerde incluir el
	    nombre, la versi&oacute;n del port (mande la l&iacute;nea
	    <literal>&dollar;FreeBSD:</literal> 
	    del <filename>Makefile</filename>) y la salida de error
	    cuando mande el email al mantenedor.  Si no recibe una
	    respuesta del mantenedor, puede usar &man.send-pr.1; para
	    enviar un informe de error.</para>
	</listitem>

	<listitem>
	  <para>Descargue el paquete de algun sitio FTP.  El
	    <quote>principal</quote> servidor de la colecci&oacute;n
	    de paquetes esta en <hostid
	    role="fqdn">ftp.FreeBSD.org</hostid> en el <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/">directorio
	    de paquetes</ulink>, &iexcl;pero asegurese de mirar en su espejo
	    mas cercano <emphasis>first</emphasis>!  Es probable que
	    esto funcione antes que compilar el port desde
	    c&oacute;digo fuente y tambi&eacute;n es bastante
	    m&aacute;s rapido.  Use el programa &man.pkg.add.1; para
	    instalar el paquete en su sistema.</para>
	</listitem>
      </orderedlist>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
