Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: There are a couple of kinds of <quote>free memory</quote>. One kind is the amount of memory immediately available without paging anything else out. That is approximately the size of cache queue + size of free queue (with a derating factor, depending upon system tuning). Another kind of <quote>free memory</quote> is the total amount of <acronym>VM</acronym> space. That can be complex, but is dependent upon the amount of swap space and memory. Other kinds of <quote>free memory</quote> descriptions are also possible, but it is relatively useless to define these, but rather it is important to make sure that the paging rate is kept low, and to avoid running out of swap space.
de_de: Es gibt verschiedene Arten von <quote>freiem Speicher</quote>. Eine Art ist die Speichermenge, die sofort, ohne etwas auszulagern, zur Verfügung steht. Dies ist ungefähr die kumulierte Größe von <literal>Inactive</literal> und <literal>Free</literal>. Der gesamte <acronym>VM</acronym>-Bereich ist eine weitere Art des <quote>freien Speichers</quote>. Die Betrachtung ist komplex, hängt aber von der Größe des Swap-Bereichs und der Größe des Arbeitsspeichers ab. Es gibt weitere Definitionen für <quote>freien Speicher</quote>, die aber alle relativ nutzlos sind. Wichtig ist hingegen, dass wenig Seiten ausgelagert werden (paging) und der Swap-Bereich ausreichend groß ist.
es_es: Hay varios tipos de <quote>memoria libre</quote>. Un tipo es la cantidad de memoria directamente disponible sin paginar nada a disco. Esto es aproximadamente el tamaño de una cola de cache + el tamaño de la cola libre (con un factor de reducción de potencia, dependiendo de como se configure el sistema). Otro tipo de <quote>memoria libre</quote> es la cantidad total de espacio <acronym>VM</acronym>. Esto puede ser complejo, pero depende de la cantidad de espacio de intercambio y memoria. Otros tipos de descripciones de <quote>memoria libre</quote> también son posibles, pero es relativamente inútil definirlos, en su lugar es importante asegurarse de mantener el rango de paginación bajo, para evitar que se agote el espacio de intercambio.
pt_br: Existem alguns tipos de <quote>memória livre</quote>. Um tipo é a quantidade de memória imediatamente disponível sem fazer a paginação de mais nada para a VM. Isso é aproximadamente o tamanho da fila de cache + tamanho da fila livre (com um fator de redução de capacidade, dependendo do ajuste do sistema). Outro tipo de <quote>memória livre</quote> é a quantidade total de espaço <acronym>VM</acronym>. Isto pode ser complexo, mas depende da quantidade de espaço de swap e memória. Outros tipos de descrições de <quote>memória livre</quote> também são possíveis, mas é relativamente inútil defini-los, mas por outro lado é importante certificar-se de que a taxa de paginação está mantida baixa para evitar a falta de espaço de swap.

source: What is <filename>/var/empty</filename>?
de_de: Was ist <filename>/var/empty</filename>?
es_es: ¿Qué es <filename>/var/empty</filename>?
pt_br: O que é o <filename>/var/empty</filename>?

source: <filename>/var/empty</filename> is a directory that the <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> program uses when performing privilege separation. The <filename>/var/empty</filename> directory is empty, owned by <systemitem class="username">root</systemitem> and has the <literal>schg</literal> flag set. This directory should not be deleted.
de_de: Das Verzeichnis <filename>/var/empty</filename> wird von <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> benötigt, wenn es mit <quote>Privilege Separation</quote> ausgeführt wird. Das Verzeichnis <filename>/var/empty</filename> ist leer, gehört <systemitem class="username">root</systemitem> und ist durch das Dateiattribut <literal>schg</literal> geschützt.
es_es: <filename>/var/empty</filename> es un directorio que el programa <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> usa al realizar la separación de privilegios. El directorio <filename>/var/empty</filename> esta vació, su dieño es <systemitem class="username">root</systemitem> y tiene la bandera <literal>schg</literal> habilitada. Este directorio no debería ser borrado.
pt_br: O <filename>/var/empty</filename> é um diretório que o programa <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> utiliza ao executar a separação de privilégios. O diretório <filename>/var/empty</filename> está vazio, pertence ao usuário <systemitem class="username">root</systemitem> e possui as flags <literal>schg</literal> definidas. Este diretório não deve ser excluído.

source: I just changed <filename>/etc/newsyslog.conf</filename>. How can I check if it does what I expect?
de_de: Ich habe eben <filename>/etc/newsyslog.conf</filename> geändert. Wie kann ich das Ergebnis überprüfen?
es_es: Acabo de cambiar <filename>/etc/newsyslog.conf</filename>. ¿Como puedo verificar si hace lo que yo espero?
pt_br: Acabei de alterar o <filename>/etc/newsyslog.conf </filename>. Como posso verificar se ele faz o que eu espero?

source: To see what <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry> will do, use the following:
de_de: Um zu sehen wie <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry> reagiert, verwenden Sie das folgende Kommando:
es_es: Para ver lo que haría <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry>, use lo siguiente:
pt_br: Para ver o que <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry> vai fazer, use o seguinte:

source: My time is wrong, how can I change the timezone?
de_de: Meine Systemuhr geht falsch. Wie kann ich die Zeitzone ändern?
es_es: ¿Mi hora esta mal, como puedo cambiar la zona del tiempo?
pt_br: Minha hora está errada, como posso mudar o fuso horário?

source: The X Window System and Virtual Consoles
de_de: Das X Window System und virtuelle Konsolen
es_es: El sistema X Window y las consolas virtuales
pt_br: O sistema X Window e consoles virtuais

source: What is the X Window System?
de_de: Was ist das X Window System?
es_es: ¿Qué es el sistema X Window?
pt_br: O que é o sistema X Window?

source: The X Window System (commonly <literal>X11</literal>) is the most widely available windowing system capable of running on <trademark class="registered">UNIX</trademark> or <trademark class="registered">UNIX</trademark> like systems, including FreeBSD. <link xlink:href="http://www.x.org/wiki/">The X.Org Foundation</link> administers the <link xlink:href="http://en.wikipedia.org/wiki/X_Window_System_core_protocol">X protocol standards</link>, with the current reference implementation, version 11 release 7.7, so references are often shortened to <literal>X11</literal>.
de_de: Das X Window System (oder auch nur <literal>X11</literal>) ist das am häufigsten verwendete Window System für <trademark class="registered">UNIX</trademark>- und <trademark class="registered">UNIX</trademark>-ähnliche Systeme, zu denen auch FreeBSD gehört. Der <link xlink:href="http://en.wikipedia.org/wiki/X_Window_System_core_protocol">X Protokollstandard</link> wird von der <link xlink:href="http://www.x.org/wiki/">X.Org Foundation</link> definiert und liegt aktuell in Version 11 Release 7.7 vor und wird häufig auch nur als <literal>X11</literal> bezeichnet.
es_es: El sistema X Window (comúnmente <literal>X11</literal>) es el sistema de ventanas más ampliamente disponible capaz de correr en <trademark class="registered">UNIX</trademark> o sistemas de tipo <trademark class="registered">UNIX</trademark>, incluyendo FreeBSD. <link xlink:href="http://www.x.org/wiki/">La X.Org Foundation</link> administra <link xlink:href="http://en.wikipedia.org/wiki/X_Window_System_core_protocol">estándares de protocolo de X</link>, con la implementación de referencia actual, versión 11 release 7.7, de modo que las referencias suelen acortarse a <literal>X11</literal>.
pt_br: O sistema de janelas X (comumente chamado de <literal>X11</literal>) é o sistema de janelas mais amplamente disponível capaz de executar em Sistemas <trademark class="registered">UNIX</trademark> e sistemas <trademark class="registered">UNIX</trademark>-Like, incluindo o FreeBSD. A <link xlink:href="http://www.x.org/wiki/">Fundação X.Org</link> administra os <link xlink:href="http://en.wikipedia.org/wiki/X_Window_System_core_protocol"> padrões de protocolo X</link>, sendo que a implementação de referência atual é a versão 11 release 7.7, então as referências são frequentemente encurtadas para <literal>X11</literal>.

source: Many implementations are available for different architectures and operating systems. An implementation of the server-side code is properly known as an <literal>X server</literal>.
de_de: Das X Window System wurde für viele verschiedene Architekturen und Betriebssysteme implementiert. Eine serverseitige Implementierung wird dabei als <literal>X-Server</literal> bezeichnet.
es_es: Exiten muchas implementaciones disponibles para diferentes arquitecturas y sistemas operativos. Una implementación del código del lado del servidor es conocida propiamente como un <literal>servidor X</literal>.
pt_br: Muitas implementações estão disponíveis para diferentes arquiteturas e sistemas operacionais. Uma implementação do código do lado do servidor é conhecida como um <literal>Servidor X</literal>.

source: I want to run Xorg, how do I go about it?
de_de: Ich möchte Xorg benutzen, was muss ich tun?
es_es: ¿Quiero correr Xorg, como hago esto?
pt_br: Eu quero rodar o Xorg, como faço para isso?

source: To install Xorg do one of the following:
de_de: Sie können Xorg wie folgt installieren:
es_es: Para instalar Xorg siga uno de los siguientes pasos:
pt_br: Para instalar o Xorg, siga um destes procedimentos:

source: Use the <package>x11/xorg</package> meta-port, which builds and installs every Xorg component.
de_de: Benutzen Sie den Meta-Port <package>x11/xorg</package>, der sämtliche Xorg Komponenten installiert.
es_es: Use el meta-port <package>x11/xorg</package>, que compila e instala todos los componentes de Xorg.
pt_br: Use o meta-port <package>x11/xorg</package>, que constrói e instala todos os componentes do Xorg.

source: Use <package>x11/xorg-minimal</package>, which builds and installs only the necessary Xorg components.
de_de: Benutzen Sie <package>x11/xorg-minimal</package>, der nur die benötigten Komponenten installiert.
es_es: Use <package>x11/xorg-minimal</package>, que compila e instala solo los componentes de Xorg necesarios.
pt_br: Use <package>x11/xorg-minimal</package>, que constrói e instala apenas os componentes Xorg necessários.

source: Install Xorg from FreeBSD packages:
de_de: Sie können Xorg auch als Paket installieren:
es_es: Instale Xorg desde los paquetes de FreeBSD:
pt_br: Instale o Xorg a partir de pacotes do FreeBSD:

source: After the installation of Xorg, follow the instructions from the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/x-config.html">X11 Configuration</link> section of the FreeBSD Handbook.
de_de: Lesen Sie nach erfolgreicher Installation von Xorg den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/x-config.html">X11 konfigurieren</link> im FreeBSD Handbuch.
es_es: Luego de la instalación de Xorg, siga las instrucciones de la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/x-config.html">Configuración de X11</link> del manual de FreeBSD.
pt_br: Após a instalação do Xorg, siga as instruções da seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/x-config.html">Configuração X11</link> do Handbook do FreeBSD.

source: I <emphasis>tried</emphasis> to run X, but I get a <errorname>No devices detected.</errorname> error when I type <command>startx</command>. What do I do now?
de_de: Ich habe <emphasis>versucht</emphasis>, X zu starten, aber wenn ich <command>startx</command> eingebe, erhalte ich die Fehlermeldung <errorname>No devices detected.</errorname>. Was soll ich jetzt machen?
es_es: He <emphasis>intentado</emphasis> correr X, pero obtengo el error <errorname>No devices detected.</errorname> cuando escribo <command>startx</command>. ¿Qué hago ahora?
pt_br: Eu <emphasis>tentei</emphasis> executar o X, mas eu recebo um erro <errorname>No devices detected.</errorname> quando eu digito <command>startx</command>. O que eu faço agora?

source: The system is probably running at a raised <literal>securelevel</literal>. It is not possible to start X at a raised <literal>securelevel</literal> because X requires write access to <citerefentry><refentrytitle>io</refentrytitle><manvolnum>4</manvolnum></citerefentry>. For more information, see at the <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page.
de_de: Das System läuft wahrscheinlich auf einer erhöhten Sicherheitsstufe (<literal>securelevel</literal>). X kann auf einer erhöhten Sicherheitsstufe nicht gestartet werden, weil X dazu Schreibzugriff auf <citerefentry><refentrytitle>io</refentrytitle><manvolnum>4</manvolnum></citerefentry> benötigt. Lesen Sie dazu auch die Manualpage <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: El sistema probablemente este corriendo en un <literal>securelevel</literal> elevado. No es posible iniciar X en un <literal>securelevel</literal> elevado porque X requiere acceso de escritura a <citerefentry><refentrytitle>io</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Para más información vea la página de manual de <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: O sistema provavelmente está sendo executado em um <literal>securelevel</literal> alto. Não é possível iniciar o X em <literal>securelevel</literal> alto porque o X requer acesso de ao <citerefentry> <refentrytitle>io</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Para obter mais informações, consulte a página de manual do <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: There are two solutions to the problem: set the <literal>securelevel</literal> back down to zero or run <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> (or an alternative display manager) at boot time before the <literal>securelevel</literal> is raised.
de_de: Es gibt zwei Lösungen für dieses Problem: Setzen Sie die Sicherheitsstufe wieder zurück auf <literal>0</literal> oder starten Sie <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> (oder einen alternativen Display Manager) während des Bootens, bevor die Sicherheitsstufe erhöht wird.
es_es: Hay dos soluciones a este problema: ponga <literal>securelevel</literal> en cero o corra <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> (o un gestor gráfico alternativo) en tiempo de arranque antes de que <literal>securelevel</literal> sea elevado.
pt_br: Existem duas soluções para o problema: definir o <literal>securelevel</literal> novamente a zero ou executar <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> (ou um gerenciador de exibição alternativo) no momento da inicialização antes que o <literal>securelevel</literal> seja elevado.

source: See <xref linkend="xdm-boot"/> for more information about running <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> at boot time.
de_de: Der Abschnitt <xref linkend="xdm-boot"/> enthält Informationen darüber, wie Sie <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> beim Systemstart aktivieren können.
es_es: Vea <xref linkend="xdm-boot"/> para más información acerca de correr <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> en tiempo de arranque.
pt_br: Veja <xref linkend="xdm-boot"/> para mais informações sobre como executar o <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> no momento da inicialização.

source: Why does my mouse not work with X?
de_de: Warum funktioniert meine Maus unter X nicht?
es_es: ¿Por qué mi mouse no funciona con X?
pt_br: Por que meu mouse não funciona com o X?

source: When using <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, the default console driver, FreeBSD can be configured to support a mouse pointer on each virtual screen. To avoid conflicting with X, <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> supports a virtual device called <filename>/dev/sysmouse</filename>. All mouse events received from the real mouse device are written to the <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry> device via <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>. To use the mouse on one or more virtual consoles, <emphasis>and</emphasis> use X, see <xref linkend="moused" remap="another section"/> and set up <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Wenn Sie den Standard-Konsolentreiber <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> benutzen, können Sie FreeBSD so konfigurieren, dass auf jedem virtuellen Bildschirm ein Mauszeiger unterstützt wird. Um Konflikte mit X zu vermeiden, unterstützt <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> ein virtuelles Gerät namens <filename>/dev/sysmouse</filename>. Alle Mausbewegungen und Mausklicks werden über <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> in das <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry> Gerät. Falls Sie die Maus auf einer oder mehreren virtuellen Konsolen <emphasis>und</emphasis> unter X benutzen wollen, sollten Sie zunächst <xref linkend="moused" remap="another section"/> lesen und <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> konfigurieren.
es_es: Al usar <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, el controlador de consola por defecto, FreeBSD puede configurarse para soportar un puntero del mouse en cada pantalla virtual. Para evitar entrar en conflico con X, <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> soporta un dispositivo virtual llamado <filename>/dev/sysmouse</filename>. Todos los eventos del mouse recibidos del dispositivo real del mouse se escriben al dispositivo <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry> mediante <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Para usar el mouse en una o más consolas virtuales, <emphasis>and</emphasis> use X, vea <xref linkend="moused" remap="another section"/> y configure<citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Ao usar <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, o driver de console padrão, o FreeBSD pode ser configurado para suportar um ponteiro de mouse em cada tela virtual. Para evitar conflito com o X, o <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> suporta um dispositivo virtual chamado <filename>/dev/sysmouse</filename>. Todos os eventos de mouse recebidos do dispositivo de mouse real são gravados no dispositivo via <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry><citerefentry><refentrytitle> moused </refentrytitle><manvolnum>8</manvolnum></citerefentry>. Para usar o mouse em um ou mais consoles virtuais, <emphasis> e </emphasis> usar X, veja <xref linkend="moused" remap="outra seção" /> e configure o <citerefentry> <refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Then edit <filename>/etc/X11/xorg.conf</filename> and make sure the following lines exist:
de_de: Stellen Sie anschließend sicher, dass die folgenden Einträge in <filename>etc/X11/xorg.conf</filename> enthalten sind:
es_es: Luego edite <filename>/etc/X11/xorg.conf</filename> y asegúrese de que las siguientes líneas existan:
pt_br: Em seguida, edite o arquivo <filename>/etc/X11/xorg.conf</filename> e verifique se as seguintes linhas existem:

source: Starting with Xorg version 7.4, the <literal>InputDevice</literal> sections in <filename>xorg.conf</filename> are ignored in favor of autodetected devices. To restore the old behavior, add the following line to the <literal>ServerLayout</literal> or <literal>ServerFlags</literal> section:
de_de: Beginnend mit Xorg 7.4 werden Angaben im Abschnitt <literal>InputDevice</literal> von <filename>xorg.conf</filename> ignoriert. Stattdessen wird auf die automatisch ermittelten Werte zurückgegriffen. Um das alte Verhalten zu reaktivieren, fügen Sie die folgende Zeile entweder in den Abschnitt <literal>ServerLayout</literal> oder <literal>ServerFlags</literal> ein:
es_es: Empezando con la versión 7.4 de Xorg, las secciones <literal>InputDevice</literal> en <filename>xorg.conf</filename> son ignoradas en favor de los dispositivos autodetectados. Para restaurar el viejo comportamiento, agregue la siguiente línea a la sección <literal>ServerLayout</literal> o a <literal>ServerFlags</literal>:
pt_br: Começando com a versão 7.4 do Xorg, as seções <literal>InputDevice</literal> no <filename>xorg.conf</filename> são ignoradas em favor dos dispositivos autodetectados. Para restaurar o comportamento antigo, adicione a seguinte linha à seção <literal>ServerLayout</literal> ou <literal>ServerFlags</literal>:
