Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: There are other methods. As every good sysadmin knows, it is part of standard practice to send data to the screen of interesting variety to keep all the pixies that make up your picture happy. Screen pixies (commonly mis-typed or re-named as <quote>pixels</quote>) are categorized by the type of hat they wear (red, green or blue) and will hide or appear (thereby showing the color of their hat) whenever they receive a little piece of food. Video cards turn data into pixie-food, and then send them to the pixies — the more expensive the card, the better the food, so the better behaved the pixies are. They also need constant stimulation — this is why screen savers exist.
de_de: Es gibt andere Mittel und Wege. Wie jeder gute Systemadministrator weiss, gehört es zum guten Ton, einigen Daten zum Bildschirm zu senden, damit die Leuchtkäferchen, die das Bild anzeigen, glücklich sind. Die Leuchtkäferchen werden nach der Farbe Ihrer Hüte (Rot, Grün, oder Blau) unterschieden und sie verstecken bzw. zeigen sich (wobei man die Farbe ihrer Hüte erkennen kann) bei jeder Nahrungsaufnahme. Grafikkarten wandeln Daten in Leuchkäfer-Nahrung um und schicken sie dann zu den Leuchtkäfern - teure Karten erzeugen bessere Nahrung und sorgen so für besseres Verhalten der Leuchtkäfer. Diese brauchen allerdings einen konstanten Stimulus - darum gibt es Bildschirmschoner.
es_es: Hay otros métodos. Como todo buen sysadmin sabe, es parte de las prácticas estándares envíar datos a la pantalla de variedad interesante para mantener los pixies y hacer feliz a sus fotos. Los pixies de pantalla (comúnmente mal escritos o renombrados como <quote>pixels</quote>) son categorizados por el tipo de sombrero que llevan puesto (rojo, verde o azul) y se esconderán o aparecerán (de esta forma mostrando el color de su sombrero) cuando reciban un pedazo de comida. Las tarjetas de video convierten datos en comida para pixies y se la mandan a los pixies — cuanto más cara la tarjeta, mejor es la comida, y mejor se comportan los pixies. También necesitan estimulación constante — por esto es que existen los salvapantallas.
pt_br: Existem outros métodos. Como todo bom administrador de sistemas sabe, é parte da prática padrão enviar dados para a tela de variedade interessante para manter todos os pixies que compõem sua imagem felizes. Os duendes de tela (comumente com erros de digitação ou renomeados como <quote>pixels</quote>) são categorizados pelo tipo de chapéu que usam (vermelho, verde ou azul) e serão ocultados ou exibidos (mostrando a cor do chapéu ) sempre que recebem um pequeno pedaço de comida. Placas de vídeo transformam dados em comida de duende, e então os enviam para os duendes - quanto mais cara a carta, melhor a comida, então é melhor que os pixies se comportem melhor. Eles também precisam de estímulo constante - é por isso que existem proteções de tela.

source: To take your suggestions further, you could just throw the random data to console, thereby letting the pixies consume it. This causes no heat to be produced at all, keeps the pixies happy and gets rid of your data quite quickly, even if it does make things look a bit messy on your screen.
de_de: Darum lautet mein Vorschlag, die zufälligen Daten einfach zum Bildschirm zu schicken, damit sie von den Leuchtkäfern verzehrt werden. Dabei entsteht keine Hitze, die Leuchtkäfer bleiben glücklich und man wird seine überflüssigen Daten sehr schnell los, auch wenn der Bildschirm etwas merkwürdig aussieht.
es_es: Para llevar más sus sugerencias, podría arrojar datos al azar a la consola, por consiguiente dejando que los pixies lo consuman. Esto hace que no se produzca calor en absoluto, mantiene los pixies felices y se deshace de sus datos realmente rápido, incluso si hace que las cosas se vean un poco desorganizadas en su pantalla.
pt_br: Para levar suas sugestões adiante, você poderia simplesmente jogar os dados aleatórios no console, permitindo que os duendes os consumam. Isso faz com que nenhum calor seja produzido, mantém os pixies felizes e se livra de seus dados rapidamente, mesmo que isso faça as coisas parecerem um pouco confusas na sua tela.

source: Incidentally, as an ex-admin of a large ISP who experienced many problems attempting to maintain a stable temperature in a server room, I would strongly discourage people sending the data they do not want out to the network. The fairies who do the packet switching and routing get annoyed by it as well.
de_de: Übrigens: Als Ex-Admin eines großen ISPs, der so seine Probleme mit der Kühlung seines Rechenzentrums hatte, kann ich nur davon abraten, überflüssige Daten einfach in das Netzwerk zu schicken. Die Heinzelmännchen, die die Pakete verteilen und versenden, regen sich darüber ganz furchtbar auf.
es_es: Accidentalmente, como un ex-administrador de un gran ISP que ha experimentado muchos problemas intentando mantener una temperatura estable en el cuarto de servidores, desaconsejo fuertemente el que la gente envíe datos indeseados a la red. A las hadas que se encargan de el intercambio de paquetes y el ruteo también les molesta.
pt_br: Incidentalmente, como um ex-administrador de um grande ISP que teve muitos problemas ao tentar manter uma temperatura estável em uma sala de servidores, eu desencorajaria fortemente as pessoas que enviam os dados que não querem para a rede. As fadas que fazem a troca e o encaminhamento de pacotes também se irritam com isso.

source: My colleague sits at the computer too much, how can I prank her?
de_de: Mein Kollege hängt zu viel vor dem Rechner, wie kann ich ihm einen Streich spielen?
es_es: Mi colega esta demasiado tiempo sentada en la computadora. ¿Como puedo hacerle una broma?
pt_br: Minha colega fica muito no computador, como eu posso brincar com ela?

source: Install <package role="port">games/sl</package> and wait for her to mistype <userinput>sl</userinput> for <command>ls</command>.
de_de: Installieren Sie auf dem Rechner Ihres Kollegen <package role="port">games/sl</package> und warten Sie, bis Ihr Kollege unbeabsichtigt <userinput>sl</userinput> für <command>ls</command> eingibt.
es_es: Instale <package role="port">games/sl</package> y espere a que ella se equivoque al escribir <userinput>sl</userinput> en vez de <command>ls</command>.
pt_br: Instale o <package role="port">games/sl</package> e espere ela digitar <userinput>sl</userinput> para <command>ls</command>.

source: Advanced Topics
de_de: Weiterführende Themen
es_es: Temas avanzados
pt_br: Tópicos Avançados

source: How can I learn more about FreeBSD's internals?
de_de: Wie kann ich mehr über die Interna von FreeBSD erfahren?
es_es: ¿Como puedo aprender más acerca del funcionamiento interno de FreeBSD?
pt_br: Como posso aprender mais sobre os componentes internos do FreeBSD?

source: See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook">FreeBSD Architecture Handbook</link>.
de_de: Lesen Sie das <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook">FreeBSD Architecture Handbook</link>.
es_es: Vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook">Manual de arquitectura de FreeBSD</link>.
pt_br: Veja o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook"> Handbook de Arquitetura do FreeBSD </link>.

source: Additionally, much general <trademark class="registered">UNIX</trademark> knowledge is directly applicable to FreeBSD.
de_de: Allgemeines Wissen über <trademark class="registered">UNIX</trademark> kann allerdings in den meisten Fällen auf FreeBSD angewendet werden.
es_es: Además, la mayor parte del conocimiento general acerca de <trademark class="registered">UNIX</trademark>es directamente aplicable a FreeBSD.
pt_br: Além disso, muito do conhecimento geral sobre o <trademark class="registered">UNIX</trademark> é diretamente aplicável ao FreeBSD.

source: How can I contribute to FreeBSD?
de_de: Wie kann ich bei der Entwicklung von FreeBSD mithelfen?
es_es: ¿Cómo puedo contribuir a FreeBSD?

source: See the article on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">Contributing to FreeBSD</link> for specific advice on how to do this. Assistance is more than welcome!
de_de: Genauere Informationen finden Sie im Artikel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/articles/contributing/article.html">FreeBSD unterstützen</link>. Wir können Hilfe immer gut gebrauchen!
es_es: Vea el artículo acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">Contribuir a FreeBSD</link> para consejos específicos acerca de como hacer esto. ¡La ayuda es más que bienvenida!

source: What are snapshots and releases?
de_de: Was sind Snapshots und Releases?
es_es: ¿Qué son snapshots y lanzamientos?
pt_br: O que são Snapshots e Releases?

source: There are currently 3 active/semi-active branches in the FreeBSD <link xlink:href="http://svnweb.FreeBSD.org/base/">Subversion Repository</link>. (Earlier branches are only changed very rarely, which is why there are only 3 active branches of development):
de_de: Derzeit existieren drei aktive/halbaktive Zweige im FreeBSD <link xlink:href="http://svnweb.FreeBSD.org/base/">Subversion Repository</link>. In früheren Zweigen ändert sich wenig, daher gibt es nur drei aktive Entwicklungszweige:
es_es: Hay actualmente 3 ramas activas/semi activas en el <link xlink:href="http://svnweb.FreeBSD.org/base/">repositorio Subversion</link> de FreeBSD. (Las ramas anteriores cambian muy raramente, que es por lo cual solo hay 3 ramas de desarrollo activas):
pt_br: Atualmente existem 3 branchs ativas/semi-ativas no <link xlink:href="http://svnweb.FreeBSD.org/base/">Repositório de Subversion</link> do FreeBSD. (Os branchs anteriores são alterados apenas muito raramente, e é por isso que existem apenas 3 ramificações ativas de desenvolvimento):

source: <symbol>stable/9/</symbol> AKA <emphasis>9-STABLE</emphasis>
de_de: <symbol>stable/9/</symbol> bzw. <emphasis>9-STABLE</emphasis>
es_es: <symbol>stable/9/</symbol> alias <emphasis>9-STABLE</emphasis>

source: <symbol>stable/10/</symbol> AKA <emphasis>10-STABLE</emphasis>
de_de: <symbol>stable/10/</symbol> bzw. <emphasis>10-STABLE</emphasis>
es_es: <symbol>stable/10/</symbol> alias <emphasis>10-STABLE</emphasis>

source: <symbol>head/</symbol> AKA <emphasis>-CURRENT</emphasis> AKA <emphasis>11-CURRENT</emphasis>
de_de: <symbol>head/</symbol> bzw. <emphasis>-CURRENT</emphasis> oder auch <emphasis>11-CURRENT</emphasis>
es_es: <symbol>head/</symbol> alias <emphasis>-CURRENT</emphasis> alias <emphasis>11-CURRENT</emphasis>

source: <literal>HEAD</literal> is not an actual branch tag. It is a symbolic constant for the current, non-branched development stream known as <emphasis>-CURRENT</emphasis>.
de_de: <literal>HEAD</literal> ist keine wirkliche Bezeichnung für einen Zweig. Es ist lediglich eine symbolische Konstante für den aktuellen, nicht verzweigten Entwicklungsstrom, auf den wir uns einfach als <emphasis>-CURRENT</emphasis> beziehen.
es_es: <literal>HEAD</literal> no es realmente un tag de rama. Es una constante simbólica para el torrente de desarrollo actual, no ramificado conocido como <emphasis>-CURRENT</emphasis>.
pt_br: <literal>HEAD</literal> não é uma tag de branch real. É uma constante simbólica para o fluxo de desenvolvimento atual, não ramificado, conhecido como <emphasis>-CURRENT</emphasis>.

source: Right now, <emphasis>-CURRENT</emphasis> is the 11.<replaceable>X</replaceable> development stream; the <emphasis>10-STABLE</emphasis> branch, <symbol>stable/10/</symbol>, forked off from <emphasis>-CURRENT</emphasis> in January 2014 and the <emphasis>9-STABLE</emphasis> branch, <symbol>stable/9/</symbol>, forked off from <emphasis>-CURRENT</emphasis> in September 2011.
de_de: Derzeit steht <emphasis>-CURRENT</emphasis> für den 11.<replaceable>X</replaceable>-Entwicklungsstrom. Der <emphasis>10-STABLE</emphasis>-Zweig (<symbol>stable/10</symbol>) wurde von <emphasis>-CURRENT</emphasis> im Januar 2014 und der <emphasis>9-STABLE</emphasis>-Zweig (<symbol>stable/9</symbol>) im September 2011 von <emphasis>-CURRENT</emphasis> abgespalten.
es_es: En este momento, <emphasis>-CURRENT</emphasis> es el torrente de desarrollo 11.<replaceable>X</replaceable>; la rama <emphasis>10-STABLE</emphasis>, <symbol>stable/10/</symbol>, se ramifico de <emphasis>-CURRENT</emphasis> en Enero del 2014 y la rama <emphasis>9-STABLE</emphasis>, <symbol>stable/9/</symbol>, se ramifico de <emphasis>-CURRENT</emphasis> en Septiembre del 2011.

source: Can I follow <emphasis>-CURRENT</emphasis> with limited Internet access?
es_es: ¿Puedo seguir <emphasis>-CURRENT</emphasis> con una conexión a Internet limitada?

source: Yes, this can be done <emphasis>without</emphasis> downloading the whole source tree by using the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/synching.html#ctm">CTM facility</link>.
es_es: Si, esto puede hacerse <emphasis>sin</emphasis> descargar el árbol de código fuente entero usando la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/synching.html#ctm">utilidad CTM</link>.

source: I have written a kernel extension, who do I send it to?
de_de: Ich habe eine Kernelerweiterung geschrieben. An wen sende ich sie?
es_es: He escrito una extensión para el kernel ¿A quien se la envío?

source: Take a look at the article on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">Contributing to FreeBSD</link> to learn how to submit code.
de_de: Lesen Sie den Artikel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/articles/contributing/article.html">FreeBSD unterstützen</link>.
es_es: Vea el artículo en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">Contribuyendo a FreeBSD</link> para aprender como enviar código.

source: And thanks for the thought!
de_de: Und Danke, dass Sie darüber nachdenken!
es_es: ¡Y gracias por haberlo pensado!
pt_br: E obrigado por considerar nos ajudar!

source: How can I make the most of the data I see when my kernel panics?
de_de: Wie kann ich optimalen Nutzen aus einer kernel panic ziehen?
es_es: ¿Como puedo aprovechar al máximo los datos que veo cuando mi kernel tiene un pánico?
pt_br: Como posso aproveitar ao máximo os dados que vejo quando meu kernel entra em panic?

source: Here is typical kernel panic:
de_de: Hier ist eine typische Kernel-Panic:
es_es: Este es un típico pánico de kernel:
pt_br: Aqui está um panic típico do kernel:

source: This message is not enough. While the instruction pointer value is important, it is also configuration dependent as it varies depending on the kernel image. If it is a <filename>GENERIC</filename> kernel image from one of the snapshots, it is possible for somebody else to track down the offending function, but for a custom kernel, only you can tell us where the fault occurred.
de_de: Bei Meldungen wie dieser, reicht es nicht, sie einfach zu reproduzieren und sie einzusenden. Der Wert des Instruktionszeigers ist wichtig; leider ist er auch konfigurationsabhängig. Mit anderen Worten variieren die Werte abhängig von dem Kernel-Image, das Sie tatsächlich benutzen. Wenn Sie ein <filename>GENERIC</filename> Kernelimage von einem der Snapshots benutzen, dann ist es für jemand anderen möglich, die fehlerhafte Instruktion herauszufinden, aber wenn Sie einen angepassten Kernel benutzen, können nur <emphasis>Sie</emphasis> uns sagen, wo der Fehler auftrat.
es_es: Este mensaje no es suficiente. Mientras que el valor del puntero de instrucción es importante, también depende de la configuración varía en cada imagen de kernel. Si es un kernel <filename>GENERIC</filename> desde uno de los snapshots, es posible que alguien más rastree la función problemática, pero para un kernel personalizado, solo usted puede decirnos donde ocurrió el fallo.
pt_br: Esta mensagem não é suficiente. Embora o valor do ponteiro de instrução seja importante, ele também depende da configuração, pois varia dependendo da imagem do kernel. Se for uma imagem de kernel <filename>GENERIC</filename> de um dos snapshots, é possível que alguém rastreie a função problemática, mas para um kernel personalizado, somente você pode nos dizer onde a falha ocorreu.

source: To proceed:
de_de: Was Sie tun sollten, ist folgendes:
es_es: Para proceder:
pt_br: Para prosseguir:

source: Write down the instruction pointer value. Note that the <literal>0x8:</literal> part at the beginning is not significant in this case: it is the <literal>0xf0xxxxxx</literal> part that we want.
de_de: Notieren Sie sich den Wert des Instruktionszeigers. Beachten Sie, dass der Teil <literal>0x8:</literal> am Anfang in diesem Fall nicht von Bedeutung ist; der Teil <literal>0xf0xxxxxx</literal> ist der, den wir wollen.
es_es: Anote el valor del puntero de instrucción. Note que la parte <literal>0x8:</literal> al inicio no es importante en este caso: es la parte <literal>0xf0xxxxxx</literal> la que nos interesa.
pt_br: Anote o valor do ponteiro de instrução. Note que a parte <literal>0x8:</literal> no começo não é relevante neste caso: é a parte <literal>0xf0xxxxxx</literal> que nós queremos.

source: When the system reboots, do the following:
de_de: Tun Sie folgendes, wenn das System rebootet:
es_es: Cuando el sistema reinicie, haga lo siguiente:
pt_br: Quando o sistema for reinicializado, faça o seguinte:

source: <prompt>%</prompt> <userinput>nm -n kernel.that.caused.the.panic | grep f0xxxxxx</userinput>
es_es: <prompt>%</prompt> <userinput>nm -n kernel.que.causo.el.panico | grep f0xxxxxx</userinput>

source: where <literal>f0xxxxxx</literal> is the instruction pointer value. The odds are you will not get an exact match since the symbols in the kernel symbol table are for the entry points of functions and the instruction pointer address will be somewhere inside a function, not at the start. If you do not get an exact match, omit the last digit from the instruction pointer value and try again:
de_de: wobei <literal>0xf0xxxxxx</literal> der Wert des Instruktionszeigers ist. Es besteht die Möglichkeit, dass Sie keinen exakten Treffer erzielen, weil die Symbole in der Symboltabelle des Kernels Funktionseinstiegspunkte sind und die Adresse des Instruktionszeigers irgendwo innerhalb einer Funktion liegen wird und nicht am Anfang. Falls sie keinen exakten Treffer erzielen, lassen Sie den letzten Teil des Werts des Instruktionszeigers weg und versuchen es noch einmal, z.B.:
es_es: donde <literal>f0xxxxxx</literal> es el valor del puntero de instrucción. Lo más probable es que no consiga una coincidencia exacta dado que los símbolos en la tabla de símbolos del kernel son para puntos de entrada de las funciones y la dirección del puntero de instrucción estará en algún lugar adentro de una función, no al inicio. Si no consigue una coincidencia exacta, omita el último dígito del valor del puntero de instrucción e inténtelo nuevamente:
pt_br: no qual <literal>f0xxxxxx</literal> é o valor do ponteiro de instrução. As probabilidades são de que você não obterá uma correspondência exata, pois os símbolos na tabela de símbolos do kernel são para os pontos de entrada das funções e o endereço do ponteiro de instrução estará em algum lugar dentro de uma função, não no início. Se você não obtiver uma correspondência exata, omita o último dígito do valor do ponteiro de instrução e tente novamente:

source: <prompt>%</prompt> <userinput>nm -n kernel.that.caused.the.panic | grep f0xxxxx</userinput>
es_es: <prompt>%</prompt> <userinput>nm -n kernel.que.causo.el.panico | grep f0xxxxx</userinput>

source: If that does not yield any results, chop off another digit. Repeat until there is some sort of output. The result will be a possible list of functions which caused the panic. This is a less than exact mechanism for tracking down the point of failure, but it is better than nothing.
de_de: Falls das kein Ergebnis liefert, hacken Sie eine weitere Ziffer ab. Wiederholen Sie die Schritte, bis Sie irgendeine Ausgabe erhalten. Das Ergebnis wird eine Liste möglicher Funktionen sein, die die Panik verursacht haben. Das ist zwar kein absolut genauer Mechanismus, um die Fehlerursache ausfindig zu machen, aber es ist besser als gar nichts.
es_es: Si eso no arroja ningún resultado, elimine otro dígito. Repita hasta que haya algún tipo de salida. El resultado será una lista de posibles funciones que causaron el pánico. Este es un mecanismo poco exacto para rastrear el punto de fallo, pero es mejor que nada.
pt_br: Se isso não produzir nenhum resultado, corte outro dígito. Repita até que haja algum tipo de saída. O resultado será uma possível lista das funções que causaram o panic. Este é um mecanismo menos do que exato para rastrear o ponto de falha, mas é melhor do que nada.

source: However, the best way to track down the cause of a panic is by capturing a crash dump, then using <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> to generate a stack trace on the crash dump.
de_de: Wie dem auch sei, der beste Weg, den Grund für eine Panik herauszufinden, ist der, einen Crash-Dump festzuhalten und dann <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> zu benutzen, um den Stack im Crash-Dump zurückzuverfolgen.
es_es: Sin embargo, la mejor manera de rastrear la causa del pánico es capturando un volcado de fallos, y luego usando <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para generar un seguimiento de pila sobre el volcado de fallos.
pt_br: No entanto, a melhor maneira de rastrear a causa de um panic é capturar um despejo de memória e usar o <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para gerar um rastreamento de pilha no despejo de memória.

source: In any case, the method is this:
de_de: Jedenfalls funktioniert die Methode wie folgt:
es_es: En cualquier caso, el método es este:
pt_br: Em qualquer caso, o método é este:

source: Make sure that the following line is included in the kernel configuration file:
de_de: Sorgen Sie dafür, dass die folgende Zeile in der Kernelkonfigurationsdatei enthalten ist:
es_es: Asegúrese de que la siguiente línea esta incluida en el archivo de configuración del kernel:
pt_br: Certifique-se de que a seguinte linha esteja incluída no arquivo de configuração do kernel:

source: Change to the <filename>/usr/src</filename> directory:
de_de: Wechseln Sie in das Verzeichnis <filename>/usr/src</filename>:
es_es: Cambie el directorio a <filename>/usr/src</filename>:
pt_br: Mude para o diretório <filename>/usr/src</filename>:

source: Compile the kernel:
de_de: Erstellen Sie den Kernel:
es_es: Compile el kernel:
pt_br: Compile o kernel:

source: Wait for <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> to finish compiling.
de_de: Warten Sie, bis <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> den Kernel fertig kompiliert hat.
es_es: Espere a que <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> termine de compilar.
pt_br: Aguarde até o <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> terminar a compilação.

source: Reboot.
de_de: Starten Sie das System neu.
es_es: Reinicie.
pt_br: Reinicie.
