Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: FreeBSD supports EIDE, SATA, SCSI, and SAS drives (with a compatible controller; see the next section), and all drives using the original <quote>Western Digital</quote> interface (MFM, RLL, ESDI, and of course IDE). A few ESDI controllers that use proprietary interfaces may not work: stick to WD1002/3/6/7 interfaces and clones.
de_de: FreeBSD unterstützt EIDE-, SATA-, SCSI- und SAS-Laufwerke (mit kompatiblen Controllern - siehe folgenden Abschnitt), sowie alle Laufwerke, die die original <quote>Western Digital</quote>-Schnittstelle (MFM, RLL, ESDI und natürlich IDE) benutzen. Ein paar ESDI-Controller benutzen proprietäre Schnittstellen und laufen eventuell nicht: halten Sie sich an WD1002/3/6/7-Schnittstellen und Clones.
es_es: FreeBSD soporta discos EIDE, SATA, SCSI y SAS (con un controlador compatible; vea la siguiente sección), y todos los dispositivos que usen la interfaz original de <quote>Western Digital</quote> (MFM, RLL, ESDI, y por supuesto IDE). Algunos controladores ESDI que usan interfaces propietarias pueden no funcionar: quédese con las interfaces WD1002/3/6/7 y clones.
pt_br: O FreeBSD suporta unidades EIDE, SATA, SCSI e SAS (com um controlador compatível; veja a próxima seção), e todas as unidades usando a interface original da <quote>Western Digital</quote> (MFM, RLL, ESDI e, é claro, IDE). Alguns controladores ESDI que usam interfaces proprietárias podem não funcionar: use interfaces e clones WD1002/3/6/7.

source: Which SCSI or SAS controllers are supported?
de_de: Welche SCSI- oder SAS-Controller werden unterstützt?
es_es: ¿Qué controladores SCSI o SAS están soportados?
pt_br: Quais controladores SCSI ou SAS são suportados?

source: See the complete list in the Hardware Notes for FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/10.2R/hardware.html">10.2</link> or <link xlink:href="http://www.FreeBSD.org/releases/9.3R/hardware.html">9.3</link>.
es_es: Vea la lista completa en las Notas de hardware para FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/10.2R/hardware.html"> 10.2 </link> o <link xlink:href="http://www.FreeBSD.org/releases/9.3R/hardware.html"> 9.3 </link> .

source: What types of tape drives are supported?
de_de: Welche Arten von Bandlaufwerken werden unterstützt?
es_es: ¿Qué tipo de unidades de cinta están soportadas?
pt_br: Quais tipos de unidades de fita são suportados?

source: FreeBSD supports all standard SCSI tape interfaces.
de_de: FreeBSD unterstützt alle gängigen SCSI-Bandlaufwerke
es_es: FreeBSD soporta todas las interfaces de cinta SCSI estándar.
pt_br: O FreeBSD suporta todas as interfaces de fita SCSI padrão.

source: Does FreeBSD support tape changers?
de_de: Unterstützt FreeBSD Bandwechsler?
es_es: ¿Soporta FreeBSD cambiadores de cinta?
pt_br: O FreeBSD suporta trocadores de fita (tape changers)?

source: FreeBSD supports SCSI changers using the <citerefentry><refentrytitle>ch</refentrytitle><manvolnum>4</manvolnum></citerefentry> device and the <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry> command. The details of how to control the changer can be found in <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: FreeBSD unterstützt SCSI-Bandwechsler über das Gerät <citerefentry><refentrytitle>ch</refentrytitle><manvolnum>4</manvolnum></citerefentry> und das Kommando <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Details zum Betrieb des Wechslers finden Sie in <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: FreeBSD soporta cambiadores SCSI utilizando el dispositivo <citerefentry><refentrytitle>ch</refentrytitle><manvolnum> 4 </manvolnum></citerefentry> y el comando<citerefentry><refentrytitle>chio</refentrytitle><manvolnum> 1 </manvolnum></citerefentry>. Los detalles acerca de cómo controlar el cambiador se pueden encontrar en <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: O FreeBSD suporta trocadores SCSI usando o dispositivo <citerefentry><refentrytitle>ch</refentrytitle><manvolnum>4</manvolnum></citerefentry> e o comando <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Os detalhes de como controlar o trocador podem ser encontrados em <citerefentry><refentrytitle>chio</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: While <application>AMANDA</application> and some other products already understands changers, other applications only know how to move a tape from one point to another. In this case, keep track of which slot a tape is in and which slot the tape currently in the drive needs to go back to.
de_de: Falls Sie nicht <application>AMANDA</application> oder ein anderes Produkt benutzen, das den Wechsler bereits kennt, bedenken Sie, dass die Programme nur wissen, wie sie ein Band von einem Punkt zu einem anderen bewegen müssen. Sie selbst müssen sich also merken, in welchem Einschub sich ein Band befindet und zu welchem Einschub das Band, das sich gerade im Laufwerk befindet, zurück muss.
es_es: Mientras que <application>AMANDA</application> y algunos otros productos entienden acerca de los cambiadores, otras aplicaciones solo saben como mover una cinta de un punto a otro. En este caso, lleve la cuenta de en que ranura esta la cinta actualmente y a que unidad necesita ir nuevamente el dispositivo.
pt_br: Embora o <application>AMANDA</application> e alguns outros produtos já entendam os trocadores, outros aplicativos só sabem como mover uma fita de um ponto para outro. Nesse caso, rastreie em qual slot uma fita está e para qual slot a fita que está atualmente na unidade precisa voltar.

source: Which CD-ROM and CD-RW drives are supported by FreeBSD?
de_de: Welche CD-ROM-Laufwerke werden von FreeBSD unterstützt?
es_es: ¿Qué dispositivos de CD-ROM y CD-RW están soportados por FreeBSD?
pt_br: Quais drives de CD-ROM e CD-RW são suportados pelo FreeBSD?

source: Any SCSI drive connected to a supported controller is supported. Most ATAPI compatible IDE CD-ROMs are supported.
de_de: Jedes an einem unterstützten Controller angeschlossene SCSI-Laufwerk wird unterstützt. Zudem werden die meisten ATAPI kompatiblen IDE CD-ROMs unterstützt.
es_es: Cualquier unidad SCSI drive connectada a un controlador soportado esta soportada. La mayoría de los CD-ROMs ATAPI compatibles con IDE están soportados.
pt_br: Qualquer unidade SCSI conectada a um controlador suportado é suportada. A maioria dos CD-ROMs IDE compatíveis com ATAPI é suportada.

source: FreeBSD supports any ATAPI-compatible IDE CD-R or CD-RW drive. See <citerefentry><refentrytitle>burncd</refentrytitle><manvolnum>8</manvolnum></citerefentry> for details.
de_de: FreeBSD unterstützt jedes ATAPI kompatible IDE CD-R- oder CD-RW-Laufwerk. Weitere Details finden Sie in der Manualpage <citerefentry><refentrytitle>burncd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: FreeBSD soporta cualquier CD-R o CD-RW compatible con ATAPI. Vea <citerefentry><refentrytitle>burncd</refentrytitle><manvolnum>8</manvolnum></citerefentry> para más detalles.

source: FreeBSD also supports any SCSI CD-R or CD-RW drives. Install the <package>sysutils/cdrtools</package> port or package, then use <command>cdrecord</command>.
de_de: FreeBSD unterstützt zudem jedes SCSI CD-R- oder CD-RW-Laufwerk. Installieren Sie den Port oder das Paket <package>sysutils/cdrtools</package> und benutzen Sie dann <command>cdrecord</command>.
es_es: FreeBSD también soporta cualquier tipo de dispositivos CSI CD-R o CD-RW. Instale el port o paquete de <package>sysutils/cdrtools</package>, y luego use el comando <command>cdrecord</command>.
pt_br: O FreeBSD também suporta qualquer unidade de CD-R ou CD-RW SCSI. Instale o port ou pacote do <package> sysutils/cdrtools</package> e, em seguida, use o <command> cdrecord </command>.

source: Keyboards and Mice
de_de: Tastaturen und Mäuse
es_es: Teclados y Ratones
pt_br: Teclados e Mouses

source: Is it possible to use a mouse outside the X Window system?
de_de: Kann die Maus außerhalb des X Window Systems benutzt werden?
es_es: ¿Es posible usar un ratón por fuera del sistema X Window?
pt_br: É possível usar um mouse fora do sistema X Window?

source: The default console driver, <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, provides the ability to use a mouse pointer in text consoles to cut &amp; paste text. Run the mouse daemon, <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and turn on the mouse pointer in the virtual console:
de_de: Falls Sie den Konsolentreiber <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> benutzen, können Sie den Mauszeiger auf Textkonsolen zum Kopieren und Einfügen von Text verwenden. Starten Sie den Mausdaemon <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> und schalten Sie den Mauszeiger auf der virtuellen Konsole ein:
es_es: El controlador de consola por defecto, <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, provee la habilidad de usar un puntero del ratón en consolas de texto para copiar &amp; pegar texto. Corra el demonio del ratón, <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>, e inicie el puntero del ratón en la consola virtual:
pt_br: O driver de console padrão, <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, fornece a capacidade de usar um ponteiro de mouse em consoles de texto para cortar &amp; colar o texto. Execute o daemon do mouse, <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum> </citerefentry> e ative o ponteiro do mouse no console virtual:

source: Where <replaceable>xxxx</replaceable> is the mouse device name and <replaceable>yyyy</replaceable> is a protocol type for the mouse. The mouse daemon can automatically determine the protocol type of most mice, except old serial mice. Specify the <literal>auto</literal> protocol to invoke automatic detection. If automatic detection does not work, see the <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page for a list of supported protocol types.
de_de: <replaceable>xxxx</replaceable> ist der Gerätename der Maus und <replaceable>yyyy</replaceable> ist das Protokoll. Der Mausdaemon erkennt die Protokolle der meisten Mäuse (mit Ausnahme alter serieller Mäuse) automatisch, wenn Sie <literal>auto</literal> für das Protokoll angeben. Falls das Protokoll nicht automatisch erkannt wird, finden Sie die unterstützten Protokolle in der <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> Manualpage.
es_es: Donde <replaceable>xxxx</replaceable> es el nombre del dispositivo del ratón y <replaceable>yyyy</replaceable> es un tipo de protocolo para el ratón. El demonio del ratón puede automáticamente determinar el protocolo para la mayoría de los ratones, con excepción del los viejos ratones en serie. Especifique el protocolo <literal>auto</literal> para invocar la detección automática. Si la detección automática no funciona, vea la pagina de manual de <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> para una lista de tipos de protocolo soportados.
pt_br: No qual <replaceable>xxxx</replaceable> é o nome do dispositivo de mouse e <replaceable>yyyy</replaceable> é o tipo de protocolo para o mouse. O daemon do mouse pode determinar automaticamente o tipo de protocolo da maioria dos mouses, exceto antigos mouses seriais. Especifique o protocolo <literal>auto</literal> para invocar a detecção automática. Se a detecção automática não funcionar, consulte a página de manual <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> para obter uma lista dos tipos de protocolos suportados.

source: For a PS/2 mouse, add <literal>moused_enable="YES"</literal> to <filename>/etc/rc.conf</filename> to start the mouse daemon at boot time. Additionally, to use the mouse daemon on all virtual terminals instead of just the console, add <literal>allscreens_flags="-m on"</literal> to <filename>/etc/rc.conf</filename>.
de_de: Wenn Sie eine PS/2-Maus besitzen und diese beim Systemstart aktivieren wollen, fügen Sie <literal>moused_enable="YES"</literal> in <filename>/etc/rc.conf</filename> ein. Falls Sie den Mausdaemon auf allen virtuellen Bildschirmen anstatt nur auf der Konsole benutzen wollen, tragen Sie außerdem <literal>allscreens_flags="-m on"</literal> in <filename>/etc/rc.conf</filename> ein.
es_es: Para un ratón PS/2 mouse, aÑADA <literal>moused_enable="YES"</literal> a <filename>/etc/rc.conf</filename> para iniciar el demonio del ratón en tiempo de arranque. Adicionalmente, para usar el demonio del ratón en todas las terminales virtuales, en lugar de solo en la consola, añada <literal>allscreens_flags="-m on"</literal> a <filename>/etc/rc.conf</filename>.
pt_br: Para um mouse PS/2, adicione <literal>moused_enable="YES"</literal> ao arquivo <filename>/etc/rc.conf</filename> para iniciar o daemon do mouse no momento da inicialização. Além disso, para usar o daemon do mouse em todos os terminais virtuais em vez de apenas no console, adicione <literal>allscreens_flags="-m on"</literal> ao arquivo <filename>/etc/rc.conf</filename>.

source: When the mouse daemon is running, access to the mouse must be coordinated between the mouse daemon and other programs such as X Windows. Refer to the <acronym>FAQ</acronym> <link linkend="x-and-moused">Why does my mouse not work with X?</link> for more details on this issue.
de_de: Während der Mausdaemon läuft, muss der Zugriff auf die Maus zwischen dem Mausdaemon und anderen Programmen, wie X Windows, koordiniert werden. Die <acronym>FAQ</acronym> <link linkend="x-and-moused">Warum funktioniert meine meine Maus unter X nicht?</link> enthält weitere Details.
es_es: Cuando el demonio del ratón este corriendo, el acceso al mouse debe ser coordinado entre el demonio del ratón y otros programas tales como X Windows. Vea el <acronym>FAQ</acronym> <link linkend="x-and-moused">¿Porque mi mouse no funciona con X?</link> para más detalles acerca del problema.
pt_br: Quando o daemon do mouse está em execução, o acesso ao mouse deve ser coordenado entre o daemon do mouse e outros programas, tais como o X Windows. Consulte o <acronym>FAQ</acronym> <link linkend="x-and-moused"> Por que meu mouse não funciona com o X?</link> para obter mais detalhes sobre esse problema.

source: How do I cut and paste text with a mouse in the text console?
de_de: Wie funktioniert das Kopieren und Einfügen von Text mit der Maus auf einer Textkonsole?
es_es: ¿Como copio y pego texto con un ratón en la consola de texto?
pt_br: Como faço para cortar e colar texto com um mouse no console de texto?

source: It is not possible to remove data using the mouse. However, it is possible to copy and paste. Once the mouse daemon is running as described in the <link linkend="moused">previous question</link>, hold down button 1 (left button) and move the mouse to select a region of text. Then, press button 2 (middle button) to paste it at the text cursor. Pressing button 3 (right button) will <quote>extend</quote> the selected region of text.
de_de: Sobald der Mausdaemon ausgeführt, wie in der <link linkend="moused">vorherigen Frage</link> beschrieben, ausgeführt wird, können Sie die linke Maustaste benutzen um Text zu kopieren. Drücken Sie dann die mittlere Maustaste, um den Text an der Cursorposition einzufügen. Mit der rechten Maustaste kann der markierte Bereich <quote>erweitert</quote> werden.
es_es: No es posible remover datos usando el ratón. No obstante, es posible copiar y pegar. Una vez que el demonio del ratón este corriendo como se describió en la <link linkend="moused">pregunta anterior</link>, presión el botón 1 (botón izquierdo)y mueva el ratón para seleccionar una región de texto. Luego presione el botón 2 (botón del medio) y para pegar en la posición del cursor de texto. Presionar el botón 3 (botón derecho) <quote>extenderá</quote> la región de texto seleccionada.
pt_br: Não é possível remover (cortar) dados usando o mouse. No entanto, é possível copiar e colar. Quando o daemon do mouse estiver em execução, conforme descrito na <link linkend="moused">pergunta anterior</link>, mantenha pressionado o botão 1 (botão esquerdo) e mova o mouse para selecionar uma região do texto. Em seguida, pressione o botão 2 (botão do meio) para colar no cursor de texto. Pressionar o botão 3 (botão direito) irá <quote> estender </quote> a região selecionada do texto.

source: If the mouse does not have a middle button, it is possible to emulate one or remap buttons using mouse daemon options. See the <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page for details.
de_de: Wenn Sie keine 3-Tasten-Maus besitzen, können Sie die mittlere Maustaste mit einer Tastenkombination emulieren oder die Funktion der mittleren Taste auf eine andere Taste legen. Einzelheiten dazu enthält die Manualpage <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: Si el ratón no tiene botón del medio, es posible emular uno o remapear botones utilizando opciones del demonio del ratón. Vea la <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> pagina del manual para detalles.
pt_br: Se o mouse não tiver um botão do meio, é possível emular um ou remapear os botões usando as opções do daemon do mouse. Consulte a página de manual <citerefentry><refentrytitle>moused</refentrytitle><manvolnum>8</manvolnum></citerefentry> para obter detalhes.

source: My mouse has a fancy wheel and buttons. Can I use them in FreeBSD?
de_de: Meine Maus hat ein neumodisches Rad und mehr Knöpfe. Kann ich sie in FreeBSD benutzen?
es_es: Mi ratón tiene una reluciente rueda y botones. ¿Puedo usarlos en FreeBSD?
pt_br: Meu mouse tem uma roda e botões extravagantes. Posso usá-los no FreeBSD?

source: The answer is, unfortunately, <quote>It depends</quote>. These mice with additional features require specialized driver in most cases. Unless the mouse device driver or the user program has specific support for the mouse, it will act just like a standard two, or three button mouse.
de_de: Unglücklicherweise lautet die Antwort: <quote>Vielleicht</quote>. Solche Mäuse mit zusätzlichen Extras erfordern in den meisten Fällen spezielle Treiber. Wenn der Gerätetreiber für die Maus oder das Anwendungsprogramm keine spezielle Unterstützung für die Maus bietet, wird sie sich wie eine gewöhnliche Maus mit zwei oder drei Knöpfen verhalten.
es_es: La respuesta a eso es, desafortunadamente, <quote>depende</quote>. Estos ratones con características adicionales requieren un controlador especializado en la mayoría de los casos. A menos que el dispositivo del ratón o el programa de usuario tenga soporte especifico para el ratón, el mismo actuara como un ratón normal de dos o tres botones.
pt_br: A resposta é, infelizmente, <quote>Depende</quote>. Esses mouses com recursos adicionais exigem um driver especializado na maioria dos casos. A menos que o driver do dispositivo do mouse ou o programa do usuário tenha suporte específico para o mouse, ele funcionará exatamente como um mouse padrão de dois ou três botões.

source: For the possible usage of wheels in the X Window environment, refer to <link linkend="x-and-wheel">that section</link>.
de_de: Ob und wie Sie das Rad unter X benutzen können, können Sie im <link linkend="x-and-wheel">passenden Abschnitt</link> der FAQ erfahren.
es_es: Para el posible uso de ruedas en el ambiente X Window, refiérase a <link linkend="x-and-wheel">esa sección</link>.
pt_br: Para o possível uso de rodas do mouse no ambiente X Window, consulte <link linkend="x-and-wheel">essa seção</link>.

source: How do I use my delete key in <command>sh</command> and <command>csh</command>?
de_de: Wie kann ich die Delete-Taste in der <command>sh</command> und <command>csh</command> einsetzen?
es_es: ¿Como uso la tecla delete en <command>sh</command> y <command>csh</command>?
pt_br: Como eu uso a minha tecla de delete no <command>sh</command> e <command>csh</command>?

source: For the <application>Bourne Shell</application>, add the following lines to <filename>~/.shrc</filename>. See <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>editrc</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
de_de: Für die <application>Bourne Shell</application> fügen Sie die folgende Zeile in <filename>.shrc</filename> ein. Lesen Sie dazu auch die Manualpages <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>editrc</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: Para <application>Bourne Shell</application>, agregue las siguientes líneas a <filename>~/.shrc</filename>. Vea <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>editrc</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
pt_br: Para o <application>Bourne Shell</application>, inclua as seguintes linhas no arquivo <filename>~/.shrc</filename>. Veja <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry> <refentrytitle>editrc</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: For the <application>C Shell</application>, add the following lines to <filename>~/.cshrc</filename>. See <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: Für die <application>C Shell</application> nehmen Sie hingegen die folgende Zeile in <filename>.cshrc</filename>. Lesen Sie dazu auch die Manualpage <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Para <application>C Shell</application>, agregue las siguientes líneas a <filename>~/.cshrc</filename>. Vea <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Para o <application>C Shell</application>, adicione as seguintes linhas ao <filename>~/.cshrc</filename>. Veja <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: For more information, see <link xlink:href="http://www.ibb.net/~anne/keyboard.html">this page</link>.
de_de: Weitere Informationen zu diesem Thema finden Sie auf <link xlink:href="http://www.ibb.net/~anne/keyboard.html">dieser Seite</link>.
es_es: Para más información, vea <link xlink:href="http://www.ibb.net/~anne/keyboard.html">esta página</link>.
pt_br: Para maiores informações, consulte <link xlink:href="http://www.ibb.net/~anne/keyboard.html"> esta página </link>.

source: Other Hardware
de_de: Sonstige Hardware
es_es: Otro Hardware
pt_br: Outro hardware

source: Workarounds for no sound from my <citerefentry><refentrytitle>pcm</refentrytitle><manvolnum>4</manvolnum></citerefentry> sound card?
de_de: Abhilfe für fehlenden Sound bei Verwendung des <citerefentry><refentrytitle>pcm</refentrytitle><manvolnum>4</manvolnum></citerefentry>-Treibers?
es_es: ¿Soluciones para cuando mi tarjeta de audio <citerefentry><refentrytitle>pcm</refentrytitle><manvolnum>4</manvolnum></citerefentry> no emite sonidos?
pt_br: Algum workaround para o problema de não sair nenhum som da minha placa de som <citerefentry><refentrytitle>pcm</refentrytitle><manvolnum>4</manvolnum></citerefentry>?
