Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: There are two schools of thought on how to start <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry>. One school starts <command>xdm</command> from <filename>/etc/ttys</filename> (see <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) using the supplied example, while the other runs <command>xdm</command> from <filename>rc.local</filename> (see <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>) or from an <filename>X</filename> script in <filename>/usr/local/etc/rc.d</filename>. Both are equally valid, and one may work in situations where the other does not. In both cases the result is the same: X will pop up a graphical login prompt.
de_de: Es gibt zwei Denkansätze, wie <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> zu starten ist. Bei dem einen wird <command>xdm</command> unter Nutzung des mitgelieferten Beispiels über <filename>/etc/ttys</filename> (siehe <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) gestartet, während beim zweiten Ansatz <filename>rc.local</filename> (siehe <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>) oder das Skript <filename>X</filename> aus <filename>/usr/local/etc/rc.d</filename> verwendet wird. Beide Ansätze sind gleichwertig und der eine wird in Situationen funktionieren, in denen der andere es nicht tut. In beiden Fällen ist das Ergebnis das gleiche: X liefert eine graphische Anmeldeaufforderung.
es_es: Hay dos escuelas de pensamiento acerca de como arrancar <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Una escuela arranca <command>xdm</command> desde <filename>/etc/ttys</filename> (see <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) usando el ejemplo provisto, mientras la otra corre <command>xdm</command> desde <filename>rc.local</filename> (see <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>) o desde un script de <filename>X</filename> en <filename>/usr/local/etc/rc.d</filename>. Ambas son igualmente válidas, y una puede funcionar en situaciones donde la otra no. En ambos casos el resultado es el mismo: X mostrara un indicador de inicio gráfico.
pt_br: Existem duas escolas de pensamento sobre como iniciar o <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Uma escola inicia o <command>xdm</command> a partir do <filename>/etc/ttys</filename> (veja <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) usando o exemplo fornecido, enquanto o outro executa o <command>xdm</command> a partir do <filename>rc.local</filename> (veja <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>) ou de um script <filename>X</filename> localizado em <filename>/usr/local/etc/rc.d</filename>. Ambos são igualmente válidos, e um pode funcionar em situações em que o outro não funciona. Em ambos os casos, o resultado é o mesmo: O X mostrará um prompt de login gráfico.

source: The <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry> method has the advantage of documenting which vty X will start on and passing the responsibility of restarting the X server on logout to <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>. The <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> method makes it easy to <command>kill</command> <command>xdm</command> if there is a problem starting the X server.
de_de: Die <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>-Methode hat den Vorteil, dass dokumentiert ist, auf welchem vty X gestartet wird und der Neustart des X-Servers beim Abmelden an <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> übergeben wird. Die <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Methode erleichtert den Aufruf von <command>kill</command> <command>xdm</command>, falls Probleme beim Start des X-Servers auftreten sollten.
es_es: El método <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry> tiene la ventaja de documentar en que vty iniciara X will y pasar la responsabilidad de reiniciar el servidor X al desloguearse a <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>. El método <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> hace que sea fácil hacer <command>kill</command> a <command>xdm</command> si hay un problema arrancando el servidor X.
pt_br: O método <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry> tem a vantagem de documentar qual vty X iniciará e passando a responsabilidade de reiniciar o servidor X no logout para o <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>. O método <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> facilita o <command>kill</command> <command>xdm</command> se houver um problema ao iniciar o servidor X.

source: If loaded from <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <command>xdm</command> should be started without any arguments. <command>xdm</command> must start <emphasis>after</emphasis> <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> runs, or else <command>getty</command> and <command>xdm</command> will conflict, locking out the console. The best way around this is to have the script sleep 10 seconds or so then launch <command>xdm</command>.
de_de: Beim Laden von <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, sollte <command>xdm</command> ohne irgendwelche Argumente (das heißt als Daemon) gestartet werden. <command>xdm</command> muss gestartet werden <emphasis>nachdem</emphasis> <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> läuft, andernfalls entsteht ein Konflikt zwischen <command>getty</command> und <command>xdm</command> und die Konsole bleibt gesperrt. Der beste Weg, um dies zu vermeiden, ist, das Skript für etwa zehn Sekunden anzuhalten und dann <command>xdm</command> zu starten.
es_es: Si se carga desde <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <command>xdm</command> debería iniciarse sin argumentos. <command>xdm</command> debe arrancar <emphasis>luego</emphasis> de que corra <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o de lo contrario <command>getty</command> y <command>xdm</command> estarán en conflicto, bloqueando la consola. La mejor manera de solucionar esto es hacer que el script duerma por 10 segundos y luego inicie <command>xdm</command>.
pt_br: Se carregado pelo <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o <command>xdm</command> deve ser iniciado sem nenhum argumento. <command>xdm</command> deve iniciar <emphasis>após</emphasis> o <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> ser executado, ou então <command>getty</command> e <command>xdm</command> entrarão em conflito, bloqueando o console. A melhor maneira de contornar isso é fazer com que o script espere 10 segundos ou mais e, em seguida, iniciar o <command>xdm</command>.

source: When starting <command>xdm</command> from <filename>/etc/ttys</filename>, there still is a chance of conflict between <command>xdm</command> and <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>. One way to avoid this is to add the <literal>vt</literal> number in <filename>/usr/local/lib/X11/xdm/Xservers</filename>:
de_de: Wenn Sie <command>xdm</command> durch einen Eintrag in <filename>/etc/ttys</filename> starten lassen, kann es zu einem Konflikt zwischen <command>xdm</command> und <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> kommen. Um dieses Problem zu vermeiden, sollten Sie die Nummer des <literal>vt</literal> in <filename>/usr/local/lib/X11/xdm/Xservers</filename> eintragen:
es_es: Al iniciar <command>xdm</command> desde <filename>/etc/ttys</filename>, aún hay una posibilidad de conflicto entre <command>xdm</command> y <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Una manera de evitar esto es añadir el número de <literal>vt</literal> en <filename>/usr/local/lib/X11/xdm/Xservers</filename>:
pt_br: Ao iniciar o <command>xdm</command> pelo <filename>/etc/ttys</filename>, ainda há uma chance de conflito entre <command>xdm</command> e <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Uma maneira de evitar isso é adicionar o número <literal> vt </literal> no arquivo <filename>/usr/local/lib/X11/xdm/Xservers</filename>:

source: The above example will direct the X server to run in <filename>/dev/ttyv3</filename>. Note the number is offset by one. The X server counts the vty from one, whereas the FreeBSD kernel numbers the vty from zero.
de_de: Diese Zeile führt dazu, dass der X Server <filename>/dev/ttyv3</filename> nutzt. Die beiden Zahlen weichen voneinander ab: Der X-Server beginnt die Zählung der vty bei 1, während der FreeBSD-Kernel bei 0 beginnt.
es_es: El ejemplo de arriba indicara al servidor X que corra en <filename>/dev/ttyv3</filename>. Note que el número es mayor en uno. El servidor X cuenta la vty desde uno, mientras que el kernel de FreeBSD numera la vty desde cero.
pt_br: O exemplo acima irá direcionar o servidor X para ser executado em <filename>/dev/ttyv3</filename>. Observe que o número é compensado por um. O servidor X conta a vty a partir de 1, enquanto o kernel do FreeBSD numera a vty a partir de zero.

source: Why do I get <errorname>Couldn't open console</errorname> when I run <command>xconsole</command>?
de_de: Wieso erhalte ich die Meldung <errorname>Couldn't open console</errorname>, wenn ich <command>xconsole</command> starte?
es_es: ¿Porque obtengo <errorname>Couldn't open console</errorname> al correr <command>xconsole</command>?
pt_br: Por que eu obtenho o erro <errorname>Couldn't open console</errorname> quando executo o <command>xconsole</command>?

source: When <application>X</application> is started with <command>startx</command>, the permissions on <filename>/dev/console</filename> will <emphasis>not</emphasis> get changed, resulting in things like <command>xterm -C</command> and <command>xconsole</command> not working.
de_de: Wenn <application>X</application> mit <command>startx</command> gestartet wird, werden die Zugriffsrechte für <filename>/dev/console</filename> <emphasis>nicht</emphasis> geändert, was dazu führt, dass Dinge wie <command>xterm -C</command> und <command>xconsole</command> nicht funktionieren.
es_es: Cuando <application>X</application> se inicia con <command>startx</command>, los permisos en <filename>/dev/console</filename> <emphasis>no</emphasis> serán cambiados, lo que hace que cosas como <command>xterm -C</command> y <command>xconsole</command> no funcionen.
pt_br: Quando o <application>X</application> é iniciado com o comando <command>startx</command>, as permissões em <filename>/dev/console</filename> <emphasis>não</emphasis> serão alteradas, o que resultará um comportamento errático de algumas coisas tais como o não funcionamento do <command>xterm -C</command> e do <command>xconsole</command>.

source: This is because of the way console permissions are set by default. On a multi-user system, one does not necessarily want just any user to be able to write on the system console. For users who are logging directly onto a machine with a VTY, the <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry> file exists to solve such problems.
de_de: Das hängt damit zusammen, wie die Zugriffsrechte für die Konsole standardmäßig gesetzt sind. Auf einem Mehrbenutzersystem möchte man nicht unbedingt, dass jeder Benutzer einfach auf die Systemkonsole schreiben kann. Für Benutzer, die sich auf einer Maschine direkt mit einem VTY anmelden, existiert die Datei <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry>, um derartige Probleme zu lösen.
es_es: Esto es por la manera en que los permisos de consola están configurados por defecto. En un sistema multiusuario, uno no necesariamente quiere que cualquier usuario pueda escribir en la consola del sistema. Para usuarios que se están autenticando directamente en una maquina con una VTY, el archivo <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry> existe para resolver tales problemas.
pt_br: Isso ocorre devido à maneira como as permissões do console são definidas por padrão. Em um sistema multiusuário, não é necessário que qualquer usuário possa escrever no console do sistema. Para os usuários que estão logando diretamente em uma máquina com um VTY, existe o arquivo <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum></manvolnum></citerefentry> para resolver tais problemas.

source: In a nutshell, make sure an uncommented line of the form is in <filename>/etc/fbtab</filename> (see <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry>):
de_de: In Kürze: sorgen Sie dafür, dass sich in der Datei <filename>/etc/fbtab</filename> (siehe <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry>) eine nicht auskommentierte Zeile der folgenden Art befindet:
es_es: En resumen, asegurese de que una línea no comentada de esta forma se encuentre en <filename>/etc/fbtab</filename> (vea <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry>):
pt_br: Em poucas palavras, certifique-se de que uma linha não comentada do formulário esteja no <filename>/etc/fbtab</filename> (veja <citerefentry><refentrytitle>fbtab</refentrytitle><manvolnum>5</manvolnum></citerefentry>):

source: It will ensure that whomever logs in on <filename>/dev/ttyv0</filename> will own the console.
de_de: Das sorgt dafür, dass wer auch immer sich auf <filename>/dev/ttyv0</filename> anmeldet, auch die Konsole besitzt.
es_es: Se asegurara que quien sea que escriba un log en <filename>/dev/ttyv0</filename> sea el dueño de la consola.
pt_br: Ele irá garantir que quem fizer o login em <filename>/dev/ttyv0</filename> será o dono do console.

source: Why does my PS/2 mouse misbehave under X?
de_de: Warum funktioniert meine PS/2-Maus nicht richtig?
es_es: ¿Por qué mi mouse PS/2 se comporta mal bajo X?
pt_br: Por que meu mouse PS/2 não funciona direito no X?

source: The mouse and the mouse driver may have become out of synchronization. In rare cases, the driver may also erroneously report synchronization errors:
de_de: Ihre Maus und der Maustreiber sind vielleicht aus der Synchronisation geraten. In seltenen Fällen kann auch der Treiber irrtümlicherweise Synchronisationsprobleme melden:
es_es: El mouse y el controlador del mouse pueden haberse dessincronizado. En casos raros, el controlador puede también haber reportado erróneamente errores de sincronización:
pt_br: O mouse e o driver do mouse podem estar fora de sincronização. Em casos raros, o driver também pode relatar erroneamente erros de sincronização:

source: If this happens, disable the synchronization check code by setting the driver flags for the PS/2 mouse driver to <literal>0x100</literal>. This can be easiest achieved by adding <literal>hint.psm.0.flags="0x100"</literal> to <filename>/boot/loader.conf</filename> and rebooting.
de_de: Falls das passiert, deaktivieren Sie den Code zur Überprüfung der Synchronisation, indem Sie die Treiberangaben für den PS/2-Maustreiber auf <literal>0x100</literal> setzen. Dazu fügen Sie einfach <literal>hint.psm.0.flags="0x100"</literal> in <filename>/boot/loader.conf</filename> ein und starten das System anschließend neu.
es_es: Si esto sucede, deshabilite el codigo de verificación de sincronización ajustando las banderas del controlador para el controlador del mouse PS/2 a <literal>0x100</literal>. Esto puede lograrse más fácilmente añadiendo <literal>hint.psm.0.flags="0x100"</literal> a <filename>/boot/loader.conf</filename> y reiniciando.
pt_br: Se isso acontecer, desative o código de verificação de sincronização definindo as flags de driver para o driver de mouse PS/2 como <literal>0x100</literal>. Isto pode ser mais facilmente alcançado adicionando <literal>hint.psm.0.flags="0x100"</literal> ao arquivo <filename>/boot/loader.conf</filename> e reiniciando.

source: How do I reverse the mouse buttons?
de_de: Wie vertausche ich die Maustasten?
es_es: ¿Como revierto los botones del mouse?
pt_br: Como eu inverto os botões do mouse?

source: Type <command>xmodmap -e "pointer = 3 2 1"</command>. Add this command to <filename>~/.xinitrc</filename> or <filename>~/.xsession</filename> to make it happen automatically.
de_de: Geben Sie <command>xmodmap -e "pointer = 3 2 1"</command> ein. Fügen Sie dieses Kommando in <filename>~/.xinitrc</filename> oder <filename>~/.xsession</filename> hinzu, damit dies automatisch geschieht.
es_es: Escriba <command>xmodmap -e "pointer = 3 2 1"</command>. Añada este comando a <filename>~/.xinitrc</filename> o <filename>~/.xsession</filename> para hacer que esto pase de manera automática.
pt_br: Digite <command>xmodmap -e "pointer = 3 2 1"</command>. Adicione este comando ao <filename>~/.xinitrc</filename> ou <filename>~/.xsession</filename> para que isso aconteça automaticamente.

source: How do I install a splash screen and where do I find them?
de_de: Wie installiere ich einen Splash-Screen und wo finde ich sie?
es_es: ¿Como instalo una splash screen y donde puedo encontrarlas?
pt_br: Como faço para instalar uma splash screen e onde posso encontrá-las?

source: The detailed answer for this question can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot-blocks.html#boot-splash">Boot Time Splash Screens</link> section of the FreeBSD Handbook.
es_es: La respuesta detallada a esta pregunta puede encontrarse en la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot-blocks.html#boot-splash">Splash Screens en tiempo de arranque</link> del manual de FreeBSD.

source: Can I use the <keycap>Windows</keycap> keys on my keyboard in X?
de_de: Kann ich die <keycap>Windows</keycap>-Tasten unter X benutzen?
es_es: ¿Puedo usar las teclas <keycap>Windows</keycap> en mi teclado en X?
pt_br: Posso usar as teclas do <keycap>Windows</keycap> do meu teclado no X?

source: Yes. Use <citerefentry vendor="xfree86"><refentrytitle>xmodmap</refentrytitle><manvolnum>1</manvolnum></citerefentry> to define which functions the keys should perform.
de_de: Ja, Sie müssen lediglich mit <citerefentry vendor="xfree86"><refentrytitle>xmodmap</refentrytitle><manvolnum>1</manvolnum></citerefentry> festlegen, welche Aktion diese Tasten auslösen sollen.
es_es: Si. Use <citerefentry vendor="xfree86"><refentrytitle>xmodmap</refentrytitle><manvolnum>1</manvolnum></citerefentry> para definir que funciones deben realizar las teclas.
pt_br: Sim. Use o <citerefentry vendor="xfree86"><refentrytitle>xmodmap</refentrytitle><manvolnum>1</manvolnum></citerefentry> para definir quais funções as teclas devem executar.

source: Assuming all Windows keyboards are standard, the keycodes for these three keys are the following:
de_de: Unter der Annahme, dass alle Windows-Tastaturen dem Standard entsprechen, lauten die Keycodes für die drei Tasten wie folgt:
es_es: Asumiendo que todos los teclados de windows sean estándares, los códigos de teclas para estas tres teclas son los siguientes:
pt_br: Supondo que todos os teclados Windows sigam um padrão, os códigos de teclas para essas três teclas são os seguintes:

source: <keycode>115</keycode> — <keycap>Windows</keycap> key, between the left-hand <keycap>Ctrl</keycap> and <keycap>Alt</keycap> keys
de_de: <keycode>115</keycode> - <keycap>Windows</keycap>-Taste zwischen den <keycap>Strg</keycap>- und <keycap>Alt</keycap>-Tasten auf der linken Seite
es_es: <keycode>115</keycode> — tecla de <keycap> Windows</keycap>, entre las teclas <keycap>Ctrl</keycap> izquierdo y <keycap>Alt</keycap>
pt_br: <keycode> 115 </keycode> - tecla <keycap> Windows </keycap>, entre as teclas <keycap> Ctrl </keycap> e <keycap> Alt </keycap> do lado esquerdo

source: <keycode>116</keycode> — <keycap>Windows</keycap> key, to the right of <keycap>AltGr</keycap>
de_de: <keycode>116</keycode> - <keycap>Windows</keycap>-Taste rechts von der <keycap>AltGr</keycap>-Taste
es_es: <keycode>116</keycode> — tecla de <keycap>Windows</keycap> , a la derecha de <keycap>AltGr</keycap>
pt_br: <keycode> 116 </keycode> - tecla <keycap> Windows </keycap>, à direita de <keycap> AltGr </keycap>

source: <keycode>117</keycode> — <keycap>Menu</keycap>, to the left of the right-hand <keycap>Ctrl</keycap>
de_de: <keycode>117</keycode> - <keycap>Menü</keycap>-Taste, links von der rechten <keycap>Strg</keycap>-Taste
es_es: <keycode>117</keycode> — <keycap>Menu</keycap>, a la derecha de <keycap>Ctrl</keycap> derecha
pt_br: <keycode> 117 </keycode> - <keycap> Menu </keycap>, à esquerda da tecla <keycap>Ctrl</keycap> da direita

source: To have the left <keycap>Windows</keycap> key print a comma, try this.
de_de: Nach der folgenden Anweisung erzeugt die linke <keycap>Windows</keycap>-Taste ein Komma.
es_es: Para hacer que la tecla <keycap>Windows</keycap>izquierda imprima una coma, intente esto.
pt_br: Para que a tecla <keycap> Windows </keycap> da esquerda imprima uma vírgula, tente isto.

source: To have the <keycap>Windows</keycap> key-mappings enabled automatically every time X is started, either put the <command>xmodmap</command> commands in <filename>~/.xinitrc</filename> or, preferably, create a <filename>~/.xmodmaprc</filename> and include the <command>xmodmap</command> options, one per line, then add the following line to <filename>~/.xinitrc</filename>:
de_de: Um die neue Belegung der Windows-Tasten automatisch bei jedem Start von X zu erhalten, könnten entsprechende <command>xmodmap</command> Anweisungen in <filename>~/.xinitrc</filename> einfügt werden. Die bevorzugte Variante ist aber, eine Datei mit dem Namen <filename>~/.xmodmaprc</filename> zu erzeugen, die nur die Parameter für den Aufruf von <command>xmodmap</command> enthält. Wenn Sie mehrere Tasten umdefinieren wollen, muss jede Definition in eine eigene Zeile gesetzt werden. Weiterhin müssen Sie in <filename>~/.xinitrc</filename> die folgende Zeile einfügen:
es_es: Para que los mapeos de teclas de <keycap>Windows</keycap> se habiliten automáticamente cada vez que se inicia X, ponga los comandos <command>xmodmap</command> en <filename>~/.xinitrc</filename> o, preferiblemente, cree un archivo <filename>~/.xmodmaprc</filename> e incluya las opciones de <command>xmodmap</command>, una por línea, luego añada la siguiente línea a <filename>~/.xinitrc</filename>:
pt_br: Para que os mapeamentos de teclas <keycap>Windows</keycap> sejam ativados automaticamente toda vez que X for iniciado, coloque os comandos <command>xmodmap</command> em <filename>~/.xinitrc</filename> ou, preferencialmente, crie um <filename>~/.xmodmaprc</filename> e inclua as opções <command>xmodmap</command>, uma por linha, e adicione a seguinte linha ao <filename>~/.xinitrc</filename>:
