Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Why does <command>mountd</command> keep telling me it <errorname>can't change attributes</errorname> and that I have a <errorname>bad exports list</errorname> on my FreeBSD NFS server?
de_de: Warum meldet mir <command>mountd</command> auf meinem FreeBSD NFS-Server ständig <errorname>can't change attributes</errorname> und bad <errorname>exports list</errorname>?
es_es: ¿Porque <command>mountd</command> continua diciéndome <errorname>can't change attributes</errorname> (que no puedo cambiar atributos) y que tengo una <errorname>bad exports list</errorname> (lista de exports mala) en mi servidor NFS de FreeBSD?
pt_br: Por que o comando <command>mountd</command> continua me dizendo que ele <errorname>can't change attributes</errorname> (não pode alterar os atributos) e que eu tenho uma <errorname>bad exports list</errorname> (lista de exports ruins) no meu servidor NFS do FreeBSD?

source: The most frequent problem is not understanding the correct format of <filename>/etc/exports</filename>. Review <citerefentry><refentrytitle>exports</refentrytitle><manvolnum>5</manvolnum></citerefentry> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-nfs.html">NFS</link> entry in the Handbook, especially the section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-nfs.html#configuring-nfs">configuring NFS</link>.
de_de: Die häufigste Ursache für dieses Problem ist, dass Sie den Aufbau der <filename>/etc/exports</filename> nicht richtig verstanden haben. Lesen Sie <citerefentry><refentrytitle>exports</refentrytitle><manvolnum>5</manvolnum></citerefentry> und das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/network-nfs.html">NFS</link> im Handbuch, speziell den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/network-nfs.html#configuring-nfs">Konfiguration von NFS</link>.
es_es: El problema mas frecuente es no entender el formato correcto de <filename>/etc/exports</filename>. Revise <citerefentry><refentrytitle>exports</refentrytitle><manvolnum>5</manvolnum></citerefentry> y la entrada de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-nfs.html">NFS</link> en el manual, especialmente la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-nfs.html#configuring-nfs">configurar NFS</link>.
pt_br: O problema mais freqüente é não entender o formato correto de <filename>/etc/exports</filename>. Revise <citerefentry> <refentrytitle>exports</refentrytitle><manvolnum>5</manvolnum></citerefentry> e o <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/network-nfs.html ">NFS</link> no manual, especialmente na seção <link xlink:href=" @@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/network-nfs html#configuring-nfs ">configurando o NFS</link>.

source: How do I enable IP multicast support?
de_de: Wie aktiviere ich die Unterstützung für IP-Multicast?
es_es: ¿Como habilito soporte para IP multicast?
pt_br: Como faço para ativar o suporte a multicast IP?

source: Install the <package>net/mrouted</package> package or port and add <literal>mrouted_enable="YES"</literal> to <filename>/etc/rc.conf</filename> start this service at boot time.
de_de: Installieren Sie das Paket oder den Port <package>net/mrouted</package> und fügen Sie <literal>mrouted_enable="YES"</literal> in <filename>/etc/rc.conf</filename> hinzu, um den Dienst beim Booten zu starten.
es_es: Instale el paquete o port <package>net/mrouted</package> y añada <literal>mrouted_enable="YES"</literal> a <filename>/etc/rc.conf</filename> inicie este servicio en tiempo de arranque.
pt_br: Instale o pacote ou port <package>net/mrouted</package> e adicione <literal>mrouted_enable="YES"</literal> ao <filename>/etc/rc.conf</filename> para que o FreeBSD inicie este serviço no momento da inicialização.

source: Why do I have to use the FQDN for hosts on my site?
de_de: Warum muss ich für Hosts auf meiner Site den FQDN benutzen?
es_es: ¿Porque tengo que usar FQDN para hosts en mi sitio?
pt_br: Por que preciso usar o FQDN para hosts na minha rede?

source: See the answer in the FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mail-trouble.html">Handbook</link>.
de_de: Die Antwort hierzu finden Sie im FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/mail-trouble.html">Handbuch</link>.
es_es: Vea la respuesta en el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mail-trouble.html">manual</link> de FreeBSD.
pt_br: Veja a resposta no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mail-trouble.html">Handbook</link> do FreeBSD.

source: Why do I get an error, <errorname>Permission denied</errorname>, for all networking operations?
de_de: Wieso erhalte ich bei allen Netzwerkoperationen die Meldung <errorname>Permission denied</errorname>?
es_es: ¿Porque obtengo un error, <errorname>Permission denied</errorname>, para todas las operaciones de red?
pt_br: Por que recebo oerro, <errorname>Permission denied</errorname>, para todas as operações de rede?

source: If the kernel is compiled with the <literal>IPFIREWALL</literal> option, be aware that the default policy is to deny all packets that are not explicitly allowed.
de_de: Wenn der Kernel mit der Option <literal>IPFIREWALL</literal> kompiliert wurde, müssen Sie beachten, dass die Standardrichtlinie alle Pakete, die nicht explizit zulässig sind, verweigert.
es_es: Si el kernel fue compilado con la opción <literal>IPFIREWALL</literal>, este al tanto de que la política por defecto es bloquear todos los paquetes que no estén explícitamente permitidos.
pt_br: Se o kernel é compilado com a opção <literal>IPFIREWALL</literal>, esteja ciente de que a política padrão é negar todos os pacotes que não são explicitamente permitidos.

source: If the firewall is unintentionally misconfigured, restore network operability by typing the following as <systemitem class="username">root</systemitem>:
de_de: Wenn die Firewall unabsichtlich falsch konfiguriert wurde, stellen Sie die Netzwerkfunktionalität wieder her, indem Sie Folgendes als <systemitem class="username">root</systemitem> eingeben:
es_es: Si el firewall esta mal configurado, restaure la operabilidad de la red escribiendo lo siguiente como <systemitem class="username">root</systemitem>:
pt_br: Se o firewall foi inadvertidamente configurado de forma errada, restaure a operacionalidade da rede digitando o seguinte comando como <systemitem class="username">root</systemitem>:

source: Consider setting <literal>firewall_type="open"</literal> in <filename>/etc/rc.conf</filename>.
de_de: Sie können in <filename>/etc/rc.conf</filename> auch <literal>firewall_type="open"</literal> setzen.
es_es: Considere ajustar <literal>firewall_type="open"</literal> en <filename>/etc/rc.conf</filename>.
pt_br: Considere configurar a opção <literal>firewall_type="open"</literal> no <filename>/etc/rc.conf</filename>.

source: For further information on configuring this firewall, see the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html">Handbook chapter</link>.
de_de: Weitere Informationen über die Konfiguration dieser Firewall finden Sie im Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-ipfw.html">IPFW</link> des Handbuchs.
es_es: Para más información acerca de configurar este firewall vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html">capítulo del manual</link>.
pt_br: Para obter mais informações sobre como configurar seu firewall, consulte o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html">Handbook</link>.

source: Why is my <command>ipfw</command> <quote>fwd</quote> rule to redirect a service to another machine not working?
de_de: Warum kann ich mit <command>ipfw</command> einen Dienst nicht mit <quote>fwd</quote> auf eine andere Maschine umlenken?
es_es: ¿Por qué mi regla <quote>fwd</quote> de <command>ipfw</command> para redirigir un servicio a otra maquina no funciona?
pt_br: Por que minha regra <command>ipfw</command> <quote>fwd</quote> para redirecionar um serviço para outra máquina que não está funcionando?

source: Possibly because network address translation (NAT) is needed instead of just forwarding packets. A <quote>fwd</quote> rule only forwards packets, it does not actually change the data inside the packet. Consider this rule:
de_de: Wahrscheinlich benötigen Sie Network Address Translation (NAT) und nicht die einfache Weiterleitung von Paketen. Die <quote>fwd</quote>-Regel leitet lediglich Pakete weiter; die Daten in den Paketen werden aber nicht verändert. Ein Beispiel:
es_es: Posiblemente porque la traducción de direcciones de red (NAT) es necesaria en lugar de simplemente envíar paquetes needed. Una regla <quote>fwd</quote> solo envía paquetes, no cambia realmente los datos adentro del paquete. Considere esta regla:
pt_br: Possivelmente porque você precisa utilizar a conversão de endereços de rede (NAT) em vez de apenas encaminhar os pacotes. Uma regra <quote>fwd</quote> apenas encaminha os pacotes, ela não altera os dados dentro do pacote. Considere esta regra:

source: When a packet with a destination address of <replaceable>foo</replaceable> arrives at the machine with this rule, the packet is forwarded to <replaceable>10.0.0.1</replaceable>, but it still has the destination address of <replaceable>foo</replaceable>. The destination address of the packet is not changed to <replaceable>10.0.0.1</replaceable>. Most machines would probably drop a packet that they receive with a destination address that is not their own. Therefore, using a <quote>fwd</quote> rule does not often work the way the user expects. This behavior is a feature and not a bug.
de_de: Wenn ein Paket mit dem Ziel <replaceable>foo</replaceable> die Maschine mit dieser Regel erreicht, wird das Paket an <replaceable>10.0.0.1</replaceable> weitergeleitet; die Zieladresse im Paket lautet aber immer noch <replaceable>foo</replaceable>! Die Zieladresse wird nicht in <replaceable>10.0.0.1</replaceable> geändert. Die meisten Rechner werden allerdings Pakete verwerfen, wenn die Zieladresse des Paketes nicht mit der Adresse des Rechners übereinstimmt. Das ist der Grund, warum eine <quote>fwd</quote> Regel oft nicht den Effekt hat, den der Benutzer wollte. Dieses Verhalten ist aber kein Fehler, sondern erwünscht.
es_es: Cuando un paquete con una dirección de destino de <replaceable>foo</replaceable> llega a la máquina con esta regla, el paquete es enviado a <replaceable>10.0.0.1</replaceable>, pero todavía tiene la dirección de destino de <replaceable>foo</replaceable>. La dirección de destino del paquete no se cambia a <replaceable>10.0.0.1</replaceable>. La mayoría de las máquinas probablemente tiren un paquete que reciben con una dirección de destino que no sea la propia. Por consiguiente, usar una regla <quote>fwd</quote> no necesariamente funciona de la manera que espera el usuario. Este comportamiento es una característica y no un error.
pt_br: Quando um pacote com um endereço de destino <replaceable>foo</replaceable> chega à máquina com esta regra, o pacote é encaminhado para <replaceable>10.0.0.1</replaceable>, mas ainda tem o endereço de destino <replaceable >foo</replaceable>. O endereço de destino do pacote não é alterado para <replaceable>10.0.0.1</replaceable>. A maioria das máquinas provavelmente descartaria um pacote que recebesse com um endereço de destino que não fosse o seu. Portanto, usar uma regra <quote>fwd</quote> geralmente não funciona da maneira esperada pelo usuário. Esse comportamento é um recurso e não um bug.

source: See the <link linkend="service-redirect"><acronym>FAQ</acronym> about redirecting services</link>, the <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual, or one of the several port redirecting utilities in the <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">Ports Collection</link> for a correct way to do this.
de_de: Wenn Sie einen Dienst auf eine andere Maschine umleiten wollen, sollten Sie die <link linkend="service-redirect"><acronym>FAQ</acronym> über die Umleitung von Diensten</link> und die Manualpage <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry> lesen. Auch in der <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">Ports Sammlung</link> sind diverse Hilfsprogramme für diesen Zweck enthalten.
es_es: Va el <link linkend="service-redirect"><acronym>FAQ</acronym> acerca de redirigir servicios </link>, el manual de <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o una de las varias utilidades para redirigir puertos en la <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">colección de ports</link> para la manera correcta de hacer esto.
pt_br: Veja o <link linkend="service-redirect"><acronym>FAQ</acronym> sobre redirecionamento de serviços</link>, o manual do <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, ou um dos vários utilitários de redirecionamento de porta na <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">Coleção de Portas</link> para uma maneira correta de fazer isso.

source: How can I redirect service requests from one machine to another?
de_de: Wie kann ich Service-Anfragen von einer Maschine auf eine andere umleiten?
es_es: ¿Como puedo redirigir pedidos de servicio de una máquina a otra?
pt_br: Como posso redirecionar as solicitações de serviço de uma máquina para outra?

source: FTP and other service requests can be redirected with the <package>sysutils/socket</package> package or port. Replace the entry for the service in <filename>/etc/inetd.conf</filename> to call <command>socket</command>, as seen in this example for <application>ftpd</application>:
de_de: Sie können für FTP und andere Dienste mit dem Paket oder Port <package>sysutils/socket</package> umleiten. Ersetzen sie die Befehlszeile für den Dienst in <filename>/etc/inetd.conf</filename> einfach so, dass stattdessen <command>socket</command> aufgerufen wird, wie in diesem Beispiel für <application>ftpd</application> zu sehen ist:
es_es: FTP y otros pedidos de servicios pueden ser redirigidos con el port o paquete <package>sysutils/socket</package>. Reemplace la entrada del servicio en <filename>/etc/inetd.conf</filename> para llamar a <command>socket</command>, como se puede ver en este ejemplo para <application>ftpd</application>:
pt_br: FTP e outras solicitações de serviço podem ser redirecionadas com o pacote ou port <package>sysutils/socket</package>. Substitua a entrada para o serviço em <filename>/etc/inetd.conf</filename> para chamar <command>socket</command>, conforme visto neste exemplo para <application>ftpd</application>:

source: where <replaceable>ftp.example.com</replaceable> and <replaceable>ftp</replaceable> are the host and port to redirect to, respectively.
de_de: wobei <replaceable>ftp.example.com</replaceable> und <replaceable>ftp</replaceable> entsprechend der Host und der Port sind, wohin umgeleitet werden soll.
es_es: donde <replaceable>ftp.example.com</replaceable> y <replaceable>ftp</replaceable> son el host y el puerto a los que redirigirse, respectivamente.
pt_br: na qual <replaceable>ftp.example.com</replaceable> e <replaceable>ftp</replaceable> são o host e a porta de destino do redirecionamento, respectivamente.

source: Where can I get a bandwidth management tool?
de_de: Woher kann ich ein Bandbreiten-Managementtool bekommen?
es_es: ¿Dónde puedo obtener una herramienta de manejo de ancho de banda?
pt_br: Onde posso obter uma ferramenta de gerenciamento de largura de banda?

source: There are three bandwidth management tools available for FreeBSD. <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> is integrated into FreeBSD as part of <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry>. <link xlink:href="http://www.sonycsl.co.jp/person/kjc/programs.html">ALTQ</link> has been integrated into FreeBSD as part of <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Bandwidth Manager from <link xlink:href="http://www.etinc.com/">Emerging Technologies</link> is a commercial product.
de_de: Für FreeBSD gibt es drei Bandbreiten-Managementtools. <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> ist als Teil von <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry> in FreeBSD integriert. <link xlink:href="http://www.sonycsl.co.jp/person/kjc/programs.html">ALTQ</link> ist in FreeBSD Bestandteil von <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Beim Bandbreiten-Manager von <link xlink:href="http://www.etinc.com/">Emerging Technologies</link> handelt es sich hingegen um ein kommerzielles Produkt.
es_es: Hay tres herramientas de manejo de ancho de banda disponibles para FreeBSD. <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> esta integrada en FreeBSD como parte de <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry>. <link xlink:href="http://www.sonycsl.co.jp/person/kjc/programs.html">ALTQ</link> fue integrada a FreeBSD como parte de <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Bandwidth Manager de <link xlink:href="http://www.etinc.com/">Emerging Technologies</link> es un producto comercial.
pt_br: Existem três ferramentas de gerenciamento de largura de banda disponíveis para o FreeBSD. <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> é integrado ao FreeBSD como parte do <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry>. <link xlink:href="http://www.sonycsl.co.jp/person/kjc/programs.html">ALTQ</link> foi integrado ao FreeBSD como parte do <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>. O Bandwidth Manager das <link xlink:href="http://www.etinc.com/"> Tecnologias Emergentes </link> é um produto comercial.

source: Why do I get <errorname>/dev/bpf0: device not configured</errorname>?
de_de: Warum erhalte ich die Meldung <errorname>/dev/bpf0: device not configured</errorname>?
es_es: ¿Por qué obtengo <errorname>/dev/bpf0: device not configured</errorname>?
pt_br: Por que estou recebendo o erro <errorname>/dev/bpf0: device not configured</errorname>?

source: The running application requires the Berkeley Packet Filter (<citerefentry><refentrytitle>bpf</refentrytitle><manvolnum>4</manvolnum></citerefentry>), but it was removed from a custom kernel. Add this to the kernel config file and build a new kernel:
de_de: Der Berkeley Paket Filter (<citerefentry><refentrytitle>bpf</refentrytitle><manvolnum>4</manvolnum></citerefentry>) muss in den Kernel eingebunden werden, bevor er von einem Programm genutzt werden kann. Fügen Sie folgendes zur Kernelkonfigurationsdatei hinzu und erstellen Sie einen neuen Kernel:
es_es: La aplicación que esta corriendo requiere Berkeley Packet Filter (<citerefentry><refentrytitle>bpf</refentrytitle><manvolnum>4</manvolnum></citerefentry>), pero el mismo fue removido de un kernel personalizado. Agregue esto al archivo de configuración del kernel y compile un nuevo kernel:
pt_br: O aplicativo em execução requer o Packet Filter da Berkeley (<citerefentry><refentrytitle>bpf</refentrytitle><manvolnum>4</manvolnum></citerefentry>), mas ele foi removido de um kernel personalizado. Adicione isto ao arquivo de configuração do kernel e construa um novo kernel:

source: How do I mount a disk from a <trademark class="registered">Windows</trademark> machine that is on my network, like smbmount in <trademark class="registered">Linux</trademark>?
de_de: Habe ich, analog zum smbmount von <trademark class="registered">Linux</trademark>, eine Möglichkeit, auf ein freigegebenes Laufwerk einer <trademark class="registered">Windows</trademark>-Maschine in meinem Netzwerk zuzugreifen?
es_es: ¿Como monto un disco desde una máquina con <trademark class="registered">Windows</trademark> que esta en mi red, de la misma manera que smbmount en <trademark class="registered">Linux</trademark>?
pt_br: Como faço para montar um disco de uma máquina <trademark class="registered">Windows</trademark> que esteja na minha rede, tal como o smbmount no <trademark class="registered">Linux</trademark>?

source: Use the <application>SMBFS</application> toolset. It includes a set of kernel modifications and a set of userland programs. The programs and information are available as <citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> in the base system.
de_de: Benutzen Sie die Programme aus dem Paket <application>SMBFS</application>. Es enthält einige Kernel-Erweiterungen und Benutzerprogramme. Die Programme und weitergehende Informationen sind unter <citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> im Basissystem verfügbar.
es_es: Use el set de herramientas <application>SMBFS</application>. El mismo incluye un set de modificaciones al kernel y un set de programas de espacio de usuario. Los programas y la información están disponibles como <citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> en el sistema base.
pt_br: Use o conjunto de ferramentas <application>SMBFS</application>. Ele inclui um conjunto de modificações do kernel e um conjunto de programas da área de usuário. Os programas e as informações necessárias estão disponíveis como <citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> no sistema base.

source: What are these messages about: <errorname>Limiting icmp/open port/closed port response</errorname> in my log files?
de_de: Was bedeutet die Meldung <errorname>Limiting icmp/open port/closed port response</errorname> in meinen Logdateien?
es_es: ¿Por qué aparecen mensajes como: <errorname>Limiting icmp/open port/closed port response</errorname> en mis archivos de log?
pt_br: O que são essas mensagens sobre: ​​<errorname>Limiting icmp/open port/closed port response</errorname> em meus arquivos de log?
