Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/freebsd-glossary.html">FreeBSD Glossary</link>.
de_de: Sehen Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/freebsd-glossary.html">FreeBSD-Glossar</link> nach.
es_es: Vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/freebsd-glossary.html">glosario de FreeBSD</link>.
pt_br: Consulte o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/freebsd-glossary.html">Glossário do FreeBSD</link>.

source: Why should I care what color the bikeshed is?
de_de: Warum sollte mich die Farbe des Fahrradschuppens interessieren?
es_es: ¿Por qué debería preocuparme de que color es el cobertizo para bicicletas?
pt_br: Por que eu deveria me importar com a cor da bikeshed?

source: The really, really short answer is that you should not. The somewhat longer answer is that just because you are capable of building a bikeshed does not mean you should stop others from building one just because you do not like the color they plan to paint it. This is a metaphor indicating that you need not argue about every little feature just because you know enough to do so. Some people have commented that the amount of noise generated by a change is inversely proportional to the complexity of the change.
de_de: Die ganz, ganz kurze Antwort ist: Überhaupt nicht. Die etwas längere Antwort lautet: Nur weil Sie in der Lage sind, einen Fahrradschuppen zu bauen, müssen Sie noch lange nicht andere davon abhalten, nur weil Ihnen die Farbe nicht gefällt. Dies ist natürlich eine Metapher dafür, dass Sie nicht eine Diskussion über jede kleine Änderung beginnen sollen, nur weil Sie das können. Einige Leute behaupten sogar, dass die Anzahl der (nutzlosen) Kommentare über eine Änderung umgekehrt proportional zur Komplexität der Änderung ist.
es_es: La respuesta verdaderamente corta es que no debería. La respuesta un poco más larga es que solo porque usted es capaz de construir un cobertizo para bicicletas no significa que debería evitar que otros construyan uno solo porque no le gusta el color del que lo quieren pintar. Esta es una metáfora indicando que no necesita discutir sobre cada pequeña característica solo porque tiene el conocimiento para hacerlo. Algunas personas comentaron que la cantidad de ruido generada por un cambio es inversamente proporcional a la complejidad del cambio.
pt_br: A resposta realmente curta é que você não deveria. A resposta um pouco mais longa é que só porque você é capaz de construir um bikeshed não significa que você deve impedir os outros de construir um só porque você não gosta da cor na qual eles planejam pintá-lo. Esta é uma metáfora indicando que você não precisa discutir sobre cada pequena característica apenas porque você sabe o suficiente para fazê-lo. Algumas pessoas comentaram que a quantidade de ruído gerada por uma mudança é inversamente proporcional à complexidade da mudança.

source: The longer and more complete answer is that after a very long argument about whether <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>1</manvolnum></citerefentry> should take fractional second arguments, Poul-Henning Kamp <email>phk@FreeBSD.org</email> posted a long message entitled <quote><link xlink:href="http://www.bikeshed.com">A bike shed (any color will do) on greener grass...</link></quote>. The appropriate portions of that message are quoted below.
de_de: Die noch längere und vollständigere Antwort ist, dass Poul-Henning Kamp <email>phk@FreeBSD.org</email> nach einen langen Diskussion über das Thema <quote>Soll <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>1</manvolnum></citerefentry> Sekundenbruchteile als Parameter akzeptieren?</quote> eine lange Mail mit dem Titel <quote><link xlink:href="http://www.bikeshed.com">A bike shed (any color will do) on greener grass...</link></quote> schrieb. Die einschlägigen Teile der Nachricht lauteten:
es_es: Una respuesta más larga y completa es que luego de una larga discusión acerca de si <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>1</manvolnum></citerefentry> debería tomar argumentos de segundos fraccionales, <email>phk@FreeBSD.org</email> posteo un largo mensaje titulado <quote><link xlink:href="http://www.FreeBSD.org/cgi/getmsg.cgi?fetch=506636+517178+/usr/local/www/db/text/1999/freebsd-hackers/19991003.freebsd-hackers">A bike shed (any color will do) on greener grass...</link></quote>. Las porciones apropiadas de ese mensaje son citadas más abajo.
pt_br: A resposta mais longa e completa é que depois de uma longa discussão sobre se <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>1</manvolnum></citerefentry> deve receber argumentos secundários fracionários, Poul-Henning Kamp <email>phk@FreeBSD.org</email> publicou uma longa mensagem intitulada <quote><link xlink:href="http://www.bikeshed.com"> Um galpão de bicicleta (qualquer cor serve) na grama mais verde...</link> </quote>As partes apropriadas dessa mensagem são citadas abaixo.

source: Poul-Henning Kamp <email>phk@FreeBSD.org</email> on <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">freebsd-hackers</link>, October 2, 1999
de_de: Poul-Henning Kamp <email>phk@FreeBSD.org</email> in <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">freebsd-hackers</link>, 2.10.1999
es_es: Poul-Henning Kamp <email>phk@FreeBSD.org</email> en <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">freebsd-hackers</link>, October 2, 1999
pt_br: Poul-Henning Kamp <email>phk@FreeBSD.org</email> em <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">freebsd-hackers</link> 2 de outubro de 1999

source: <quote>What is it about this bike shed?</quote> Some of you have asked me.
de_de: Einige von Euch haben mich gefragt, <quote>Was meinst Du mit dem Fahrradschuppen?</quote>
es_es: <quote>¿Qué es esto acerca de un cobertizo de bicicletas?</quote> Me han preguntado algunos.
pt_br: <quote>O que acontece com esse bicicletário? </quote> Alguns de vocês me perguntaram.

source: It is a long story, or rather it is an old story, but it is quite short actually. C. Northcote Parkinson wrote a book in the early 1960s, called <quote>Parkinson's Law</quote>, which contains a lot of insight into the dynamics of management.
de_de: Es ist eine lange oder eigentlich eher eine sehr alte und doch sehr kurze Geschichte. C. Northcote Parkinson schrieb in den frühen Sechzigern ein Buch mit dem Namen <quote>Parkinson's Law</quote>, das viele Einblick in die Beziehungen innerhalb des Managements gibt.
es_es: Es una larga historia, o más bien, una historia vieja pero de hecho es bastante corta. C. Northcote Parkinson escribió un libro a principios de los 1960s, titulado <quote>Parkinson's Law</quote>, que contiene muchas revelaciones acerca de la dinámica del management.
pt_br: É uma longa história, ou melhor, é uma história antiga, mas na verdade é bem curta. C. Northcote Parkinson escreveu um livro no início dos anos 1960, chamado <quote>Lei de Parkinson</quote>, que contém muitas informações sobre a dinâmica da administração.

source: <emphasis>[snip a bit of commentary on the book]</emphasis>
de_de: <emphasis>[ein paar Kommentare zum Buch gestrichen]</emphasis>
es_es: <emphasis>[suprimidos varios comentarios acerca del libro]</emphasis>
pt_br: <emphasis> [recorte um pouco o comentário sobre o livro] </emphasis>

source: In the specific example involving the bike shed, the other vital component is an atomic power-plant, I guess that illustrates the age of the book.
de_de: In dem Beispiel mit dem Fahrradschuppen ist die andere wichtige Komponente ein Kernkraftwerk. Ich glaube, dass zeigt schon, wie alt dieses Buch ist.
es_es: En el ejemplo específico que involucra al cobertizo de bicicletas, el otro componente vital es una planta de energía atómica, supongo que eso ilustra la edad del libro.
pt_br: No exemplo específico envolvendo o bicicletário, o outro componente vital é uma usina atômica, acho que isso ilustra a idade do livro.

source: Parkinson shows how you can go into the board of directors and get approval for building a multi-million or even billion dollar atomic power plant, but if you want to build a bike shed you will be tangled up in endless discussions.
de_de: Parkinson zeigte, dass man zum Vorstand gehen kann und die Genehmigung für ein mehrere Millionen oder sogar Milliarden Dollar teures Kernkraftwerk bekommt; wenn man aber einen Fahrradschuppen bauen will, wird man in endlose Diskussionen verwickelt.
es_es: Parkinson muestra como puedes ir a la junta directiva y obtener aprobación para construir una planta de energía atómica que cueste varios millones, o incluso un billon, pero si quieres construir un cobertizo para bicicletas te encontraras atrapado en un sinfín de discusiones.
pt_br: Parkinson mostra como você pode entrar na diretoria e obter aprovação para a construção de uma usina de energia atômica multimilionária ou mesmo bilionária, mas se você quiser construir um galpão de bicicleta, você ficará envolvido em discussões intermináveis.

source: Parkinson explains that this is because an atomic plant is so vast, so expensive and so complicated that people cannot grasp it, and rather than try, they fall back on the assumption that somebody else checked all the details before it got this far. Richard P. Feynmann gives a couple of interesting, and very much to the point, examples relating to Los Alamos in his books.
de_de: Laut Parkinson liegt das daran, dass ein Kernkraftwerk so groß, so teuer und so kompliziert ist, dass die Leute es nicht verstehen. Und bevor sie versuchen, es zu verstehen, verlassen Sie sich lieber darauf, dass irgend jemand sicherlich die ganzen Details geprüft hat, bevor das Projekt bis zum Vorstand gekommen ist. Im Buch von Richard P. Feynmann finden sich einige interessante und sehr passende Beispiele aus dem Gebiet von Los Alamos.
es_es: Parkinson explica que esto sucede porque una planta de energía es tan grande, tan cara y tan complicada que la gente no puede comprenderla, y en lugar de intentarlo, suponen que alguien más ya ha verificado todos los detalles antes de haber llegado tan lejos. Richard P. Feynmann da un par de ejemplos interesantes y aplicables ejemplos relacionados con Los Alamos en sus libros.
pt_br: Parkinson explica que isso ocorre porque uma usina atômica é tão vasta, tão cara e tão complicada que as pessoas não conseguem entendê-la e, em vez de tentar, recuam supondo que alguém tenha verificado todos os detalhes antes de chegar tão longe. Richard P. Feynmann dá alguns exemplos interessantes, e muito importantes, relacionados a Los Alamos em seus livros.

source: A bike shed on the other hand. Anyone can build one of those over a weekend, and still have time to watch the game on TV. So no matter how well prepared, no matter how reasonable you are with your proposal, somebody will seize the chance to show that he is doing his job, that he is paying attention, that he is <emphasis>here</emphasis>.
de_de: Ein Fahrradschuppen ist was anderes. Jeder kann an seinem freien Wochenende einen bauen und hat trotzdem noch genug Zeit für die Sportschau. Daher ist es unwichtig, wie gut man sich vorbereitet und wie sinnvoll der eigene Vorschlag ist. Irgend jemand wird die Möglichkeit nutzen und zeigen, dass er seine Arbeit tut, dass er aufmerksam ist, dass er <emphasis>da</emphasis> ist.
es_es: Un cobertizo de bicicletas es otra cosa. Cualquiera puede construirlo en un fin de semana, y aún tener tiempo para mirar un juego por televisión. De modo que sin importar que tan bien preparada, o que tan razonable sea tu propuesta, alguien aprovechara la oportunidad para mostrar que esta haciendo su trabajo, que esta prestando atención, que esta <emphasis>presente</emphasis>.
pt_br: Uma bicicletário por outro lado. Qualquer um pode construir um desses em um fim de semana e ainda ter tempo de assistir ao jogo na TV. Portanto, não importa o quão bem preparado, não importa o quão razoável você é com a sua proposta, alguém vai aproveitar a chance de mostrar que ele está fazendo o seu trabalho, que ele está prestando atenção, que ele está <emphasis>aqui</emphasis>.

source: In Denmark we call it <quote>setting your fingerprint</quote>. It is about personal pride and prestige, it is about being able to point somewhere and say <quote>There! <emphasis>I</emphasis> did that.</quote> It is a strong trait in politicians, but present in most people given the chance. Just think about footsteps in wet cement.
de_de: In Dänemark wird dieses Verhalten <quote>Seine Fingerabdrücke hinterlassen</quote> genannt. Es geht um persönlichen Stolz und Prestige; die Chance, auf irgend etwas zu zeigen und zu sagen zu können: <quote>Da! Das habe <emphasis>Ich</emphasis> getan.</quote> Politiker leiden sehr stark darunter, aber viele Leute verhalten sich so, wenn sie die Chance haben. Denken Sie einfach mal an Fußabdrücke in feuchtem Zement.
es_es: En Dinamarca lo llamamos <quote>dejar tu huella dactilar</quote>. Se trata de privilegio y prestigio personal, se trata de poder apuntar a algún lado y decir <quote>¡Ahi! <emphasis>Yo</emphasis> hice eso.</quote>
pt_br: Na Dinamarca, chamamos de <quote>definindo sua identidade</quote>. É sobre orgulho pessoal e prestígio, é sobre poder apontar para algum lugar e dizer <quote>Lá!<emphasis> Eu </emphasis> fiz aquilo. </quote> É um traço forte nos políticos, mas presente na maioria das pessoas que têm chance. Basta pensar em passos em cimento molhado.

source: The FreeBSD Funnies
de_de: Nicht ganz ernstgemeinte Fragen
es_es: Cosas divertidas de FreeBSD
pt_br: Coisas legais do FreeBSD

source: How cool is FreeBSD?
de_de: Wie cool ist FreeBSD?
es_es: ¿Qué tan frío es FreeBSD?
pt_br: Quão legal é o FreeBSD?

source: Q. Has anyone done any temperature testing while running FreeBSD? I know <trademark class="registered">Linux</trademark> runs cooler than DOS, but have never seen a mention of FreeBSD. It seems to run really hot.
de_de: Q. Hat irgend jemand Temperaturmessungen durchgeführt, während FreeBSD läuft? Ich weiß, dass <trademark class="registered">Linux</trademark> cooler läuft als DOS, habe aber niemals gesehen, dass FreeBSD erwähnt wurde. Es scheint sehr heiß zu laufen.
es_es: Q. ¿Alguien ha hecho alguna prueba de temperatura al correr FreeBSD? Se que linux <trademark class="registered">Linux</trademark> es más frío que DOS, pero jamás vi alguna mención a FreeBSD. Parece que sobrecalienta bastante.
pt_br: Q. Alguém fez algum teste de temperatura durante a execução do FreeBSD? Eu sei que o <trademark class="registered">Linux</trademark> é mais legal que o DOS, mas nunca vi uma menção ao FreeBSD. Parece ser muito rápido.

source: A. No, but we have done numerous taste tests on blindfolded volunteers who have also had 250 micrograms of LSD-25 administered beforehand. 35% of the volunteers said that FreeBSD tasted sort of orange, whereas <trademark class="registered">Linux</trademark> tasted like purple haze. Neither group mentioned any significant variances in temperature. We eventually had to throw the results of this survey out entirely anyway when we found that too many volunteers were wandering out of the room during the tests, thus skewing the results. We think most of the volunteers are at Apple now, working on their new <quote>scratch and sniff</quote> GUI. It is a funny old business we are in!
de_de: A. Nein, aber wir haben zahlreiche Geschmackstests mit Freiwilligen mit verbundenen Augen durchgeführt, denen außerdem zuvor 250 Mikrogramm LSD-25 verabreicht wurden. 35% der Freiwilligen sagte, dass FreeBSD nach Orange schmeckte, <trademark class="registered">Linux</trademark> hingegen schmecke wie Purple Haze. Keine der Gruppen hat besondere Abweichungen der Temperatur erwähnt. Eventuell hätten wir sämtliche Ergebnisse dieser Untersuchung fortwerfen sollen, als wir festgestellt haben, dass zu viele der Freiwilligen den Raum während der Tests verlassen haben und dadurch die Ergebnisse verfälscht haben. Wir glauben, dass die meisten der Freiwilligen nun bei Apple sind und an ihrer neuen <quote>scratch and sniff</quote> Oberfläche arbeiten. Es ist ein lustiges, altes Geschäft, in dem wir uns befinden!
es_es: A. No pero he hecho numerosas pruebas de gusto en voluntarios que tomaron 250 microgramos de LSD-25 administrados previamente. El 35% de los voluntarios dijo que FreeBSD sabe a naranja, mientras que <trademark class="registered">Linux</trademark> sabe a humo violeta. Ningún grupo menciono nada acerca de variaciones en la temperatura. Eventualmente debimos desechar los resultados de esta encuesta de todas formas al enterarnos que demasiado voluntarios estaban deambulando fuera del cuarto durante las pruebas, arruinando los resultados. Pensamos que la mayoría de los voluntarios están en Apple ahora, trabajando en su nueva GUI <quote>scratch and sniff</quote>. ¡Es un negocio divertido el nuestro!
pt_br: R. Não, mas fizemos numerosos testes de gostos em voluntários vendados que também receberam 250 microgramas de LSD-25 administrados antecipadamente. 35% dos voluntários disseram que o FreeBSD tinha um gosto de um tipo de laranja, enquanto o <trademark class="registered">Linux</trademark> tinha gosto de névoa roxa. Nenhum dos grupos mencionou variações significativas na temperatura. Eventualmente nós tivemos que lançar os resultados desta pesquisa completamente de qualquer maneira quando descobrimos que muitos voluntários estavam vagando fora da sala durante os testes, assim distorcendo os resultados. Nós achamos que a maioria dos voluntários está na Apple agora, trabalhando em sua nova GUI <quote>risca e arrisca</quote>. É um negócio antigo e engraçado em que estamos!

source: Seriously, FreeBSD uses the <acronym>HLT</acronym> (halt) instruction when the system is idle thus lowering its energy consumption and therefore the heat it generates. Also if you have <acronym>ACPI</acronym> (Advanced Configuration and Power Interface) configured, then FreeBSD can also put the CPU into a low power mode.
de_de: Ernsthaft, FreeBSD benutzt die Instruktion <acronym>HLT</acronym> (halt), wenn das System untätig ist, wodurch der Energieverbrauch und dadurch die produzierte Wärme reduziert wird. Falls Sie auch <acronym>ACPI</acronym> (Advanced Configuration and Power Interface) konfiguriert haben, kann FreeBSD die CPU auch in einen Low-Power-Modus bringen.
es_es: En serio, FreeBSD usa la instrucción <acronym>HLT</acronym> (halt) cuando el sistema esta ocioso, de esta manera reduciendo su consumo de energía y eventualmente el calor que genera. Además, si ha configurado <acronym>ACPI</acronym> (Advanced Configuration and Power Interface), entonces FreeBSD también puede poner la CPU en modo de bajo consumo.
pt_br: Sério, o FreeBSD usa a instrução <acronym>HLT</acronym> (halt) quando o sistema está ocioso, reduzindo assim seu consumo de energia e, portanto, o calor gerado. Além disso, se você tiver <acronym>ACPI</acronym> (Configuração Avançada e Interface de Energia) configurado, então o FreeBSD também pode colocar a CPU em um modo de baixa energia.

source: Who is scratching in my memory banks??
de_de: Wer kratzt in meinen Speicherbänken??
es_es: ¿Quién esta borrando mis bancos de memoria?
pt_br: Quem está coçando nos meus bancos de memória??

source: Q. Is there anything <quote>odd</quote> that FreeBSD does when compiling the kernel which would cause the memory to make a scratchy sound? When compiling (and for a brief moment after recognizing the floppy drive upon startup, as well), a strange scratchy sound emanates from what appears to be the memory banks.
de_de: Q. Gibt es irgend etwas <quote>seltsames</quote>, das FreeBSD tut, wenn der Kernel kompiliert wird, das dazu führt, dass der Speicher ein kratzendes Geräusch macht? Bei der Kompilierung (und auch für einen kurzen Moment nach der Erkennung des Floppy-Laufwerks beim Hochfahren), kommt ein seltsames kratzendes Geräusch von etwas, das die Speicherbänke zu sein scheinen.
es_es: Q. ¿Hay algo <quote>extraño</quote> que FreeBSD hace al compilar el kernel que pueda causar que la memoria haga un sonido de rasguño? Al compilar (y por un breve momento luego de reconocer el disco floppy en el arranque), un extraño sonido como un arañazo emana de lo que parecen ser los bancos de memoria.
pt_br: Q. Existe alguma coisa <quote>estranha</quote> que o FreeBSD faz ao compilar o kernel que faria com que a memória fizesse um som de algo coçando? Ao compilar (e por um breve momento depois de reconhecer o drive de disquete na inicialização também), um estranho som de algo coçando emana do que parecem ser os bancos de memória.

source: A. Yes! You will see frequent references to <quote>daemons</quote> in the BSD documentation, and what most people do not know is that this refers to genuine, non-corporeal entities that now possess your computer. The scratchy sound coming from your memory is actually high-pitched whispering exchanged among the daemons as they best decide how to deal with various system administration tasks.
de_de: A. Ja! In der BSD-Dokumentation finden Sie häufige Verweise auf <quote>Daemons</quote> und was die meisten Leute nicht wissen, ist, dass diese sich auf echte, nicht-körperlichen Wesen beziehen, die Besitz von Ihrem Computer ergriffen haben. Das kratzende Geräusch, das von Ihrem Speicher kommt, ist in Wirklichkeit hochtöniges Flüstern, das unter den Daemons ausgetauscht wird, während Sie entscheiden, wie Sie die verschiedenen Systemadministrationsaufgaben, am besten erledigen.
es_es: A. ¡Si! Vera frecuentes referencias a <quote>demonios</quote> en la documentación de BSD y lo que la mayoría de la gente no sabe es que esto se refiere a entidades genuinas e incorpóreas que ahora poseen su computadora. El sonido de arañazos que viene desde su memoria es de hecho un silbido de alta frecuencia intercambiado por los demonios mientras deciden como lidiar con varias tareas administrativas del sistema.
pt_br: Sim! Você verá referências freqüentes a <quote>daemons</quote> na documentação do BSD, e o que a maioria das pessoas não sabe é que isso se refere a entidades genuínas e não corporais que agora possuem seu computador. O som áspero vindo de sua memória é, na verdade, um sussurro agudo entre os daemons, pois eles decidem como lidar com várias tarefas de administração do sistema.
