Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This means that a function that may sleep was called while a mutex (or other unsleepable) lock was held.
de_de: Diese Meldung erscheint, wenn eine Funktion, die sich im Ruhemodus befindet, aufgerufen wird, während ein Mutex oder eine andere (nicht in den Ruhemodus versetzbare) Sperre aktiv war.
es_es: Significa que una función que puede dormirse fue llamada mientras un mutex (u otra primitiva de sincronización que no duerme) estaba bloqueado.
pt_br: Isso significa que uma função que pode dormir foi chamada enquanto um lock mutex (ou outro unsleepable) era mantido.

source: The reason this is an error is because mutexes are not intended to be held for long periods of time; they are supposed to only be held to maintain short periods of synchronization. This programming contract allows device drivers to use mutexes to synchronize with the rest of the kernel during interrupts. Interrupts (under FreeBSD) may not sleep. Hence it is imperative that no subsystem in the kernel block for an extended period while holding a mutex.
de_de: Der Grund dafür ist, dass ein Mutex nicht für längere Zeitspannen aktiv sein soll, sondern nur für die Synchronisation von Gerätetreibern mit dem Rest des Kernels während eines Interrupts. Unter FreeBSD dürfen Interrupts nicht in den Ruhemodus versetzt werden. Daher ist es von entscheidender Bedeutung, dass während des Bestehens eines Mutex kein Kernelsubsystem für einen längeren Zeitraum blockiert ist.
es_es: La razón por la que esto es un error es que los mutexes no fueron concebidos para ser tenidos por largos períodos de tiempo; se supone que solo se tengan para mantener durante períodos cortos de sincronización. Este contrato de programación permite que los controladores de dispositivo usen mutexes para sincronizarse con el resto del kernel durante las interrupciones. Las interrupciones (bajo FreeBSD) pueden no dormirse. Luego es imperativo que ningún subsistema en el kernel se bloquee por un período extendido de tiempo al mantener un mutex.
pt_br: A razão pela qual isso é um erro é porque os mutexes não devem ser mantidos por longos períodos de tempo; eles deveriam existir apenas para manter curtos períodos de sincronização. Este contrato de programação permite que os drivers de dispositivos usem mutexes para sincronizar com o resto do kernel durante as interrupções. As interrupções (no FreeBSD) podem não dormir. Por isso, é imperativo que nenhum subsistema bloqueie o kernel por um longo período mantendo um mutex ativo.

source: To catch such errors, assertions may be added to the kernel that interact with the <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem to emit a warning or fatal error (depending on the system configuration) when a potentially blocking call is made while holding a mutex.
de_de: Um solche Fehler abzufangen, können Sicherungen (Assertions) in den Kernel eingebaut werden, die danach mit dem <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>-Subsystem interagieren. Dadurch wird (in Abhängigkeit der Systemkonfiguration) eine Warnung oder eine Fehlermeldung ausgegeben, falls der Aufruf einer Funktion während des Bestehens eines Mutex zu einer Blockierung führen kann.
es_es: Para atrapar tales errores, pueden agregarse aserciones al kernel para interactuar con el subsitema <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> y emitir una alerta o un error fatal (dependiendo de la configuración del sistema) cuando una llamada potencialmente bloqueante es hecha mientras que se mantiene un mutex.
pt_br: Para capturar tais erros, asserções podem ser adicionadas ao kernel que interage com o subsistema <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> para emitir um aviso ou erro fatal (dependendo a configuração do sistema) quando uma chamada potencialmente de bloqueio é feita enquanto um mutex estiver sendo mantido.

source: In summary, such warnings are non-fatal, however with unfortunate timing they could cause undesirable effects ranging from a minor blip in the system's responsiveness to a complete system lockup.
de_de: Zusammenfassend kann man sagen, dass diese Warnungen in der Regel zwar nicht bedrohlich sind. Unter bestimmten Umständen kann es aber dennoch zu unerwünschten Nebenwirkungen, angefangen von einer Erhöhung der Reaktionszeit bis hin zu einem kompletten Einfrieren des Systems kommen.
es_es: En resumen, estas alertas no son fatales, no obstante errores de coordinación pueden causar efectos indeseables variando desde un mínimo retraso en la respuesta del sistema a un completo bloqueo del mismo.
pt_br: Em resumo, tais avisos não são fatais, no entanto, com um timing infeliz, podem causar efeitos indesejáveis, desde um pequeno erro na capacidade de resposta do sistema até o seu travamento completo.

source: For additional information about locking in FreeBSD see <citerefentry><refentrytitle>locking</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
de_de: Weitere Informationen zum Locking unter FreeBSD finden Sie in <citerefentry><refentrytitle>locking</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
es_es: Para información adicional acerca de los bloqueos en FreeBSD vea <citerefentry><refentrytitle>locking</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
pt_br: Para obter informações adicionais sobre locking no FreeBSD, consulte <citerefentry><refentrytitle>locking</refentrytitle><manvolnum>9</manvolnum></citerefentry>.

source: Why does <_:buildtarget-1/>/<_:buildtarget-2/> die with the message <errorname>touch: not found</errorname>?
de_de: Warum bricht <_:buildtarget-1/>/<_:buildtarget-2/> mit der Meldung <errorname>touch: not found</errorname> ab?
es_es: ¿Porque <_:buildtarget-1/>/<_:buildtarget-2/> termina con el mensaje <errorname>touch: not found</errorname>?
pt_br: Por que o <_:buildtarget-1/> / <_:buildtarget-2/> morre com a mensagem <errorname>touch: not found</errorname>?

source: This error does not mean that the <citerefentry><refentrytitle>touch</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility is missing. The error is instead probably due to the dates of the files being set sometime in the future. If the CMOS clock is set to local time, run <command>adjkerntz -i</command> to adjust the kernel clock when booting into single-user mode.
de_de: Dieser Fehler bedeutet nicht, dass <citerefentry><refentrytitle>touch</refentrytitle><manvolnum>1</manvolnum></citerefentry> nicht auf dem System vorhanden ist. Vielmehr sind Dateien die Ursache, deren Erzeugungsdatum in der Zukunft liegt. Wenn die CMOS-Uhr auf die lokale Zeit eingestellt ist, müssen Sie <command>adjkerntz -i</command> verwenden, um die Kerneluhr anzupassen, wenn Sie in den Single-User-Modus booten.
es_es: Este error no significa que la utilidad <citerefentry><refentrytitle>touch</refentrytitle><manvolnum>1</manvolnum></citerefentry> este faltante. En su lugar el error probablemente se debe a que las fechas de los archivos están ajustadas a una fecha futura. Si el reloj CMOS esta ajustado a tiempo local, corra <command>adjkerntz -i</command> para ajustar el reloj del kernel al arrancar en modo de un solo usuario.
pt_br: Este erro não significa que o utilitário <citerefentry><refentrytitle>touch</refentrytitle><manvolnum>1</manvolnum></citerefentry> esteja ausente. O erro é provavelmente devido às datas dos arquivos que estão sendo definidos em algum momento no futuro. Se o relógio do CMOS estiver configurado para a hora local, execute <command>adjkerntz -i</command> para ajustar o relógio do kernel ao inicializar no modo de usuário único.

source: User Applications
de_de: Anwendungen
es_es: Aplicaciones de usuario
pt_br: Aplicativos do Usuário

source: Where are all the user applications?
de_de: Wo finde ich die ganzen Anwendungen?
es_es: ¿Cuáles son las aplicaciones de usuario?
pt_br: Onde estão todas as aplicações de usuário?

source: Refer to <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">the ports page</link> for info on software packages ported to FreeBSD. The list currently tops 24,000 and is growing daily, so come back to check often or subscribe to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">FreeBSD announcements mailing list</link> for periodic updates on new entries.
de_de: Informationen zu auf FreeBSD portierten Anwendungen finden Sie auf der <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">Ports-Seite</link>. Die Liste enthält circa 24.000 Pakete und es werden ständig mehr. Sie sollten diese Liste daher im Auge behalten, oder die <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">FreeBSD announcements Mailingliste</link> abonnieren und regelmäßig auf neue Einträge prüfen.
es_es: Vaya a <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">la página de ports</link> para información acerca de paquetes de software que han sido porteados a FreeBSD. La lista actual contiene más de 24,000 y crece diariamente, vuelva y verifíquela seguido o subscribase a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">lista de anuncios de FreeBSD</link> para actualizaciones periódicas sobre nuevas entradas.
pt_br: Consulte <link xlink:href="@@URL_RELPREFIX@@/ports/index.html"> a página de ports </link> para informações sobre os pacotes de software portados para o FreeBSD. A lista atualmente tem 24.000 aplicativos e está crescendo diariamente, então volte sempre para conferir ou assine a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce"> lista de discussão de anúncios do FreeBSD </link> para atualizações periódicas com as novidades.

source: Most ports should work on all supported versions of FreeBSD. Those that do not are specifically marked as such. Each time a FreeBSD release is made, a snapshot of the ports tree at the time of release in also included in the <filename>ports/</filename> directory.
de_de: Die meisten Ports sollten auf allen unterstützten FreeBSD Versionen lauffähig sein. Nicht funktionierende Ports sind als solche gekennzeichnet. Jedes mal, wenn ein FreeBSD Release erstellt wird, wird ein Snapshot der Ports-Sammlung in <filename>ports/</filename> mitgeliefert.
es_es: La mayoría de los ports deberían funcionar en todas las version soportadas de FreeBSD. Los que no lo hacen están marcados específicamente de esta manera. Cada vez que se realiza una versión de FreeBSD, se hace un snapshot del árbol de ports al momento de la versión que se incluye en el directorio <filename>ports/</filename>.
pt_br: A maioria dos ports deve funcionar em todas as versões suportadas do FreeBSD. Aqueles que não funcionam, estão especificamente sinalizados como tal. Cada vez que uma release do FreeBSD é construida, um snapshot da coleção de ports no momento da construção também é incluída no diretório <filename>ports/</filename>.

source: FreeBSD supports compressed binary packages to easily install and uninstall ports. Use <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>7</manvolnum></citerefentry> to control the installation of packages.
de_de: FreeBSD unterstützt für die Installation komprimierte Binärpakete und Ports. Benutzen Sie <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>7</manvolnum></citerefentry> um die Installation von Paketen zu steuern.
es_es: FreeBSD soporta paquetes binarios comprimidos para instalar y desinstalar ports fácilmente. Use <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>7</manvolnum></citerefentry> para controlar la instalación de paquetes.
pt_br: O FreeBSD suporta pacotes binários compactados para facilitar a instalação e desinstalação dos ports. Use o comando <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>7</manvolnum></citerefentry> para controlar a instalação de pacotes.

source: How do I download the Ports tree? Should I be using SVN?
de_de: Wie lade ich die Ports-Sammlung herunter? Soll ich dafür SVN benutzen?
es_es: ¿Como descargo el árbol de Ports? ¿Debería usar SVN?

source: Any of the methods listed here work:
de_de: Die folgenden Methoden können verwendet werden:
es_es: Cualquiera de los métodos listados aquí funciona:
pt_br: Qualquer um dos métodos listados aqui funciona:

source: Use portsnap for most use cases. Refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Using the Ports Collection</link> for instructions on how to use this tool.
de_de: In den meisten Situationen sollten Sie portsnap benutzen. Der Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports-using.html">Benutzen der Ports-Sammlung</link> beschreibt die Verwendung dieses Werkzeugs.
es_es: Use portsnap para la mayoría de los casos. Vea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Usando la colección de Ports</link> para instrucciones acerca de como usar esta herramienta.
pt_br: Use o portsnap para a maioria dos casos de uso. Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Usando a coleção de ports</link> para obter instruções sobre como usar essa ferramenta .

source: Use SVN if custom patches to the ports tree are needed. Refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Using Subversion</link> for details.
de_de: Verwenden Sie SVN, wenn Sie bestimmte Patches für den Portsbaum benötigen. Lesen Sie <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/svn.html">Benutzen von Subversion</link> für weitere Informationen.
es_es: Use SVN si se necesitan parches personalizados para el árbol de ports. Vea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Usando Subversion</link> para más detalles.

source: Use <acronym>CTM</acronym>, as described in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ctm.html">Using <acronym>CTM</acronym></link> to receive patches by email over an unreliable Internet connection.
es_es: Use <acronym>CTM</acronym>, como se describe en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ctm.html">Usando <acronym>CTM</acronym></link> para recibir parches por correo electrónico sobre una conexión a internet poco confiable.

source: Does FreeBSD support <trademark>Java</trademark>?
de_de: Unterstützt FreeBSD <trademark>Java</trademark>?
es_es: ¿FreeBSD soporta <trademark>Java</trademark>?
pt_br: O FreeBSD suporta o <trademark>Java</trademark>?

source: Yes. Refer to <link xlink:href="@@URL_RELPREFIX@@/java/index.html">http://www.FreeBSD.org/java/</link> for more information.
de_de: Ja. Lesen Sie <link xlink:href="@@URL_RELPREFIX@@/java/index.html">http://www.FreeBSD.org/java/</link> für weitere Informationen.
es_es: Si. Vea <link xlink:href="@@URL_RELPREFIX@@/java/index.html">http://www.FreeBSD.org/java/</link> para más información.

source: Why can I not build this port on my 9.<replaceable>X</replaceable> -, or 10.<replaceable>X</replaceable> -STABLE machine?
de_de: Warum kann ich manche Ports auf meiner 9.<replaceable>X</replaceable> oder 10.<replaceable>X</replaceable>-STABLE-Maschine nicht erstellen?
es_es: ¿Porque no puedo compilar este port en mi máquina 9.<replaceable>X</replaceable> -, o 10.<replaceable>X</replaceable> -STABLE?

source: If the installed FreeBSD version lags significantly behind <emphasis>-CURRENT</emphasis> or <emphasis>-STABLE</emphasis>, update the Ports Collection using the instructions in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Using the Ports Collection</link>. If the system is up-to-date, someone might have committed a change to the port which works for <emphasis>-CURRENT</emphasis> but which broke the port for <emphasis>-STABLE</emphasis>. <link xlink:href="https://bugs.FreeBSD.org/submit/">Submit</link> a bug report, since the Ports Collection is supposed to work for both the <emphasis>-CURRENT</emphasis> and <emphasis>-STABLE</emphasis> branches.
de_de: Wenn Sie eine FreeBSD-Version benutzen, die deutlich älter als das aktuelle <emphasis>-CURRENT</emphasis> oder <emphasis>-STABLE</emphasis> ist, könnte es sein, dass Sie zunächst die Ports-Sammlung aktualisieren müssen. Lesen Sie dazu <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports-using.html">Benutzen der Ports-Sammlung</link>. Ist die Ports-Sammlung aktuell, könnte es sein, dass jemand eine Änderung am Port durchgeführt hat, die für <emphasis>-CURRENT</emphasis> funktioniert, den Port für <emphasis>-STABLE</emphasis> aber unbrauchbar gemacht hat. Bitte senden Sie einen <link xlink:href="https://bugs.FreeBSD.org/submit/">Fehlerbericht</link>. Von der Ports-Sammlung wird nämlich erwartet, dass sie sowohl auf <emphasis>-CURRENT</emphasis> als auch auf <emphasis>-STABLE</emphasis> funktioniert.
es_es: Si la versión de FreeBSD instalada se atrasa significativamente de <emphasis>-CURRENT</emphasis> o <emphasis>-STABLE</emphasis>, actualice la colección de ports usando las instrucciones en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Usando la colección de ports</link>. Si el sistema esta actualizado, alguien puede haber commiteado un cambio al port que funciona para <emphasis>-CURRENT</emphasis> pero que rompió el port para <emphasis>-STABLE</emphasis>. <link xlink:href="https://bugs.FreeBSD.org/submit/">Envíe</link> un reporte de errores, dado que se supone que la colección de ports funcione tanto para la rama <emphasis>-CURRENT</emphasis> como para <emphasis>-STABLE</emphasis>.
pt_br: Se a versão do FreeBSD instalada estiver significativamente atrás do <emphasis>-CURRENT</emphasis> ou do <emphasis>-STABLE</emphasis>, atualize a coleção de ports usando as instruções disponíveis na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Usando a coleção de ports</link>. Se o sistema estiver atualizado, alguém pode ter feito uma alteração no port que funciona para <emphasis>-CURRENT</emphasis> mas que quebrou o port para o <emphasis>-STABLE</emphasis>. <link xlink:href="https://bugs.FreeBSD.org/submit/">Envie</link> um relatório de bug, já que a Coleção de Ports deve funcionar tanto para o branch <emphasis>-CURRENT</emphasis> e quanto o <emphasis>-STABLE</emphasis>.

source: I just tried to build <filename>INDEX</filename> using <command>make index</command>, and it failed. Why?
de_de: Ich habe gerade versucht, <filename>INDEX</filename> mit <command>make index</command> zu bauen, und es hat nicht geklappt. Woran liegt das?
es_es: Acabo de intentar compilar <filename>INDEX</filename> usando <command>make index</command> y fallo. ¿Porque?
pt_br: Acabei de tentar compilar o <filename>INDEX</filename> usando o comando <command>make index</command>, e ele falhou. Por quê?

source: First, make sure that the Ports Collection is up-to-date. Errors that affect building <filename>INDEX</filename> from an up-to-date copy of the Ports Collection are high-visibility and are thus almost always fixed immediately.
de_de: Stellen Sie zuerst sicher, dass die Ports-Sammlung aktuell ist. Fehler, die einen Bau von <filename>INDEX</filename> aus einer aktuellen Ports-Sammlung verhindern, sind sofort sichtbar und werden daher fast immer umgehend behoben.
es_es: Primero, asegúrese de que la colección de ports esta actualizada. Errores que afecten la compilación de <filename>INDEX</filename> de una copia actualizada de la colección de ports tienen alta visibilidad y suelen arreglarse casi inmediatamente.
pt_br: Primeiro, certifique-se de que a Coleção de Ports esteja atualizada. Erros que afetam a compilação do <filename>INDEX</filename> a partir de uma cópia atualizada da coleção de ports são de alta visibilidade e, portanto, quase sempre são corrigidos imediatamente.

source: There are rare cases where <filename>INDEX</filename> will not build due to odd cases involving <varname>WITH_<replaceable>*</replaceable></varname> or <varname>WITHOUT_<replaceable>*</replaceable></varname> variables being set in <filename>make.conf</filename>. If you suspect that this is the case, try to make <filename>INDEX</filename> with those make variables turned off before reporting it to <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>.
de_de: Es gibt seltene Fälle, in denen <filename>INDEX</filename> nicht gebaut werden kann, wenn bestimmte <varname>WITH_<replaceable>*</replaceable></varname> oder <varname>WITHOUT_<replaceable>*</replaceable></varname> Variablen in <filename>make.conf</filename> gesetzt sind. Wenn Sie dieses Problem haben, sollten Sie diese make-Variablen deaktivieren und <filename>INDEX</filename> erneut bauen, bevor Sie das Problem an die <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD Ports Mailingliste</link> melden.
es_es: Hay raras ocurrencias en las que <filename>INDEX</filename> no compilara debido a casos extraños que involucren variables <varname>WITH_<replaceable>*</replaceable></varname> o <varname>WITHOUT_<replaceable>*</replaceable></varname> siendo ajustadas en <filename>make.conf</filename>. Si sospecha que este es el caso, intente hacer make de <filename>INDEX</filename> con esas variables desactivadas antes de reportar el error a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de correo de ports de FreeBSD </link>.

source: I updated the sources, now how do I update my installed ports?
de_de: Ich habe die Quellen aktualisiert, wie aktualisiere ich jetzt die installierten Ports?
es_es: He actualizado el código fuente ¿Como actualizo mis ports instalados?
pt_br: Eu atualizei os fontes, agora como faço para atualizar meus ports instalados?

source: FreeBSD does not include a port upgrading tool, but it does have some tools to make the upgrade process somewhat easier. Additional tools are available to simplify port handling and are described the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Upgrading Ports</link> section in the FreeBSD Handbook.
de_de: FreeBSD enthält zwar kein Programm, das die installierten Ports aktualisiert, allerdings existieren diverse Programme, die diesen Prozess etwas vereinfachen. Weiterhin können Sie zusätzliche Programme installieren, die Sie dabei unterstützen. Lesen Sie das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports-using.html">Benutzen der Ports-Sammlung</link> im FreeBSD Handbuch.
es_es: FreeBSD no incluye una herramienta para actualizar ports, pero si tiene herramientas para hacer el proceso de actualización un poco más fácil. Herramientas adicionales están disponibles para simplificar el manejo de ports y son descriptas en la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Actualizando ports</link>en el manual de FreeBSD.
pt_br: O FreeBSD não inclui uma ferramenta de atualização de ports, mas possui algumas ferramentas para facilitar o processo de atualização. Ferramentas adicionais estão disponíveis para simplificar o manuseio dos ports e são descritas na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Atualizando Ports</link> no Handbook do FreeBSD .

source: Do I need to recompile every port each time I perform a major version update?
de_de: Muss ich nach der Aktualisierung einer FreeBSD-Hauptversion jedes Mal alle Ports neu erstellen?
es_es: ¿Es necesario que recompile todos los ports cada vez que hago una actualización a una versión mayor?
pt_br: Preciso recompilar todos os ports sempre que realizo uma atualização de versão principal?
