Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Read the section on <link linkend="signal11">Signal 11</link> for a further explanation and a discussion on how memory testing software or hardware can still pass faulty memory. There is an extensive <acronym>FAQ</acronym> on this at <link xlink:href="http://www.bitwizard.nl/sig11/">the SIG11 problem <acronym>FAQ</acronym></link>.
de_de: Lesen Sie den Abschnitt <link linkend="signal11">Signal 11</link> für weitere Erklärungen. Es existiert eine ausführliche <acronym>FAQ</acronym> hierzu unter <link xlink:href="http://www.bitwizard.nl/sig11/">the SIG11 problem <acronym>FAQ</acronym></link>.
es_es: Lea la sección acerca de <link linkend="signal11">Signal 11</link> para más explicaciones y una discusión acerca de como el software o hardware que verifica la memoria puede no detectar memoria defectuosa. Hay un extenso <acronym>FAQ</acronym> acerca de esto en <link xlink:href="http://www.bitwizard.nl/sig11/">el problema SIG11<acronym>FAQ</acronym></link>.
pt_br: Leia a seção sobre o <link linkend="signal11">Signal 11</link> para obter maiores explicações e a discussão sobre como um software ou hardware de teste de memória ainda pode deixar passar uma memória defeituosa. Existe uma extensa <acronym>FAQ</acronym> sobre o problema do SIG11 disponível <link xlink:href="http://www.bitwizard.nl/sig11/">neste link</link>.

source: Finally, if none of this has helped, it is possibly a bug in FreeBSD. Follow <link linkend="access-pr">these instructions</link> to send a problem report.
de_de: Wenn alle diese Schritte nicht helfen, ist es möglich, dass Sie einen Fehler in FreeBSD gefunden haben. Folgen Sie einfach <link linkend="access-pr">diesen Anweisungen</link> für die Erstellung eines Problem Reports.
es_es: Finalmente, si nada de esto ayuda, es posible que sea un error en FreeBSD. Siga <link linkend="access-pr">estas instrucciones</link> para enviar un reporte de errores.
pt_br: Por fim, se nada disso ajudou, trata-se possivelmente de um bug no FreeBSD. Siga <link linkend="access-pr">estas instruções</link> para enviar um relatório de problemas.

source: My system crashes with either <errorname>Fatal trap 12: page fault in kernel mode</errorname>, or <errorname>panic:</errorname>, and spits out a bunch of information. What should I do?
de_de: Mein System stürzt mit der Meldung <errorname>Fatal trap 12: page fault in kernel mode</errorname> oder <errorname>panic:</errorname> ab und gibt eine Menge zusätzlicher Informationen aus. Was kann ich tun?
es_es: Mi sistema falla con <errorname>Fatal trap 12: page fault in kernel mode</errorname>, o <errorname>panic:</errorname>, y escupe un monton de información. ¿Qué debo hacer?
pt_br: Meu sistema trava com <errorname>Fatal trap 12: page fault in kernel mode</errorname> ou <errorname>panic:</errorname>, e mostra um monte de informações. O que devo fazer?

source: The FreeBSD developers are interested in these errors, but need more information than just the error message. Copy the full crash message. Then consult the <acronym>FAQ</acronym> section on <link linkend="kernel-panic-troubleshooting">kernel panics</link>, build a debugging kernel, and get a backtrace. This might sound difficult, but does not require any programming skills. Just follow the instructions.
de_de: Die Entwickler von FreeBSD interessieren sich für solchen Meldungen, allerdings brauchen Sie deutlich mehr Informationen als nur die Fehlermeldung. Kopieren Sie die kompletten Meldungen und lesen Sie anschließend den <acronym>FAQ</acronym>-Abschnitt über <link linkend="kernel-panic-troubleshooting">kernel panics</link>. Erzeugen sie einen Kernel mit den zusätzlichen Daten zur Fehlersuche, und dann einen Backtrace. Das hört sich komplizierter an, als es ist. Sie brauchen keine Programmier-Erfahrung, Sie müssen einfach nur den Anweisungen folgen.
es_es: Los desarrolladores de FreeBSD están interesados en estos errores, pero necesitan mas información que solo el mensaje de error. Copie el mensaje de fallo entero. Luego consulte la sección del <acronym>FAQ</acronym> acerca de <link linkend="kernel-panic-troubleshooting">fallos de kernel</link>, compile un kernel de depuración y obtenga un backtrace. Esto puede sonar difícil, pero no requiere habilidades de programación. Tan solo siga las instrucciones.
pt_br: Os desenvolvedores do FreeBSD estão interessados ​​nesses erros, mas precisam de mais informações do que apenas a mensagem de erro. Copie a mensagem completa da falha. Em seguida, consulte a seção <acronym>FAQ</acronym> em <link linkend="kernel-panic-troubleshooting">kernel panics</link>, compile um kernel de depuração e obtenha um backtrace. Isso pode parecer difícil, mas não requer nenhuma habilidade de programação. Apenas siga as instruções.

source: What is the meaning of the error <errorname>maxproc limit exceeded by uid %i, please see tuning(7) and login.conf(5)</errorname>?
de_de: Was bedeutet die Fehlermeldung <errorname>maxproc limit exceeded by uid %i, please see tuning(7) and login.conf(5)</errorname>?
es_es: ¿Cual es el significado del error <errorname>maxproc limit exceeded by uid %i, please see tuning(7) and login.conf(5)</errorname>?
pt_br: Qual é o significado do erro <errorname>maxproc limit exceeded by uid %i, please see tuning(7) and login.conf(5)</errorname>?

source: The FreeBSD kernel will only allow a certain number of processes to exist at one time. The number is based on the <varname>kern.maxusers</varname> <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> variable. <varname>kern.maxusers</varname> also affects various other in-kernel limits, such as network buffers. If the machine is heavily loaded, increase <varname>kern.maxusers</varname>. This will increase these other system limits in addition to the maximum number of processes.
de_de: Der FreeBSD-Kernel beschränkt die Anzahl der gleichzeitig laufenden Prozesse. Die Anzahl errechnet sich aus dem Wert der <varname>kern.maxusers</varname> <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Variable. Auch andere Einstellungen wie die Anzahl der Puffer für Netzwerkoperationen werden durch <varname>kern.maxusers</varname> beeinflusst. Wenn das System stark belastet ist, sollten Sie den Wert von <varname>kern.maxusers</varname> erhöhen. Dadurch werden diverse Einstellungen des Systems angepasst und die maximale Anzahl gleichzeitig laufender Prozesse erhöht.
es_es: El kernel de FreeBSD solo permite que exista un cierto número de procesos en un punto determinado del tiempo. El número esta basado en la variable de <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> <varname>kern.maxusers</varname>. <varname>kern.maxusers</varname> también afecta varios otros límites del kernel, tales como los buffers de red. Si la máquina esta bajo una carga intensiva, incremente <varname>kern.maxusers</varname>. Esto incrementara estos otros límites del sistema, además del número máximo de procesos.
pt_br: O kernel do FreeBSD permitirá que apenas um certo número de processos exista ao mesmo tempo. O número é baseado na variável <varname>kern.maxusers</varname> do <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. O valor da variável <varname>kern.maxusers</varname> também afeta vários outros limites dentro do kernel, como por exemplo os buffers de rede. Se a máquina estiver muito carregada, aumente o <varname>kern.maxusers</varname>. Isso aumentará esses outros limites do sistema além do número máximo de processos.

source: To adjust the <varname>kern.maxusers</varname> value, see the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">File/Process Limits</link> section of the Handbook. While that section refers to open files, the same limits apply to processes.
de_de: Um den Wert von <varname>kern.maxusers</varname> anzupassen, folgen Sie den Anweisungen im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">Datei und Prozeß Limits</link> des Handbuchs. Dieser Abschnitt spricht zwar nur von Dateien, für Prozesse gelten aber die gleichen Beschränkungen.
es_es: Para ajustar el valor de <varname>kern.maxusers</varname>, vea la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">Límites de proceso/archivo</link> del manual. Mientras que esa sección se refiere a archivos abierto, los mismos límites aplican para los procesos.
pt_br: Para ajustar o valor da variável <varname>kern.maxusers </varname>, consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">Limites de Arquivos / Processos</link> do Handbook. Apesar desta seção se referir a arquivos abertos, os mesmos limites se aplicam aos processos.

source: If the machine is lightly loaded but running a very large number of processes, adjust the <varname>kern.maxproc</varname> tunable by defining it in <filename>/boot/loader.conf</filename>. The tunable will not get adjusted until the system is rebooted. For more information about tuning tunables, see <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. If these processes are being run by a single user, adjust <varname>kern.maxprocperuid</varname> to be one less than the new <varname>kern.maxproc</varname> value. It must be at least one less because one system program, <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, must always be running.
de_de: Wenn das System nicht besonders stark ausgelastet ist und Sie einfach nur mehr gleichzeitig laufende Prozesse erlauben wollen, können Sie den Wert der Variable <varname>kern.maxproc</varname> in <filename>/boot/loader.conf</filename> anpassen. Um die Änderung zu aktivieren, müssen Sie das System neu starten. Wollen Sie das System zusätzlich optimieren, sollten Sie <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> lesen. Wenn diese Prozesse von einem einzigen Benutzer ausgeführt werden, müssen Sie den Wert von <varname>kern.maxprocperuid</varname> ebenfalls erhöhen. Dieser Wert muss immer mindestens um eins geringer sein als der Wert von <varname>kern.maxproc</varname>, weil ein Systemprogramm, <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, immer ausgeführt werden muss.
es_es: Si la máquina tiene una carga ligera pero esta corriendo número muy alto de proceso, ajuste la variable <varname>kern.maxproc</varname> definiendola en <filename>/boot/loader.conf</filename>. La variable no se ajustara hasta que el sistema se reinicie. Para más información acerca de ajustar variables, vea <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Si estos procesos están siendo corridos por un solo usuario, ajuste <varname>kern.maxprocperuid</varname> para que sea uno menos que el nuevo valor de <varname>kern.maxproc</varname>. Debe ser al menos uno menos porque hay un programa del sistema, <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, que debe estar corriendo constantemente.
pt_br: Se a máquina estiver levemente carregada, mas executando um número muito grande de processos, ajuste o valor do <varname>kern.maxproc</varname> definindo-o no arquivo <filename>/boot/loader.conf</filename>. O ajuste não terá efeito até que o sistema seja reinicializado. Para mais informações sobre o tuning de variáveis, consulte o manual do <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Se esses processos estiverem sendo executados por um único usuário, ajuste o <varname>kern.maxprocperuid</varname> para que fique menor em 1 unidade do novo valor do <varname>kern.maxproc</varname>. Ele deve ser pelo menos uma unidade menor porque o programa do sistema, <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, deve estar sempre em execução.

source: Why do full screen applications on remote machines misbehave?
de_de: Wieso funktionieren bildschirmorientierte Anwendungen beim Zugriff über ein Netzwerk nicht richtig?
es_es: ¿Por qué las aplicaciónes de pantalla completa en máquinas remotas se comportan mal?
pt_br: Por que aplicativos de tela cheia em máquinas remotas se comportam de forma errática?

source: The remote machine may be setting the terminal type to something other than <literal>xterm</literal> which is required by the FreeBSD console. Alternatively the kernel may have the wrong values for the width and height of the terminal.
de_de: Die entfernte Maschine scheint den Terminaltyp auf etwas anderes als den Typ <literal>xterm</literal>, der von FreeBSD verlangt wird, zu setzen. Vielleicht hat aber auch der Kernel falsche Werte für die Breite und Höhe des Terminals.
es_es: La máquina remota puede estar ajustando el tipo de la terminal a un valor que no sea <literal>xterm</literal> el cual es requerido por la consola de FreeBSD. Alternativamente el kernel puede contener los valores equivocados para el ancho y alto de la terminal.
pt_br: A máquina remota pode estar configurando o tipo de terminal para algo diferente de <literal> xterm </literal>, que é o tipo requerido pelo console do FreeBSD. Alternativamente, o kernel pode ter valores errados para a largura e a altura do terminal.

source: Check the value of the <envar>TERM</envar> environment variable is <literal>xterm</literal>. If the remote machine does not support that try <literal>vt100</literal>.
de_de: Überprüfen Sie, ob der Wert der <envar>TERM</envar>-Umgebungsvariable <literal>xterm</literal> ist. Wenn das entfernte Gerät dies nicht unterstützt, versuchen Sie <literal>vt100</literal>.
es_es: Verifique que el valor de la variable de entorno <envar>TERM</envar> sea <literal>xterm</literal>. Si la máquina remota no soporta eso, intente <literal>vt100</literal>.
pt_br: Verifique se o valor da variável de ambiente <envar>TERM</envar> é <literal>xterm</literal>. Se a máquina remota não suportar isso, tente<literal>vt100</literal>.

source: Run <command>stty -a</command> to check what the kernel thinks the terminal dimensions are. If they are incorrect, they can be changed by running <command>stty rows <replaceable>RR</replaceable> cols <replaceable>CC</replaceable></command>.
de_de: Führen Sie <command>stty -a</command> aus, um zu überprüfen, was der Kernel für Terminalaußmaße eingestellt hat. Wenn diese Werte falsch sind, können sie mit <command>stty rows <replaceable>RR</replaceable> cols <replaceable>CC</replaceable></command> geändert werden.
es_es: Corra <command>stty -a</command> para verificar que dimensiones cree el kernel que tiene la terminal. Si son incorrectas, pueden cambiarse corriendo <command>stty rows <replaceable>RR</replaceable> cols <replaceable>CC</replaceable></command>.
pt_br: Execute o <command>stty -a</command> para verificar o que o kernel acha que são as dimensões do terminal. Se estiverem incorretos, eles podem ser alterados executando <command>stty rows<replaceable>RR</replaceable>cols<replaceable>CC</replaceable></command>.

source: Alternatively, if the client machine has <package>x11/xterm</package> installed, then running <command>resize</command> will query the terminal for the correct dimensions and set them.
de_de: Falls <package>x11/xterm</package> installiert ist, können Sie alternativ auch <command>resize</command> ausführen, um die richtigen Einstellungen für das Terminal zu setzen.
es_es: Alternativamente, si la máquina del cliente tiene <package>x11/xterm</package> instalado, entonces correr <command>resize</command> consultara a la terminal las dimensiones correctas y las ajustara.
pt_br: Alternativamente, se a máquina do cliente tiver o <package>x11/xterm</package> instalado, a execução do <command>resize</command> consultará o terminal para as dimensões corretas e as definirá.

source: Why does it take so long to connect to my computer via <command>ssh</command> or <command>telnet</command>?
de_de: Wieso dauert es so lange, bis eine Verbindung über <command>ssh</command> oder <command>telnet</command> aufgebaut wird?
es_es: ¿Porque le lleva tanto tiempo a mi computadora conectarse via <command>ssh</command> o <command>telnet</command>?
pt_br: Por que demora tanto para conectar ao meu computador via <command>ssh</command> ou <command>telnet</command>?

source: The symptom: there is a long delay between the time the TCP connection is established and the time when the client software asks for a password (or, in <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry>'s case, when a login prompt appears).
de_de: Das Symptom: Nach dem Aufbau des TCP-Verbindung vergeht einige Zeit, bis endlich die Abfrage des Passwortes (bzw. der Login-Prompt bei <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry>) erscheint.
es_es: El síntoma: hay un largo retraso entre el tiempo en que se establece la conexión TCP y el tiempo en el que el software del cliente pide una contraseña (o, en el caso de <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry>, cuando aparece una pantalla de autenticación).
pt_br: O sintoma: há um longo atraso entre o momento em que a conexão TCP é estabelecida e a hora em que o software cliente solicita uma senha (ou, no caso do <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry>, quando um prompt de login aparece).

source: The problem: more likely than not, the delay is caused by the server software trying to resolve the client's IP address into a hostname. Many servers, including the <application>Telnet</application> and <application>SSH</application> servers that come with FreeBSD, do this to store the hostname in a log file for future reference by the administrator.
de_de: Das Problem: In den meisten Fällen versucht der Server die IP-Adresse des Clients in einen Rechnernamen zu übersetzen. Viele Server, darunter die <application>Telnet</application> und <application>SSH</application>-Server von FreeBSD, machen das, um den Hostnamen in eine Protokolldatei zu schreiben.
es_es: El problema: lo más probable, es que el retraso haya sido causado por el software del servidor intentando resolver la dirección IP del cliente a un nombre de host. Muchos servidores, incluyendo los servidores <application>Telnet</application> y <application>SSH</application> que vienen con FreeBSD, hacen esto para guardar el hostname en un archivo de log para referencias futuras del administrador.
pt_br: O problema: mais provável do que não, o atraso é causado pelo software do servidor tentando resolver o endereço IP do cliente em um nome de host. Muitos servidores, incluindo os servidores <application>Telnet</application> e <application>SSH</application> que vêm com o FreeBSD, fazem isso para armazenar o nome do host em um arquivo de log para referência futura pelo administrador.

source: The remedy: if the problem occurs whenever connecting the client computer to any server, the problem is with the client. If the problem only occurs when someone connects to the server computer, the problem is with the server.
de_de: Die Lösung: wenn das Problem bei jedem Server auftritt, den Sie von dem Computer (dem Client) ansprechen, dann wird das Problem vom Client verursacht. Wenn das Problem aber nur auftritt, wenn jemand den Rechner (den Server) anspricht, dann liegt die Ursache beim Server.
es_es: La solución: si el problema ocurre siempre que se conecta la computadora cliente a cualquier servidor, el problema esta en el cliente. Si el problema ocurre solo cuando alguien se conecta a la computadora servidor, el problema esta en el servidor.
pt_br: A solução: se o problema ocorrer sempre, independente do servidor ao que o computador cliente se conecta, o problema está no cliente. Se o problema ocorrer apenas quando o computador cliente se conecta a um determinado servidor, o problema está no servidor.

source: If the problem is with the client, the only remedy is to fix the DNS so the server can resolve it. If this is on a local network, consider it a server problem and keep reading. If this is on the Internet, contact your ISP.
de_de: Wenn das Problem vom Client verursacht wird, müssen Sie die Einträge im DNS korrigieren, damit der Server die IP-Adresse übersetzen kann. Wenn das Problem im lokalen Netzwerk auftritt, sollten Sie es als Problem des Servers behandeln und weiterlesen; wenn es allerdings im Internet auftritt, sollten Sie Ihren ISP kontaktieren.
es_es: Si el problema esta en el cliente, la única solución es reparar el DNS de manera que el servidor pueda resolverla. Si esto ocurre en una red local, considerelo un problema del servidor y siga leyendo. Si esto ocurre en Internet, contacte a su ISP.
pt_br: Se o problema for com o cliente, a única solução é corrigir o DNS para que o servidor possa resolvê-lo. Se isso estiver ocorrendo em uma rede local, considere um problema no servidor e continue lendo. Se isso estiver ocorrendo na Internet, entre em contato com seu ISP.
