Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If you are still prompted to give the <systemitem class="username">root</systemitem> password when entering the single-user mode, it means that the console has been marked as <literal>insecure</literal> in <filename>/etc/ttys</filename>. In this case, it will be required to boot from a FreeBSD installation disk, choose the <guimenuitem>Live CD</guimenuitem> or <guimenuitem>Shell</guimenuitem> at the beginning of the install process and issue the commands mentioned above. Mount the specific partition in this case and then chroot to it. For example, replace <command>mount -urw /</command> with <command>mount /dev/ada0p1 /mnt; chroot /mnt</command> for a system on <replaceable>ada0p1</replaceable>.
de_de: Wenn Sie immer noch dazu aufgefordert werden, das Passwort für <systemitem class="username">root</systemitem> beim Betreten des Single-User-Modus einzugeben, bedeutet das, dass die Konsole in <filename>/etc/ttys</filename> als <literal>insecure</literal> markiert wurde. In diesem Fall ist es notwendig, von einem FreeBSD Installationsmedium zu booten, die Option <guimenuitem>Live CD</guimenuitem> oder <guimenuitem>Shell</guimenuitem> auszuwählen und die oben beschriebenen Befehle einzugeben. Mounten Sie die entsprechende Partition und wechseln Sie mit <command>chroot</command> in die Partition. Ersetzen Sie bspw. <command>mount -urw /</command> durch <command>mount /dev/ada0p1 /mnt; chroot /mnt</command> falls eine solche Partition auf dem System existiert.
es_es: Si todavía se le pide la contraseña de <systemitem class="username">root</systemitem> al ingresar en modo de un solo usuario, significa que la consola ha sido marcada como <literal>insegura</literal> en <filename>/etc/ttys</filename>. En este caso, se requerirá que arranque desde un disco de instalación de FreeBSD, elija <guimenuitem>Live CD</guimenuitem> o <guimenuitem>Shell</guimenuitem> al inicio del proceso de instalación y corra los comandos mencionados anteriormente. Monte la partición específica en este caso y luego haga chroot en ella. Por ejemplo, reemplace <command>mount -urw /</command> con <command>mount /dev/ada0p1 /mnt; chroot /mnt</command> para un sistema en <replaceable>ada0p1</replaceable>.
pt_br: Se você ainda for solicitado a entrar com a senha do usuário <systemitem class="username">root</systemitem> ao entrar no modo single user único, isso significa que o console foi configurado como <literal>inseguro</literal> no arquivo <filename>/etc/ttys</filename>. Neste caso, será necessário inicializar a partir de um disco de instalação do FreeBSD, escolher o <guimenuitem>Live CD</guimenuitem> ou <guimenuitem>Shell</guimenuitem> no início do processo de instalação e executar os comandos mencionados acima. Monte a partição específica neste caso e, em seguida, execute o chroot para ela. Por exemplo, substitua <command>mount -urw /</command> por <command>mount /dev/ada0p1 /mnt; chroot /mnt</command> para um sistema em instalado em <replaceable>ada0p1</replaceable>.

source: If the root partition cannot be mounted from single-user mode, it is possible that the partitions are encrypted and it is impossible to mount them without the access keys. For more information see the section about encrypted disks in the FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">Handbook</link>.
de_de: Wenn Sie die Root-Partition im Single-User-Modus nicht mounten können, liegt es möglicherweise daran, dass die Partitionen verschlüsselt sind und es damit unmöglich ist, sie ohne die dazugehörigen Schlüssel zu mounten. Für weitere Informationen lesen Sie den Abschnitt über verschlüsselte Partitionen im FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/disks-encrypting.html">Handbuch</link>.
es_es: Si la partición raíz no puede ser montada en modo de un solo usuario, es posible que las particiones se encuentren encriptadas y es imposible montarlas sin las llaves de acceso. Para más información vea la sección acerca de discos encriptados en el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">manual</link> de FreeBSD.
pt_br: Se a partição raiz não puder ser montada a partir do modo de usuário único, é possível que as partições estejam criptografadas e será impossível montá-las sem as chaves de acesso. Para obter mais informações, consulte a seção sobre discos criptografados no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">Handbook</link> do FreeBSD.

source: How do I keep <keycombo action="simul"><keycap>Control</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo> from rebooting the system?
de_de: Wie verhindere ich, dass das System mit <keycombo action="simul"><keycap>Strg</keycap><keycap>Alt</keycap><keycap>Entf</keycap></keycombo> rebootet werden kann?
es_es: ¿Como prevengo que <keycombo action="simul"><keycap>Control</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo> borre el sistema?
pt_br: Como evito que a combinação de teclas <keycombo action="simul"><keycap>Control</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo> reinicialize o sistema?

source: When using <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, the default console driver, build and install a new kernel with this line in the configuration file:
de_de: Falls Sie <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> (der Standard-Treiber für die Konsole) benutzen, fügen Sie folgende Zeile in die Kernelkonfigurationsdatei ein und bauen und installieren Sie einen neuen Kernel:
es_es: Cuando use <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>, el controlador por defecto dela consola, compile e instale un nuevo kernel con esta línea en el archivo de configuración:
pt_br: Se estiver utilizando o <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry> que é o driver padrão de console, compile e instale um novo kernel que contenha esta linha no arquivo de configuração:

source: This can also be done by setting the following <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> which does not require a reboot or kernel recompile:
de_de: Alternativ kann die folgende <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Variable gesetzt werden, ohne dass Sie das System dazu neu starten oder einen angepassten Kernel erstellen müssen:
es_es: Esto también puede hacerse ajustando el siguiente <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> que no requiere un reinicio o una recompilación de kernel:
pt_br: Isto também pode ser feito definindo a variável abaixo do <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>, este processo não requer uma reinicialização ou recompilação do kernel:

source: The above two methods are exclusive: The <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> does not exist if the kernel is compiled with <literal>SC_DISABLE_REBOOT</literal>.
de_de: Die beiden oben genannten Methoden schließen sich gegenseitig aus: Diese <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Variable existiert nicht, wenn Sie einen Kernel mit der Option <literal>SC_DISABLE_REBOOT</literal> bauen.
es_es: Los dos métodos anteriores son exclusivos: el <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> no existe si el kernel se compila con <literal>SC_DISABLE_REBOOT</literal>.
pt_br: Os dois métodos acima são exclusivos: Esta variável do <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> não existirá se o kernel tiver sido compilado com a opção <literal>SC_DISABLE_REBOOT</literal>.

source: How do I reformat DOS text files to <trademark class="registered">UNIX</trademark> ones?
de_de: Wie kann ich DOS-Textdateien unter <trademark class="registered">UNIX</trademark> verwenden?
es_es: ¿Como reformateo archivos de texto de DOS a archivos <trademark class="registered">UNIX</trademark>?
pt_br: Como faço para converter arquivos de texto do DOS para <trademark class="registered">UNIX</trademark>?

source: Use this <citerefentry><refentrytitle>perl</refentrytitle><manvolnum>1</manvolnum></citerefentry> command:
de_de: Benutzen Sie diesen <citerefentry><refentrytitle>perl</refentrytitle><manvolnum>1</manvolnum></citerefentry>-Befehl:
es_es: Use este comando de <citerefentry><refentrytitle>perl</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
pt_br: Use este comando <citerefentry><refentrytitle>perl</refentrytitle><manvolnum>1</manvolnum></citerefentry>:

source: where <replaceable>file(s)</replaceable> is one or more files to process. The modification is done in-place, with the original file stored with a <filename>.bak</filename> extension.
de_de: Wobei <replaceable>file(s)</replaceable> eine oder mehrere zu verarbeitende(n) Datei(en) ist/sind. Die Änderungen erfolgen in der Originaldatei, die zuvor mit der Erweiterung <filename>.bak</filename> gesichert wird.
es_es: donde <replaceable>file(s)</replaceable> es uno o más archivos a procesar. La modificación se hace en el lugar, con el archivo original guardado con la extensión <filename>.bak</filename>.
pt_br: no qual <replaceable>files(s)</replaceable> trata-se de um ou mais arquivos que desejamos processar. A modificação é feita in-place, o arquivo original é preservado com uma extensão <filename>.bak</filename>.

source: Alternatively, use <citerefentry><refentrytitle>tr</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
de_de: Alternativ können Sie den Befehl <citerefentry><refentrytitle>tr</refentrytitle><manvolnum>1</manvolnum></citerefentry> benutzen:
es_es: Alternativamente, use <citerefentry><refentrytitle>tr</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
pt_br: Alternativamente, use o <citerefentry><refentrytitle>tr</refentrytitle><manvolnum>1</manvolnum></citerefentry>:

source: <replaceable>dos-text-file</replaceable> is the file containing DOS text while <replaceable>unix-file</replaceable> will contain the converted output. This can be quite a bit faster than using <command>perl</command>.
de_de: <replaceable>dos-text-file</replaceable> ist die Datei, die den Text im DOS-Format enthält und <replaceable>unix-file</replaceable> wird die konvertierte Ausgabe enthalten. Diese Möglichkeit könnte etwas schneller sein, als die Benutzung von <command>perl</command>.
es_es: <replaceable>dos-text-file</replaceable> es el archivo que contiene texto de DOS mientras que <replaceable>unix-file</replaceable> contendrá la salida convertida. Esto puede ser un poco más rápido que usar <command>perl</command>.
pt_br: O <replaceable>dos-text-file</replaceable> é o arquivo que contém o texto no formato DOS, enquanto o <replaceable>unix-file</replaceable> contém a saída convertida. Esta opção pode ser um pouco mais rápida do que usar o <command>perl</command>.

source: Yet another way to reformat DOS text files is to use the <package>converters/dosunix</package> port from the Ports Collection. Consult its documentation about the details.
de_de: Die Verwendung von <package>converters/dosunix</package> aus der Ports-Sammlung stellt eine weitere Möglichkeit dar, DOS-Textdateien neu zu formatieren. Konsultieren Sie die Dokumentation für weitere Informationen.
es_es: Otra forma de reformatear archivos de texto de DOS es usar el port <package>converters/dosunix</package> de la colección de ports. Consulte su documentación para más detalles.
pt_br: Uma outra maneira de reformatar arquivos de texto do DOS é usar o port <package>converters/dosunix</package> da Coleção de Ports. Consulte a sua documentação para maiores detalhes.

source: How do I re-read <filename>/etc/rc.conf</filename> and re-start <filename>/etc/rc</filename> without a reboot?
de_de: Wie lade ich <filename>/etc/rc.conf</filename> und starte <filename>/etc/rc</filename> neu, ohne zu rebooten?
es_es: ¿Como releo <filename>/etc/rc.conf</filename> y rearranco <filename>/etc/rc</filename> sin reiniciar?
pt_br: Como faço para reler o arquivo <filename>/etc/rc.conf</filename> e reiniciar o <filename>/etc/rc</filename> sem dar boot?

source: Go into single-user mode and then back to multi-user mode:
de_de: Gehen Sie in den Single-User-Modus und dann zurück in den Multi-User-Modus:
es_es: Vaya al modo de un solo usuario y luego vuelva al modo multiusuario:
pt_br: Entre no modo single user e retorne ao modo multi usuário:

source: I tried to update my system to the latest <emphasis>-STABLE</emphasis>, but got <emphasis>-BETA<replaceable>x</replaceable></emphasis>, <emphasis>-RC</emphasis> or <emphasis>-PRERELEASE</emphasis>! What is going on?
de_de: Ich wollte auf das aktuelle -STABLE aktualisieren, und plötzlich läuft auf dem System ein <emphasis>-BETA<replaceable>x</replaceable></emphasis>, <emphasis>-RC</emphasis> oder <emphasis>-PRERELEASE</emphasis>! Was ist passiert?
es_es: ¡Intente actualizar mi sistema al último <emphasis>-STABLE</emphasis>, pero obtuve <emphasis>-BETA<replaceable>x</replaceable></emphasis>, <emphasis>-RC</emphasis> o <emphasis>-PRERELEASE</emphasis>! ¿Qué esta pasando?
pt_br: Tentei atualizar o meu sistema para a versão <emphasis>-STABLE</emphasis> mais recente, mas obtive a <emphasis>-BETA<replaceable>x</replaceable></emphasis>, <emphasis>-RC</emphasis> ou <emphasis>-PRERELEASE</emphasis>! O que está acontecendo?

source: Short answer: it is just a name. <emphasis>RC</emphasis> stands for <quote>Release Candidate</quote>. It signifies that a release is imminent. In FreeBSD, <emphasis>-PRERELEASE</emphasis> is typically synonymous with the code freeze before a release. (For some releases, the <emphasis>-BETA</emphasis> label was used in the same way as <emphasis>-PRERELEASE</emphasis>.)
de_de: Kurze Antwort: Das ist nur ein anderer Name. <emphasis>RC</emphasis> ist die Abkürzung für <quote>Release Candidate</quote>. Es bedeutet, dass ein neues Release bevorsteht. PRERELEASE bedeutet bei FreeBSD, dass der Quellcode zur Vorbereitung auf ein Release <quote>ingefroren</quote> wurde (in einigen Releases wurde <emphasis>-BETA</emphasis> anstelle von <emphasis>-PRERELEASE</emphasis> verwendet).
es_es: Respuesta corta: es solo un nombre. <emphasis>RC</emphasis> significa <quote>Release Candidate</quote>. Esto quiere decir que un lanzamiento es inminente. En FreeBSD, <emphasis>-PRERELEASE</emphasis> típicamente significa el congelamiento de código antes de un lanzamiento. (Para algunos lanzamientos, la etiqueta <emphasis>-BETA</emphasis> fue usada en la misma manera que <emphasis>-PRERELEASE</emphasis>.)
pt_br: Resposta curta: é apenas um nome. <emphasis>RC</emphasis> significa <quote>Release Candidate</quote>. Isso significa que uma nova release é iminente. No FreeBSD, <emphasis>-PRERELEASE</emphasis> é tipicamente sinônimo do congelamento de código antes de uma release. (Para algumas versões, o rótulo <emphasis>-BETA</emphasis> foi usado da mesma forma que o <emphasis>-PRERELEASE</emphasis>.)

source: Long answer: FreeBSD derives its releases from one of two places. Major, dot-zero, releases, such as 9.0-RELEASE are branched from the head of the development stream, commonly referred to as <link linkend="current">-CURRENT</link>. Minor releases, such as 6.3-RELEASE or 5.2-RELEASE, have been snapshots of the active <link linkend="stable">-STABLE</link> branch. Starting with 4.3-RELEASE, each release also now has its own branch which can be tracked by people requiring an extremely conservative rate of development (typically only security advisories).
de_de: Ausführliche Antwort: Bei FreeBSD gibt es zwei Quellen für Releases. Die Major Releases wie 9.0-RELEASE werden aus dem aktuellen Stand des Hauptzweiges der Entwicklung (besser bekannt als <link linkend="current">-CURRENT</link>) erzeugt. Minor Releases wie 6.3-RELEASE oder 5.2-RELEASE stammen aus dem aktiven <link linkend="stable">-STABLE</link> Zweig. Seit 4.3-RELEASE gibt es nun auch einen eigenen Zweig für jede Release, der für die Leute gedacht ist, die ein sehr konservativ weiterentwickeltes System benötigen (normalerweise nur Sicherheitsaktualisierungen).
es_es: Respuesta larga: FreeBSD deriva sus lanzamientos actuales de uno de dos lugares. Las versiones mayores, punto cero, tales como 9.0-RELEASE se ramifican del punto mas adelantado del torrente de desarrollo, comúnmente denominado <link linkend="current">-CURRENT</link>. Versiones menores, tales como 6.3-RELEASE o 5.2-RELEASE, fueron snapshots de la rama <link linkend="stable">-STABLE</link> activa. A partir de 4.3-RELEASE, cada versión ahora también tiene su propia rama que puede ser seguida por gente que requiera una velocidad de desarrollo extremadamente conservadora (típicamente solo avisos de seguridad).
pt_br: Resposta longa: o FreeBSD deriva suas releases de um de dois lugares. Releases principais (major) ponto-zero, como a 9.0-RELEASE são derivadas a partir do branch principal de desenvolvimento, comumente referida como <link linkend="current">-CURRENT</link>. Releases secundárias (minor), como a 6.3-RELEASE ou a 5.2-RELEASE, foram snapshots da branch <link linkend="stable">-STABLE</link> ativa. A partir do 4.3-RELEASE, cada release também tem sua própria branch, a qual pode ser seguida por pessoas que exigem uma taxa extremamente conservadora de desenvolvimento (geralmente apenas avisos de segurança).

source: When a release is about to be made, the branch from which it will be derived from has to undergo a certain process. Part of this process is a code freeze. When a code freeze is initiated, the name of the branch is changed to reflect that it is about to become a release. For example, if the branch used to be called 6.2-STABLE, its name will be changed to 6.3-PRERELEASE to signify the code freeze and signify that extra pre-release testing should be happening. Bug fixes can still be committed to be part of the release. When the source code is in shape for the release the name will be changed to 6.3-RC to signify that a release is about to be made from it. Once in the RC stage, only the most critical bugs found can be fixed. Once the release (6.3-RELEASE in this example) and release branch have been made, the branch will be renamed to 6.3-STABLE.
de_de: Bevor in einem Zweig ein Release erfolgt, muss in diesem Zweig ein bestimmter Prozess ablaufen. Ein Teil dieses Prozesses ist der <quote>code freeze</quote>, der Stop der Weiterentwicklung. Sobald dieser Schritt erfolgt ist, wird der Name des Zweiges geändert, um anzuzeigen, dass demnächst ein Release erfolgen wird. Wenn der Zweig zum Beispiel 6.2-STABLE genannt wurde, wird der Name in 6.3-PRERELEASE geändert, um dies zu verdeutlichen. Weiterhin ist das ein Zeichen, dass jetzt besonders intensiv getestet werden sollte. In dieser Phase können Fehler im Quellcode noch korrigiert werden. Wenn der Quellcode so weit <quote>gereift</quote> ist, dass ein Release erstellt werden kann, wird der Name in 6.3-RC geändert, um genau dies anzuzeigen. In dieser Phase können nur noch extrem wichtige Korrekturen aufgenommen werden. Sobald das Release (in diesem Beispiel 6.3-RELEASE) erfolgt ist, wird der Zweig in 6.3-STABLE umbenannt.
es_es: Cuando esta a punto de hacerse un lanzamiento, la rama desde la cual sera derivada debe pasar por un cierto proceso. Parte de este proceso es un congelamiento de código. Cuando el mismo se inicia, el nombre de la rama se cambia para reflejar que esta a punto de convertirse en una versión. Por ejemplo, si la rama se solía llamar 6.2-STABLE, su nombre sera cambiado a 6.3-PRERELEASE para indicar el congelamiento de código y remarcar que habrá un testo extra pre-lanzamiento. Las correcciones de errores pueden seguir siendo commiteadas para formar parte del lanzamiento. Cuando el código fuente esta en forma para ser lanzado el nombre sera cambiado a 6.3-RC para indicar que se esta por hacer un lanzamiento a partir del mismo. Una vez en la fase de RC, solo los errores más críticos serán reparados. Una vez que el lanzamiento (6.3-RELEASE en este ejemplo) y la rama de la versión se hayan hecho, la rama sera renombrada a 6.3-STABLE.
pt_br: Quando um release está prestes a ser feito, o branch do qual ele será derivado tem que passar por um determinado processo. Parte desse processo é um congelamento de código. Quando um congelamento de código é iniciado, o nome da branch é alterado para refletir que está prestes a se tornar uma release. Por exemplo, se a ramificação costumava ser chamada de 6.2-STABLE, seu nome será alterado para 6.3-PRERELEASE para indicar o congelamento de código e indicar que testes extras de pré-release devem estar acontecendo. Correções de bugs ainda podem ser adicionadas ao repositório de código fonte para fazer parte da release. Quando o código-fonte estiver estabilizado para a release, o nome será alterado para 6.3-RC para indicar que uma release está prestes a ser feita a partir dele. Uma vez no estágio RC, somente os bugs mais críticos que forem encontrados podem ser corrigidos. Uma vez que o release (6.3-RELEASE neste exemplo) e o branch de release foram feitos, o branch será renomeado para 6.3-STABLE.

source: For more information on version numbers and the various Subversion branches, refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link> article.
de_de: Weitere Informationen über Versionsnummern und die verschiedenen Entwicklungszweige enthält der Artikel <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link>.
es_es: Para más información acerca de números de version y varias ramas de Subversion, vea el artículo de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Ingenieria de lanzamientos </link>.
pt_br: Para mais informações sobre números de versão e as várias branches do Subversion, consulte o artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link>.

source: I tried to install a new kernel, and the <citerefentry><refentrytitle>chflags</refentrytitle><manvolnum>1</manvolnum></citerefentry> failed. How do I get around this?
de_de: Als ich versucht habe, einen neuen Kernel zu installieren, ist <citerefentry><refentrytitle>chflags</refentrytitle><manvolnum>1</manvolnum></citerefentry> fehlgeschlagen. Was mache ich jetzt?
es_es: He intentado instalar un nuevo kernel y las <citerefentry><refentrytitle>chflags</refentrytitle><manvolnum>1</manvolnum></citerefentry> fallaron. ¿Como soluciono esto?
pt_br: Tentei instalar um novo kernel, e o <citerefentry><refentrytitle>chflags</refentrytitle><manvolnum>1</manvolnum></citerefentry> falhou. Como faço para contornar isso?

source: Short answer: the security level is greater than 0. Reboot directly to single-user mode to install the kernel.
de_de: Kurze Antwort: die Sicherheitseinstellung (der securelevel) ist größer als 0. Sie müssen das System im Single-User-Modus starten, um den Kernel zu installieren.
es_es: Respuesta corta: el nivel de seguridad es mayor a 0. Reinicie directamente al modo de un solo usuario para instalar el kernel.
pt_br: Resposta curta: o nível de segurança é maior que 0. Reinicialize diretamente para o modo de single user para instalar o kernel.
