Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Where <replaceable>hd0,a</replaceable> points to the root partition on the first disk. To specify the slice number, use something like this <replaceable>(hd0,2,a)</replaceable>. By default, if the slice number is omitted, <application>GRUB</application> searches the first slice which has the <literal>a</literal> partition.
de_de: Dabei steht <replaceable>hd0,a</replaceable> für die Root-Partition der ersten Festplatte. Benötigen Sie auch die Slice-Nummer, so verwenden Sie einen Eintrag der Form <replaceable>hd0,2,a</replaceable>. In der Voreinstellung ist die Angabe der Slice-Nummer aber nicht nötig, da <application>GRUB</application> automatisch das erste Slice (das die Bezeichnung <literal>a</literal> hat) nutzt.
es_es: Donde <replaceable>hd0,a</replaceable> apunte a la partición raíz del primer disco. Para especificar el número de slice, utilice algo como esto <replaceable>(hd0,2,a)</replaceable>. Por defecto, si el número de slice es omitido, <application>GRUB</application> busca la primera dado que tiene la partición <literal>a</literal>.
pt_br: No qual <replaceable>hd0,a</replaceable> aponta para a partição raiz no primeiro disco. Para especificar o número da slice, use algo como isto <replaceable>(hd0,2,a)</replaceable>. Por padrão, se o número da slice for omitido, o <application>GRUB</application> pesquisará a primeira slice que tiver a partição <literal>a</literal>.

source: How do I boot FreeBSD and <trademark class="registered">Linux</trademark> using <application>BootEasy?</application>
de_de: Wie boote ich FreeBSD und <trademark class="registered">Linux</trademark> mit <application>BootEasy</application>?
es_es: ¿Como arranco FreeBSD y <trademark class="registered">Linux</trademark> usando <application>BootEasy?</application>
pt_br: Como inicializo o FreeBSD e o <trademark class="registered">Linux</trademark> usando o <application>BootEasy?</application>

source: Install LILO at the start of the <trademark class="registered">Linux</trademark> boot partition instead of in the Master Boot Record. You can then boot LILO from <application>BootEasy</application>.
de_de: Installieren Sie LILO am Anfang der <trademark class="registered">Linux</trademark>-Bootpartition, anstatt im Master Boot Record. Sie können LILO dann von <application>BootEasy</application> aus booten.
es_es: Instale LILO al inicio de la partición de arranque de <trademark class="registered">Linux</trademark> en lugar de en el Registro de Arranque Principal Luego podrá arrancar LILO desde <application>BootEasy</application>.
pt_br: Instale o LILO no início da partição de inicialização <trademark class="registered">Linux</trademark> em vez de no Master Boot Record. Você poderá então inicializar o LILO a partir do <application>BootEasy</application>.

source: This is recommended when running <trademark class="registered">Windows</trademark> and <trademark class="registered">Linux</trademark> as it makes it simpler to get <trademark class="registered">Linux</trademark> booting again if <trademark class="registered">Windows</trademark> is reinstalled.
de_de: Wenn Sie <trademark class="registered">Windows</trademark> und <trademark class="registered">Linux</trademark> benutzen, wird dies ohnehin empfohlen, um es einfacher zu machen, <trademark class="registered">Linux</trademark> wieder zu booten, wenn es nötig werden sollte, dass Sie <trademark class="registered">Windows</trademark> neu installieren.
es_es: Esto se recomienda al correr <trademark class="registered">Windows</trademark> y <trademark class="registered">Linux</trademark> dado que hace mucho más simple lograr que <trademark class="registered">Linux</trademark> arranque nuevamente si <trademark class="registered">Windows</trademark> es reinstalado.
pt_br: Isto é recomendado ao executar o <trademark class="registered">Windows</trademark> e o <trademark class="registered">Linux</trademark>, pois torna mais fácil fazer o <trademark class="registered">Linux</trademark> inicializar novamente se o <trademark class="registered">Windows</trademark> for reinstalado.

source: How do I change the boot prompt from <literal>???</literal> to something more meaningful?
de_de: Wie kann ich das <literal>???</literal> des Boot-Managers durch etwas Sinnvolles ersetzen?
es_es: ¿Como cambio el indicador de arranque de <literal>???</literal> a algo que tenga más sentido?
pt_br: Como faço para alterar o prompt de inicialização de <literal>???</literal> para algo mais significativo?

source: This cannot be accomplished with the standard boot manager without rewriting it. There are a number of other boot managers in the <filename>sysutils</filename> category of the Ports Collection.
de_de: Ohne den Boot-Manager neu zu schreiben, gar nicht. Allerdings gibt es in der Kategorie <filename>sysutils</filename> der Ports-Sammlung diverse Boot-Manager, die diese Funktionalität bieten.
es_es: Esto no puede lograrse con el cargador de arranque estándar sin reescribirlo. Existen varios otros cargadores de arranque en la categoría <filename>sysutils</filename> de la colección de ports.
pt_br: Isso não pode ser feito com o gerenciador de inicialização padrão sem reescrevê-lo. Há vários outros gerenciadores de inicialização na categoria <filename>sysutils</filename> da coleção de ports.

source: How do I use a new removable drive?
de_de: Wie verwende ich einen neuen Wechseldatenträger?
es_es: ¿Como utilizo un nuevo disco removible?
pt_br: Como faço para usar uma nova unidade removível?

source: If the drive already has a file system on it, use a command like this:
de_de: Wenn auf dem Laufwerk bereits ein Dateisystem existiert, können Sie folgendes Kommando benutzen:
es_es: Si el disco ya tiene un sistema de archivos en el, use un comando como este:
pt_br: Se a unidade já tiver um sistema de arquivos, use um comando como este:

source: If the drive will only be used with FreeBSD systems, partition it with <acronym>UFS</acronym> or <acronym>ZFS</acronym>. This will provide long filename support, improvement in performance, and stability. If the drive will be used by other operating systems, a more portable choice, such as msdosfs, is better.
de_de: Wenn das Laufwerk nur mit FreeBSD-Systemen verwendet wird, partitionieren Sie es mit <acronym>UFS</acronym> oder <acronym>ZFS</acronym>. Dies bietet Unterstützung für lange Dateinamen, eine verbesserte Leistung und Stabilität. Wenn das Laufwerk von anderen Betriebssystemen verwendet wird, ist bspw. msdosfs die bessere Wahl.
es_es: Si el disco solo puede ser usado con sistemas FreeBSD, particionelo con <acronym>UFS</acronym> o <acronym>ZFS</acronym>. Esto proveerá soporte para nombres de archivo largos, mejoras en performance y estabilidad. Si el disco va a ser usado por otros sistemas operativos, una opción más portable, tal como msdosfs, es preferible.
pt_br: Se a unidade só for usada com sistemas FreeBSD, particione-a com <acronym>UFS</acronym> ou <acronym>ZFS</acronym>. Isso fornecerá suporte a nomes longos de arquivo, melhoria no desempenho e na estabilidade. Se a unidade for usada por outros sistemas operacionais, uma escolha mais portátil, como por exemplo o msdosfs, será mais apropriada.

source: Finally, create a new file system:
de_de: Anschließend erstellen Sie ein neues Dateisystem:
es_es: Finalmente, cree un nuevo sistema de archivos:
pt_br: Finalmente, crie um novo sistema de arquivos:

source: and mount it:
de_de: und mounten es:
es_es: y móntelo:
pt_br: e monte-o:

source: It is a good idea to add a line to <filename>/etc/fstab</filename> (see <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry>) so you can just type <command>mount /mnt</command> in the future:
de_de: Es ist eine gute Idee einen Eintrag in <filename>/etc/fstab</filename> hinzuzufügen (siehe <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry>), sodass Sie in Zukunft einfach nur <command>mount /mnt</command> eingeben müssen:
es_es: Es una buena idea agregar una línea a <filename>/etc/fstab</filename> (vea <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry>) de manera que pueda simplemente escribir <command>mount /mnt</command> en el futuro:
pt_br: É uma boa ideia adicionar uma linha ao <filename>/etc/fstab</filename> (veja <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry>) para que você possa digitar apenas <command>mount /mnt</command>no futuro:

source: Why do I get <errorname>Incorrect super block</errorname> when mounting a CD?
de_de: Wieso erhalte ich die Meldung <errorname>Incorrect super block</errorname> beim Mounten einer CD?
es_es: ¿Por qué obtengo <errorname>Incorrect super block</errorname> al montar un CD?
pt_br: Por que recebo o erro <errorname>Incorrect super block</errorname> ao montar um CD?

source: The type of device to mount must be specified. This is described in the Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Using Data CDs</link>.
de_de: Sie müssen <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry> mitteilen, was für ein Gerät Sie mounten wollen. Genauere Informationen dazu finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Einhängen von Daten-CDs</link> des Handbuchs.
es_es: El tipo de dispositivo a montar debe estar especificado. Esto se describe en la sección del manual acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Usar CDs de datos</link>.
pt_br: O tipo de dispositivo a ser montado deve ser especificado. Isso está descrito no Handbook na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd"> Usando CDs de Dados</link>.

source: Why do I get <errorname>Device not configured</errorname> when mounting a CD?
de_de: Wieso erhalte ich die Meldung <errorname>Device not configured</errorname>, wenn ich eine CD mounte?
es_es: ¿Por qué obtengo <errorname>Device not configured</errorname> al montar un CD?
pt_br: Por que recebo o erro <errorname>Device not configured</errorname> ao montar um CD?

source: This generally means that there is no CD in the drive, or the drive is not visible on the bus. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Using Data CDs</link> section of the Handbook for a detailed discussion of this issue.
de_de: Das bedeutet im allgemeinen, dass sich keine CD im Laufwerk befindet, oder dass das Laufwerk auf dem Bus nicht sichtbar ist. Dieses Problem wird im Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Einhängen von Daten-CDs</link> des Handbuchs ausführlich diskutiert.
es_es: Esto usualmente significa que no hay CD en el dispositivo, o que el dispositivo no es visible en el bus. Refiérase a la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Usando CDs de datos</link> del manual para una discusión detallada de este problema.
pt_br: Isso geralmente significa que não há CD na unidade ou a unidade não está visível no barramento. Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd"> Usando CDs de Dados</link> do Handbook para uma discussão detalhada desta questão.

source: Why do all non-English characters in filenames show up as <quote>?</quote> on my CDs when mounted in FreeBSD?
de_de: Wieso werden alle Sonderzeichen in den Dateinamen auf meinen CDs durch <quote>?</quote> ersetzt, wenn ich die CD unter FreeBSD benutze?
es_es: ¿Por qué todos los caracteres no ingleses en los nombres de archivo se muestran como <quote>?</quote> en mis CDs cuando los monto en FreeBSD?
pt_br: Por que todos os caracteres não-ingleses em nomes de arquivos aparecem como <quote>?</quote> em meus CDs quando montados no FreeBSD?

source: The CD probably uses the <quote>Joliet</quote> extension for storing information about files and directories. This is discussed in the Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Using Data CD-ROMs</link>.
de_de: Wahrscheinlich werden auf der CD-ROM die <quote>Joliet</quote> Erweiterungen für die Speicherung von Datei- und Verzeichnisnamen benutzt. Werfen Sie einen Blick in das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Einhängen von Daten-CDs</link> im Handbuch.
es_es: El CD probablemente use la extensión <quote>Joliet</quote> para guardar información acerca de archivos y directorios. Esto se discute en la sección del manual <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Usando CDs de datos</link>.
pt_br: O CD provavelmente usa a extensão <quote>Joliet</quote> para armazenar informações sobre arquivos e diretórios. Isso é discutido na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Usando CD-ROMs de Dados</link> do Handbook.

source: A CD burned under FreeBSD cannot be read under any other operating system. Why?
de_de: Ich habe eine CD mit FreeBSD gebrannt und kann sie nicht mit anderen Betriebssystemen lesen. Warum?
es_es: Un CD grabado bajo FreeBSD no puede ser leído bajo ningún otro sistema operativo. ¿Porque?
pt_br: Um CD gravado no FreeBSD não pode ser lido sob nenhum outro sistema operacional. Por quê?

source: This means a raw file was burned to the CD, rather than creating an ISO 9660 file system. Take a look at the Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Using Data <acronym>CD</acronym>s</link>.
de_de: Sie haben wahrscheinlich eine Datei direkt auf CD geschrieben, statt ein ISO 9660-Dateisystem erzeugt zu haben. Werfen Sie einen Blick in das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Einhängen von Daten-<acronym>CD</acronym>s</link> im Handbuch.
es_es: Esto significa que un archivo crudo fue grabado al CD, en lugar de crear un sistema de archivos ISO 9660. Dele un vistazo a la sección del manual acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Utilizar <acronym>CD</acronym>s de datos</link>.
pt_br: Isso significa que um raw file foi gravado no CD, em vez de criar um sistema de arquivos ISO 9660. Dê uma olhada na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mounting-cd">Usando <acronym> CD</acronym>s de Dados</link>.

source: How can I create an image of a data CD?
de_de: Wie kann ich ein Image einer Daten-CD erzeugen?
es_es: ¿Como puedo crear una imagen de un CD de datos?
pt_br: Como posso criar uma imagem de um CD de dados?

source: This is discussed in the Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mkisofs">Writing Data to an <acronym>ISO</acronym> File System</link>. For more on working with CD-ROMs, see the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html">Creating CDs Section</link> in the Storage chapter in the Handbook.
de_de: Diese Information finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mkisofs">Daten auf ein <acronym>ISO</acronym>-Dateisystem schreiben</link> des Handbuchs. Weitere Informationen über die Arbeit mit CD-ROMs finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html">Erstellen und Verwenden von CDs</link> im Kapitel Speichermedien des Handbuchs.
es_es: Esto se dicute en la sección del manual acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mkisofs">Escribir datos a un sistema de archivos <acronym>ISO</acronym></link>. Para más información acerca de trabajar con CD-ROMs, vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html">sección acerca de crear CDs</link> en el capítulo de almacenamiento en el manual.
pt_br: Isso é discutido na seção Handbook sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html#mkisofs">como gravar dados em um sistema de arquivos <acronym>ISO</acronym> </link>. Para mais informações sobre como trabalhar com CD-ROMs, consulte a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html"> Seção Criando CDs </link> no capítulo sobre Armazenamento do Handbook.

source: Why can I not <command>mount</command> an audio CD?
de_de: Wieso kommt <command>mount</command> nicht mit einer Audio-CD zurecht?
es_es: ¿Porque no puedo hacer <command>mount</command> a un CD de audio?
pt_br: Por que não consigo usar o comando <command>mount</command> com um CD de áudio?

source: Trying to mount an audio CD will produce an error like <errorname>cd9660: /dev/acd0c: Invalid argument</errorname>. This is because <command>mount</command> only works on file systems. Audio CDs do not have file systems; they just have data. Instead, use a program that reads audio CDs, such as the <package>audio/xmcd</package> package or port.
de_de: Wenn Sie versuchen eine Audio-CD zu mounten, erhalten Sie die Meldung <errorname>cd9660: /dev/acd0c: Invalid argument</errorname>. Der Grund dafür ist, dass <command>mount</command> nur mit Dateisystemen arbeitet. Audio-CDs haben kein Dateisystem, sondern nur Daten. Wenn Sie eine Audio-CD auslesen wollen, brauchen Sie ein entsprechendes Programm wie z.B. den Port oder das Paket <package>audio/xmcd</package>.
es_es: Intentar montar un CD de audio producira un error como <errorname>cd9660: /dev/acd0c: Invalid argument</errorname>. Esto es porque <command>mount</command> solo funciona en sistemas de archivos. Los CDs de audio no tienen sistemas de archivos; solo tienen datos. En su lugar, utilice un programa que lea CDs de audio, como el paquete o port de <package>audio/xmcd</package>.

source: How do I <command>mount</command> a multi-session CD?
de_de: Wie mounte ich eine Multi-Session CD?
es_es: ¿Como hago <command>mount</command> a un CD multi-sesión?
pt_br: Como eu faço para usar o comando <command>mount</command> com um CD multi-sessão?

source: By default, <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry> will attempt to mount the last data track (session) of a CD. To load an earlier session, use the <option>-s</option> command line argument. Refer to <citerefentry><refentrytitle>mount_cd9660</refentrytitle><manvolnum>8</manvolnum></citerefentry> for specific examples.
de_de: Standardmäßig benutzt <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry> den letzten (aktuellsten) Daten-Track der CD. Wenn Sie eine ältere Session benutzen wollen, müssen Sie diese mit der Option <option>-s</option> definieren. Weitere Informationen und Beispiele finden Sie in <citerefentry><refentrytitle>mount_cd9660</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: Por defecto, <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry> intentara montar la última pista de datos (sesión) a un CD. Para cargar una sesión anterior, use el argumento de linea de comandos <option>-s</option>. Vea <citerefentry><refentrytitle>mount_cd9660</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ejemplos específicos.
pt_br: Por padrão, o <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry> tentará montar a última trilha de dados (sessão) de um CD. Para carregar uma sessão anterior, use o argumento de linha de comando <option>-s</option>. Consulte <citerefentry><refentrytitle>mount_cd9660</refentrytitle><manvolnum>8</manvolnum></citerefentry> para exemplos específicos.

source: How do I let ordinary users mount CD-ROMs, DVDs, USB drives, and other removable media?
de_de: Wie lasse ich normale Benutzer Disketten, CD-ROMs und andere Wechseldatenträger mounten?
es_es: ¿Como hago para que los usuarios comunes puedan montar CD-ROMs, DVDs, dispositivos USB, y otros medios removibles?
pt_br: Como posso permitir que usuários não privilegiados montem CD-ROMs, DVDs, unidades USB e outras mídias removíveis?

source: As <systemitem class="username">root</systemitem> set the sysctl variable <varname>vfs.usermount</varname> to <literal>1</literal>.
de_de: Setzen Sie als <systemitem class="username">root</systemitem> die sysctl-Variable <varname>vfs.usermount</varname> auf <literal>1</literal>:
es_es: Como <systemitem class="username">root</systemitem> ajuste la variable de sysctl <varname>vfs.usermount</varname> a <literal>1</literal>.
pt_br: Como <systemitem class="username">root</systemitem>, defina a variável <varname>vfs.usermount</varname> do sysctl como <literal>1</literal>.

source: To make this persist across reboots, add the line <literal>vfs.usermount=1</literal> to <filename>/etc/sysctl.conf</filename> so that it is reset at system boot time.
de_de: Fügen Sie den Eintrag <literal>vfs.usermount=1</literal> in <filename>/etc/sysctl.conf</filename> hinzu, damit die Einstellung beim nächsten Systemstart erneut gesetzt wird.
es_es: Para hacer que esto persista a un reinicio, agregue la línea <literal>vfs.usermount=1</literal> a <filename>/etc/sysctl.conf</filename> de modo que se vuelva a ajustar al inicio del sistema.
pt_br: Para tornar o ajuste permanente, adicione a linha <literal>vfs.usermount=1</literal> ao arquivo <filename>/etc/sysctl.conf</filename> para que a variável seja redefinids no momento da inicialização do sistema.

source: Users can only mount devices they have read permissions to. To allow users to mount a device permissions must be set in <filename>/etc/devfs.conf</filename>.
de_de: Benutzer dürfen nur Geräte mounten, auf die sie Leserechte haben. Um es Benutzern zu gestatten Geräte zu mounten, müssen die entsprechenden Berechtigungen in <filename>/etc/sysctl.conf</filename> gesetzt werden.
es_es: Los usuarios solo pueden montar dispositivos que tienen permisos para leer. Para permitir que los usuarios monten un dispositivo los permisos deben establecerse en <filename>/etc/devfs.conf</filename>.
pt_br: Os usuários só podem montar dispositivos para os quais tenham permissões de leitura. Para permitir que os usuários montem um dispositivo, as permissões devem ser definidas em <filename>/etc/devfs.conf</filename>.

source: For example, to allow users to mount the first USB drive add:
de_de: Wenn Sie zum Beispiel den Benutzern den Zugriff auf das erste USB-Laufwerk zu erlauben wollen:
es_es: Por ejemplo, para permitir a los usuarios montar el primer dispositivo de USB añada:
pt_br: Por exemplo, para permitir que os usuários montem a primeira unidade USB, adicione:

source: # Allow all users to mount a USB drive. own /dev/da0 root:operator perm /dev/da0 0666
es_es: # Prmitir a todos los usuarios montar un dispositivo USB. own /dev/da0 root:operator perm /dev/da0 0666

source: All users can now mount devices they could read onto a directory that they own:
de_de: Alle Benutzer können nun Geräte, die sie lesen können, in ein Verzeichnis einbinden, das sie besitzen:
es_es: Ahora todos los usuarios pueden montar dispositivos que podrían leer a un directorio propio:
pt_br: Todos os usuários agora podem montar dispositivos que eles podem ler em um diretório que eles possuem:
