Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This command may be typed at the <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> command prompt or it may be entered at the start of the <literal>default</literal> section in <filename>/etc/ppp/ppp.conf</filename>. Make sure that <filename>/etc/syslog.conf</filename> contains the lines below and the file <filename>/var/log/ppp.log</filename> exists:
de_de: Dieser Befehl kann an der Eingabeaufforderung von <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> eingegeben, oder in den Abschnitt <literal>default</literal> der Konfigurationsdatei <filename>/etc/ppp/ppp.conf</filename> eingetragen werden. Stellen Sie sicher, dass die Datei <filename>/etc/syslog.conf</filename> die folgenden Zeilen enthält und die Datei <filename>/var/log/ppp.log</filename> existiert:
es_es: Este comando debe ser escrito en el indicador de comandos de <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry>o puede ser ingresado al inicio de la sección <literal>default</literal> en <filename>/etc/ppp/ppp.conf</filename>. Asegurese de que <filename>/etc/syslog.conf</filename> contenga las líneas mostradas a continuación y que el archivo <filename>/var/log/ppp.log</filename> exista:
pt_br: Este comando pode ser digitado no prompt de comando <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ou pode ser inserido no início da seção <literal>default</literal> do arquivo <filename>/etc/ppp/ppp.conf</filename>. Certifique-se de que o arquivo <filename>/etc/syslog.conf</filename> contenha as linhas abaixo e de que o arquivo <filename>/var/log/ppp.log</filename> exista:

source: A lot about what is going can be learned from the log file. Do not worry if it does not all make sense as it may make sense to someone else.
de_de: Sie können nun in der Protokolldatei eine Menge darüber herausfinden, was geschieht. Es macht nichts, wenn die Einträge Ihnen gar nichts sagen. Wenn Sie jemandem um Hilfe bitten müssen, könnten sie für ihn von Nutzen sein.
es_es: Mucho de lo que esta pasando puede verse en el archivo de log. No se preocupe si no tiene sentido dado que puede tener sentido para alguien más.
pt_br: Muito sobre o que está acontecendo pode ser aprendido no arquivo de log. Não se preocupe se isso não faz sentido, pois pode fazer sentido para outra pessoa.

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> hang when I run it?
de_de: Warum hängt sich <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf, wenn ich es benutze?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> se cuelga cuando lo corro?
pt_br: Por que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> é interrompido quando eu o executo?

source: This is usually because the hostname will not resolve. The best way to fix this is to make sure that <filename>/etc/hosts</filename> is read first by the by ensuring that the <literal>hosts</literal> line is listed first in <filename>/etc/host.conf</filename>. Then, put an entry in <filename>/etc/hosts</filename> for the local machine. If there is no local network, change the <systemitem>localhost</systemitem> line:
de_de: Das liegt meistens daran, dass der Rechnername nicht aufgelöst werden kann. Um dieses Problem zu lösen, müssen Sie sicherstellen, dass <filename>/etc/hosts</filename> vom Resolver zuerst genutzt wird. Dazu muss in <filename>/etc/host.conf</filename> der Eintrag <literal>hosts</literal> an die erste Stelle gesetzt werden. Erstellen Sie dann für den lokalen Rechner einen Eintrag in <filename>/etc/hosts</filename>. Falls es kein lokales Netzwerk gibt, ändern Sie die <systemitem>localhost</systemitem>-Zeile:
es_es: Esto suele ser porque le nombre de host no puede resolverse. La mejor manera de arreglar esto es asegurarse de que <filename>/etc/hosts</filename> sea leído primero asegurando que la línea <literal>hosts</literal> este listada primero en <filename>/etc/host.conf</filename>. Luego, agregue una entrada en <filename>/etc/hosts</filename> para la máquina local. Si no hay una red local, cambie la línea <systemitem>localhost</systemitem>:
pt_br: Geralmente, isso ocorre porque o nome do host não será resolvido. A melhor maneira de corrigir isso é certificar-se de que <filename>/etc/hosts</filename> seja lido primeiro, garantindo que a linha <literal>hosts</literal> seja listada primeiro em <filename>/etc/host.conf</filename>. Em seguida, insira uma entrada em <filename>/etc/hosts</filename> para a máquina local. Se não houver nenhuma rede local, altere a linha <systemitem>localhost</systemitem>:

source: Otherwise, add another entry for the host. Consult the relevant manual pages for more details.
de_de: Andernfalls fügen Sie einfach einen weiteren Eintrag für den lokalen Rechner hinzu. Weitere Informationen finden Sie in den entsprechenden Manualpages.
es_es: De otra manera, agregue otra entrada para el host. Consulte las paginas de manual relevantes para más detalles.
pt_br: Caso contrário, adicione outra entrada para o host. Consulte as páginas de manual relevantes para mais detalhes.

source: When finished, verify that this command is successful: <command>ping -c1 `hostname`</command>.
de_de: Wenn Sie fertig sind sollten Sie <command>ping -c1 `hostname`</command> erfolgreich ausführen können.
es_es: Cuando termine, verifique que este comando corra exitosamente: <command>ping -c1 `hostname`</command>.
pt_br: Quando terminar, verifique se este comando foi bem sucedido: <command> ping -c1 `hostname`</command>.

source: Why will <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> not dial in <literal>-auto</literal> mode?
de_de: Warum wählt <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> im <literal>-auto</literal>-Modus nicht?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> no marca en modo <literal>-auto</literal>?
pt_br: Por que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> não disca no modo <literal>-auto</literal>?

source: First, check that a default route exists. This command should display two entries:
de_de: Überprüfen Sie zunächst, ob eine Standardroute existiert. Das folgende Kommando sollte zwei Einträge anzeigen:
es_es: En primer lugar, verifique que exista una ruta por defecto. Este comando debería mostrar dos entradas:
pt_br: Primeiro, verifique se existe uma rota padrão. Este comando deve exibir duas entradas:

source: If a default route is not listed, make sure that the <literal>HISADDR</literal> line has been added to <filename>/etc/ppp/ppp.conf</filename>.
de_de: Wenn die Standardroute nicht erscheint, stellen Sie sicher, dass die Zeile <literal>HISADDR</literal> in <filename>/etc/ppp/ppp.conf</filename> hinzugefügt wurde.
es_es: Si una ruta por defecto no se muestra, asegurese de que la línea <literal>HISADDR</literal> haya sido agregada a <filename>/etc/ppp/ppp.conf</filename>.
pt_br: Se uma rota padrão não estiver listada, certifique-se de que a linha <literal>HISADDR</literal> foi adicionada ao <filename>/etc/ppp/ppp.conf</filename>.

source: Another reason for the default route line being missing is that a default route has been added to <filename>/etc/rc.conf</filename> and this line is missing from <filename>/etc/ppp/ppp.conf</filename>:
de_de: Ein weiterer Grund dafür, dass die Zeile für die Standardroute fehlt, könnte der sein, dass Sie eine Standardroute in <filename>/etc/rc.conf</filename> eingetragen und die folgende Zeile in <filename>/etc/ppp/ppp.conf</filename> ausgelassen haben:
es_es: Otra razón para que la línea de la ruta por defecto falte es que se haya añadido una ruta por defecto a <filename>/etc/rc.conf</filename> y esta línea no este en <filename>/etc/ppp/ppp.conf</filename>:
pt_br: Outro motivo para a falta da linha de rota padrão é que uma rota padrão foi adicionada ao <filename>/etc/rc.conf</filename> e esta linha está faltando no arquivo <filename>/etc/ppp/ppp.conf</filename>:

source: If this is the case, go back to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html#userppp-final">Final System Configuration</link> section of the Handbook.
de_de: Lesen Sie in diesem Fall den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/userppp.html#userppp-final">Abschließende Systemkonfiguration</link> des Handbuchs.
es_es: Si este es el caso, vuelva a la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html#userppp-final">Configuración final del sistema</link> del manual.
pt_br: Se esse for o caso, volte para seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html#userppp-final">Configuração final do sistema</link> no Handbook.

source: What does <errorname>No route to host</errorname> mean?
de_de: Was bedeutet <errorname>No route to host</errorname>?
es_es: ¿Qué significa <errorname>No route to host</errorname>?
pt_br: O que o erro <errorname>No route to host</errorname> significa?

source: This error is usually because the following section is missing in <filename>/etc/ppp/ppp.linkup</filename>:
de_de: Dieser Fehler beruht für gewöhnlich auf einem fehlenden Abschnitt in <filename>/etc/ppp/ppp.linkup</filename>:
es_es: Este error suele ocurrir porque la siguiente sección falta en <filename>/etc/ppp/ppp.linkup</filename>:
pt_br: Este erro geralmente ocorre porque a seguinte seção está faltando no arquivo <filename>/etc/ppp/ppp.linkup</filename>:

source: This is only necessary for a dynamic IP address or when the address of the default gateway is unknown. When using interactive mode, the following can be typed in after entering packet mode. Packet mode is indicated by the capitalized <acronym>PPP</acronym> in the prompt:
de_de: Er ist nur notwendig, wenn Sie eine dynamische IP-Adresse besitzen oder die Adresse des Gateways nicht bekannt ist. Wenn Sie den interaktiven Modus benutzen, können Sie folgendes eingeben, nachdem Sie in den packet mode gelangt sind (den Paket Modus erkennen Sie an <acronym>PPP</acronym> im Prompt):
es_es: Esto solo es necesario para una dirección de IP dinámica o cuando la dirección del gateway por defecto es desconocida. Cuando se usa modo interactivo, puede escribirse lo siguiente luego de entrar en modo de paquetes. El modo de paquetes esta indicado por las letras <acronym>PPP</acronym> en mayúscula en la consola:
pt_br: Isso é necessário apenas para um endereço IP dinâmico ou quando o endereço do gateway padrão é desconhecido. Ao usar o modo interativo, o seguinte pode ser digitado depois de entrar no modo de pacote. O modo de pacote é indicado pelo <acronym>PPP</acronym> em letras maiúsculas no prompt:

source: Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html#userppp-dynamicip">PPP and Dynamic IP addresses</link> section of the Handbook for further details.
de_de: Weitere Informationen finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/userppp.html#userppp-dynamicip">PPP und Dynamische IP-Adressen</link> des Handbuchs.
es_es: Vea la sección sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html#userppp-dynamicip">PPP y direcciones de IP dinámicas</link> del manual para más detalles.
pt_br: Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/userppp.html#userppp-dynamicip">Endereços IP dinâmicos e PPP</link> do manual para mais detalhes.

source: Why does my connection drop after about 3 minutes?
de_de: Wieso werden meine Verbindungen nach ca. drei Minuten beendet?
es_es: ¿Por qué mi conexión se corta luego de 3 minutos?
pt_br: Por que minha conexão cai depois de 3 minutos?

source: The default PPP timeout is 3 minutes. This can be adjusted with the following line:
de_de: Der Standardtimeout für PPP beträgt drei Minuten. Er kann durch die folgende Zeile eingestellt werden:
es_es: El timeout por defecto de PPP es de 3 minutos. Esto puede ajustarse con la siguiente línea:
pt_br: O tempo limite padrão do PPP é de 3 minutos. Isso pode ser ajustado com a seguinte linha:

source: where <replaceable>NNN</replaceable> is the number of seconds of inactivity before the connection is closed. If <replaceable>NNN</replaceable> is zero, the connection is never closed due to a timeout. It is possible to put this command in <filename>ppp.conf</filename>, or to type it at the prompt in interactive mode. It is also possible to adjust it on the fly while the line is active by connecting to <application>ppp</application>'s server socket using <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Refer to the <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> man page for further details.
de_de: <replaceable>NNN</replaceable> gibt die Inaktivität in Sekunden an, bevor die Verbindung geschlossen wird. Falls <replaceable>NNN</replaceable> Null ist, wird die Verbindung niemals aufgrund eines Timeouts geschlossen. Es ist möglich, diesen Befehl in <filename>ppp.conf</filename> einzubinden, oder ihn an der Eingabeaufforderung im interaktiven Modus einzugeben. Durch eine Verbindung zum Server-Socket von <application>ppp</application> über <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry> oder <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> ist es auch möglich, den Timeout bei aktiver Verbindung anzupassen. Weitere Informationen finden Sie in der Manualpage <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: donde <replaceable>NNN</replaceable> es el número de segundos de inactividad antes que la conexión se cierre. Si <replaceable>NNN</replaceable> es cero, la conexión nunca se cerrara debido a un timeout. Es posible poner este comando en <filename>ppp.conf</filename>, o escribirlo en la consola en modo interactivo. También es posible ajustarlo en tiempo real mientras las línea esta activa conectandose a el servidor de socket de <application>ppp</application> usando <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry> o <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Vea la pagina de manual de <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para más detalles.
pt_br: onde <replaceable>NNN</replaceable> é o número de segundos de inatividade antes que a conexão seja fechada. Se <replaceable>NNN</replaceable> for zero, a conexão nunca será fechada devido a um tempo limite. É possível colocar este comando em <filename>ppp.conf</filename>, ou digitá-lo no prompt no modo interativo. Também é possível ajustá-lo rapidamente enquanto a linha está ativa conectando-se ao socket de servidor do <application>ppp</application> usando <citerefentry><refentrytitle>telnet</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Consulte a página do manual <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para obter mais detalhes.

source: Why does my connection drop under heavy load?
de_de: Wieso bricht meine Verbindung bei hoher Auslastung ab?
es_es: ¿Por qué mi conexión se corta bajo carga intensiva?
pt_br: Por que minha conexão cai sob carga pesada?

source: If Link Quality Reporting (<acronym>LQR</acronym>) is configured, it is possible that too many <acronym>LQR</acronym> packets are lost between the FreeBSD system and the peer. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> deduces that the line must therefore be bad, and disconnects. <acronym>LQR</acronym> is disabled by default and can be enabled with the following line:
de_de: Falls Link-Quality-Reporting (<acronym>LQR</acronym>) konfiguriert wurde, ist es möglich, dass zu viele <acronym>LQR</acronym>-Pakete zwischen dem FreeBSD-System und dem verbundenen Rechner verloren gehen. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> folgert daraus, dass die Verbindung nicht in Ordnung ist und schließt sie. <acronym>LQR</acronym> ist standardmäßig deaktiviert und kann mit der folgenden Zeile aktiviert werden:
es_es: Si Link Quality Reporting (<acronym>LQR</acronym>) esta configurado, es posible que muchos paquetes <acronym>LQR</acronym> se hayan perdido entre el sistema FreeBSD y el peer. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> deduce que por consiguiente la línea debe estar mal, y se desconecta. <acronym>LQR</acronym> esta deshabilitado por defecto y puede habilitarse con la siguiente línea:
pt_br: Se o relatório de qualidade de link (<acronym>LQR</acronym>) estiver configurado, é possível que muitos pacotes <acronym>LQR</acronym> sejam perdidos entre o sistema FreeBSD e o peer. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> deduz que a linha deve ser ruim e desconectada. O <acronym>LQR</acronym> vem desativado por padrão e pode ser ativado com a seguinte linha:

source: Why does my connection drop after a random amount of time?
de_de: Warum bricht die Verbindung nach unbestimmter Zeit zusammen?
es_es: ¿Por qué mi conexión se corta luego de un intervalo al azar de tiempo?
pt_br: Por que minha conexão cai depois de um período de tempo aleatório?

source: Sometimes, on a noisy phone line or even on a line with call waiting enabled, the modem may hang up because it incorrectly thinks that it lost carrier.
de_de: Wenn die Qualität der Telefonleitung zu schlecht oder beim Anschluss die Option Anklopfen aktiviert ist, kann es manchmal vorkommen, dass das Modem auflegt, weil es fälschlicherweise annimmt, dass es das Trägersignal verloren hat.
es_es: A veces, en una línea de teléfono con mucho ruido, o incluso una línea con llamada en espera habilitada, el modem puede colgar porque incorrectamente piensa que perdió el portador.
pt_br: Às vezes, em uma linha telefônica barulhenta ou mesmo em uma linha com a chamada em espera ativada, o modem pode desligar porque acha incorretamente que perdeu conexão com a operadora.

source: There is a setting on most modems for determining how tolerant it should be to temporary losses of carrier. Refer to the modem manual for details.
de_de: Bei den meisten Modems gibt es eine Einstellmöglichkeit, um anzugeben, wie tolerant es gegenüber vorübergehenden Verlusten des Trägersignals sein soll. Lesen Sie die Dokumentation des Modems für weitere Informationen.
es_es: Hay un parámetro en la mayoría de los modems para determinar que tan tolerante debe ser a perdidas temporales del portador. Vea el manual del modem para más detalles.
pt_br: Há uma configuração na maioria dos modems para determinar quão tolerante deve ser a perda temporária de conexão com portadora. Consulte o manual do modem para detalhes.

source: Why does my connection hang after a random amount of time?
de_de: Warum hängt meine Verbindung nach einer unbestimmten Zeit?
es_es: ¿Por qué mi conexión se cuelga luego de un intervalo al azar de tiempo?
pt_br: Por que minha conexão cai após um período aleatório de tempo?

source: Many people experience hung connections with no apparent explanation. The first thing to establish is which side of the link is hung.
de_de: Viele Leute machen Erfahrungen mit hängenden Verbindungen ohne erkennbaren Grund. Als erstes muss festgestellt werden, auf welcher Seite die Verbindung hängt.
es_es: Mucha gente experiencia conexiones que se cuelgan sin explicación aparente. Lo primero es estable que lado de la conexión esta colgado.
pt_br: Muitas pessoas experimentam conexões pendentes sem explicação aparente. A primeira coisa a estabelecer é de que lado do link está pendurado.
