Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: The <citerefentry><refentrytitle>cpio</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilities are also available for moving user data. These are known to lose file flag information, so use them with caution.
de_de: Zum Verschieben von Benutzerdaten stehen Werkzeuge wie <citerefentry><refentrytitle>cpio</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> zur Verfügung. Allerdings sind diese Programme dafür bekannt, dass sie die erweiterten Dateiattribute nicht verstehen, daher sollten Sie bei ihrem Einsatz aufpassen.
es_es: Las utilidades <citerefentry><refentrytitle>cpio</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> también están disponibles para mover datos del usuario. Es sabido que estas utilidades pierden información de las baneras, de modo que úselas con cuidado.
pt_br: Os utilitários <citerefentry><refentrytitle>cpio</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> também estão disponíveis para mover dados do usuário. Estes comandos são conhecidos por perder as flags com as informações dos arquivo, portanto, use-os com cuidado.

source: Which partitions can safely use Soft Updates? I have heard that Soft Updates on <filename>/</filename> can cause problems. What about Journaled Soft Updates?
de_de: Auf welchen Partitionen kann ich gefahrlos Soft Updates einsetzen? Ich habe gehört, dass der Einsatz von Soft Updates auf <filename>/</filename> Probleme verursachen kann. Was ist mit Journaled Soft Updates?
es_es: ¿Qué particiones pueden usar con seguridad Soft Updates? Escuche que utilizar Soft Updates en <filename>/</filename> puede causar problemas. ¿Qué sucede con Journaled Soft Updates?
pt_br: Quais partições podem usar com segurança o Soft Updates? Ouvi dizer que o uso de Soft Updates no <filename>/</filename> pode causar problemas. E quanto ao Journaled Soft Updates?

source: Short answer: Soft Updates can usually be safely used on all partitions.
de_de: Die schnelle Antwort: Sie können Soft Updates bedenkenlos auf alle Partitionen benutzen.
es_es: Respuesta corta: Soft Updates pueden por lo general usarse de manera segura en todas las particiones.
pt_br: Resposta curta: Soft Updates geralmente podem ser usados ​​com segurança em todas as partições.

source: Long answer: Soft Updates has two characteristics that may be undesirable on certain partitions. First, a Soft Updates partition has a small chance of losing data during a system crash. The partition will not be corrupted as the data will simply be lost. Second, Soft Updates can cause temporary space shortages.
de_de: Die ausführliche Antwort: Soft Updates besitzen zwei Eigenschaften, die auf bestimmten Partitionen unerwünscht sein können. Zum einen kann es bei einem Absturz des System auf einer Partition mit Soft Updates zum Datenverlust kommen. Die Partition ist zwar noch brauchbar, aber die Daten sind verloren. Weiterhin kann es durch Soft Updates zu einem zeitweisen Mangel an Plattenplatz kommen.
es_es: Respuesta larga: Soft Updates tiene dos características que pueden ser indeseables en ciertas particiones. Primero, una partición con Soft Updates tiene una pequeña chance de perder datos durante una falla del sistema. La partición no se corrompera dado que los datos simplemente se perderan. Segundo, Soft Updates puede causar faltas de espacio temporales.
pt_br: Resposta longa: o Soft Updates possui duas características que podem ser indesejáveis ​​em determinadas partições. Primeiro, uma partição com Soft Updates tem uma pequena chance de perder dados durante uma falha do sistema. A partição não será corrompida, pois os dados serão simplesmente perdidos. Em segundo lugar, o uso de Soft Updates pode causar escassez temporária de espaço.

source: When using Soft Updates, the kernel can take up to thirty seconds to write changes to the physical disk. When a large file is deleted the file still resides on disk until the kernel actually performs the deletion. This can cause a very simple race condition. Suppose one large file is deleted and another large file is immediately created. The first large file is not yet actually removed from the physical disk, so the disk might not have enough room for the second large file. This will produce an error that the partition does not have enough space, even though a large chunk of space has just been released. A few seconds later, the file creation works as expected.
de_de: Bei der Benutzung von Soft Updates kann es bis zu dreißig Sekunden dauern, bis der Kernel Änderungen auf das physikalische Speichermedium schreibt. Wenn Sie eine große Datei löschen, ist diese Datei noch auf der Platte vorhanden, bis der Kernel die Löschoperation tatsächlich durchführt. Das kann zu einem sehr einfachen Problem führen: Stellen Sie sich vor, Sie löschen eine große Datei und legen gleich darauf eine andere große Datei an. Da die erste Datei noch nicht wirklich gelöscht wurde, ist eventuell nicht genug Platz für die zweite große Datei. Sie erhalten die Fehlermeldung, dass nicht genug freier Platz vorhanden ist, obwohl Sie gerade eben ausreichend Platz freigegeben haben. Ein paar Sekunden später funktioniert die Erstellung der Datei wie erwartet.
es_es: Al usar Soft Updates, el kernel puede tomar hasta treinta segundos para escribir los cambios al disco físico. Cuando un archivo grande se borra el archivo aún reside en el disco hasta que el kernel realmente realice el borrado. Esto puede causar una condición de carrera muy simple. Suponga que un archivo grande es borrado y otro archivo grande se crea inmediatamente. El primer archivo grande no ha sido removido aún del disco físico, de modo que el disco puede no tener suficiente espacio para el segundo archivo grande. Esto producirá un error diciendo que la partición no tiene suficiente espacio, aun cuando una gran cantidad de espacio acaba de liberarse. Un par de segundos más tarde, la creación de archivos funciona de manera esperada.
pt_br: Ao usar o Soft Updates, o kernel pode levar até trinta segundos para gravar alterações no disco físico. Quando um arquivo grande é excluído, o arquivo ainda reside no disco até que o kernel execute a exclusão. Isso pode causar uma "race condition" muito simples. Suponha que um arquivo grande seja excluído e outro arquivo grande seja criado imediatamente. O primeiro arquivo grande ainda não foi removido do disco físico, portanto, o disco pode não ter espaço suficiente para o segundo arquivo grande. Isso produzirá um erro de que a partição não tem espaço suficiente, mesmo que um grande espaço tenha acabado de ser liberado. Alguns segundos depois, a criação do arquivo funciona conforme o esperado.

source: If a system should crash after the kernel accepts a chunk of data for writing to disk, but before that data is actually written out, data could be lost. This risk is extremely small, but generally manageable.
de_de: Wenn der Kernel ein Datenpaket annimmt und das System abstürzt, bevor die Daten auf die Platte geschrieben wurden, kann es zum Verlust oder zur Zerstörung von Daten kommen. Dieses Risiko ist nur sehr gering und normalerweise überschaubar.
es_es: Si un sistema falla luego de que el kernel acepte un gran trozo de datos para escribir a disco, pero antes de que los datos sean realmente escritos, los mismos pueden perderse. El riesgo es extremadamente mínimo, pero generalmente es manejable.
pt_br: Se um sistema travar depois que o kernel tiver aceito um bloco de dados para gravar no disco, mas antes que os dados sejam realmente gravados, os dados poderão ser perdidos. Esse risco é extremamente pequeno, e geralmente gerenciável.

source: These issues affect all partitions using Soft Updates. So, what does this mean for the root partition?
de_de: Diese beiden Probleme betreffen alle Partitionen, die Soft Updates verwenden. Was bedeutet das für die Root-Partition?
es_es: Estos problemas afectan a todas las plataformas que utilicen Soft Updates. ¿Qué significa esto para la partición raíz?
pt_br: Esses problemas afetam todas as partições usando as Soft Updates. Então, o que isso significa para a partição raiz?

source: Vital information on the root partition changes very rarely. If the system crashed during the thirty-second window after such a change is made, it is possible that data could be lost. This risk is negligible for most applications, but be aware that it exists. If the system cannot tolerate this much risk, do not use Soft Updates on the root file system!
de_de: Die wichtigen Daten auf der Root-Partition ändern sich nur sehr selten. Wenn das System in den 30 Sekunden nach einer solchen Änderung abstürzt, ist es möglich, das Daten verloren gehen. Dieses Risiko ist in den meisten Fällen unerheblich, aber es ist vorhanden. Wenn das zu viel Risiko ist, dann sollten Sie Soft Updates nicht auf der Root-Partition einsetzen.
es_es: La información vital en la partición raíz cambia de manera muy esporádica. Si el sistema fallo durante la ventana de treinta segundos luego de que se realice este cambio, es posible que se pierdan datos. El riesgo es negligible para la mayoría de las aplicaciones, pero tenga en cuenta que existe. Si el sistema no puede tolerar este riesgo... ¡No use Soft Updates en el sistema de archivos raíz!
pt_br: Informações vitais sobre a partição raiz mudam muito raramente. Se o sistema travar dentro da janela de 30 segundos depois de uma alteração ter sido feita, é possível que os dados possam ser perdidos. Esse risco é insignificante para a maioria dos aplicativos, mas esteja ciente de que existe. Se o seu sistema não puder tolerar este risco, não use as Soft Updates no sistema de arquivos raiz!

source: <filename>/</filename> is traditionally one of the smallest partitions. If <filename>/tmp</filename> is on <filename>/</filename>, there may be intermittent space problems. Symlinking <filename>/tmp</filename> to <filename>/var/tmp</filename> will solve this problem.
de_de: <filename>/</filename> war schon immer eine der kleinsten Partitionen. Wenn <filename>/tmp</filename> direkt auf <filename>/</filename> liegt, kann es zeitweise zu den oben beschriebenen Platzproblemen kommen. Um das Problem zu lösen, sollten sie einen symbolischen Link von <filename>/tmp</filename> nach <filename>/var/tmp</filename> legen.
es_es: <filename>/</filename> es tradicionalmente una de las particiones más pequeñas. Si <filename>/tmp</filename> esta en <filename>/</filename>, puede haber problemas con el espacio intermitente. Realizar un symlink de <filename>/tmp</filename> a <filename>/var/tmp</filename> resolverá este problema.
pt_br: O <filename>/</filename> é tradicionalmente uma das menores partições. Se o <filename>/tmp</filename> estiver localizado dentro do <filename>/</filename>, pode haver problemas intermitentes de falta de espaço. A criação de um link simbólico apontando o <filename>/tmp</filename> para <filename>/var/tmp</filename> resolverá esse problema.

source: Finally, <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> does not work in live mode (-L) on a filesystem, with Journaled Soft Updates (<acronym>SU+J</acronym>).
de_de: Zudem sei noch angemerkt, dass <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> nicht im Live-Modus (-L) auf einem Dateisystem mit Journaled Soft Updates (<acronym>SU+J</acronym>) funktioniert.
es_es: Finalmente, <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> no funciona en modo vivo (-L) en un sistema de archivos, con Journaled Soft Updates (<acronym>SU+J</acronym>).
pt_br: Por fim, o <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> não funciona no modo live (-L) em um sistema de arquivos, com Journaled Soft Updates (<acronym>SU + J</acronym>).

source: Can I mount other foreign file systems under FreeBSD?
de_de: Kann ich andere fremde Dateisysteme unter FreeBSD mounten?
es_es: ¿Puedo montar otros sistemas de archivos no nativos bajo FreeBSD?
pt_br: Posso acessar outros sistemas de arquivos não-nativos do FreeBSD?

source: FreeBSD supports a variety of other file systems.
de_de: FreeBSD unterstützt verschiedene fremde Dateisysteme:
es_es: FreeBSD soporta muchos otros sistemas de archivos.
pt_br: O FreeBSD suporta uma variedade de outros sistemas de arquivos.

source: UFS CD-ROMs can be mounted directly on FreeBSD. Mounting disk partitions from Digital UNIX and other systems that support UFS may be more complex, depending on the details of the disk partitioning for the operating system in question.
de_de: UFS-CD-ROMs können unter FreeBSD direkt gemountet werden. Das Mounten von Partitionen von Digital UNIX und anderen Systemen, die UFS unterstützen, könnte schwieriger sein, abhängig von den Details der Plattenpartitionierung des betreffenden Betriebssystems.
es_es: Los CD-ROM que usen UFS pueden montarse directamente en FreeBSD. Montar particiones de discos de Digital UNIX y otros sistemas que soporten UFS puede ser más complejo, dependiendo de los detalles acerca del particionado de disco del sistema operativo en cuestión.
pt_br: Os CD-ROMs UFS podem ser montados diretamente no FreeBSD. Montar partições de disco do Digital UNIX e de outros sistemas que suportam o UFS pode ser mais complexo, dependendo dos detalhes do particionamento do disco para o sistema operacional em questão.

source: FreeBSD supports <literal>ext2fs</literal> and <literal>ext3fs</literal> partitions. See <citerefentry><refentrytitle>ext2fs</refentrytitle><manvolnum>5</manvolnum></citerefentry> for more information.
de_de: FreeBSD unterstützt <literal>ext2fs</literal> und <literal>ext3fs</literal>-Partitionen. Unter <citerefentry><refentrytitle>ext2fs</refentrytitle><manvolnum>5</manvolnum></citerefentry> finden Sie weitere Informationen.
es_es: FreeBSD soporta particiones <literal>ext2fs</literal> y <literal>ext3fs</literal>. Vea <citerefentry><refentrytitle>ext2fs</refentrytitle><manvolnum>5</manvolnum></citerefentry> para más información.
pt_br: O FreeBSD suporta partições <literal>ext2fs</literal> e <literal>ext3fs</literal>. Veja <citerefentry><refentrytitle>ext2fs</refentrytitle><manvolnum>5</manvolnum></citerefentry> para mais informações.

source: FUSE based NTFS support is available as a port (<package>sysutils/fusefs-ntfs</package>). For more information see <link xlink:href="http://www.tuxera.com/community/ntfs-3g-manual/"><application>ntfs-3g</application></link>.
de_de: FUSE basierte NTFS-Unterstützung ist über einen Port verfügbar (<package>sysutils/fuse-ntfs</package>). Weitere Informationen finden Sie unter <link xlink:href="http://www.tuxera.com/community/ntfs-3g-manual/"><application>ntfs-3g</application></link>.
es_es: Soporte para NTFS basado en FUSE esta disponible como un port (<package>sysutils/fusefs-ntfs</package>). Para más información vea <link xlink:href="http://www.tuxera.com/community/ntfs-3g-manual/"><application>ntfs-3g</application></link>.
pt_br: O suporte ao NTFS baseia-se no FUSE está disponível como um port (<package>sysutils/fusefs-ntfs</package>). Para mais informações, consulte <link xlink:href="http://www.tuxera.com/community/ntfs-3g-manual/"><application>ntfs-3g</application></link>.

source: FreeBSD includes a read-write FAT driver. For more information, see <citerefentry><refentrytitle>mount_msdosfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: FreeBSD enthält ein FAT-Treiber, der Lese- und Schreibzugriffe ermöglicht. Weitere Informationen finden Sie in <citerefentry><refentrytitle>mount_msdosfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: FreeBSD incluye un controlador de lectura-escritura FAT. Para más información vea <citerefentry><refentrytitle>mount_msdosfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: O FreeBSD inclui um driver FAT de leitura-gravação. Para obter mais informações, consulte <citerefentry><refentrytitle>mount_msdosfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: FreeBSD includes a port of <trademark>Sun</trademark>'s ZFS driver. The current recommendation is to use it only on amd64 platforms with sufficient memory. For more information, see <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: FreeBSD enthält eine Portierung von <trademark>Sun</trademark>s ZFS Treiber. Die aktuelle Empfehlung ist, es nur auf amd64 Plattformen mit ausreichend Hauptspeicher zu verwenden. Mehr Informationen finden Sie in <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: FreeBSD incluye un port del controlador de ZFS de <trademark>Sun</trademark>. La recomendación actual es solo usarlo en plataformas amd64 platforms con suficiente memoria. Para más información. vea <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: O FreeBSD inclui um port do driver ZFS da <trademark>Sun</trademark>. A recomendação atual é usá-lo apenas em plataformas amd64 com memória suficiente. Para obter mais informações, consulte <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: FreeBSD includes the Network File System <acronym>NFS</acronym> and the FreeBSD Ports Collection provides several FUSE applications to support many other file systems.
de_de: FreeBSD unterstützt auch das Netzwerk-Dateisystem <acronym>NFS</acronym>. Die FreeBSD Ports-Sammlung bietet zudem einige FUSE-Anwendungen um weitere Dateisysteme zu unterstützen.
es_es: FreeBSD incluye el Network File System <acronym>NFS</acronym> y la colección de ports de FreeBSD Ports Collection provee varias aplicaciones de FUSE para soportar muchos otros sistemas de archivos.
pt_br: O FreeBSD inclui o sistema de arquivos de rede <acronym>NFS</acronym> e a Coleção de Ports do FreeBSD fornece vários aplicativos FUSE para suportar muitos outros sistemas de arquivos.

source: How do I mount a secondary DOS partition?
de_de: Wie mounte ich eine erweiterte DOS-Partition?
es_es: ¿Como monto una partición DOS secundaria?
pt_br: Como faço para montar uma partição secundária do DOS?

source: The secondary DOS partitions are found after <emphasis>all</emphasis> the primary partitions. For example, if <literal>E</literal> is the second DOS partition on the second SCSI drive, there will be a device file for <quote>slice 5</quote> in <filename>/dev</filename>. To mount it:
de_de: Die erweiterten DOS-Partitionen befinden sich hinter <emphasis>allen</emphasis> primären Partitionen. Wenn sich zum Beispiel eine Partition <literal>E</literal> als sekundäre DOS-Partition auf einem zweiten SCSI-Laufwerk befindet, wird eine Gerätedatei für <literal>Slice 5</literal> in <filename>/dev</filename> erstellt. Um diese zu mounten:
es_es: Las particiones de DOS secundarias se encuentras luego de <emphasis>todas</emphasis> las particiones primarias. Por ejemplo, si <literal>E</literal> es la segunda partición DOS en el segundo dispositivo SCSI, habrá un dispositivo para <quote>slice 5</quote> en <filename>/dev</filename>. Para montarlo corra:
pt_br: As partições secundárias do DOS são encontradas depois de <emphasis>todas</emphasis> as partições primárias. Por exemplo, se <literal>E</literal> for a segunda partição DOS na segunda unidade SCSI, haverá um arquivo de dispositivo para a <quote>slice 5</quote> em <filename>/dev</filename>. Para montá-lo:

source: Is there a cryptographic file system for FreeBSD?
de_de: Gibt es ein verschlüsselndes Dateisystem für FreeBSD?
es_es: ¿Existe un sistema de archivos criptográfico para FreeBSD?
pt_br: Existe um sistema de arquivos criptográficos para o FreeBSD?

source: Yes, <citerefentry><refentrytitle>gbde</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>geli</refentrytitle><manvolnum>8</manvolnum></citerefentry>. See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">Encrypting Disk Partitions</link> section of the FreeBSD Handbook.
de_de: Ja. <citerefentry><refentrytitle>gbde</refentrytitle><manvolnum>8</manvolnum></citerefentry> und <citerefentry><refentrytitle>geli</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Lesen Sie dazu auch den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/disks-encrypting.html">Partitionen verschlüsseln</link> im FreeBSD Handbuch.
es_es: SI, <citerefentry><refentrytitle>gbde</refentrytitle><manvolnum>8</manvolnum></citerefentry> y <citerefentry><refentrytitle>geli</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Vea la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">Encriptar particiones de disco</link> del manual de FreeBSD.
pt_br: Sim, o <citerefentry><refentrytitle>gbde</refentrytitle><manvolnum>8</manvolnum></citerefentry> e o <citerefentry><refentrytitle>geli</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-encrypting.html">Partições de Disco com Criptografia</link> do Handbook do FreeBSD.

source: How do I boot FreeBSD and <trademark class="registered">Linux</trademark> using <application>GRUB</application>?
de_de: Wie boote ich FreeBSD und <trademark class="registered">Linux</trademark> mit <application>GRUB</application>?
es_es: ¿Cómo hago para arrancar FreeBSD y <trademark class="registered">Linux</trademark> usando <application>GRUB</application>?
pt_br: Como inicializo o FreeBSD e o <trademark class="registered"> Linux </trademark> utilizando o <application>GRUB</application>?

source: To boot FreeBSD using <application>GRUB</application>, add the following to either <filename>/boot/grub/menu.lst</filename> or <filename>/boot/grub/grub.conf</filename>, depending upon which is used by the <trademark class="registered">Linux</trademark> distribution.
de_de: Um FreeBSD mit <application>GRUB</application> zu booten, müssen Sie die folgenden Zeilen in Abhängigkeit der verwendeten <trademark class="registered">Linux</trademark>-Distribution in <filename>/boot/grub/menu.lst</filename> oder <filename>/boot/grub/grub.conf</filename> aufnehmen.
es_es: Para arrancar FreeBSD usando <application>GRUB</application>, y añada lo siguiente a <filename>/boot/grub/menu.lst</filename> o <filename>/boot/grub/grub.conf</filename>, dependiendo de como sea usado por la distribución de <trademark class="registered">Linux</trademark>.
pt_br: Para inicializar o FreeBSD usando o <application>GRUB</application>, adicione o seguinte ao <filename>/boot/grub/menu.lst</filename> ou ao <filename> /boot/grub/grub.conf</filename>, dependendo de qual é usado pela sua distribuição <trademark class="registered"> Linux </trademark>.
