Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

# _
source: translator-credits
de_de: bhd@FreeBSD.org, 2016
es_es: Federico Caminiti demian.fc@gmail.com, 2015, 2016
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Kanazuchi, contato@kanazuchi.com, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Frequently Asked Questions for FreeBSD 9.<replaceable>X</replaceable> and 10.<replaceable>X</replaceable>
de_de: Häufig gestellte Fragen zu FreeBSD 9.<replaceable>X</replaceable> und 10.<replaceable>X</replaceable>
es_es: Preguntas Frecuentes para FreeBSD 9.<replaceable>X</replaceable> y 10.<replaceable>X</replaceable>

source: <orgname>The FreeBSD Documentation Project</orgname>
de_de: <orgname>The FreeBSD German Documentation Project</orgname>
es_es: <orgname>El proyecto de documentación de FreeBSD</orgname>
pt_br: <orgname>Projeto de Documentação do FreeBSD</orgname>

source: Redistribution and use in source (XML DocBook) and 'compiled' forms (XML, HTML, PDF, PostScript, RTF and so forth) with or without modification, are permitted provided that the following conditions are met:
es_es: La redistribución y el uso en formatos fuente(XML DocBook) y 'compilados' (XML, HTML, PDF, PostScript, RTF y similares) con o sin modificación, estan permitidas siempre que se cumplan las siguientes condiciones:

source: Redistributions of source code (XML DocBook) must retain the above copyright notice, this list of conditions and the following disclaimer as the first lines of this file unmodified.
es_es: Las redistribuciones de código fuente (XML DocBook) deben retener la noticia de copyright listada más arriba, esta lista de condiciones y la siguiente nota como las primera lineas de este archivo, sin modificaciones.

source: Redistributions in compiled form (transformed to other DTDs, converted to PDF, PostScript, RTF and other formats) must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
es_es: Las redistribuciones en formato compilado (tranformado a otros DTDs, convertido en PDF, PostScript, RTF y otros formatos deben reproducir la nota de copyright indicada más arriba, esta lista de condiciones y la siguiente nota en la documentación y/o otros materias provistos con las distribución.

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
de_de: FreeBSD ist ein eingetragenes Warenzeichen der FreeBSD Foundation.
es_es: FreeBSD es una marca registrada de FreeBSD Foundation.

source: Adobe, Acrobat, Acrobat Reader, Flash and PostScript are either registered trademarks or trademarks of Adobe Systems Incorporated in the United States and/or other countries.
de_de: Adobe, Acrobat, Acrobat Reader und PostScript sind entweder eingetragene Warenzeichen oder Warenzeichen von Adobe Systems Incorporated in den Vereinigten Staaten und/oder in anderen Ländern.
es_es: Adobe, Acrobat, Acrobat Reader, Flash y PostScript son marcas registradas o marcas de Adobe Systems Incorporated en los Estados Unidos y/o en otros paises.

source: IBM, AIX, OS/2, PowerPC, PS/2, S/390, and ThinkPad are trademarks of International Business Machines Corporation in the United States, other countries, or both.
de_de: IBM, AIX, OS/2, PowerPC, PS/2, S/390 und ThinkPad sind Warenzeichen der International Business Machines Corporation in den Vereinigten Staaten, anderen Ländern oder beiden.
es_es: IBM, AIX, OS/2, PowerPC, PS/2, S/390, y ThinkPad son marcas de International Business Machines Corporation en los Estados Unidos, otros paises, o ambos.

source: IEEE, POSIX, and 802 are registered trademarks of Institute of Electrical and Electronics Engineers, Inc. in the United States.
de_de: IEEE, POSIX und 802 sind eingetragene Warenzeichen vom Institute of Electrical and Electronics Engineers, Inc. in den Vereinigten Staaten.
es_es: IEEE, POSIX, y 802 son marcas registradas de Institute of Electrical and Electronics Engineers, Inc. en los Estados Unidos.

source: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, and Xeon are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries.
de_de: Intel, Celeron, EtherExpress, i386, i486, Itanium, Pentium und Xeon sind Warenzeichen oder eingetragene Warenzeichen der Intel Corporation oder ihrer Gesellschaften in den Vereinigten Staaten und in anderen Ländern.
es_es: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, y Xeon son marcas o marcas registradas de Intel Corporation o sus subsidiarias en los Estados Unidos y otros paises.

source: Linux is a registered trademark of Linus Torvalds.
de_de: Linux ist ein eingetragenes Warenzeichen von Linus Torvalds.
es_es: Linux es una marca registrada de Linus Torvalds.

source: Microsoft, IntelliMouse, MS-DOS, Outlook, Windows, Windows Media and Windows NT are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries.
de_de: Microsoft, IntelliMouse, MS-DOS, Outlook, Windows, Windows Media und Windows NT sind entweder eingetragene Warenzeichen oder Warenzeichen der Microsoft Corporation in den Vereinigten Staaten und/oder in anderen Ländern.
es_es: Microsoft, IntelliMouse, MS-DOS, Outlook, Windows, Windows Media y Windows NT son marcas registradas o marcas de Microsoft Corporation en los Estados Unidos y/o otros paises.

source: NetBSD is a registered trademark of the NetBSD Foundation.
de_de: NetBSD ist ein eingetragenes Warenzeichen der NetBSD Foundation.
es_es: NetBSD es una marca registrada de NetBSD Foundation.

source: Motif, OSF/1, and UNIX are registered trademarks and IT DialTone and The Open Group are trademarks of The Open Group in the United States and other countries.
de_de: Motif, OSF/1 und UNIX sind eingetragene Warenzeichen und IT DialTone und The Open Group sind Warenzeichen der The Open Group in den Vereinigten Staaten und in anderen Ländern.
es_es: Motif, OSF/1, y UNIX son marcas registradas y IT DialTone y The Open Group son marcas de The Open Group en los Estados Unidos y otros paises.

source: Silicon Graphics, SGI, and OpenGL are registered trademarks of Silicon Graphics, Inc., in the United States and/or other countries worldwide.
de_de: Silicon Graphics, SGI und OpenGL sind eingetragene Warenzeichen von Silicon Graphics, Inc. in den Vereinigten Staaten und/oder in anderen Ländern.
es_es: Silicon Graphics, SGI, y OpenGL son marcas registradas de Silicon Graphics, Inc., en los estaods unidos y/o otros paises al rededor del mundo.

source: Sun, Sun Microsystems, Java, Java Virtual Machine, JDK, JRE, JSP, JVM, Netra, OpenJDK, Solaris, StarOffice, SunOS and VirtualBox are trademarks or registered trademarks of Sun Microsystems, Inc. in the United States and other countries.
de_de: Sun, Sun Microsystems, Java, Java Virtual Machine, JDK, JRE, JSP, JVM, Netra, OpenJDK, Solaris, StarOffice, SunOS und VirtualBox sind Warenzeichen oder eingetragene Warenzeichen von Sun Microsystems, Inc. in den Vereinigten Staaten und in anderen Ländern.
es_es: Sun, Sun Microsystems, Java, Java Virtual Machine, JDK, JRE, JSP, JVM, Netra, OpenJDK, Solaris, StarOffice, SunOS y VirtualBox son marcas o marcas registradas de Sun Microsystems, Inc. en los Estados Unidos y otros paises.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
de_de: Viele Produktbezeichnungen von Herstellern und Verkäufern sind Warenzeichen. Soweit dem FreeBSD Project das Warenzeichen bekannt ist, werden die in diesem Dokument vorkommenden Bezeichnungen mit dem Symbol <quote>™</quote> oder dem Symbol <quote>®</quote> gekennzeichnet.
es_es: Muchas de las designaciones usadas por fabricantes y vendedores para distinguir sus productos son reclamadas como marcas. En los lugares donde dichas designaciones aparecen en este documento, y el proyecto FreeBSD estaba al tanto del reclamo de marca, las designaciones van seguidas de los símbolos <quote>™</quote> o <quote>®</quote>.

source: This is the Frequently Asked Questions <acronym>(FAQ)</acronym> for FreeBSD versions 9.<replaceable>X</replaceable> and 10.<replaceable>X</replaceable>. Every effort has been made to make this <acronym>FAQ</acronym> as informative as possible; if you have any suggestions as to how it may be improved, send them to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
de_de: Dies ist die FAQ für die FreeBSD-Versionen 9.<replaceable>X</replaceable> und 10.<replaceable>X</replaceable>. Es wurden große Anstrengungen unternommen, diese <acronym>FAQ</acronym> so informativ wie möglich zu gestalten. Wenn Sie Vorschläge haben, wie dieses Dokument verbessert werden kann, senden Sie eine Mail an die Mailingliste <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">'FreeBSD Documentation Project</link>.
es_es: Estas son las Preguntas Frencuentes <acronym>FAQ</acronym> para FreeBSD en sus versiones 9.<replaceable>X</replaceable> y 10.<replaceable>X</replaceable>. Se han realizado muchos esfuerzos para hacer este <acronym>FAQ</acronym> lo más informativo posible; si tiene sugerencias sobre como mejorarlo, envíelas a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de correo del proyecto de documentación FreeBSD</link>.

source: The latest version of this document is always available from the <link xlink:href="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/index.html">FreeBSD website</link>. It may also be downloaded as one large <link xlink:href="book.html">HTML</link> file with HTTP or as a variety of other formats from the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/">FreeBSD FTP server</link>.
de_de: Die neueste Version dieses Dokuments ist immer auf der <link xlink:href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/faq/index.html">FreeBSD Webseite</link> verfügbar. Diese <acronym>FAQ</acronym> kann ebenfalls über HTTP als große <link xlink:href="book.html">HTML</link>-Datei, oder in verschiedenen anderen Formaten vom <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/de/">FreeBSD FTP Server</link> heruntergeladen werden.
es_es: La última versión de esto documento esta siempre disponible desde el <link xlink:href="http://www.FreeBSD.org/doc/es_ES.ISO8859-1/books/faq/index.html">sitio web de FreeBSD</link>. También puede ser descargada como un solo archivo <link xlink:href="book.html">HTML</link> con HTTP o en varios otros formatos desde el <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/">servidor FTP de FreeBSD</link>.

source: Introduction
de_de: Übersicht
es_es: Introducción
pt_br: Introdução

source: What is FreeBSD?
de_de: Was ist FreeBSD
es_es: ¿Qué es FreeBSD?
pt_br: O que é o FreeBSD?

source: FreeBSD is a modern operating system for desktops, laptops, servers, and embedded systems with support for a large number of <link xlink:href="http://www.FreeBSD.org/platforms/">platforms</link>.
de_de: FreeBSD ist ein modernes Betriebssystem für Server, Desktops und eingebettete Systeme, das auf zahlreichen <link xlink:href="http://www.FreeBSD.org/de/platforms/">Plattformen</link> läuft.
es_es: FreeBSD es un sistema operativo moderno para desktops, laptops, servidores, y sistemas embebidos con con soporte para un gran número de <link xlink:href="http://www.FreeBSD.org/platforms/">plataformas</link>.

source: It is based on U.C. Berkeley's <quote>4.4BSD-Lite</quote> release, with some <quote>4.4BSD-Lite2</quote> enhancements. It is also based indirectly on William Jolitz's port of U.C. Berkeley's <quote>Net/2</quote> to the <trademark>i386</trademark>, known as <quote>386BSD</quote>, though very little of the 386BSD code remains.
de_de: Es basiert auf dem <quote>4.4BSD-Lite</quote>-Release der U.C. Berkeley, mit einigen Erweiterungen aus <quote>4.4BSD-Lite2</quote>. Es basiert außerdem indirekt auf der von William Jolitz unter dem Namen <quote>386BSD</quote> herausgebrachten Portierung des <quote>Net/2</quote>-Releases für <trademark>i386</trademark> der U.C. Berkeley. Allerdings ist nur sehr wenig vom ursprünglichen 386BSD Code übrig geblieben.
es_es: Esta basado en la versión <quote>4.4BSD-Lite</quote> de la U.C. Berkeley, con algunas mejoras de <quote>4.4BSD-Lite2</quote>. También esta basado indirectamente en el port que William Jolitz's hizo de <quote>Net/2</quote> de la U.C. Berkeley a <trademark>i386</trademark>, conocido como <quote>386BSD</quote>, a pesar de que actualmente queda muy poco código de 386BSD.
pt_br: Ele é baseado no sistema <quote>4.4BSD-Lite</quote> da U.C. de Berkeley, com algumas melhorias oriundas do <quote>4.4BSD-Lite2</quote>. Ele também se baseia indiretamente no port para <trademark>i386</trademark> feito por William Jolitz do sistema <quote>Net/2</quote> da U.C. Berkeley, conhecido como <quote>386BSD</quote>, embora muito pouco do código original do 386BSD ainda esteja presente.

source: FreeBSD is used by companies, Internet Service Providers, researchers, computer professionals, students and home users all over the world in their work, education and recreation.
de_de: Unternehmen, Internet Service Provider, Forscher, Computerfachleute, Studenten und Privatnutzer auf der ganzen Welt benutzen FreeBSD für die Arbeit, die Ausbildung oder in der Freizeit.
es_es: FreeBSD es usado por compañias, proveedores de internet, investigadores, profesionales de las computadoras, estudiantes y usuarios hogareños alrededor del mundo para su trabajo educación y recreación.
pt_br: O FreeBSD é usado por empresas, provedores de serviços de Internet, pesquisadores, profissionais da computação, estudantes e usuários domésticos em todo o mundo em seu trabalho, educação e recreação.

source: For more detailed information on FreeBSD, refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">FreeBSD Handbook</link>.
de_de: Ausführlichere Informationen zu FreeBSD, finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/index.html">FreeBSD Handbuch</link>.
es_es: Para información más detallada acerca de FreeBSD, vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">manual de FreeBSD</link>.
pt_br: Para informações mais detalhadas sobre o FreeBSD, consulte o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Manual do FreeBSD</link>.

source: What is the goal of the FreeBSD Project?
de_de: Welches Ziel hat das FreeBSD Project?
es_es: ¿Cual es el objetivo del proyecto FreeBSD?
pt_br: Qual é o objetivo do projeto FreeBSD?

source: The goal of the FreeBSD Project is to provide a stable and fast general purpose operating system that may be used for any purpose without strings attached.
de_de: Das Ziel des FreeBSD Projects ist es, ein stabiles und schnelles Betriebssystem zur Verfügung zu stellen, das Sie für jeden Zweck verwenden können, ohne dabei irgendwelche Bedingungen in Kauf nehmen zu müssen.
es_es: El objetivo del proyecto FreeBSD es proveer un sistema operativo estable y veloz de propósito general que pueda ser usado para cualquier propósito sin ataduras.
pt_br: O objetivo do Projeto FreeBSD é fornecer um sistema operacional de propósito geral estável e rápido que possa ser usado para qualquer propósito sem restrições.

source: Does the FreeBSD license have any restrictions?
de_de: Beinhaltet die FreeBSD-Lizenz irgendwelche Einschränkungen?
es_es: ¿Tiene alguna restricción la licencia de FreeBSD?
pt_br: A licença do FreeBSD tem alguma restrição?

source: Yes. Those restrictions do not control how the code is used, but how to treat the FreeBSD Project itself. The license itself is available at <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">license</link> and can be summarized like this:
de_de: Ja. Diese Einschränkungen regeln aber nicht, wie Sie mit dem Quellcode umgehen, sondern betreffen nur den Umgang mit dem FreeBSD Project an sich. Die Lizenz ist unter <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">http://www.FreeBSD.org/copyright/freebsd-license.html</link> verfübar und lässt sich wie folgt zusammenfassen:
es_es: Si. Estas restricciones no controlan como se usa el código, sino como se trata al proyecto FreeBSD en si mismo. La licencia esta disponible en <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">licencia</link> y puede ser resumida de la siguiente manera:

source: Do not claim that you wrote this.
de_de: Behaupten Sie nicht, Sie hätten es geschrieben.
es_es: No pretenda haber escrito esto.
pt_br: Não reivindique que você escreveu o sistema.

source: Do not sue us if it breaks.
de_de: Verklagen Sie uns nicht, wenn etwas nicht funktioniert.
es_es: No nos demande si falla.
pt_br: Não nos processe se ele quebrar.

source: Do not remove or modify the license.
de_de: Sie dürfen die Lizenz nicht entfernen oder verändern.
es_es: No remueva o modifique la licencia.
pt_br: Não remova ou modifique a licença.

source: Many of us have a significant investment in the project and would certainly not mind a little financial compensation now and then, but we definitely do not insist on it. We believe that our first and foremost <quote>mission</quote> is to provide code to any and all comers, and for whatever purpose, so that the code gets the widest possible use and provides the widest possible benefit. This, we believe, is one of the most fundamental goals of Free Software and one that we enthusiastically support.
de_de: Viele von uns haben erheblich zur Erstellung des Codes (und zum Projekt) beigetragen und hätten jetzt oder in Zukunft sicherlich nichts gegen einen geringen finanziellen Ausgleich einzuwenden, aber wir beabsichtigen definitiv nicht, darauf zu bestehen. Wir sind der Meinung, dass unsere <quote>Mission</quote> zuerst und insbesondere darin besteht, allen und jedem Kommenden Code für welchen Zweck auch immer zur Verfügung zu stellen, damit der Code möglichst weit eingesetzt wird und den größtmöglichen Nutzen liefert. Das ist, so glauben wir, eines der fundamentalsten Ziele von freier Software und eines, das wir enthusiastisch unterstützen.
es_es: Muchos de nosotros hemos invertido significativamente en el proyecto y no nos molestaría recibir una pequeña compensación financiera ocasionalmente, pero de ninguna manera insistiremos en ello. Creeemos que nuestra primera y principal <quote>misión</quote> es proveer código a todos los consumidores, para cualquier propósito, de manera que el codigo se utilize de la manera más amplia posible y provea el mayor beneficio posible. Esta, creemos es una de las metas mas fundamentales del software libre, y una que apoyamos entusiastamente.
pt_br: Muitos de nós têm um investimento significativo no projeto e certamente não nos importaríamos com uma pequena compensação financeira de vez em quando, mas nós definitivamente não insistimos nisso. Acreditamos que a nossa primeira e principal <quote>missão</quote> é fornecer código a todos os participantes, e para qualquer finalidade, para que o código obtenha o maior uso possível e forneça o maior benefício possível. Este, acreditamos, é um dos objetivos mais fundamentais do Software Livre e um dos que apoiamos entusiasticamente.

source: Code in our source tree which falls under the <link xlink:href="http://www.FreeBSD.org/copyright/COPYING">GNU General Public License (GPL)</link> or <link xlink:href="http://www.FreeBSD.org/copyright/COPYING.LIB">GNU Library General Public License (LGPL)</link> comes with slightly more strings attached, though at least on the side of enforced access rather than the usual opposite. Due to the additional complexities that can evolve in the commercial use of GPL software, we do, however, endeavor to replace such software with submissions under the more relaxed <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">FreeBSD license</link> whenever possible.
de_de: Der Code in unserem Quellbaum, der der <link xlink:href="http://www.FreeBSD.org/copyright/COPYING">GNU General Public License (GPL)</link> oder der <link xlink:href="http://www.FreeBSD.org/copyright/COPYING.LIB">GNU Library General Public License (LGPL)</link> unterliegt, ist mit zusätzlichen Bedingungen verknüpft, jedoch handelt es sich dabei lediglich um erzwungene Bereitstellung statt des sonst üblichen Gegenteils. Auf Grund der zusätzlichen Komplexität, die durch den kommerziellen Einsatz von GPL Software entstehen kann, bemühen wir uns jedoch, solche Software, wo möglich, durch solche, die der etwas lockereren <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">FreeBSD Lizenz</link> unterliegt, zu ersetzen.
es_es: El código en nuestro arbol de codigo fuente que esta cubierto por la <link xlink:href="http://www.FreeBSD.org/copyright/COPYING">Licencia Pública General de GNU</link> o la <link xlink:href="http://www.FreeBSD.org/copyright/COPYING.LIB">GNU Library General Public License (LGPL)</link> viene con más restricciones, pero el menos del lado de forzar el acceso al código en lugar de su opuesto. Debido a las complejidades adicionales que pueden evolucionar del uso comercial de software GPL, intentamos reemplazar tal software con alternativas bajo la más permisiva <link xlink:href="http://www.FreeBSD.org/copyright/freebsd-license.html">licencia de FreeBSD</link> cuando sea posible.

source: Can FreeBSD replace my current operating system?
de_de: Kann FreeBSD mein bisher verwendetes Betriebssystem ersetzen?
es_es: ¿Puede FreeBSD reemplazar mi sistema operativo actual?
pt_br: O FreeBSD pode substituir meu sistema operacional atual?

source: For most people, yes. But this question is not quite that cut-and-dried.
de_de: In den meisten Fällen lautet die Antwort: Ja! Allerdings ist diese Frage nicht ganz so einfach, wie sie scheint.
es_es: Para la mayoría de la gente, si. Pero esta pregunta no es tan simple.
pt_br: Para a maioria das pessoas, sim. Mas esta questão não é assim tão simples.

source: Most people do not actually use an operating system. They use applications. The applications are what really use the operating system. FreeBSD is designed to provide a robust and full-featured environment for applications. It supports a wide variety of web browsers, office suites, email readers, graphics programs, programming environments, network servers, and much more. Most of these applications can be managed through the <link xlink:href="http://www.FreeBSD.org/ports/">Ports Collection</link>.
de_de: Die meisten Anwender benutzen kein Betriebssystem, sondern Anwendungen. Die Anwendungen sind es, die das Betriebssystem benutzen. FreeBSD wurde entworfen, Anwendungen eine stabile und funktionsreiche Umgebung zu bieten. Es unterstützt viele unterschiedliche Web-Browser, Büroanwendungen, E-Mail-Programme, Grafik-Programme, Entwicklungsumgebungen, Netzwerk-Server, und vieles mehr. Die meisten dieser Anwendungen sind in der <link xlink:href="http://www.FreeBSD.org/de/ports/">Ports-Sammlung</link> verfügbar.
es_es: La mayoría de la gente no usa realmente un sistema operativo. Usan aplicaciones. Estas aplicaciones son las que realmente utilizan el sistema operativo. FreeBSD fue diseñado para proveer un ambiente robusto y lleno de características para aplicaciones. Soporta una amplia variedad de navegadores web, suites ofimáticas, lectores de correo electrónico, programas gráficos, ambientes de programación, servidores de red, y mucho más. La mayoría de estas aplicaciones puede manejarse a través de <link xlink:href="http://www.FreeBSD.org/ports/">La colección de Ports</link>.
