Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If an application is only available on one operating system, that operating system cannot just be replaced. Chances are, there is a very similar application on FreeBSD, however. As a solid office or Internet server or a reliable workstation, FreeBSD will almost certainly do everything you need. Many computer users across the world, including both novices and experienced <trademark class="registered">UNIX</trademark> administrators, use FreeBSD as their only desktop operating system.
de_de: Wenn Sie eine Anwendung benutzen müssen, die es nur für ein bestimmtes Betriebssystem gibt, dann kommen Sie an diesem Betriebssystem nicht vorbei. Allerdings stehen die Chancen nicht schlecht, dass es eine vergleichbare Anwendung für FreeBSD gibt.
es_es: Si una aplicación solo esta disponible en un sistema operativo, ese sistema operativo no puede ser reemplazado. De todas maneras, hay muchas posibilidades de que haya una aplicación muy similar en FreeBSD. Como un sólido servidor para la oficina o internet o una confiable estación de trabajo, FreeBSD con toda seguridad hara todo lo que usted necesita. Muchos usuarios de computadoras alrededor del mundo, incluyendo novatos y administradores <trademark class="registered">UNIX</trademark> experimentados, utilizan FreeBSD como su único sistema operativo de escritorio.
pt_br: Se um aplicativo estiver disponível apenas para um determinado sistema operacional, esse sistema operacional não poderá ser substituído. No entanto é provável que exista um aplicativo muito semelhante no FreeBSD. Seja como um sólido servidor corporativo, um servidor de Internet ou ainda uma confiável estação de trabalho, o FreeBSD quase certamente fará tudo o que você precisa. Muitos usuários de computador ao redor do mundo, incluindo novatos e experientes administradores <trademark class="registered">UNIX</trademark>, usam o FreeBSD como seu único sistema operacional de desktop.

source: Users migrating to FreeBSD from another <trademark class="registered">UNIX</trademark>-like environment will find FreeBSD to be similar. <trademark class="registered">Windows</trademark> and <trademark class="registered">Mac OS</trademark> users may be interested in instead using <link xlink:href="http://www.pcbsd.org/">PC-BSD</link>, a FreeBSD-based desktop distribution. Non-<trademark class="registered">UNIX</trademark> users should expect to invest some additional time learning the <trademark class="registered">UNIX</trademark> way of doing things. This <acronym>FAQ</acronym> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">FreeBSD Handbook</link> are excellent places to start.
de_de: Wenn Sie von einem anderen <trademark class="registered">UNIX</trademark> System zu FreeBSD wechseln, dürfte Ihnen vieles bekannt vorkommen. Wenn Ihr Hintergrund ein Betriebssystem wie <trademark class="registered">Windows</trademark> oder <trademark class="registered">MacOS</trademark>ist, sind Sie vielleicht an <link xlink:href="https://www.trueos.org/">TrueOS</link> interessiert, eine auf FreeBSD basierende Desktop-Distribution. Wenn Sie vorher noch nicht mit <trademark class="registered">UNIX</trademark> gearbeitet haben, werden Sie zusätzliche Zeit investieren müssen, um den <trademark class="registered">UNIX</trademark> Stil zu verstehen. Diese <acronym>FAQ</acronym> und das <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/index.html">FreeBSD Handbuch</link> sind die besten Startpunkte.
es_es: Los usuarios que migren a FreeBSD desde otro ambiente estilo <trademark class="registered">UNIX</trademark> encontraran que FreeBSD es similar. Los usuarios de <trademark class="registered">Windows</trademark> y <trademark class="registered">Mac OS</trademark> pueden estar interesados en utilizar <link xlink:href="http://www.pcbsd.org/">PC-BSD</link>, una distribución de escritorio basada en FreeBSD. Los usuarios no-<trademark class="registered">UNIX</trademark> deberían esperar invertir más tiempo aprendiendo la manera <trademark class="registered">UNIX</trademark> de hacer las cosas. Este <acronym>FAQ</acronym> y el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">manual de FreeBSD</link> son excelentes lugares para empezar.

source: Why is it called FreeBSD?
de_de: Warum heißt es FreeBSD?
es_es: ¿Porque se llama FreeBSD?
pt_br: Por que ele é chamado de FreeBSD?

source: It may be used free of charge, even by commercial users.
de_de: Es darf kostenlos genutzt werden - sogar von kommerziellen Nutzern.
es_es: Puede ser usado sin cargo, incluso por usuarios comerciales.
pt_br: Pode ser usado gratuitamente, até mesmo por usuários comerciais.

source: Full source for the operating system is freely available, and the minimum possible restrictions have been placed upon its use, distribution and incorporation into other work (commercial or non-commercial).
de_de: Der komplette Quellcode für das Betriebssystem ist frei verfügbar und die Benutzung, Verbreitung und Einbindung in andere (kommerzielle und nicht-kommerzielle) Arbeiten sind mit den geringstmöglichen Einschränkungen versehen worden.
es_es: El codigo fuente completo del sistema operativo esta disponible libremente, y se le han impuesto las mínimas restricciones posible a su uso, distribución y incorporación en otras obras (comerciales o no-comerciales).
pt_br: O código fonte completo do sistema operacional está disponível gratuitamente, e foram colocadas restrições mínimas sobre seu uso, distribuição e incorporação em outro trabalho (comercial ou não comercial).

source: Anyone who has an improvement or bug fix is free to submit their code and have it added to the source tree (subject to one or two obvious provisions).
de_de: Jedem ist es freigestellt, Code für Verbesserungen oder die Behebung von Fehlern einzusenden und ihn zum Quellbaum hinzufügen zu lassen (dies ist natürlich Gegenstand von ein oder zwei offensichtlichen Klauseln).
es_es: Cualquiera que posea una mejora una corrección de errores es libre de enviar su codigo y que este se añada al arbol de codigo fuente (sujeto a una o dos clausulas obvias).
pt_br: Qualquer pessoa que tenha uma melhoria ou correção de bug está livre para enviar seu código e para adicioná-lo ao repositório de código-fonte (sujeito a uma ou duas provisões óbvias).

source: It is worth pointing out that the word <quote>free</quote> is being used in two ways here: one meaning <quote>at no cost</quote> and the other meaning <quote>do whatever you like</quote>. Apart from one or two things you <emphasis>cannot</emphasis> do with the FreeBSD code, for example pretending you wrote it, you can really do whatever you like with it.
de_de: Es wird darauf hingewiesen, dass das englische Wort <quote>free</quote> hier in den Bedeutungen <quote>umsonst</quote> und <quote>Sie können tun, was immer Sie möchten</quote> genutzt wird. Abgesehen von ein oder zwei Dingen, die Sie mit dem FreeBSD-Code <emphasis>nicht</emphasis> tun können (z.B. vorgeben, ihn geschrieben zu haben), können Sie damit tatsächlich tun, was auch immer Sie möchten.
es_es: Vale la pena señalar que la palabra <quote>free</quote> se usa de dos maneras aqui: una de ellas significa <quote>sin costo</quote> y la otra significa <quote>haga lo que quiera</quote>. Aparte de una o dos cosas que usted <emphasis>no puede</emphasis> hacer con el código de FreeBSD, por ejemplo pretender que lo escribio, puede hacer lo que desee con el mismo.
pt_br: Vale ressaltar que a palavra <quote>free</quote> está sendo usada de duas formas aqui: uma que significa <quote>sem custo</quote> (grátis) e a outra que significa <quote>faça o que quiser</quote> (Livre). Fora uma ou duas coisas que você <emphasis>não pode</emphasis> fazer com o código do FreeBSD, por exemplo, fingir que você o escreveu, você pode realmente fazer o que quiser com ele.

source: What are the differences between FreeBSD and NetBSD, OpenBSD, and other open source BSD operating systems?
de_de: Wie unterschieden sich FreeBSD, NetBSD, OpenBSD und andere Open-Source BSD-Systeme?
es_es: ¿Cuales son las diferencias entre FreeBSD y NetBSD, OpenBSD, y otros sistemas operativos BSD de código abierto?
pt_br: Quais são as diferenças entre o FreeBSD, o NetBSD, o OpenBSD e os outros sistemas operacionais BSD de código aberto?

source: James Howard wrote a good explanation of the history and differences between the various projects, called <link xlink:href="http://www.freebsdworld.gr/freebsd/bsd-family-tree.html">The BSD Family Tree</link> which goes a fair way to answering this question. Some of the information is out of date, but the history portion in particular remains accurate.
de_de: James Howards Artikel, genannt <link xlink:href="http://www.freebsdworld.gr/freebsd/bsd-family-tree.html">The BSD Family Tree,</link>, beschreibt sehr gut die Geschichte und die Unterschiede der BSD-Varianten.
es_es: James Howard escribio una buena explicación de la historia y diferencias entre los varios proyectos, llamada <link xlink:href="http://www.freebsdworld.gr/freebsd/bsd-family-tree.html">El Arbol Familiar BSD</link> que se esfuerza en responder esta pregunta. Parte de la información esta desactualizada, pero la parte histórica en particular sigue siendo precisa.

source: Most of the BSDs share patches and code, even today. All of the BSDs have common ancestry.
de_de: Die meisten der BSDs teilen auch heute noch Patches und Code. Außerdem haben alle BSDs eine gemeinsame Herkunft.
es_es: La mayoria de los BSDs comparten codigo y parches, aún hoy en día. Todos estos BSDs tienen un linaje en común.
pt_br: A maioria dos BSDs compartilha patches e códigos, até hoje. Todos os BSDs descendem dos mesmos ancestrais.

source: The design goals of FreeBSD are described in <xref linkend="FreeBSD-goals"/>, above. The design goals of the other most popular BSDs may be summarized as follows:
de_de: Die Ziele von FreeBSD sind in <xref linkend="FreeBSD-goals"/> beschrieben. Die Ziele der anderen bekannten BSDs können wie folgt zusammengefasst werden:
es_es: Los objetivos de diseño de FreeBSD se describen en <xref linkend="FreeBSD-goals"/>. Los objetivos de diseño de los otros BSDs populares pueden resumirse como sigue:
pt_br: Os objetivos de design do FreeBSD estão descritos em <xref linkend="FreeBSD-goals"/>, acima. Os objetivos de design dos outros BSDs mais populares podem ser resumidos da seguinte forma:

source: OpenBSD aims for operating system security above all else. The OpenBSD team wrote <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>, which have both been ported to FreeBSD.
de_de: OpenBSD strebt eine hohe Sicherheit des Betriebssystems an. Das OpenBSD-Team hat auch <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry> entwickelt, welche ebenfalls nach FreeBSD portiert wurden.
es_es: OpenBSD busca la seguridad del sistema operativo por sobre todo lo demás. El equipo de OpenBSD escribio <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>, ambos han sido porteados a FreeBSD.
pt_br: O OpenBSD visa a segurança do sistema operacional acima de tudo. A equipe do OpenBSD escreveu o <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> e o <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>, os quais foram portados para o FreeBSD.

source: NetBSD aims to be easily ported to other hardware platforms.
de_de: NetBSD soll leicht auf andere Plattformen portierbar sein.
es_es: NetBSD apunta a ser facilmente porteado a otras plataformas de hardware.
pt_br: O NetBSD pretende ser facilmente portado para outras plataformas de hardware.

source: DragonFly BSD is a fork of FreeBSD 4.8 that has since developed many interesting features of its own, including the HAMMER file system and support for user-mode <quote>vkernels</quote>.
de_de: DragonFlyBSD ist eine Abspaltung von FreeBSD 4.8 und hat seither viele interessante Funktionen entwickelt, einschließlich des HAMMER-Dateisystems und Unterstützung für User-Mode <quote>vkernels</quote>.
es_es: DragonFly BSD es un fork de FreeBSD 4.8 que desde entonces desarrollo muchas caracterí­sticas propias interesantes, incluyendo el sistema de archivos HAMMER y soporte para <quote>vkernels</quote> en modo usuario.
pt_br: O DragonFly BSD é um fork do FreeBSD 4.8 o qual desenvolveu muitas características interessantes ao longo dos anos, incluindo o sistema de arquivos HAMMER e o suporte para <quote>vkernels</quote> no modo de usuário.

source: What is the latest version of FreeBSD?
de_de: Welches ist die aktuelle FreeBSD-Version?
es_es: ¿Cual es la última versión de FreeBSD?
pt_br: Qual é a última versão do FreeBSD?

source: At any point in the development of FreeBSD, there can be multiple parallel branches. 10.<replaceable>X</replaceable> releases are made from the <emphasis>10-STABLE</emphasis> branch, and 9.<replaceable>X</replaceable> releases are made from the <emphasis>9-STABLE</emphasis> branch.
de_de: Momentan gibt es zwei Entwicklungszweige, die für die Erstellung von Releases verwendet werden. Die 10.<replaceable>X</replaceable>-RELEASEs werden auf dem <emphasis>10-STABLE</emphasis>-Zweig erstellt, die 9.<replaceable>X</replaceable>-RELEASEs auf dem <emphasis>9-STABLE</emphasis>-Zweig.
es_es: En cualquier punto del desarrollo de FreeBSD puede haber multiples ramas paralelas. Las versiones 10.<replaceable>X</replaceable> se hacen a partir de la rama <emphasis>10-STABLE</emphasis>, y las versiones 9.<replaceable>X</replaceable> se hacen a partir de la rama <emphasis>9-STABLE</emphasis>.

source: Up until the release of 9.0, the 9.<replaceable>X</replaceable> series was the one known as <emphasis>-STABLE</emphasis>. However, as of 11.<replaceable>X</replaceable>, the 9.<replaceable>X</replaceable> branch will be designated for an <quote>extended support</quote> status and receive only fixes for major problems, such as security-related fixes.
de_de: Bis zur Veröffentlichung von FreeBSD 9.0 galt die 9.<replaceable>X</replaceable>-Serie als <emphasis>-STABLE</emphasis>. Seit FreeBSD 11.<replaceable>X</replaceable> gibt es für den Zweig 9.<replaceable>X</replaceable> nur mehr eine <quote>erweiterte Unterstützung</quote> in der Form von Korrekturen von größeren Problemen, wie neu entdeckten Sicherheitsheitslücken.
es_es: Hasta el lanzamiento de 9.0, la serie 9.<replaceable>X</replaceable> era la conocida como <emphasis>-STABLE</emphasis>. No obstante, a la fecha de lanzar 11.<replaceable>X</replaceable>, la rama 9.<replaceable>X</replaceable> sera designada para un estatus de <quote>soporte extendido</quote> y recibira solo arreglos para problemas importantes, por ejemplo los relacionados con seguridad.

source: Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.2-RELEASE/">10.2</link> is the latest release from the <emphasis>10-STABLE</emphasis> branch; it was released in August 2015. Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/9.3-RELEASE/">9.3</link> is the latest release from the <emphasis>9-STABLE</emphasis> branch; it was released in July 2014.
es_es: La versión <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.2-RELEASE/">10.2</link> es la última versión de la rama <emphasis>10-STABLE</emphasis>; fue lanzada en Agosto del 2015. La versión <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/9.3-RELEASE/">9.3</link> es la última versión de la rama <emphasis>9-STABLE</emphasis>; fue lanzada en Julio del 2014.

source: Releases are made <link linkend="release-freq">every few months</link>. While many people stay more up-to-date with the FreeBSD sources (see the questions on <link linkend="current">FreeBSD-CURRENT</link> and <link linkend="stable">FreeBSD-STABLE</link>) than that, doing so is more of a commitment, as the sources are a moving target.
de_de: Releases werden <link linkend="release-freq">nur alle paar Monate</link> erstellt. Viele Leute halten ihre Systeme aktueller (lesen Sie die Fragen zu <link linkend="current">FreeBSD-CURRENT</link> und <link linkend="stable">FreeBSD-STABLE</link>), aber das erfordert ein erhöhtes Engagement, da der Quellcode sich ständig verändern.
es_es: Las versiones se hacen <link linkend="release-freq">cada unos cuantos meses</link>. Mientras que mucha gente se mantiene más al corriente con las fuentes de FreeBSD (vea las preguntas en <link linkend="current">FreeBSD-CURRENT</link> y <link linkend="stable">FreeBSD-STABLE</link>) que eso, hacerlo requiere un compromiso mayor, ya que las fuentes son un blanco en movimiento.
pt_br: As releases são liberadas a <link linkend="release-freq">cada poucos meses</link>. Embora muitas pessoas se mantenham mais que isso por meio do código fonte do FreeBSD (veja as perguntas em <link linkend="current">FreeBSD-CURRENT</link> e <link linkend="stable">FreeBSD-STABLE</link> ), esta periodicidade está mais para um compromisso, já que o código fonte é um alvo em movimento.

source: More information on FreeBSD releases can be found on the <link xlink:href="http://www.FreeBSD.org/releng/index.html#release-build">Release Engineering page</link> and in <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.
de_de: Weitere Informationen über FreeBSD-Releases finden Sie auf der <link xlink:href="http://www.FreeBSD.org/releng/index.html#release-build">Release Engineering Seite</link> und in <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.
es_es: Puede encontrarse más información acerca de las versiones de FreeBSD en la <link xlink:href="http://www.FreeBSD.org/releng/index.html#release-build">página de Ingenieria de Versiones</link> y en <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.

source: What is <emphasis>FreeBSD-CURRENT</emphasis>?
de_de: Was ist <emphasis>FreeBSD-CURRENT</emphasis>?
es_es: ¿Qué es <emphasis>FreeBSD-CURRENT</emphasis>?
pt_br: O que é o <emphasis>FreeBSD-CURRENT</emphasis>?

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">FreeBSD-CURRENT</link> is the development version of the operating system, which will in due course become the new FreeBSD-STABLE branch. As such, it is really only of interest to developers working on the system and die-hard hobbyists. See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">relevant section</link> in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook</link> for details on running <emphasis>-CURRENT</emphasis>.
de_de: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">FreeBSD-CURRENT</link> ist die Entwicklungsversion des Betriebssystems, aus der zu gegebener Zeit der FreeBSD-STABLE-Zweig entstehen wird. Als solche ist sie lediglich für Entwickler, die am System mitarbeiten und für unentwegte Bastler von Interesse. Details zum Betrieb von <emphasis>-CURRENT</emphasis> finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/current-stable.html#current">entsprechenden Abschnitt</link> des <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/index.html">Handbuchs</link>.
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">FreeBSD-CURRENT</link> es la versión de desarrollo del sistema operativo, la cual a su debido tiempo se convertira en la nueva rama FreeBSD-STABLE. Como tal, solo sirve de interes a los desarrolladores trabajando en el sistema y entusiastas acérrimos. Vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">sección reelevante</link> en el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">manual</link> para obtener detalles acerca de correr <emphasis>-CURRENT</emphasis>.
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">FreeBSD-CURRENT</link> é a versão de desenvolvimento do sistema operacional, que no devido tempo se tornará o novo branch FreeBSD-STABLE. Como tal, ele é recomendado apenas para os desenvolvedores que trabalham no sistema e usuários amadores obstinados. Consulte a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">seção relevante</link> no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook</link> para detalhes sobre como executar o <emphasis>-CURRENT</emphasis>.

source: Users not familiar with FreeBSD should not use FreeBSD-CURRENT. This branch sometimes evolves quite quickly and due to mistake can be un-buildable at times. People that use FreeBSD-CURRENT are expected to be able to analyze, debug, and report problems.
de_de: Falls Sie mit FreeBSD nicht vertraut sind, sollten Sie FreeBSD-CURRENT nicht verwenden. Dieser Zweig entwickelt sich manchmal sehr schnell weiter und kann gelegentlich nicht installierbar sein. Von Personen, die FreeBSD-CURRENT verwenden, wird erwartet, dass Sie dazu in der Lage sind, Probleme zu erkennen, zu analysieren und diese an das Projekt zurückzumelden.
es_es: Los usuarios que no esten familiarizados con FreeBSD no deberían usar FreeBSD-CURRENT. Esta rama suele evolucionar rápidamente y a veces, debido a errores puede ser imposible de compilar. Se espera que la gente que usa FreeBSD-CURRENT sea capaz de analizar, debuggear y reportar problemas.
pt_br: Usuários não familiarizados com o FreeBSD não devem usar o FreeBSD-CURRENT. Este branch às vezes evolui muito rapidamente e, devido a um erro, pode ser difícil de compilá-lo às vezes. Espera-se que as pessoas que usam o FreeBSD-CURRENT possam analisar, depurar e reportar problemas.

source: FreeBSD <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link> releases are made based on the current state of the <emphasis>-CURRENT</emphasis> and <emphasis>-STABLE</emphasis> branches. The goals behind each snapshot release are:
de_de: Jeden Monat wird der aktuelle Entwicklungsstand in den Zweigen -CURRENT und -STABLE in einer <link xlink:href="@@URL_RELPREFIX@@/snapshots/">Snapshot</link> Release festgehalten. Die Ziele dieser Snapshot Releases sind:
es_es: Las versiones <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link> de FreeBSD son hechas basadas en en el estado actual de las ramas <emphasis>-CURRENT</emphasis> y <emphasis>-STABLE</emphasis>. Los objetivos detrás de cada version snapshot son:
pt_br: As <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link> releases do FreeBSD são disponibilizadas com base no estado atual das branchs <emphasis>-CURRENT</emphasis> e <emphasis>-STABLE</emphasis>. Os objetivos por trás de cada release de snapshot são:

source: To test the latest version of the installation software.
de_de: Die aktuelle Version der Installationssoftware zu testen.
es_es: Probar la última versión de la instalación del software.
pt_br: Testar a versão mais recente do software de instalação.
