Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Back when FreeBSD 2.0.5 was released, FreeBSD development branched in two. One branch was named <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, one <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link>. <emphasis>FreeBSD-STABLE</emphasis> is the development branch from which major releases are made. Changes go into this branch at a slower pace and with the general assumption that they have first been tested in FreeBSD-CURRENT. However, at any given time, the sources for FreeBSD-STABLE may or may not be suitable for general use, as it may uncover bugs and corner cases that were not yet found in FreeBSD-CURRENT. Users who do not have the resources to perform testing should instead run the most recent release of FreeBSD. <emphasis>FreeBSD-CURRENT</emphasis>, on the other hand, has been one unbroken line since 2.0 was released, leading towards 11.2-RELEASE and beyond. For more detailed information on branches see <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">FreeBSD Release Engineering: Creating the Release Branch</link></quote>, the status of the branches and the upcoming release schedule can be found on the <link xlink:href="https://www.FreeBSD.org/releng">Release Engineering Information</link> page.
pt_br: De volta quando o FreeBSD 2.0.5 foi lançado, o desenvolvimento do FreeBSD se ramificou em dois. Um ramo (branch) foi nomeado <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, um <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link>. O <emphasis>FreeBSD-STABLE</emphasis> é o branch de desenvolvimento a partir do qual os releases principais são feitos. Mudanças entram nesta branch em um ritmo mais lento e com a suposição geral de que eles foram testados primeiro no FreeBSD-CURRENT. No entanto, a qualquer momento, o código fonte para o FreeBSD-STABLE pode ou não ser adequado para uso geral, devido a descoberta de bugs e/ou outros casos específicos que ainda não foram encontrados no FreeBSD-CURRENT. Usuários que não possuem recursos para realizar testes devem, ao invés disso, executar a release mais recente do FreeBSD. O <emphasis>FreeBSD-CURRENT</emphasis>, por outro lado, tem sido uma linha continua desde que o 2.0 foi lançado, levando em direção ao 11.2-RELEASE e além. Para obter informações mais detalhadas sobre branchs, consulte <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">Engenharia de Releases do FreeBSD: Criando uma Release Branch</link></quote>, o status dos branches e o cronograma para releases futuros podem ser encontrados na página de informações da <link xlink:href="https://www.FreeBSD.org/releng">Engenharia de Release</link>.

source: 11.2-STABLE is the actively developed <emphasis>-STABLE</emphasis> branch. The latest release on the 11.2-STABLE branch is 11.2-RELEASE, which was released in June 2018.
pt_br: A 11.2-STABLE é a branch <emphasis>-STABLE</emphasis> desenvolvida ativamente. O último release na branch 11.2-STABLE é a 11.2-RELEASE, lançado em junho de 2018.

source: The <emphasis>12-CURRENT</emphasis> branch is the actively developed <emphasis>-CURRENT</emphasis> branch toward the next generation of FreeBSD. See <link linkend="current">What is FreeBSD-CURRENT?</link> for more information on this branch.
pt_br: O <emphasis>12-CURRENT</emphasis> é a branch <emphasis>-CURRENT</emphasis> desenvolvida ativamente para a próxima geração do FreeBSD. Veja <link linkend="current">O que é o FreeBSD-CURRENT?</link> para mais informações sobre esta branch.

source: More information on the release engineering process (including a schedule of upcoming releases) can be found on the <link xlink:href="https://www.FreeBSD.org/releng/index.html">release engineering</link> pages on the FreeBSD Web site.
pt_br: Maiores informações sobre o processo de engenharia de releases (incluindo a programação das releases futuros) podem ser encontradas na página <link xlink:href="https://www.FreeBSD.org/releng/index.html">engenharia de release</link> no site do FreeBSD.

source: The latest <emphasis>11-STABLE</emphasis> release, 11.2-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.2-RELEASE/">11.2-RELEASE directory</link>.
pt_br: O último release da série <emphasis>11-STABLE</emphasis>, o 11.2-RELEASE, pode ser encontrado no <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.2-RELEASE/">diretório 11.2-RELEASE</link>.

source: The latest <emphasis>10-STABLE</emphasis> release, 10.4-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.4-RELEASE/">10.4-RELEASE directory</link>.
pt_br: O último release da série <emphasis>10-STABLE</emphasis>, o 10.4-RELEASE, pode ser encontrado no <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.4-RELEASE/">diretório 10.4-RELEASE</link>.

source: The project produces a wide range of documentation, available online from this link: <uri xlink:href="https://www.FreeBSD.org/docs.html">https://www.FreeBSD.org/docs.html</uri>. In addition, the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bibliography.html">the bibliography in the Handbook</link> reference other recommended books.
pt_br: O projeto produz uma ampla gama de documentação, disponível on-line a partir deste link: <uri xlink:href="https://www.FreeBSD.org/docs.html">https://www.FreeBSD.org/docs.html</uri>. Além disso, a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bibliography.html">referência bibliográfica no Handbook</link> referencia outros livros recomendados.

source: Yes. The documentation is available in a number of different formats and compression schemes on the FreeBSD FTP site, in the <link xlink:href="https://download.freebsd.org/ftp/doc/">/pub/FreeBSD/doc/</link> directory.
pt_br: Sim. A documentação está disponível em vários formatos diferentes e esquemas de compressão no site FTP do FreeBSD, no diretório <link xlink:href="https://download.freebsd.org/ftp/doc/">/pub/FreeBSD/doc/</link>.

source: Korean (Korea, UTF-8 encoding)
pt_br: Coreano (Coreia, codificação UTF-8)

source: The FreeBSD wiki has a <link xlink:href="https://wiki.freebsd.org/IRC/Channels">good list</link> of IRC channels.
pt_br: A wiki do FreeBSD tem uma <link xlink:href="https://wiki.freebsd.org/IRC/Channels">boa lista</link> dos canais de IRC.

source: <link xlink:href="http://www.ixsystems.com">iXsystems, Inc.</link>, parent company of the <link xlink:href="http://www.freebsdmall.com/">FreeBSD Mall</link>, provides commercial FreeBSD and TrueOS software <link xlink:href="http://www.ixsystems.com/support">support</link>, in addition to FreeBSD development and tuning solutions.
pt_br: A <link xlink:href="http://www.ixsystems.com"> iXsystems, Inc. </link>, empresa controladora do <link xlink:href="http://www.freebsdmall.com/">FreeBSD Mall</link>, fornece <link xlink:href="http://www.ixsystems.com/support">supporte</link> comercial para o FreeBSD e TrueOS, e também soluções de desenvolvimento e customização para o FreeBSD.

source: On the <link xlink:href="https://www.freebsd.org/where.html">Getting FreeBSD</link> page, select <literal>[iso]</literal> next to the architecture that matches the hardware.
pt_br: Na página <link xlink:href="https://www.freebsd.org/where.html">Como obter o FreeBSD</link>, selecione <literal>[iso]</literal> ao lado da arquitetura que corresponde ao seu hardware.

source: FreeBSD uses <emphasis>SHA512</emphasis> by default. DES passwords are still available for backwards compatibility with operating systems that still use the less secure password format. FreeBSD also supports the Blowfish and MD5 password formats. Which password format to use for new passwords is controlled by the <literal>passwd_format</literal> login capability in <filename>/etc/login.conf</filename>, which takes values of <literal>des</literal>, <literal>blf</literal> (if these are available) or <literal>md5</literal>. See the <citerefentry><refentrytitle>login.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page for more information about login capabilities.
pt_br: O FreeBSD usa <emphasis>SHA512</emphasis> por padrão. Senhas DES ainda estão disponíveis para compatibilidade com sistemas operacionais que ainda usam um formato de senha menos seguro. O FreeBSD também suporta os formatos de senha Blowfish e MD5. O formato de senha que será usado para novas senhas é controlado pelo recurso de login <literal>passwd_format</literal> no arquivo <filename>/etc/login.conf</filename>, que recebe valores de <literal>des</literal>, <literal>blf</literal> (se estiverem disponíveis) ou <literal>md5</literal>. Veja a página de manual <citerefentry><refentrytitle>login.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para maiores informações sobre as capacidades de login.

source: This is discussed continually on the FreeBSD mailing lists but is to be expected since hardware changes so quickly. Read through the Hardware Notes for FreeBSD <link xlink:href="https://www.FreeBSD.org/releases/11.2R/hardware.html">11.2</link> or <link xlink:href="https://www.FreeBSD.org/releases/10.4R/hardware.html">10.4</link> and search the mailing list <link xlink:href="https://www.FreeBSD.org/search/#mailinglists">archives</link> before asking about the latest and greatest hardware. Chances are a discussion about that type of hardware took place just last week.
pt_br: Isso é discutido continuamente nas listas de discussão do FreeBSD, mas isto é de se esperar, já que o hardware muda tão rapidamente. Leia as Notas de Hardware do FreeBSD <link xlink:href="https://www.FreeBSD.org/releases/11.2R/hardware.html">11.2</link> ou <link xlink:href="https://www.FreeBSD.org/releases/10.4R/hardware.html">10.4</link> e pesquise os <link xlink:href="https://www.FreeBSD.org/search/#mailinglists">arquivos</link> da lista de discussão antes de perguntar sobre o hardware mais recente e melhor. As chances são de que uma discussão sobre esse tipo de hardware tenha acontecido na semana passada.

source: A complete list of supported architectures can be found on the <link xlink:href="https://www.FreeBSD.org/platforms/">platforms page.</link>
pt_br: Uma lista completa de arquiteturas suportadas pode ser encontrada na <link xlink:href="https://www.FreeBSD.org/platforms/">páginas de plataformas.</link>

source: See the complete list in the Hardware Notes for FreeBSD <link xlink:href="https://www.FreeBSD.org/releases/11.2R/hardware.html">11.2</link> or <link xlink:href="https://www.FreeBSD.org/releases/10.4R/hardware.html">10.4</link>.
pt_br: Veja a lista completa em Notas de Hardware para o FreeBSD <link xlink:href="https://www.FreeBSD.org/releases/11.2R/hardware.html">11.2</link> ou <link xlink:href="https://www.FreeBSD.org/releases/10.4R/hardware.html">10.4</link>.

source: FreeBSD supports any ATAPI-compatible IDE CD-R or CD-RW drive.
pt_br: O FreeBSD suporta qualquer drive IDE CD-R ou CD-RW compatível com ATAPI.

source: bind ^? ed-delete-next-char # for console bind ^[[3~ ed-delete-next-char # for xterm
pt_br: bind ^? ed-delete-next-char # para o console bind ^[[3~ ed-delete-next-char # para o xterm

source: bindkey ^? delete-char # for console bindkey ^[[3~ delete-char # for xterm
pt_br: bindkey ^? delete-char # para o console bindkey ^[[3~ delete-char # para o xterm

source: This means that a process is trying to page memory from disk, and the page attempt has hung trying to access the disk for more than 20 seconds. It might be caused by bad blocks on the disk drive, disk wiring, cables, or any other disk I/O-related hardware. If the drive itself is bad, disk errors will appear in <filename>/var/log/messages</filename> and in the output of <command>dmesg</command>. Otherwise, check the cables and connections.
pt_br: Isso significa que um processo está tentando armazenar em memória RAM a memória do disco (swap), e que o processo foi interrompido depois de tentar sem sucesso acessar o disco por mais de 20 segundos. Isso pode ser causado por blocos defeituosos na unidade de disco, fiação de disco defeituosa, cabos ou qualquer outro hardware relacionado a I/O de disco. Se a própria unidade estiver com problemas, erros de disco aparecerão em <filename>/var/log/messages</filename> e na saída do comando <command>dmesg</command>. Caso contrário, verifique os cabos e conexões.

source: How do I download the Ports tree? Should I be using Subversion?
pt_br: Como faço para baixar a coleção de ports? Eu deveria estar usando o Subversion?

source: Use Subversion if custom patches to the ports tree are needed. Refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Using Subversion</link> for details.
pt_br: Use o Subversion se for necessário a aplicação de patches customizados na árvore de ports. Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html"> Usando o Subversion </link> para obter detalhes.

source: Yes. Refer to <link xlink:href="@@URL_RELPREFIX@@/java/index.html">https://www.FreeBSD.org/java/</link> for more information.
pt_br: Sim. Consulte a página web <link xlink:href="@@URL_RELPREFIX@@/java/index.html">https://www.FreeBSD.org/java/</link> para mais informações.

source: Why can I not build this port on my 10.<replaceable>X</replaceable> -, or 11.<replaceable>X</replaceable> -STABLE machine?
pt_br: Por que não posso compilar esse port na minha máquina 10.<replaceable>X</replaceable> - ou 11.<replaceable>X</replaceable> -STABLE?

source: There are rare cases where <filename>INDEX</filename> will not build due to odd cases involving <varname>OPTIONS_SET</varname> being set in <filename>make.conf</filename>. If you suspect that this is the case, try to make <filename>INDEX</filename> with those variables turned off before reporting it to <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>.
pt_br: Existem casos raros em que o <filename>INDEX</filename> não será compilado devido a casos estranhos envolvendo a variável <varname>OPTIONS_SET</varname> sendo definida em <filename>make.conf</filename>. Se você suspeitar que este é o caso, tente fazer o <filename>INDEX</filename> com estas variáveis desativadas antes de reportar o erro para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">Lista de discussão de ports do FreeBSD</link>.

source: Trying to mount an audio CD will produce an error like <errorname>cd9660: /dev/cd0: Invalid argument</errorname>. This is because <command>mount</command> only works on file systems. Audio CDs do not have file systems; they just have data. Instead, use a program that reads audio CDs, such as the <package>audio/xmcd</package> package or port.
pt_br: Tentar montar um CD de áudio produzirá um erro do tipo <errorname>cd9660: /dev/cd0: Invalid argument</errorname>. Isso ocorre porque o comando <command>mount</command> só funciona em sistemas de arquivos. CDs de áudio não possuem sistemas de arquivos; eles têm apenas dados. Em vez disso, use um programa que leia CDs de áudio, como o pacote ou port <package>audio/xmcd</package>.

source: In order to use a full screen editor such as <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry vendor="ports"><refentrytitle>emacs</refentrytitle><manvolnum>1</manvolnum></citerefentry>, run <command>export TERM=xterm</command> so that these editors can load the correct data from the <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry> database.
pt_br: Para usar um editor de tela inteira, tal como o <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <citerefentry vendor="ports"><refentrytitle>emacs</refentrytitle><manvolnum>1</manvolnum></citerefentry>, execute <command>export TERM=xterm</command> para que esses editores possam carregar os dados corretos do banco de dados do <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: <citerefentry><refentrytitle>rpc.statd</refentrytitle><manvolnum>8</manvolnum></citerefentry> maps its status file (resident on <filename>/var</filename>) into its address space; to save worrying about remapping the status file later when it needs to grow, it maps the status file with a generous size. This is very evident from the source code, where one can see that the length argument to <citerefentry><refentrytitle>mmap</refentrytitle><manvolnum>2</manvolnum></citerefentry> is <literal>0x10000000</literal>, or one sixteenth of the address space on an IA32, or exactly 256 MB.
pt_br: O <citerefentry><refentrytitle>rpc.statd</refentrytitle><manvolnum>8</manvolnum> </citerefentry> mapeia seu arquivo de status (residente no <filename>/var</filename>) em seu espaço de endereçamento; para evitar se preocupar com o remapeamento do arquivo de status mais tarde quando ele precisar crescer, ele mapeia o arquivo de status com um tamanho generoso. Isso é muito evidente no código-fonte, onde é possível ver que o argumento length para o <citerefentry><refentrytitle>mmap</refentrytitle><manvolnum>2</manvolnum></citerefentry> é <literal> 0x10000000 </literal> , ou décima sexta parte do espaço de endereço em um IA32, ou seja, exatamente 256 MB.

source: The system is running at securelevel greater than 0. Lower the securelevel and try again. For more information, see <link linkend="securelevel">the <acronym>FAQ</acronym> entry on securelevel</link> and the <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page.
pt_br: O sistema está sendo executado em um nível de segurança maior que 0. Reduza o nível de segurança e tente novamente. Para obter mais informações, consulte <link linkend="securelevel"> a entrada do <acronym>FAQ</acronym> referente ao securelevel</link> e a página de manual do <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: The mouse can be enabled in <application>Emacs</application>by adding these lines to <filename>~/.emacs</filename>:
pt_br: O mouse pode ser habilitado no <application>Emacs</application> adicionando estas linhas ao <filename> ~/.emacs</filename>:

source: For Matrox G200/G400, check the <package>x11-drivers/xf86-video-mga</package> port.
pt_br: Para a Matrox G200/G400, verifique o port <package> x11-drivers/xf86-video-mga</package>.

source: How do I compile an IPv6 only kernel?
pt_br: Como faço para compilar um kernel com suporte somente ao IPv6?

source: Configure your kernel with these settings: <_:screen-1/>
pt_br: Configure seu kernel com estas configurações: <_:screen-1/>

source: The process is only able to run inside the walls. Since nothing the process does in regards to executing code is supposed to be able to breach the walls, a detailed audit of its code is not needed in order to be able to say certain things about its security.
pt_br: O processo só é capaz de correr dentro das barreiras. Desde que nada que o processo faça em relação à execução de código seja capaz de violar as barreiras, uma auditoria detalhada de seu código não é necessária para poder dizer certas coisas sobre sua segurança.

source: <application>BIND9</application> (<command>named</command>) is listening on some high-numbered ports. What is going on?
pt_br: O <application>BIND9</application> (<command>named</command>) está escutando em algumas portas de numeração alta. O que está acontecendo?

source: If a port number (like 53) is specified via the <literal>query-source</literal> or <literal>query-source-v6</literal> options in <filename>/usr/local/etc/namedb/named.conf</filename>, randomized port selection will not be used. It is strongly recommended that these options not be used to specify fixed port numbers.
pt_br: Se um número de porta (como 53) for especificado através das opções <literal>query-source</literal> ou <literal>query-source-v6</literal> em <filename>/usr/local/etc/namedb/named .conf</filename>, a seleção de portas aleatórias não será usada. É altamente recomendável que essas opções não sejam usadas para especificar números de porta fixos.

source: How can I contribute to FreeBSD? What can I do to help?
pt_br: Como posso contribuir para o FreeBSD? O que posso fazer para ajudar?

source: Right now, <emphasis>-CURRENT</emphasis> is the 12.<replaceable>X</replaceable> development stream; the <emphasis>11-STABLE</emphasis> branch, <symbol>stable/11/</symbol>, forked off from <emphasis>-CURRENT</emphasis> in April 2016 and the <emphasis>10-STABLE</emphasis> branch, <symbol>stable/10/</symbol>, forked off from <emphasis>-CURRENT</emphasis> in August 2015.
pt_br: No momento, o <emphasis>-CURRENT</emphasis> é o fluxo de desenvolvimento 12.<replaceable>X</replaceable>; o branch <emphasis>11-STABLE</emphasis>, <symbol>stable/11/</symbol>, derivou do <emphasis>-CURRENT</emphasis> em abril de 2016 e o branch ​​<emphasis>10-STABLE</emphasis>,<symbol>stable/10/</symbol>, derivou do <emphasis>-CURRENT</emphasis> em agosto de 2015.
