Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If the noise gets to you, a good <command>fdisk /mbr</command> from DOS will get rid of them, but do not be surprised if they react adversely and try to stop you. In fact, if at any point during the exercise you hear the satanic voice of Bill Gates coming from the built-in speaker, take off running and do not ever look back! Freed from the counterbalancing influence of the BSD daemons, the twin demons of DOS and <trademark class="registered">Windows</trademark> are often able to re-assert total control over your machine to the eternal damnation of your soul. Now that you know, given a choice you would probably prefer to get used to the scratchy noises, no?
de_de: Wenn Sie das Geräusch stört, wird ein <command>fdisk /mbr</command> aus DOS sie vertreiben, aber wundern Sie sich nicht, wenn sie feindlich reagieren und versuchen, Sie aufzuhalten. Wenn Sie während der Ausführung zu irgendeinem Zeitpunkt die teuflische Stimme von Bill Gates aus dem eingebauten Lautsprecher kommen hören, laufen Sie weg und sehen Sie sich auf keinen Fall um! Befreit von dem ausgleichenden Einfluss der BSD Dämonen sind die beiden Dämonen von DOS und <trademark class="registered">Windows</trademark> oft dazu in der Lage, die totale Kontrolle über Ihre Maschine für die ewige Verdammung Ihrer Seele zurückzuerlangen. Da Sie jetzt die Wahrheit kennen, würden Sie es vorziehen, sich an die Geräusche zu gewöhnen, wenn Sie die Wahl hätten.
es_es: Si el sonido lo empieza a molestar, un buen <command>fdisk /mbr</command> desde DOS se librara de ellos, pero no se sorprenda si reaccionan adversamente e intentan detenerlo. De hecho, si en cualquier punto del ejercicio usted escucha la voz satánica de Bill Gates viniendo desde el parlante incorporado... ¡Salga corriendo y no mire hacia atrás! Libre de las influencias de contrapeso de los demonios de BSD, los demonios gemelos de DOS y <trademark class="registered">Windows</trademark> suelen poder asegurarse el control total de su máquina y la condenación eterna de su alma. ¿Ahora que lo sabe, dada la oportunidad preferiría acostumbrarse a los sonidos de rasguños, verdad?
pt_br: Se o ruído chegar até você, um bom <command>fdisk/mbr</command> do DOS irá se livrar deles, mas não fique surpreso se eles reagirem negativamente e tentarem pará-lo. Na verdade, se em algum momento durante o exercício você ouvir a voz satânica de Bill Gates vindo do alto-falante embutido, saia correndo e não olhe para trás! Livres da influência contrabalançadora dos daemons BSD, os demônios gêmeos do DOS e <trademark class="registered">Windows</trademark> são frequentemente capazes de reafirmar o controle total sobre sua máquina para a danação eterna de sua alma. Agora que você sabe, dada uma escolha, você provavelmente preferiria se acostumar com os ruídos ásperos, não?

source: How many FreeBSD hackers does it take to change a lightbulb?
de_de: Wie viele FreeBSD-Hacker braucht man, um eine Glühbirne auszuwechseln?
es_es: ¿Cuántos hackers de FreeBSD se necesitan para cambiar un foco de luz?
pt_br: Quantos hackers do FreeBSD são necessários para trocar uma lâmpada?

source: One thousand, one hundred and sixty-nine:
de_de: Eintausendeinhundertundneunundsechzig:
es_es: Mil ciento sesenta y nueve.
pt_br: Mil, cento e sessenta e nove:

source: Twenty-three to complain to -CURRENT about the lights being out;
de_de: Dreiundzwanzig, die sich bei -CURRENT beschweren, dass das Licht aus ist;
es_es: Veintitrés para quejarse en -CURRENT que las luces están apagadas;
pt_br: Vinte e três para reclamar com -CURRENT sobre as luzes estarem apagadas;

source: Four to claim that it is a configuration problem, and that such matters really belong on -questions;
de_de: Vier, die behaupten, dass es sich um ein Konfigurationsproblem handelt und dass solche Dinge wirklich nach -questions gehören;
es_es: Cuatro para declarar que es un problema de configuración, y que tales cuestiones pertenecen a -questions;
pt_br: Quatro para afirmar que trata-se de um problema de configuração e que tais questões realmente pertencem a -questions;

source: Three to submit PRs about it, one of which is misfiled under doc and consists only of <quote>it's dark</quote>;
de_de: Drei, die PRs hierzu einreichen, einer von ihnen wird falsch unter doc abgelegt und fristet sein Dasein im Dunkeln;
es_es: Tres para envíar PRs acerca de ello, uno de los cuales fue enviado erróneamente bajo doc y consiste solo de <quote>esta oscuro</quote>;
pt_br: Três para enviar PRs sobre o assunto, uma das quais está arquivada sob doc e consiste apenas da declaração <quote>está escuro</quote>;

source: One to commit an untested lightbulb which breaks buildworld, then back it out five minutes later;
de_de: Einen, der eine ungetestete Glühbirne einreicht, wonach buildworld nicht mehr funktioniert, und sie dann fünf Minuten später wieder herausnimmt;
es_es: Uno para commitear un foco de luz no probado que rompe buildworld, y luego revertirlo cinco minutos después;
pt_br: Um para cometer uma lâmpada não testada que quebra o buildworld, e depois retorna cinco minutos depois;

source: Eight to flame the PR originators for not including patches in their PRs;
de_de: Acht, die die PR-Erzeuger beschimpfen, weil sie zu ihren PRs keine Patche hinzugefügt haben;
es_es: Ocho para agredir a los que envíaron el PR por no incluir parches en sus PRs;
pt_br: Oito para chamar os remetentes de RP por não incluir patches em seus PRs;

source: Five to complain about buildworld being broken;
de_de: Fünf, die sich darüber beschweren, dass buildworld nicht mehr funktioniert;
es_es: Cinco para quejarse de que buildworld esta roto;
pt_br: Cinco para reclamar sobre o buildworld sendo quebrado;

source: Thirty-one to answer that it works for them, and they must have updated at a bad time;
de_de: Einunddreißig, die antworten, dass es bei ihnen funktioniert und dass sie die Aktualisierung wohl zu einigem ungünstigen Zeitpunkt durchgeführt haben;
es_es: Treinta y uno para responder que funciona para ellos, y que deben haber actualizado en un mal momento;
pt_br: Trinta e um para responder que funciona para eles, e eles devem ter atualizado em um momento ruim;

source: One to post a patch for a new lightbulb to -hackers;
de_de: Einen, der einen Patch für eine neue Glühbirne an -hackers schickt;
es_es: Uno para postear un parche para un nuevo foco de luz a -hackers;
pt_br: Um para postar um patch para uma nova luz para -hackers;

source: One to complain that he had patches for this three years ago, but when he sent them to -CURRENT they were just ignored, and he has had bad experiences with the PR system; besides, the proposed new lightbulb is non-reflexive;
de_de: Einen, der sich beschwert, dass es vor drei Jahren Patches hierfür hatte, aber als er sie nach -CURRENT schickte, sind sie einfach ignoriert worden und er hatte schlechte Erfahrungen mit dem PR-System; nebenbei ist die vorgeschlagene Glühbirne nicht reflexiv;
es_es: Uno para quejarse de que tuvo parches para esto hace tres años, pero cuando los envío a -CURRENT fueron ignorados, y que tuvo malas experiencias con el sistema de PR; además, el nuevo foco de luz propuesto no es reflexivo.
pt_br: Um para reclamar que ele tinha patches para isso há três anos, mas quando ele os enviou para -CURRENT eles foram ignorados, e ele teve más experiências com o sistema de PRs; além disso, a nova luz proposta não é reflexiva;

source: Thirty-seven to scream that lightbulbs do not belong in the base system, that committers have no right to do things like this without consulting the Community, and WHAT IS -CORE DOING ABOUT IT!?
de_de: Siebenunddreißig, die schreien, dass Glühbirnen nicht in das Basissystem gehören, dass Committer nicht das Recht haben, solche Dinge durchzuführen, ohne die Gemeinschaft zu konsultieren und WAS GEDENKT -CORE HIER ZU TUN!?
es_es: Treinta y siete para gritar que los focos de luz no pertenecen en el sistema base, que los commiters no tienen derecho a hacer estas cosas sin consultar con la comunidad, y ¡¿QUE ESTA HACIENDO CORE ACERCA DE ESTO?!
pt_br: Trinta e sete para gritar que essa luz não pertencem ao sistema básico, que os committers não têm o direito de fazer coisas assim sem consultar a Comunidade, e O QUE O -CORE ESTÁ FAZENDO SOBRE ISSO!?

source: Two hundred to complain about the color of the bicycle shed;
de_de: Zweihundert, die sich über die Farbe des Fahrradschuppens beschweren;
es_es: Doscientos para quejarse del color del cobertizo de bicicletas.
pt_br: Duzentos para reclamar da cor do bicicletário;

source: Three to point out that the patch breaks <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry>;
de_de: Drei, die darauf hinweisen, dass der Patch nicht mit <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> übereinstimmt;
es_es: Tres para señalar que el parche no respeta <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry>;
pt_br: Três para salientar que o patch quebra o <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry>;

source: Seventeen to complain that the proposed new lightbulb is under GPL;
de_de: Siebzehn, die sich beschweren, dass die vorgeschlagene neue Glühbirne der GPL unterliegt;
es_es: Diecisiete para quejarse de que el nuevo foco de luz propuesto esta bajo la GPL;
pt_br: Dezessete para reclamar que a nova luz proposta está sob a GPL;

source: Five hundred and eighty-six to engage in a flame war about the comparative advantages of the GPL, the BSD license, the MIT license, the NPL, and the personal hygiene of unnamed FSF founders;
de_de: Fünfhundertundsechsundachtzig, die sich in einen Streit über die vergleichbaren Vorteile der GPL, der BSD-Lizenz, der MIT-Lizenz, der NPL und der persönlichen Hygiene nichtgenannter FSF-Gründer verwickeln;
es_es: Quinientos ochenta y seis para iniciar una discusión acerca de las ventajas comparativas de la GPL, la licencia BSD, la licencia MIT, la NPL, y la higiene personal de fundadores no especificados de la FSF;
pt_br: Quinhentos e oitenta e seis para iniciar uma guerra contra as vantagens comparativas da GPL, da licença da BSD, da licença do MIT, da NPL e da higiene pessoal dos fundadores da FSF, que não são nomeados;

source: Seven to move various portions of the thread to -chat and -advocacy;
de_de: Sieben, die unterschiedliche Teile des Threads nach -chat und -advocacy weiterleiten;
es_es: Siete para mover varias partes del thread a -chat y -advocacy;
pt_br: Sete para mover várias partes do segmento para -chat e -vocacy;

source: One to commit the suggested lightbulb, even though it shines dimmer than the old one;
de_de: Einer, der die vorgeschlagene Glühbirne einbaut, obwohl sie dunkler leuchtet, als die alte;
es_es: Uno para commitear el foco de luz sugerido, aunque brille de manera más tenue que el viejo;
pt_br: Um para comitar a luz sugerida, mesmo que ela seja mais escura que a antiga;

source: Two to back it out with a furious flame of a commit message, arguing that FreeBSD is better off in the dark than with a dim lightbulb;
de_de: Zwei, die sie wieder ausbauen, und in einer wütenden Nachricht argumentieren, dass FreeBSD besser ganz im Dunkeln dasteht, als mit einer dämmerigen Glühbirne;
es_es: Dos para revertirlo con una furiosa discusión en un mensaje de commit, arguyendo que FreeBSD esta mejor en la oscuridad que con un foco de luz oscuro;
pt_br: Dois para recuar com uma chama furiosa de uma mensagem de commit, argumentando que o FreeBSD está melhor no escuro do que com uma lâmpada fraca;

source: Forty-six to argue vociferously about the backing out of the dim lightbulb and demanding a statement from -core;
de_de: Sechsundvierzig, die sich lärmend wegen des Wiederausbaus der dämmerigen Glühbirne streiten und eine Erklärung von -core verlangen;
es_es: Cuarenta y seis para discutir vociferantemente acerca de la reversión del foco de luz tenue y demandando una declaración por parte de -core;
pt_br: Quarenta e seis para argumentar veementemente sobre o apoio da luz fraca e exigir uma declaração do alto desempenho;

source: Eleven to request a smaller lightbulb so it will fit their Tamagotchi if we ever decide to port FreeBSD to that platform;
de_de: Elf, die eine kleinere Glühbirne beantragen, damit sie in ihr Tamagotchi passt, falls wir irgendwann beschließen, FreeBSD auf diese Plattform zu portieren;
es_es: Once para pedir un foco de luz más pequeño de manera que entre en su Tamagotchi si deciden hacer un port de FreeBSD para esa plataforma;
pt_br: Onze para solicitar uma lâmpada menor para que ela caiba em seu Tamagotchi se decidirmos portar o FreeBSD para essa plataforma;

source: Seventy-three to complain about the SNR on -hackers and -chat and unsubscribe in protest;
de_de: Dreiundsiebzig, die sich über die SNR auf -hackers und -chat beschweren und aus Protest abmelden;
es_es: Setenta y tres para quejarse acerca de SNR en -hackers y -chat y cancelar su subscripción como protesta;
pt_br: Setenta e três para reclamar sobre o SNR em -chackers e -chat e cancelar a inscrição em protesto;

source: Thirteen to post <quote>unsubscribe</quote>, <quote>How do I unsubscribe?</quote>, or <quote>Please remove me from the list</quote>, followed by the usual footer;
de_de: Dreizehn, die <quote>unsubscribe</quote>, <quote>How do I unsubscribe?</quote> oder <quote>Please remove me from the list</quote> gefolgt von der üblichen Fußzeile abschicken;
es_es: Trece para postear <quote>cancelar subscripción</quote>, <quote>¿Como cancelo la subscripción?</quote>, o <quote>Por favor sáquenme de la lista</quote>, seguidos del pie usual;
pt_br: Treze para postar <quote>cancelar a inscrição</quote>, <quote> Como posso cancelar a inscrição? </quote>, ou <quote>Por favor, remova-me da lista</quote>, seguido do rodapé habitual;

source: One to commit a working lightbulb while everybody is too busy flaming everybody else to notice;
de_de: Einen, der eine funktionierende Glühbirne einbaut, während alle zu beschäftigt damit sind, mit jedem zu streiten, um es zu bemerken;
es_es: Uno para hacer un commit de un foco de luz funcional mientras que todo el mundo esta demasiado ocupado agrediendo a todos los demás como para notarlo;
pt_br: Um para comitar uma lâmpada de trabalho enquanto todos estão ocupados demais chamando a atenção de todos os outros para esse commit;

source: Thirty-one to point out that the new lightbulb would shine 0.364% brighter if compiled with TenDRA (although it will have to be reshaped into a cube), and that FreeBSD should therefore switch to TenDRA instead of GCC;
de_de: Einunddreißig, die herausstellen, dass die neue Glühbirne 0,364% heller leuchten würde, wenn sie mit TenDRA kompiliert werden würde (obwohl sie in einen Würfel umgeformt werden müsste) und dass FreeBSD deshalb nach TenDRA, anstatt nach GCC wechseln sollte;
es_es: Treinta y uno para señalar que el nuevo foco de luz seria un 0.364% más brillante si se compila con TenDRA (aunque tendría que ser remodelado en forma cúbica), y que FreeBSD debería cambiar a TenDRA en lugar de usar GCC;
pt_br: Trinta e um para salientar que a nova lâmpada iria brilhar 0,364% a mais se compilada com TenDRA (embora tenha que ser reformulada em um cubo), e que o FreeBSD deve, portanto, mudar para TenDRA ao invés de GCC;

source: One to complain that the new lightbulb lacks fairings;
de_de: Einen, der sich beschwert, dass bei der neuen Glühbirne die Verkleidung fehlt;
es_es: Uno para quejarse de que el nuevo foco de luz no tiene carenados;
pt_br: Um para reclamar que a nova lâmpada não tem carenagem;

source: Nine (including the PR originators) to ask <quote>what is MFC?</quote>;
de_de: Neun (einschließlich der PR-Ersteller), die fragen <quote>Was ist MFC?</quote>;
es_es: Nuevo (incluyendo los que crearon el PR) para preguntar <quote>¿Qué es MFC?</quote>;
pt_br: Nove (incluindo os criadores de PRs) para perguntar <quote>o que é o MFC?</quote>;

source: Fifty-seven to complain about the lights being out two weeks after the bulb has been changed.
de_de: Siebenundfünfzig, die sich zwei Wochen, nachdem die Birne gewechselt worden ist, darüber beschweren, dass das Licht aus war.
es_es: Cincueta y siete para quejarse acerca de que las luces estuvieron apagadas por dos semanas luego de que se cambio el foco.
pt_br: Cinquenta e sete para se queixar das luzes apagadas duas semanas depois de a lâmpada ter sido trocada.

source: <emphasis>Nik Clayton <email>nik@FreeBSD.org</email> adds:</emphasis>
de_de: <emphasis>Nik Clayton <email>nik@FreeBSD.org</email> hat hinzugefügt:</emphasis>
es_es: <emphasis>Nik Clayton <email>nik@FreeBSD.org</email> añade:</emphasis>
pt_br: <emphasis>Nik Clayton<email> nik@FreeBSD.org </email> acrescenta: </emphasis>

source: <emphasis>I was laughing quite hard at this.</emphasis>
de_de: <emphasis>Ich habe ziemlich hierüber gelacht.</emphasis>
es_es: <emphasis>Me estaba riendo bastante con esto.</emphasis>
pt_br: <emphasis>Eu estava rindo bastante disso.</emphasis>

source: <emphasis>And then I thought, <quote>Hang on, shouldn't there be '1 to document it.' in that list somewhere?</quote></emphasis>
de_de: <emphasis>Und dann dachte ich: <quote>Halt, sollte in dieser Liste nicht irgendwo 'Einer, der es dokumentiert' sein?</quote></emphasis>
es_es: <emphasis>Y luego pense, <quote>Un momento ¿No debería haber '1 para documentarlo.' en algún lugar de esa lista?</quote></emphasis>
pt_br: <emphasis>E então eu pensei, <quote> Espere, não deveria haver '1 para documentar isso.' nessa lista em algum lugar? </quote> </emphasis>

source: <emphasis>And then I was enlightened :-)</emphasis>
de_de: <emphasis>Und dann wurde ich erleuchtet :-)</emphasis>
es_es: <emphasis>Y luego me ilumine :-)</emphasis>
pt_br: <emphasis> E então eu fui iluminado :-) </emphasis>

source: <emphasis>Thomas Abthorpe <email>tabthorpe@FreeBSD.org</email></emphasis> says: <quote>None, <emphasis>real</emphasis> FreeBSD hackers are not afraid of the dark!</quote>
de_de: <emphasis>Thomas Abthorpe <email>tabthorpe@FreeBSD.org</email></emphasis> sagt: <quote>Keine, <emphasis>echte</emphasis> FreeBSD Hacker fürchten sich nicht vor der Dunkelheit!</quote>
es_es: <emphasis>Thomas Abthorpe <email>tabthorpe@FreeBSD.org</email></emphasis> dice: <quote>Ninguno ¡Los <emphasis>verdaderos</emphasis> hackers de FreeBSD no tienen miedo a la oscuridad!</quote>
pt_br: <emphasis> Thomas Abthorpe <email> tabthorpe@FreeBSD.org </email> </emphasis> diz: <quote> Nenhum, um hacker <emphasis>real</emphasis> do FreeBSD não têm medo do escuro! </quote>

source: Where does data written to <filename>/dev/null</filename> go?
de_de: Was passiert mit den Daten, die nach <filename>/dev/null</filename> geschrieben werden?
es_es: ¿Donde van los datos escritos a <filename>/dev/null</filename>?
pt_br: Onde os dados gravados em <filename>/dev/null</filename> vão parar?

source: It goes into a special data sink in the CPU where it is converted to heat which is vented through the heatsink / fan assembly. This is why CPU cooling is increasingly important; as people get used to faster processors, they become careless with their data and more and more of it ends up in <filename>/dev/null</filename>, overheating their CPUs. If you delete <filename>/dev/null</filename> (which effectively disables the CPU data sink) your CPU may run cooler but your system will quickly become constipated with all that excess data and start to behave erratically. If you have a fast network connection you can cool down your CPU by reading data out of <filename>/dev/random</filename> and sending it off somewhere; however you run the risk of overheating your network connection and <filename>/</filename> or angering your ISP, as most of the data will end up getting converted to heat by their equipment, but they generally have good cooling, so if you do not overdo it you should be OK.
de_de: Sie werden in einer speziellen Datensenke der CPU in Wärme umgewandelt, die dann über den Kühlkörper und den Lüfter abgeführt wird. Dies ist einer der Gründe für die Kühlung von CPUs; die Anwender gewöhnen sich an die schnelleren Prozessoren, gehen nicht mehr so sorgfältig mit Ihren Daten um und so landen immer mehr Daten in <filename>/dev/null</filename>, was zur Überhitzung der CPU führt. Wenn Sie <filename>/dev/null</filename> löschen (was die Datensenke ziemlich sicher abschaltet), wird Ihre CPU zwar nicht mehr so heiß, dafür wird Ihr System aber sehr schnell von den überzähligen Daten überladen und merkwürdige Effekte zeigen. Wenn Sie eine sehr schnell Netzwerkverbindung haben, können Sie Ihre CPU kühlen, indem sie Daten aus <filename>/dev/random</filename> lesen und in die Weite des Netzwerkes schicken; allerdings besteht hier die Gefahr der Überhitzung von Netzwerk und <filename>/</filename>. Außerdem dürfte Ihr ISP ziemlich wütend werden, da der größte Teil der Daten von seinen Geräten in Hitze umgewandelt werden wird; da ISPs aber über Klimaanlagen verfügen, sollte das kein großes Problem sein, solange Sie es nicht übertreiben.
es_es: Va a un disipador de datos especial en la CPU en donde es convertido en calor el cual es ventilado a través del conjunto disipador de calor / ventilador. Esto es por lo que el enfriado de CPU es cada vez más importante; mientras la gente se acostumbra a procesadores más rápidos se vuelven descuidados con sus datos y más y más termina en <filename>/dev/null</filename>, sobrecalentando sus CPUs. Si borra <filename>/dev/null</filename> (lo cual efectivamente deshabilita el su effectively el disipador de datos de CPU) su CPU podría correr a menos temperatura pero su sistema se volverá rápidamente constipado con todos los datos en exceso y comenzara a comportarse erráticamente. Si tiene una conexión de red rápida puede enfriar su CPU leyendo datos de <filename>/dev/random</filename> y enviándolos a algún lugar; sin embargo corre el riesgo de sobrecalentar su conexión de red y <filename>/</filename> o hacer enojar a su ISP, dado que la mayoría de los datos terminaran siendo convertidos en calor por su equipo, pero ellos generalmente tienen buena disipación de calor, de modo que si no se sobrepasa estará bien.
pt_br: Ele entra em um coletor de dados especial na CPU, onde é convertido em calor que é ventilado através do conjunto do dissipador de calor / ventilador. É por isso que o resfriamento da CPU é cada vez mais importante; À medida que as pessoas se acostumam com processadores mais rápidos, elas se tornam descuidadas com seus dados e mais e mais delas acabam no <filename>/dev/null</filename>, superaquecendo suas CPUs. Se você apagar <filename>/dev/null</filename> (o que efetivamente desativa o dissipador de dados da CPU) sua CPU pode ficar mais fria, mas seu sistema rapidamente ficará constipado com todos esses dados em excesso e começará a se comportar de maneira irregular. Se você tem uma conexão de rede rápida, pode resfriar sua CPU lendo dados de <filename>/dev/random</filename> e enviá-los para algum lugar; No entanto, você corre o risco de superaquecer sua conexão de rede e <filename>/</filename> ou irritar seu ISP, pois a maioria dos dados acabará sendo convertida em calor pelo equipamento, mas eles geralmente têm um bom resfriamento, então se você não exagere você deve estar bem.

source: <emphasis>Paul Robinson adds:</emphasis>
de_de: <emphasis>Paul Robinson fügt hinzu:</emphasis>
es_es: <emphasis>Paul Robinson añade:</emphasis>
pt_br: <emphasis>Paul Robinson acrescenta:</emphasis>
