Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Some sound cards set their output volume to 0 at every boot. Run the following command every time the machine boots:
de_de: Einige Soundkarten setzen die Lautstärke bei jedem Systemstart auf 0. In diesem Fall müssen Sie nach jedem Bootvorgang den folgenden Befehl ausführen:
es_es: Algunas tarjetas de sonido ajustan su volumen de salida a con cada arranque. Corra el siguiente comando cada vez que la maquina arranque:
pt_br: Algumas placas de som definem seu volume de saída como 0 em cada inicialização. Execute o seguinte comando toda vez que a máquina inicializar:

source: Does FreeBSD support power management on my laptop?
de_de: Unterstützt FreeBSD Power-Management auf meinem Laptop?
es_es: ¿Soporta FreeBSD manejo de poder para mi laptop?
pt_br: O FreeBSD suporta o gerenciamento de energia no meu laptop?

source: FreeBSD supports the <acronym>ACPI</acronym> features found in modern hardware. Further information can be found in <citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
de_de: FreeBSD unterstützt die <acronym>ACPI</acronym>-Funktionen moderner Hardware. Weitere Informationen dazu finden Sie in <citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
es_es: FreeBSD soporta las características <acronym>ACPI</acronym> que pueden encontrarse en el hardware moderno. Más información puede encontrarse en <citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
pt_br: O FreeBSD suporta os recursos <acronym>ACPI</acronym> encontrados em componentes modernos de hardware. Maiores informações podem ser encontradas em <citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>.

source: Troubleshooting
de_de: Fehlerbehebung
es_es: Solución de problemas
pt_br: Solução de problemas

source: Why is FreeBSD finding the wrong amount of memory on <trademark>i386</trademark> hardware?
de_de: Warum zeigt FreeBSD eine falsche Speichergröße auf <trademark>i386</trademark> Hardware an?
es_es: ¿Porque FreeBSD encuentra la cantidad incorrecta de memoria en hardware <trademark>i386</trademark>?
pt_br: Por que o FreeBSD está encontrando a quantidade errada de memória no hardware <trademark>i386</trademark>?

source: The most likely reason is the difference between physical memory addresses and virtual addresses.
de_de: Das liegt sehr wahrscheinlich an den Unterschieden zwischen physikalischen und virtuellen Speicheradressen.
es_es: La razón más probable es la diferencia entre direcciones de memoria física y direcciones virtuales.
pt_br: O motivo mais provável é a diferença entre endereços de memória física e endereços virtuais.

source: The convention for most PC hardware is to use the memory area between 3.5 GB and 4 GB for a special purpose (usually for PCI). This address space is used to access PCI hardware. As a result real, physical memory cannot be accessed by that address space.
de_de: Bei moderner PC-Hardware ist es üblich, den Speicherbereich zwischen 3,5 und 4 Gigabyte für spezielle Aufgaben (normalerweise für PCI) zu reservieren. Dieser Adressbereich wird dabei verwendet, um auf PCI-Hardware zuzugreifen. Dadurch kann in diesem Speicherbereich kein physikalischer Speicher verwaltet werden.
es_es: La convención para la mayoría del hardware de PC hardware es usar el área de memoria entre 3.5 GB y 4 GB para un propósito especial (usualmente para PCI). Este espacio de direcciones se usa para acceder a hardware PCI. Como resultado, la memoria real (física) no puede ser accedida en ese espacio de direcciones.
pt_br: A convenção para a maioria dos hardwares de PC é usar a área de memória entre 3,5 GB e 4 GB para uma finalidade especial (geralmente para PCI). Este espaço de endereço é usado para acessar o hardware PCI. Como resultado real, a memória física não pode ser acessada por esse espaço de endereço.

source: What happens to the memory that should appear in that location is hardware dependent. Unfortunately, some hardware does nothing and the ability to use that last 500 MB of RAM is entirely lost.
de_de: Was mit dem in diesen Bereich gehörenden physikalischen Speicher passiert, hängt von der eingesetzten Hardware ab. Unglücklicherweise gibt es noch immer Hardware, die hier gar nichts macht. In diesem Fall ist das System nicht in der Lage, auf diese 500 MB des RAMs zuzugreifen.
es_es: Lo que sucede con la memoria que debería aparecer en ese espacio es dependiente del hardware. Desafortunadamente, algunos equipos no hacen nada y la habilidad de usar los últimos 500 MB de RAM se pierde por completo.
pt_br: O que acontece com a memória que deveria aparecer nesse local depende do hardware. Infelizmente, alguns hardwares não fazem nada e a capacidade de usar estes últimos 500 MB de RAM é totalmente perdida.

source: Luckily, most hardware remaps the memory to a higher location so that it can still be used. However, this can cause some confusion when watching the boot messages.
de_de: Ein Großteil der Hardware ist aber inzwischen in der Lage, diesen Speicherbereich in einen höheren Speicherbereich umzulenken, damit Sie weiterhin darauf zugreifen können. Allerdings kann es durch dieses Umlenken zu verwirrenden Meldungen während des Systemstarts kommen.
es_es: Por suerte, la mayoría de los equipos de hardware remapean la memoria a una locación más alta de manera que pueda seguir siendo usada. No obstante, esto puede causar confusión al ver los mensajes de arranque.
pt_br: Felizmente, a maioria dos hardwares faz o remapeamento da memória para um local mais alto, para que ela ainda possa ser usada. No entanto, isso pode causar alguma confusão ao observar as mensagens de inicialização.

source: On a 32-bit version of FreeBSD, the memory appears lost, since it will be remapped above 4 GB, which a 32-bit kernel is unable to access. In this case, the solution is to build a PAE enabled kernel. See the entry on memory limits for more information.
de_de: Unter 32-Bit-Versionen von FreeBSD scheint dieser Speicherbereich nicht verfügbar zu sein, da er in einen Bereich oberhalb von 4 Gigabyte übertragen wurde, auf den ein 32-Bit-Kernel allerdings nicht zugreifen kann. In diesem Fall müssen Sie die PAE-Unterstützung in den Kernel kompilieren. Lesen Sie dazu auch die entsprechenden Einträge über Speicherbegrenzungen und unterschiedliche Speicherbegrenzungen auf verschiedenen Plattformen.
es_es: En una versión de 32 bits de FreeBSD, la memoria parece perdida, dado que sera remapeado por encima de los 4 GB, que son imposibles de acceder para un kernel de 32 bits. En este caso, la solución es construir un kernel con PAE habilitado. Vea la entrada acerca de límites de memoria para más información.
pt_br: Em uma versão de 32 bits do FreeBSD, a memória parece perdida, uma vez que ela será remapeada acima de 4 GB, uma área a qual um kernel de 32 bits não consegue acessar. Neste caso, a solução é construir um kernel habilitado para PAE. Veja a seção sobre os limites de memória para mais informações.

source: On a 64-bit version of FreeBSD, or when running a PAE-enabled kernel, FreeBSD will correctly detect and remap the memory so it is usable. During boot, however, it may seem as if FreeBSD is detecting more memory than the system really has, due to the described remapping. This is normal and the available memory will be corrected as the boot process completes.
de_de: Verwenden Sie hingegen eine 64-Bit-Version von FreeBSD oder einen 32-Bit-Kernel mit aktivierter PAE-Unterstützung, ist FreeBSD in der Lage, diesen Speicherbereich korrekt zu erkennen und umzulenken, damit Sie weiterhin darauf zugreifen können. Allerdings wird, aufgrund der beschriebenen Umbelegung, in diesem Fall beim Systemstart mehr Speicher angezeigt, als tatsächlich auf dem System vorhanden ist. Dies ist aber normal und wird nach dem Ende des Systemstarts automatisch korrigiert.
es_es: En una versión de 64 bits de FreeBSD, o al correr un kernel con PAE habilitado, FreeBSD detectara y remapeara la memoria de manera correcta para que sea usable. Durante el arranque, sin embargo, puede parecer que FreeBSD este detectando más memoria de la que tiene realmente el sistema, debido al remapeo descrito anteriormente. Esto es normal y la memoria disponible sera corregida cuando el proceso de arranque termine.
pt_br: Em uma versão de 64 bits do FreeBSD, ou quando o kernel estiver habilitado para PAE, o FreeBSD irá corretamente detectar e remapear a memória para que ela seja utilizável. Durante a inicialização, no entanto, pode parecer que o FreeBSD está detectando mais memória do que o sistema realmente possui, devido ao remapeamento descrito. Isso é normal e a memória disponível será corrigida conforme o processo de inicialização for concluído.

source: Why do my programs occasionally die with <errorname>Signal 11</errorname> errors?
de_de: Wieso brechen meine Programme gelegentlich mit <errorname>Signal 11</errorname>-Fehlern ab?
es_es: ¿Por que mis programas ocasionalmente terminan con errores <errorname>Signal 11</errorname>?
pt_br: Por que meus programas morrem ocasionalmente com erros <errorname> Signal 11 </errorname>?

source: Signal 11 errors are caused when a process has attempted to access memory which the operating system has not granted it access to. If something like this is happening at seemingly random intervals, start investigating the cause.
de_de: Das Signal 11 wird generiert, wenn ein Prozess versucht, auf Speicher zuzugreifen, obwohl er vom Betriebssystem dazu nicht befugt wurde. Wenn das scheinbar zufällig immer wieder passiert, sollten Sie der Sache auf den Grund gehen.
es_es: Los errores Signal 11 son causados cuando un proceso intento acceder a una región de memoria cuyo acceso no fue concedido por el sistema operativo. Si algo como esto pasa a intervalos aparentemente aleatorios, comience a investigar la causa.
pt_br: Os erros de sinal 11 são causados ​​quando um processo tentou acessar a memória à qual o sistema operacional não concedeu acesso. Se algo assim está acontecendo em intervalos aparentemente aleatórios, comece a investigar a causa.

source: These problems can usually be attributed to either:
de_de: Das Problem hat in der Regel eine der folgenden Ursachen:
es_es: Estos problemas suele deberse a:
pt_br: Esses problemas geralmente podem ser atribuídos a:

source: If the problem is occurring only in a specific custom application, it is probably a bug in the code.
de_de: Wenn das Problem nur in einer bestimmten Anwendung auftritt, dann ist es wahrscheinlich ein Fehler im Quellcode.
es_es: Si el problema ocurre solo en una aplicación específica, probablemente sea un error en el código.
pt_br: Se o problema está ocorrendo apenas em um aplicativo customizado específico, é provavelmente um bug no código.

source: If it is a problem with part of the base FreeBSD system, it may also be buggy code, but more often than not these problems are found and fixed long before us general <acronym>FAQ</acronym> readers get to use these bits of code (that is what -CURRENT is for).
de_de: Wenn das Problem in einem Teil von FreeBSD auftritt, könnte es natürlich auch ein Fehler sein; aber in den meisten Fällen werden diese Probleme gefunden und behoben, bevor die typischen Leser der <acronym>FAQ</acronym> diese Teile des Codes benutzen können (dafür gibt es schließlich -CURRENT).
es_es: Si es un problema con parte del sistema base de FreeBSD, también puede tratarse de código con errores, pero frecuentemente estos problemas suelen encontrarse y arreglarse mucho antes de que nosotros, los lectores usuales del <acronym>FAQ</acronym> lleguen a usar esas partes del código (para eso existe -CURRENT).
pt_br: Se é um problema com parte do sistema base do FreeBSD, também pode ser resultado de um código com bugs, mas na maioria das vezes esses problemas são encontrados e corrigidos muito antes que o publico em geral e que normalmente lê o <acronym> FAQ </acronym> usem essas partes do código (é para isso que -CURRENT existe).

source: It is probably not a FreeBSD bug if the problem occurs compiling a program, but the activity that the compiler is carrying out changes each time.
de_de: Wenn der Fehler auftritt, wenn Sie ein Programm kompilieren aber dabei immer wieder an anderer Stelle auftritt, dann ist das ein ganz eindeutiger Hinweis, dass das Problem nicht bei FreeBSD liegt.
es_es: Probablemente no se trate de un error en FreeBSD si el problema ocurre al compilar un programa, pero la actividad que el compilador realiza cambia en cada iteración.
pt_br: Provavelmente não é um erro do FreeBSD se o problema ocorrer na compilação de um programa, mas sim da atividade que o compilador está realizando e que muda a cada vez.

source: For example, if <command>make buildworld</command> fails while trying to compile <filename>ls.c</filename> into <filename>ls.o</filename> and, when run again, it fails in the same place, this is a broken build. Try updating source and try again. If the compile fails elsewhere, it is almost certainly due to hardware.
de_de: Nehmen wir zum Beispiel an, dass Sie <command>make buildworld</command> ausführen und die Kompilierung von <filename>ls.c</filename> in <filename>ls.o</filename> abbricht. Wenn Sie nochmal <command>make buildworld</command> ausführen und die Kompilierung an der gleichen Stelle abbricht, handelt es sich um einen Fehler im Quellcode. Aktualisieren Sie den Code und versuchen Sie es noch einmal. Wenn der Fehler jedoch an einer anderen Stelle auftritt, liegt das Problem mit an Sicherheit grenzender Wahrscheinlichkeit bei der Hardware.
es_es: Por ejemplo, si <command>make buildworld</command> falla al intentar compilar <filename>ls.c</filename> a <filename>ls.o</filename> y, al correr de vuelta, falla en el mismo lugar, esto es una compilación fallida. Pruebe actualizar el código fuente e intentando nuevamente. Si la compilación falla en otro lugar, casi ciertamente es debido al hardware.
pt_br: Por exemplo, se <command>make buildworld</command> falhar ao tentar compilar <filename>ls.c</filename> para <filename>ls.o</filename> e, quando executado novamente, ele falhar no mesmo lugar, significa que o código está quebrado. Tente atualizar o código fonte e tente compilar novamente. Se a compilação falhar em outro lugar, é quase certo que a causa é um problema de hardware.

source: In the first case, use a debugger such as <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> to find the point in the program which is attempting to access a bogus address and fix it.
de_de: Im ersten Fall können Sie einen Debugger wie z.B. <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> benutzen, um die Stelle im Programm zu finden, an der auf eine falsche Adresse zugegriffen wird und danach den Fehler beheben.
es_es: En el primer caso, use un debugger, tal como <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para encontrar el punto en el que el programa este intentando acceder a una dirección falsa y arreglarlo.
pt_br: No primeiro caso, use um depurador como o <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para localizar o ponto no programa que está tentando acessar um endereço falso e corrija-o.

source: In the second case, verify which piece of hardware is at fault.
de_de: Im zweiten Fall müssen Sie sicherstellen, dass das Problem nicht von der Hardware verursacht wird.
es_es: En el segundo caso, verifique la pieza de hardware que este fallando.
pt_br: No segundo caso, verifique qual peça de hardware está com defeito.

source: Common causes of this include:
de_de: Typische Ursachen dafür sind:
es_es: Causas comunes de esto incluyen:
pt_br: As causas comuns disso incluem:

source: The hard disks might be overheating: Check that the fans are still working, as the disk and other hardware might be overheating.
de_de: Es könnte sein, dass die Festplatten zu warm werden: Überprüfen Sie, ob die Lüfter noch funktionieren, damit Festplatten und andere Hardware nicht heißlaufen.
es_es: Los discos duros pueden estar sobrecalentándose: verifique que los ventiladores sigan funcionando, dado que el disco y otro hardware puede estar sobrecalentándose.
pt_br: Os discos rígidos podem estar superaquecidos: Verifique se os ventiladores ainda estão funcionando, pois o disco e outros componentes de hardware podem estar superaquecendo.

source: The processor running is overheating: This might be because the processor has been overclocked, or the fan on the processor might have died. In either case, ensure that the hardware is running at what it is specified to run at, at least while trying to solve this problem. If it is not, clock it back to the default settings.)
de_de: Der Prozessor überhitzt, weil er übertaktet wurde oder der CPU-Kühler ausgefallen ist. Sie müssen sicherstellen, dass Sie die Hardware unter den Bedingungen betreiben, für die sie spezifiziert ist, zumindest während Sie versuchen, das Problem zu lösen. Mit anderen Worten: Betreiben Sie Ihre CPU mit der normalen Taktfrequenz.
es_es: El procesador que esta corriendo se esta sobrecalentando: esto puede ser porque el procesador fue overclockeado, o el ventilador del procesador murió. En cualquier caso, asegúrese de que el hardware este corriendo con la características de fábrica, al menos mientras intenta solucionar este problema. Si no lo esta, reviértalo a las características por defecto.
pt_br: O processador está superaquecendo: pode ser porque o processador sofreu overclock ou o ventilador do processador pode ter parado de funcionar. Em ambos os casos, certifique-se de que o hardware esteja sendo utilizado de acordo com as condições especificadas pelo fabricante, pelo menos ao tentar resolver esse problema. Se não estiver, volte o clock para as configurações padrão.)

source: Regarding overclocking, it is far cheaper to have a slow system than a fried system that needs replacing! Also the community is not sympathetic to problems on overclocked systems.
de_de: Wenn Sie übertakten, sollten Sie daran denken, dass ein langsames System deutlich billiger ist als ein defektes System. Zudem hat die Community wenig Mitgefühl bei Problemen mit übertakteten Systemen.
es_es: Respecto al overclocking ¡Es mucho más barato tener un sistema lento que un sistema que necesita reemplazo! Además la comunidad no responde de manera simpática a problemas en sistemas overclockeados.
pt_br: Em relação ao overclocking, é muito mais barato ter um sistema lento do que um sistema frito que precisa ser substituído! Além disso, a comunidade não é simpática a problemas em sistemas com overclock.

source: Dodgy memory: if multiple memory SIMMS/DIMMS are installed, pull them all out and try running the machine with each SIMM or DIMM individually to narrow the problem down to either the problematic DIMM/SIMM or perhaps even a combination.
de_de: Unzuverlässiger Speicher: Wenn im Rechner mehr als ein SIMM/DIMM installiert ist, sollten Sie sie alle ausbauen und die Maschine testweise mit jedem SIMM oder DIMM einzeln betreiben. So können Sie feststellen, ob die Ursache ein einzelnes SIMM/DIMM oder auch eine Kombination von Modulen ist.
es_es: Memoria defectuosa: si varias memorias SIMMS/DIMMS están instaladas, sáquelas todas e intente correr la máquina con cada SIMM o DIMM individualmente para reducir el problema a la DIMM/SIMM problemática o quizás incluso a una combinación.
pt_br: Memória Errática: se vários módulos de memórias SIMMS/DIMMS estiverem instalados, retire-os e tente executar a máquina instalando cada SIMM ou DIMM individualmente para encontrar o modulo DIMM/SIMM problemático ou até mesmo encontrar uma combinação de módulos com problema.

source: Over-optimistic motherboard settings: the BIOS settings, and some motherboard jumpers, provide options to set various timings. The defaults are often sufficient, but sometimes setting the wait states on RAM too low, or setting the <quote>RAM Speed: Turbo</quote> option will cause strange behavior. A possible idea is to set to BIOS defaults, after noting the current settings first.
de_de: Zu optimistische Einstellung des Mainboards: In den Einstellungen des BIOS und mit den Jumpern auf dem Mainboard können Sie diverse Timings ändern. In den meisten Fällen reichen die Voreinstellungen aus, aber manchmal kann es durch zu wenig <quote>wait states</quote>, die Einstellung <quote>RAM Speed: Turbo</quote> oder ähnliches zu merkwürdigen Problemen kommen. Ein möglicher Ansatz ist, die Voreinstellungen des BIOS zu laden. Hierbei ist es sinnvoll, vorher die aktuellen Einstellungen zu notieren
es_es: Ajustes excesivamente optimistas de la placa madre: las características del BIOS, y algunos jumpers de la placa madre, proveen opciones para ajustar varios timings. Los ajustes por defecto suelen ser suficientes, pero a veces ajustar los estados de espera de la RAM demasiado bajo, o activar la opción <quote>RAM Speed: Turbo</quote> pueden causar comportamiento extraño. Una idea posible es quedarse con los ajustes por defecto del BIOS, luego de haber previamente anotado los ajustes actuales.
pt_br: Configurações over-otimizadas da placa-mãe: as configurações da BIOS e alguns jumpers da placa-mãe oferecem opções para definir vários intervalos de tempo. Os valores padrões geralmente são suficientes, mas, às vezes, a configuração dos estados de espera na RAM para valores muito baixos, ou a configuração da opção <quote>RAM Speed: Turbo</quote> causará um comportamento estranho. Uma ideia válida é restaurar a configuração padrão da BIOS, depois é claro de anotar as configurações atuais.

source: Unclean or insufficient power to the motherboard. Remove any unused I/O boards, hard disks, or CD-ROMs, or disconnect the power cable from them, to see if the power supply can manage a smaller load. Or try another power supply, preferably one with a little more power. For instance, if the current power supply is rated at 250 Watts, try one rated at 300 Watts.
de_de: Schlechte oder fehlerhafte Stromversorgung des Mainboards: Wenn Sie unbenutzte Steckkarten, Platten oder CD-ROMs in Ihrem System haben, sollten Sie sie testweise ausbauen oder die Stromversorgung abziehen. Dadurch können Sie prüfen, ob das Netzteil eventuell mit einer geringeren Last besser zurechtkommt. Sie können auch testweise ein anderes, am besten ein leistungsfähigeres, Netzteil ausprobieren. Wenn Sie zurzeit ein 250 W-Netzteil benutzen, sollten Sie testweise ein 300 W-Netzteil einbauen.
es_es: Poder sucio o insuficiente en la placa madre. Remueva las placas I/O , discos rígidos, o CD-ROMs sin usar, o desconecte el cable de encendido de ellos, para ver si el suministro eléctrico puede manejar una carga más pequeña. O intente otro suministro eléctrico, preferentemente uno con más poder. Por ejemplo, si el suministro actual esta registrado a 250 Watts, intente con uno registrado a 300 Watts.
pt_br: Fonte com potência insuficiente para energizar a placa-mãe: Remova qualquer placa de I/O não utilizada, discos rígidos ou CD-ROMs, desconectando o cabo de alimentação deles para ver se a fonte de alimentação pode gerenciar uma carga menor. Ou utilize outra fonte de alimentação, de preferência uma com um pouco mais de potência. Por exemplo, se a fonte de alimentação atual é recomendada para uma carga de 250 Watts, tente uma que seja recomendada para uma carga de 300 Watts.
