Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Is the documentation available in other formats, such as plain text (ASCII), or <trademark class="registered">PostScript</trademark>?
de_de: Ist die Dokumentation auch in anderen Formaten verfügbar? Zum Beispiel als einfacher Text (ASCII) oder als <trademark class="registered">PostScript</trademark>?
es_es: ¿Esta la documentación disponible en otros formatos, tales como texto plano (ASCII), o <trademark class="registered">PostScript</trademark>?
pt_br: A documentação está disponível em outros formatos, tais como texto simples (ASCII) ou <trademark class="registered">PostScript</trademark>?

source: Yes. The documentation is available in a number of different formats and compression schemes on the FreeBSD FTP site, in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/">/pub/FreeBSD/doc/</link> directory.
de_de: Ja. Werfen Sie einen Blick auf das Verzeichnis <link xlink:href="ftp://ftp.de.FreeBSD.org/pub/FreeBSD/doc/">/pub/FreeBSD/doc/</link> auf dem FreeBSD FTP-Server. Dort finden Sie Dokumentation in vielen verschiedenen Formaten.
es_es: Si. La documentación esta disponible en un número de diferentes formatos y esquemas de compresión desde el sitio FTP de FreeBSD, en el directorio <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/">/pub/FreeBSD/doc/</link>.

source: The documentation is categorized in a number of different ways. These include:
de_de: Die Dokumentation wurde nach verschiedenen Kriterien sortiert. Die Kriterien sind:
es_es: La documentación esta categorizada en un número de manera distintas. Estas incluyen:
pt_br: A documentação é categorizada de várias maneiras diferentes. Que incluem:

source: The document's name, such as <literal>faq</literal>, or <literal>handbook</literal>.
de_de: Der Name des Dokumentes, z.B. <literal>faq</literal> oder <literal>handbook</literal>.
es_es: El nombre del documento, tal como <literal>faq</literal>, o <literal>manual</literal>.
pt_br: O nome do documento, tais como como <literal>faq</literal> ou <literal>handbook</literal>.

source: The document's language and encoding. These are based on the locale names found under <filename>/usr/share/locale</filename> on a FreeBSD system. The current languages and encodings are as follows:
de_de: Die Sprache und der Zeichensatz, die in dem Dokument verwendet werden. Diese entsprechen den Anpassungen, die Sie auf einem FreeBSD-System unter <filename>/usr/share/locale</filename> finden. Zurzeit werden die folgenden Sprachen und Zeichensätze benutzt:
es_es: El lenguaje y codificación del documento. Estos estan basados en los nombres de locale encontrados bajo <filename>/usr/share/locale</filename> en un sistema FreeBSD. Los lenguajes y codificaciones actuales son los siguientes:
pt_br: A linguagem e codificação do documento. Estes são baseados nos nomes de local encontrados sob o diretório <filename>/usr/share/locale</filename> em um sistema FreeBSD. Os idiomas e codificações atuais são os seguintes:

source: Name
es_es: Nombre
pt_br: Nome

source: Meaning
de_de: Bedeutung
es_es: Significado
pt_br: Significado

source: English (United States)
de_de: Englisch (Vereinigte Staaten)
es_es: Inglés (Estados Unidos)
pt_br: Inglês (Estados Unidos)

source: Bengali or Bangla (Bangladesh)
de_de: Bengalisch oder Bangla (Bangladesh)
es_es: Bengalí o Bangla (Bangladesh)
pt_br: Bengali ou Bangla (Bangladesh)

source: Danish (Denmark)
de_de: Dänisch (Dänemark)
es_es: Danés (Dinamarca)
pt_br: Dinamarquês (Dinamarca)

source: German (Germany)
de_de: Deutsch (Deutschland)
es_es: Alemán (Alemania)
pt_br: Alemão (Alemanha)

source: Greek (Greece)
de_de: Griechisch (Griechenland)
es_es: Griego (Grecia)
pt_br: Grego (Grécia)

source: Spanish (Spain)
de_de: Spanisch (Spanien)
es_es: Español (España)
pt_br: Espanhol (Espanha)

source: French (France)
de_de: Französisch (Frankreich)
es_es: Frances (Francia)
pt_br: Francês (França)

source: Hungarian (Hungary)
de_de: Ungarisch (Ungarn)
es_es: Húngaro (Hungría)
pt_br: Húngaro (Hungria)

source: Italian (Italy)
de_de: Italienisch (Italien)
es_es: Italiano (Italia)
pt_br: Italiano (Itália)

source: Japanese (Japan, EUC encoding)
de_de: Japanisch (Japan, EUC-kodiert)
es_es: Japonés (Japón, codificación EUC)
pt_br: Japonês (Japão, codificação EUC)

source: Mongolian (Mongolia, UTF-8 encoding)
de_de: Mongolisch (Mongolei, UTF-8-kodiert)
es_es: Mongol (Mongolia, codificación UTF-8)
pt_br: Mongol (Mongólia, codificação UTF-8)

source: Dutch (Netherlands)
de_de: Niederländisch (Holland)
es_es: Holandés (Paises Bajos)
pt_br: Holandês (Holanda)

source: Norwegian (Norway)
de_de: Norwegisch (Norwegen)
es_es: Noruego (Noruega)

source: Polish (Poland)
de_de: Polnisch (Polen)
es_es: Polaco (Polonia)
pt_br: Polonês (Polônia)

source: Portuguese (Brazil)
de_de: Brasilianisches Portugiesisch (Brasilien)
es_es: Portugues (Brazil)
pt_br: Português (Brasil)

source: Russian (Russia, KOI8-R encoding)
de_de: Russisch (Russland, KOI8-R-kodiert)
es_es: Ruso (Rusia, codificación KOI8-R)
pt_br: Russo (Rússia, codificação KOI8-R)

source: Serbian (Serbia)
de_de: Serbisch (Serbien)
es_es: Serbio (Serbia)

source: Turkish (Turkey)
de_de: Türkisch (Türkei)
es_es: Turco (Turquía)
pt_br: Turco (Turquia)

source: Simplified Chinese (China, UTF-8 encoding)
de_de: Vereinfachtes Chinesisch (China, UTF-8-kodiert)
es_es: Chino simplificado (China, codificación UTF-8)
pt_br: Chinês Simplificado (China, codificação UTF-8)

source: Traditional Chinese (Taiwan, UTF-8 encoding)
de_de: Chinesisch (Taiwan, UTF-8-kodiert)
es_es: Chino tradicional (Taiwan, codificación UTF-8)
pt_br: Chinês Tradicional (Taiwan, codificação UTF-8)

source: Some documents may not be available in all languages.
de_de: Einige Dokumente sind nicht in allen Sprachen verfügbar.
es_es: Algunos documentos pueden no estar disponibles en todos los lenguajes.
pt_br: Alguns documentos podem não estar disponíveis em todos os idiomas.

source: The document's format. We produce the documentation in a number of different output formats. Each format has its own advantages and disadvantages. Some formats are better suited for online reading, while others are meant to be aesthetically pleasing when printed on paper. Having the documentation available in any of these formats ensures that our readers will be able to read the parts they are interested in, either on their monitor, or on paper after printing the documents. The currently available formats are:
de_de: Das Format des Dokumentes. Die Dokumentation wird in verschiedenen Formaten erzeugt, von denen jedes seine eigenen Vor- und Nachteile hat. Einige Formate lassen sich gut an einem Bildschirm lesen, während andere Formate dafür gedacht sind, ein ansprechendes Druckbild zu erzeugen. Das die Dokumentation in verschiedenen Formaten verfügbar ist, stellt sicher, dass unsere Leser die für sie relevanten Teile unabhängig vom Ausgabemedium (Bildschirm oder Papier) lesen können. Derzeit werden die folgenden Formate unterstützt:
es_es: El formato del documento. Producimos la documentación en varios formatos de salida distintos. Cada formato tiene sus propias ventajas y desventajas. Algunos formatos son mejores para ser leidos en linea, mientras que otros fueron concebidos para ser estéticamente agradables al ser impresos en papel. Tener la documentación disponible en cualquiera de estos formatos asegura que nuestros lectores podran leer las partes en las que estan interesados, tanto en su monitor, como en papel luego de imprimir los documentos. Los formatos actualmente disponibles son:
pt_br: O formato do documento. Produzimos a documentação em vários formatos de saída diferentes. Cada formato tem suas próprias vantagens e desvantagens. Alguns formatos são mais adequados para leitura on-line, enquanto outros estão formatados para serem,esteticamente agradáveis ​​quando impressos em papel. A disponibilização da documentação em diversos formatos garante que os nossos leitores possam ler as partes nas quais estão interessados, seja em seu monitor ou em papel após imprimi-los documentos. Os formatos disponíveis atualmente são:

source: Format
es_es: Formato
pt_br: Formato

source: A collection of small, linked, HTML files.
de_de: Viele kleine HTML-Dateien, die sich gegenseitig referenzieren.
es_es: Colección de pequeños archivos HTML vinculados
pt_br: Uma coleção de pequenos arquivos HTML vinculados.

source: One large HTML file containing the entire document
de_de: Eine große HTML-Datei, die das komplette Dokument enthält.
es_es: Un solo archivo HTML conteniendo el documento entero
pt_br: Um grande arquivo HTML contendo o documento inteiro

source: Adobe's Portable Document Format
es_es: Formato de documento portátil de Adobe
pt_br: Formato de documento portátil da Adobe

source: <trademark class="registered">Microsoft</trademark>'s Rich Text Format
es_es: Formato de Texto Enriquecido de <trademark class="registered">Microsoft</trademark>
pt_br: <trademark class="registered">Rich Text Format da Microsoft</trademark>

source: Plain text
de_de: Normaler Text
es_es: Texto plano
pt_br: Texto simples

source: Page numbers are not automatically updated when loading Rich Text Format into Word. Press <keycombo action="simul"><keycap>Ctrl</keycap><keycap>A</keycap></keycombo>, <keycombo action="simul"><keycap>Ctrl</keycap><keycap>End</keycap></keycombo>, <keycap>F9</keycap> after loading the document, to update the page numbers.
de_de: Die Seitennummern werden nicht automatisch aktualisiert, wenn Sie das Rich Text Format in Word laden. Wenn Sie das Dokument geladen haben, müssen Sie <keycombo action="simul"><keycap>Ctrl</keycap><keycap>A</keycap></keycombo>, <keycombo action="simul"><keycap>Ctrl</keycap><keycap>End</keycap></keycombo>, <keycap>F9</keycap> eingeben, um die Seitennummern aktualisieren zu lassen.
es_es: Los números de página no se actualizan automaticamente al cargar el Formato de Texto Enriquecido en Word. Presione <keycombo action="simul"><keycap>Ctrl</keycap><keycap>A</keycap></keycombo>, <keycombo action="simul"><keycap>Ctrl</keycap><keycap>End</keycap></keycombo>, <keycap>F9</keycap> luego de cargar el documento, para actualizar los números de página.
pt_br: Números de página não são atualizados automaticamente ao carregar o formato Rich Text no Word. Pressione <keycombo action="simul"> <keycap>Ctrl</keycap><keycap>A</keycap></keycombo>, <keycombo action="simul"><keycap>Ctrl</keycap><keycap>End</keycap> </keycombo>, <keycap>F9</keycap> após carregar o documento, para atualizar os números das páginas.

source: The compression and packaging scheme.
de_de: Das zur Komprimierung verwendete Programm.
es_es: El esquema de compresión y empaquetado.
pt_br: O esquema de compactação e empacotamento.

source: Where the format is <literal>html-split</literal>, the files are bundled up using <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry>. The resulting <filename>.tar</filename> file is then compressed using the compression schemes detailed in the next point.
de_de: Wenn die Dokumentation im Format <literal>html-split</literal> vorliegt, werden die Dateien mit <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> zusammengefasst. Die so entstandene <filename>.tar</filename> Datei wird dann mit einer der unten genannten Methoden komprimiert.
es_es: Donde el formato es <literal>html-split</literal>, los archivos son empaquetados usando <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry>. El archivo <filename>.tar</filename> es luego comprimido usando los esquemas de compresión detallados en el siguiente punto.

source: All the other formats generate one file. For example, <filename>article.pdf</filename>, <filename>book.html</filename>, and so on.
de_de: Bei allen anderen Formaten existiert nur eine Datei mit dem Namen, z.B. <filename>article.pdf</filename>, <filename>book.html</filename>, und so weiter.
es_es: Todos los otros formatos generan un archivo. Por ejemplo, <filename>article.pdf</filename>, <filename>book.html</filename>, y demás.
pt_br: Todos os outros formatos geram um único arquivo. Por exemplo, <filename>article.pdf</filename>, <filename>book.html</filename> e assim por diante.

source: These files are then compressed using either the <literal>zip</literal> or <literal>bz2</literal> compression schemes. <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> can be used to uncompress these files.
de_de: Diese Dateien werden entweder mit <literal>zip</literal> oder <literal>bz2</literal> komprimiert. Mit <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> können die Dateien wieder entpackt werden.
es_es: Estos archivos son posteriormente comprimidos usando los esquemas de compresión <literal>zip</literal> o <literal>bz2</literal>. <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> puede usarse para descomprimir estos archivos.
pt_br: Esses arquivos são então compactados usando os esquemas de compactação <literal>zip</literal> ou <literal>bz2</literal>. O comando <citerefentry> <refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum> </citerefentry> pode ser usado para descompactar esses arquivos.

source: So the <trademark class="registered">PostScript</trademark> version of the Handbook, compressed using <literal>bzip2</literal> will be stored in a file called <filename>book.ps.bz2</filename> in the <filename>handbook/</filename> directory.
de_de: Die mit <literal>bzip2</literal> gepackte Version des Handbuchs im <trademark class="registered">PostScript</trademark>-Format hat den Namen <filename>book.ps.bz2</filename> und ist im Verzeichnis <filename>handbook/</filename> zu finden.
es_es: Asi la versión <trademark class="registered">PostScript</trademark> del manual, comprimida usando <literal>bzip2</literal> sera guardada en un archivo llamado <filename>book.ps.bz2</filename> en el directorio <filename>handbook/</filename>.
pt_br: Portanto, a versão <trademark class="registered">PostScript</trademark> do Handbook, compactada usando <literal>bzip2</literal> será armazenada em um arquivo chamado <filename>book.ps.bz2</filename> no diretório <filename>handbook/</filename>.

source: After choosing the format and compression mechanism, download the compressed files, uncompress them, and then copy the appropriate documents into place.
de_de: Nachdem Sie das Format und das Kompressionsverfahren ausgewählt haben, müssen Sie die komprimierten Dateien herunterladen, entpacken und an die richtigen Stellen kopieren.
es_es: Luego de elegir el formato y mecanismo de compresión, descargue los archivos comprimidos, descomprimalos, y luego copie los documentos apropiados a su lugar.
pt_br: Depois de escolher o formato e o mecanismo de compactação, baixe os arquivos compactados, descompacte-os e copie os documentos para um lugar apropriado.

source: For example, the split HTML version of the <acronym>FAQ</acronym>, compressed using <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry>, can be found in <filename>doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</filename> To download and uncompress that file, type:
de_de: Zum Beispiel finden Sie die mit <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry> gepackte <literal>split-html</literal> Version der englischen <acronym>FAQ</acronym> in <filename>doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</filename>. Um diese Datei herunterzuladen und auszupacken, sind die folgenden Schritte notwendig:
es_es: Por ejemplo, la versión HTML split del <acronym>FAQ</acronym>, comprimida usando <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry>, puede encontrarse en <filename>doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</filename>. Para descargar y descomprimir dicho archivo, escriba:
pt_br: Por exemplo, a versão split HTML do <acronym>FAQ</acronym>, compactada usando <citerefentry><refentrytitle>bzip2</refentrytitle> <manvolnum>1</manvolnum></citerefentry>, pode ser encontrada em <filename>doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</filename> Para baixar e descompactar esse arquivo, digite:

source: If the file is compressed, <application>tar</application> will automatically detect the appropriate format and decompress it correctly, resulting in a collection of <filename>.html</filename> files. The main one is called <filename>index.html</filename>, which will contain the table of contents, introductory material, and links to the other parts of the document.
de_de: Wenn die Datei komprimiert ist, wird <application>tar</application> automatisch das entsprechende Format erkennen und die Datei korrekt dekomprimieren. Danach haben Sie eine Sammlung vieler kleiner <filename>.html</filename> Dateien. Die wichtigste Datei hat Namen <filename>index.html</filename> und enthält das Inhaltsverzeichnis, eine Einleitung und Verweise auf die anderen Teile des Dokumentes.
es_es: Si el archivo esta comprimido, <application>tar</application> detectara automaticamente el formato apropiado y lo descomprimira correctamente, resultando en una colección de archivos <filename>.html</filename>. El principal se llama <filename>index.html</filename>, el cual contiene la tabla de contenidos, material introductorio, y vínculos a las otras partes del documento.
pt_br: Se o arquivo estiver compactado, o <application>tar</application> detectará automaticamente o formato apropriado e o descompactará corretamente, resultando em uma coleção de arquivos <filename>.html</filename>. O principal deles é chamado <filename>index.html</filename>, que conterá o sumário, o material introdutório e os links para as outras partes do documento.

source: Where do I find info on the FreeBSD mailing lists? What FreeBSD news groups are available?
de_de: Woher bekomme ich Informationen zu den FreeBSD Mailinglisten? Welche Newsgruppen existieren zu FreeBSD?
es_es: ¿Donde encuentro información acerca de las listas de correo de FreeBSD? ¿Qué grupos de noticias de FreeBSD estan disponibles?
pt_br: Onde encontro informações sobre as listas de discussão do FreeBSD? Quais grupos de notícias do FreeBSD estão disponíveis?

source: Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#eresources-mail">Handbook entry on mailing-lists</link> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-news.html">Handbook entry on newsgroups</link>.
de_de: Lesen Sie den <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/eresources.html#eresources-mail">Handbucheintrag über Mailinglisten</link> und den <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/eresources-news.html">Handbucheintrag zu Newsgruppen</link>.
es_es: Vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#eresources-mail">entrada del manual acerca de listas de correo</link> y la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-news.html">entrada del manual acerca de grupos de noticias</link>.
pt_br: Consulte as seções do Handbook sobre as <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#eresources-mail">listas de discussão</link> e sobre os <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-news.html">grupos de notícias</link>.

source: Are there FreeBSD IRC (Internet Relay Chat) channels?
de_de: Gibt es FreeBSD IRC (Internet Relay Chat) Kanäle?
es_es: ¿Hay canales de IRC (Internet Relay Chat) de FreeBSD?
pt_br: Existem canais de IRC (Internet Relay Chat) sobre o FreeBSD?

source: Yes, most major IRC networks host a FreeBSD chat channel:
de_de: Ja, die meisten großen IRC Netze bieten einen FreeBSD Chat-Channel:
es_es: Si, la mayoría de las redes IRC hospedan un canal de chat de FreeBSD:
pt_br: Sim, a maioria das redes de IRC hospedam um canal de chat do FreeBSD:

source: Channel <literal>#FreeBSDhelp</literal> on <link xlink:href="http://www.efnet.org/index.php">EFNet</link> is a channel dedicated to helping FreeBSD users.
de_de: Der Channel <literal>#FreeBSDhelp</literal> im <link xlink:href="http://www.efnet.org/index.php">EFNet</link> bietet Hilfe für FreeBSD Benutzer.
es_es: El canal <literal>#FreeBSDhelp</literal> en <link xlink:href="http://www.efnet.org/index.php">EFNet</link> es un canal dedicado a ayudar usuarios de FreeBSD.
pt_br: Canal <literal>#FreeBSDhelp</literal> na <link xlink:href="http://www.efnet.org/index.php">EFNet</link> é um canal dedicado a ajudar usuários do FreeBSD.

source: Channel <literal>#FreeBSD</literal> on <link xlink:href="http://freenode.net/">Freenode</link> is a general help channel with many users at any time. The conversations have been known to run off-topic for a while, but priority is given to users with FreeBSD questions. Other users can help with the basics, referring to the Handbook whenever possible and providing links for learning more about a particular topic. This is primarily an English speaking channel, though it does have users from all over the world. Non-native English speakers should try to ask the question in English first and then relocate to <literal>##freebsd-lang</literal> as appropriate.
de_de: Der Channel <literal>#FreeBSD</literal> auf <link xlink:href="http://freenode.net/">Freenode</link> bietet allgemeine Hilfe zu FreeBSD-Themen. Es sind immer viele Benutzer online. Zwar werden auch nicht-FreeBSD-spezifische Themen diskutiert, den Hauptteil der Diskussionen dreht sich aber um die Lösung der Probleme von FreeBSD-Anwendern. Die Teilnehmer dieses Channels helfen Ihnen auch bei Fragen zu elementaren Dingen und zeigen Ihnen auch, wo Sie die entsprechenden Erklärungen im FreeBSD-Handbuch oder anderen Ressourcen finden können. Obwohl die Teilnehmer des Channels über die ganze Welt verstreut sind, werden die Diskussionen auf Englisch geführt. Wollen Sie die Diskussion in Ihrer Sprache führen, sollten Sie Ihre Frage trotzdem auf Englisch stellen und danach gegebenenfalls einen neuen Channel in der Form <literal>##freebsd-Ihre_Sprache</literal> eröffnen.
es_es: El canal <literal>#FreeBSD</literal> en <link xlink:href="http://freenode.net/">Freenode</link> es un canal general de ayuda con muchos usuarios activos en cualquier momento. Las conversaciones suelen salirse de tema a ratos, pero se le da prioridad a usuarios con preguntas acerca de FreeBSD. Otros usuarios pueden ayudar con lo básico, refiriendo al manual cuando sea posible y proveyendo vínculos para aprender más acerca de un tema en particular. Este es un canal donde se habla mayormente ingles, aunque tiene usuarios de todo el mundo. Los hablantes no nativos de inglés deberían intentar formular su pregunta en inglés y luego dirigirse a <literal>##freebsd-lang</literal> cuando sea apropiado.
pt_br: Canal <literal>#FreeBSD</literal> na <link xlink:href="http://freenode.net/">Freenode</link> é um canal de ajuda geral com muitos usuários a qualquer horário. É de conhecimento que conversas off-topic acontecem em alguns momentos, mas a prioridade é dada aos usuários com perguntas sobre o FreeBSD. Outros usuários podem ajudar com o básico, consultando o Handbook sempre que possível e fornecendo links para ajudá-lo a aprender mais sobre um determinado tópico. Este é um canal em que a comunicação ocorre primariamente em inglês, embora seja frequentado por usuários de todo o mundo. As pessoas que não são falantes nativas do inglês devem tentar fazer as suas perguntas primeiro em inglês e, em seguida, tentar nos canais <literal>## freebsd-lang</literal> conforme apropriado.
