Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: To give people who would like to run <emphasis>-CURRENT</emphasis> or <emphasis>-STABLE</emphasis> but who do not have the time or bandwidth to follow it on a day-to-day basis an easy way of bootstrapping it onto their systems.
de_de: Personen, die <emphasis>-CURRENT</emphasis> oder <emphasis>-STABLE</emphasis> benutzen möchten, aber nicht über die nötige Zeit oder Bandbreite verfügen, um tagesaktuell zu bleiben, soll eine bequeme Möglichkeit geboten werden, es auf ihr System zu bringen.
es_es: Darle a la gente que quiera correr <emphasis>-CURRENT</emphasis> o <emphasis>-STABLE</emphasis> pero que no tenga el tiempo o el ancho de banda para seguirlas día a día una forma fácil de correrlas en sus sistemas.
pt_br: Para que as pessoas que gostariam de executar o <emphasis>-CURRENT</emphasis> ou o <emphasis>-STABLE</emphasis> mas que não têm tempo ou largura de banda para acompanhá-lo no dia-a-dia tenham uma maneira fácil de instalá-las em seus sistemas.

source: To preserve a fixed reference point for the code in question, just in case we break something really badly later. (Although Subversion normally prevents anything horrible like this happening.)
de_de: Die Erhaltung von Referenzpunkten des fraglichen Codes, für den Fall, dass wir später einmal ernsthaften Schaden anrichten sollten - obwohl Subversion verhindern sollte, dass solche Situationen entstehen.
es_es: Preservar un punto de referencia fijo para el código en cuestión, en el caso de que rompamos algo de manera catastrófica más adelante. (Aunque Subversion normalmente previene que algo horrible como este suceda.)
pt_br: Para preservar um ponto de referência fixo para o código em questão, apenas no caso de quebrarmos algo de forma muito seria depois. (Embora o Subversion normalmente previna que uma coisa horrível como esta ocorra).

source: To ensure that all new features and fixes in need of testing have the greatest possible number of potential testers.
de_de: Sicherzustellen, dass alle neuen Merkmale und Fehlerbehebungen zu möglichst vielen potentiellen Testern gelangen.
es_es: Asegurar que todas las nuevas características y arreglos que necesiten ser probados, tengan el mayor número posible de potenciales probadores.
pt_br: Para garantir que todos os novos recursos e correções que precisam de testes tenham contato o maior número possível de testadores em potencial.

source: No claims are made that any <emphasis>-CURRENT</emphasis> snapshot can be considered <quote>production quality</quote> for any purpose. If a stable and fully tested system is needed, stick to full releases.
de_de: Von keinem <emphasis>-CURRENT</emphasis> Snapshot kann <quote>Produktionsqualität</quote> für beliebige Zwecke erwartet werden. Wenn Sie eine stabile und ausgetestete Version benötigen, sollten Sie ein vollständiges Release verwenden.
es_es: No se asegura que un snapshot de <emphasis>-CURRENT</emphasis> pueda considerarse de <quote>calidad para producción</quote> para cualquier propósito. Si se necesita un sistema estable y probado en profundidad, use las versiones completas o snapshots de <emphasis>-STABLE</emphasis>.
pt_br: Não temos a pretensão de que qualquer snapshot <emphasis>-CURRENT</emphasis> possa ser considerado com <quote>qualidade de produção</quote> para qualquer finalidade. Se você necessita de um sistema estável e totalmente testado, limite-se ao uso das releases completas.

source: Snapshot releases are directly available from <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link>.
de_de: Snapshot-Releases sind auf der <link xlink:href="@@URL_RELPREFIX@@/snapshots/">Snapshots-Seite</link> verfügbar.
es_es: Las versiones snapshot estan directamente disponibles desde <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link>.
pt_br: As snapshots releases estão disponíveis em <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link>.

source: Official snapshots are generated on a regular basis for all actively developed branches.
de_de: Offizielle Snapshots werden in regelmäßigen Abständen für jeden aktiven Zweig erstellt.
es_es: Los snapshots oficiales se generan regularmente para todas las ramas desarrolladas activamente.
pt_br: Os snapshots oficiais são gerados regularmente para todas as branchs ativamente desenvolvidas.

source: What is the <emphasis>FreeBSD-STABLE</emphasis> concept?
de_de: Was ist das Konzept von <emphasis>FreeBSD-STABLE</emphasis>?
es_es: ¿Cual es el concepto de <emphasis>FreeBSD-STABLE</emphasis>?
pt_br: Qual é o conceito do <emphasis>FreeBSD-STABLE</emphasis>?

source: Back when FreeBSD 2.0.5 was released, FreeBSD development branched in two. One branch was named <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, one <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link>. <emphasis>FreeBSD-STABLE</emphasis> is the development branch from which major releases are made. Changes go into this branch at a slower pace and with the general assumption that they have first been tested in FreeBSD-CURRENT. However, at any given time, the sources for FreeBSD-STABLE may or may not be suitable for general use, as it may uncover bugs and corner cases that were not yet found in FreeBSD-CURRENT. Users who do not have the resources to perform testing should instead run the most recent release of FreeBSD. <emphasis>FreeBSD-CURRENT</emphasis>, on the other hand, has been one unbroken line since 2.0 was released, leading towards 10.2-RELEASE and beyond. For more detailed information on branches see <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">FreeBSD Release Engineering: Creating the Release Branch</link></quote>, the status of the branches and the upcoming release schedule can be found on the <link xlink:href="http://www.FreeBSD.org/releng">Release Engineering Information</link> page.
es_es: Cuando se lanzo FreeBSD 2.0.5, el desarrollo de FreeBSD se ramifico en dos. Una rama fue llamada <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, y otra <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link>. <emphasis>FreeBSD-STABLE</emphasis> esta pensada para ser usada por proveedores de internet, y otras compañías comerciales para las cuales cambios bruscos o características experimentales son indeseables. Solo recibe arreglos de errores que hayan sido probados en profundidad y otras pequeñas mejoras incrementales. <emphasis>FreeBSD-CURRENT</emphasis>, por otra parte ha sido una linea continua desde que se lanzo 2.0 hasta 10.2-RELEASE y más allá. Para información más detallada acerca de las ramas vea <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">Ingenieria de lanzamientos de FreeBSD: Creando la Rama de Lanzamiento</link></quote>, el estado de las ramas y la agenda de lanzamientos futuros puede encontrarse en la página de <link xlink:href="http://www.FreeBSD.org/releng">Información de ingeniería de lanzamientos</link>.

source: 10.2-STABLE is the actively developed <emphasis>-STABLE</emphasis> branch. The latest release on the 10.2-STABLE branch is 10.2-RELEASE, which was released in August 2015.
es_es: 10.2-STABLE es la rama activamente desarrollada de <emphasis>-STABLE</emphasis>. La última versión de la rama 10.2-STABLE es 10.2-RELEASE, la cual fue lanzada en Agosto del 2015.

source: The <emphasis>11-CURRENT</emphasis> branch is the actively developed <emphasis>-CURRENT</emphasis> branch toward the next generation of FreeBSD. See <link linkend="current">What is FreeBSD-CURRENT?</link> for more information on this branch.
de_de: Aus dem <emphasis>11-CURRENT</emphasis>-Zweig ist der aktiv entwickelte <emphasis>CURRENT</emphasis>-Zweig, aus dem die nächste FreeBSD-Generation entsteht. Weitere Informationen über diesen Zweig finden Sie unter <link linkend="current">Was ist FreeBSD-CURRENT?</link>.
es_es: La rama <emphasis>11-CURRENT</emphasis> es la rama activamente desarrollada de <emphasis>-CURRENT</emphasis> para próxima generación de FreeBSD. Vea <link linkend="current">¿Qué es FreeBSD-CURRENT?</link> para más información acerca de esta rama.

source: When are FreeBSD releases made?
de_de: Wann werden FreeBSD-Releases erstellt?
es_es: ¿Cuando se hacen los lanzamientos de FreeBSD?
pt_br: Quando são realizados os lançamentos de novas versões do FreeBSD?

source: The Release Engineering Team <email>re@FreeBSD.org</email> releases a new major version of FreeBSD about every 18 months and a new minor version about every 8 months, on average. Release dates are announced well in advance, so that the people working on the system know when their projects need to be finished and tested. A testing period precedes each release, to ensure that the addition of new features does not compromise the stability of the release. Many users regard this caution as one of the best things about FreeBSD, even though waiting for all the latest goodies to reach <emphasis>-STABLE</emphasis> can be a little frustrating.
de_de: In der Regel gibt das Release Engineering Team <email>re@FreeBSD.org</email> alle 18 Monate eine neue Hauptversion und etwa alle 8 Monate eine Unterversion frei. Das Erscheinungsdatum einer Version wird frühzeitig bekanntgegeben, damit die am System arbeitenden Personen wissen, bis wann ihre Projekte abgeschlossen und getestet werden müssen. Vor jedem Release gibt es eine Testperiode um sicherzustellen, dass die neu hinzugefügten Features nicht die Stabilität des Releases beeinträchtigen. Viele Benutzer halten dies für einen großen Vorteil von FreeBSD, obwohl es manchmal frustrierend sein kann, so lange auf die Verfügbarkeit der aktuellsten Funktionen zu warten.
es_es: El equipo de ingenieria de lanzamientos <email>re@FreeBSD.org</email> lanza una versión mayor de FreeBSD cada aproximadamente 18 meses y una nueva versión menor cada aproximadamente 8 meses, en promedio. Las fechas de lanzamiento se anuncian con antelación, de manera que la gente que trabaja en el sistema sabe cuando sus proyectos deben estar terminados y probados. Un período de prueba precede cada lanzamiento, para asegurarse que el agregado de nuevas características no comprometa la estabilidad del lanzamiento. Muchos usuarios ven esta precuación como una de las mejores cosas acerca de FreeBSD, a pesar de que el esperar que las ultimas mejoras lleguen a <emphasis>-STABLE</emphasis> puede ser un poco frustrante.
pt_br: A Equipe de Engenharia de Releases (Release Engineering Team) <email>re@FreeBSD.org</email> lança uma nova versão principal do FreeBSD a cada 18 meses e uma nova versão secundária a cada 8 meses, em média. As datas de lançamento são anunciadas com bastante antecedência, para que as pessoas que trabalham no sistema saibam quando seus projetos precisam ser finalizados e testados. Um período de teste precede cada lançamento, para garantir que a adição de novos recursos não comprometa a estabilidade do lançamento. Muitos usuários consideram este cuidado como uma das melhores coisas do FreeBSD, apesar de que a espera para que todas as novidades mais recentes sejam disponibilizadas no <emphasis>-STABLE</emphasis> possa ser um pouco frustrante.

source: More information on the release engineering process (including a schedule of upcoming releases) can be found on the <link xlink:href="http://www.FreeBSD.org/releng/index.html">release engineering</link> pages on the FreeBSD Web site.
de_de: Weitere Informationen über die Entwicklung von Releases, sowie eine Übersicht über kommende Releases, erhalten Sie auf den <link xlink:href="http://www.FreeBSD.org/releng/index.html">Release Engineering</link> Seiten der FreeBSD Webseite.
es_es: más información acerca del proceso de ingenieria de lanzamientos (incluyendo una agenda de futuros lanzamientos) puede encontrarse en las páginas de <link xlink:href="http://www.FreeBSD.org/releng/index.html">ingenieria de lanzamientos</link> en el sitio de FreeBSD.

source: For people who need or want a little more excitement, binary snapshots are made weekly as discussed above.
de_de: Für diejenigen, die ein wenig mehr Spannung möchten, werden täglich Snapshots herausgegeben, wie oben beschrieben.
es_es: Para la gente que quiere o necesita algo de emoción, snapshots binarios se hacen semanalmente, como se dijo más arriba.
pt_br: Para aquelas pessoas que precisam ou querem um pouco mais de emoção, os snapshots binários são disponibilizados semanalmente, como discutido acima.

source: Who is responsible for FreeBSD?
de_de: Wer ist für FreeBSD verantwortlich?
es_es: ¿Quien es responsable por FreeBSD?
pt_br: Quem é responsável pelo FreeBSD?

source: The key decisions concerning the FreeBSD project, such as the overall direction of the project and who is allowed to add code to the source tree, are made by a <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">core team</link> of 9 people. There is a much larger team of more than 350 <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">committers</link> who are authorized to make changes directly to the FreeBSD source tree.
de_de: Schlüsseldiskussionen, die das FreeBSD Project betreffen, wie z.B. über die generelle Ausrichtung des Projekts und darüber, wem es erlaubt sein soll, Code zum Quellbaum hinzuzufügen, werden innerhalb eines <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">Core Teams</link> von 9 Personen geführt. Es gibt ein weitaus größeres Team von über 350 <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">Committern</link>, die dazu autorisiert sind, Änderungen am FreeBSD Quellbaum durchzuführen.
es_es: Las decisiones clave que tengan que ver con el proyecto FreeBSD, tales como la dirección general del proyecto y quien puede agregar codigo al arbol fuente, son hechas por un <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">equipo central</link> de 9 personas. Existe un equipo mucho más grande de más de 350 <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">committers</link> que estan autorizados a hacer cambios directamente al árbol de fuentes.
pt_br: As principais decisões relativas ao projeto FreeBSD, tais como a direção geral do projeto e quem tem permissão para adicionar código ao repositório de código fonte, são feitas por meio de um <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">core team</link> de 9 pessoas. Existe uma equipe muito maior, com mais de 350 <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">committers</link> que estão autorizados a fazer alterações diretamente na árvore de fontes do FreeBSD.

source: However, most non-trivial changes are discussed in advance in the <link linkend="mailing">mailing lists</link>, and there are no restrictions on who may take part in the discussion.
de_de: Jedoch werden die meisten nicht-trivialen Änderungen zuvor in den <link linkend="mailing">Mailinglisten</link> diskutiert und es bestehen keinerlei Einschränkungen darüber, wer sich an diesen Diskussionen beteiligen darf.
es_es: No obstante, la mayoría de los cambios no triviales se discuten por adelantado en las <link linkend="mailing">listas de correo</link>, y no existen restricciones acerca de quien puede participar en la discusión.
pt_br: No entanto, a maioria das alterações não-triviais é discutida com antecedência nas <link linkend="mailing">listas de discussão</link>, e não há restrições sobre quem pode participar da discussão.

source: Where can I get FreeBSD?
de_de: Wie kann ich FreeBSD beziehen?
es_es: ¿Donde puedo obtener FreeBSD?
pt_br: Onde posso obter o FreeBSD?

source: Every significant release of FreeBSD is available via anonymous FTP from the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/"> FreeBSD FTP site</link>:
de_de: Jede bedeutende Ausgabe von FreeBSD ist per Anonymous-FTP vom <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/">FreeBSD FTP Server</link> erhältlich:
es_es: Cada lanzamiento importante de FreeBSD esta disponible via FTP anónimo desde el <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/"> sito FTP de FreeBSD</link>:

source: The latest <emphasis>10-STABLE</emphasis> release, 10.2-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.2-RELEASE/">10.2-RELEASE directory</link>.
es_es: La última versión <emphasis>10-STABLE</emphasis>, 10.2-RELEASE puede encontrarse en el <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.2-RELEASE/">directorio de 10.2-RELEASE</link>

source: <link xlink:href="@@URL_RELPREFIX@@/snapshots/">Snapshot</link> releases are made monthly for the <link linkend="current">-CURRENT</link> and <link linkend="stable">-STABLE</link> branch, these being of service purely to bleeding-edge testers and developers.
de_de: <link xlink:href="@@URL_RELPREFIX@@/snapshots/">Snapshot</link>-Releases werden monatlich aus dem <link linkend="current">-CURRENT</link>-Zweig sowie aus dem <link linkend="stable">-STABLE</link>-Zweig erzeugt. Sie sollten aber nur von Entwicklern und sehr erfahrenen Testern verwendet werden.
es_es: Versiones <link xlink:href="@@URL_RELPREFIX@@/snapshots/">Snapshot</link> se hacen mensualmente para las ramas <link linkend="current">-CURRENT</link> y <link linkend="stable">-STABLE</link>, siendo estas útiles unicamente para probadores de vanguardia y desarrolladores.
pt_br: Mensalmente são produzidos <link xlink:href="@@URL_RELPREFIX@@/snapshots/">snapshot</link> releases para as branchs <link linkend="current">-CURRENT</link> e <link linkend="stable">-STABLE</link>, as quais destinam-se primariamente ao uso por parte dos desenvolvedores e testadores.

source: The latest <emphasis>9-STABLE</emphasis> release, 9.3-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/9.3-RELEASE/">9.3-RELEASE directory</link>.
es_es: La última versión <emphasis>9-STABLE</emphasis>, 9.3-RELEASE puede encontrarse en el <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/9.3-RELEASE/">directorio 9.3-RELEASE</link>.

source: Information about obtaining FreeBSD on CD, DVD, and other media can be found in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mirrors.html">the Handbook</link>.
de_de: Wo und wie Sie FreeBSD auf CD, DVD, und anderen Medien beziehen können, erfahren Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/mirrors.html">Handbuch</link>.
es_es: Información acerca de como obtener FreeBSD en CD, DVD y otros medios puede encontrarse en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mirrors.html">el manual</link>.
pt_br: Informações sobre como obter o FreeBSD em CD, DVD e outras mídias podem ser encontradas no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/mirrors.html">Handbook</link>.

source: How do I access the Problem Report database?
de_de: Wie greife ich auf die Datenbank mit Problemberichten zu?
es_es: ¿Como accedo a la base de datos de reporte de problemas?
pt_br: Como acesso o banco de dados dos Relatórios de Problemas?

source: The Problem Report database of all user change requests may be queried by using our web-based PR <link xlink:href="https://bugs.FreeBSD.org/search/">query</link> interface.
de_de: Die Datenbank mit Problemberichten (PR, problem report) und Änderungsanfragen von Benutzern kann über die webbasierte <link xlink:href="https://bugs.FreeBSD.org/search/">PR-Abfrage-Schnittstelle</link> abgefragt werden.
es_es: La base de datos de reporte de problemas de todos los pedidos de cambio por parte de los usuarios puede consultarse usando nuetra interfaz de <link xlink:href="https://bugs.FreeBSD.org/search/">consulta</link> de PR basada en web.
pt_br: O banco de dados com os Relatórios de Problemas contendo todas as solicitações de mudança enviadas pelos nossos usuários pode ser consultado usando nossa interface web de <link xlink:href="https://bugs.FreeBSD.org/search/">consulta</link> de PRs.

source: The <link xlink:href="@@URL_RELPREFIX@@/support/bugreports.html">web-based problem report submission interface</link> can be used to submit problem reports through a web browser.
de_de: Über die <link xlink:href="@@URL_RELPREFIX@@/support/bugreports.html">webbasierte PR-Schnittstelle</link> können Sie Problemberichte über einen Webbrowser einreichen.
es_es: La <link xlink:href="@@URL_RELPREFIX@@/support/bugreports.html">interfaz basada en web de envio de reporte de problemas</link> puede ser usada para enviar reportes a través de un navegador web.
pt_br: A <link xlink:href="@@URL_RELPREFIX@@/support/bugreports.html">interface web de envio de relatórios de problemas</link> pode ser usada para enviar relatórios de problemas através de um navegador.

source: Before submitting a problem report, read <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">Writing FreeBSD Problem Reports</link>, an article on how to write good problem reports.
de_de: Bevor Sie einen Fehler melden, sollten Sie zuerst <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">Writing FreeBSD Problem Reports</link> lesen, damit Sie wissen, wie Sie eine gute Fehlermeldung verfassen.
es_es: Antes de envíar un reporte de problemas, lea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">Escribiendo reportes de problemas para FreeBSD</link>, un artículo acerca de como escribir buenos reportes de problemas.
pt_br: Antes de enviar um relatório de problema, leia <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">Escrevendo Relatórios de Problemas do FreeBSD</link>, um artigo sobre como escrever bons relatórios de problemas.

source: Documentation and Support
de_de: Dokumentation und Unterstützung
es_es: Documentación y soporte
pt_br: Documentação e Suporte

source: What good books are there about FreeBSD?
de_de: Gibt es gute Bücher über FreeBSD?
es_es: ¿Qué buenos libros hay acerca de FreeBSD?
pt_br: Quais os livros existentes sobre o FreeBSD?

source: The project produces a wide range of documentation, available online from this link: <uri xlink:href="http://www.FreeBSD.org/docs.html">http://www.FreeBSD.org/docs.html</uri>. In addition, <link linkend="bibliography">the Bibliography</link> at the end of this <acronym>FAQ</acronym>, and <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bibliography.html">the one in the Handbook</link> reference other recommended books.
de_de: Im Zuge des FreeBSD Projekts sind diverse gute Dokumente entstanden, die unter der folgenden URL abgerufen werden können: <uri xlink:href="http://www.FreeBSD.org/docs.html">http://www.FreeBSD.org/de/docs.html</uri>. Zusätzlich enthält <link linkend="bibliography">die Bibliographie</link> am Ende dieser <acronym>FAQ</acronym> und <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/bibliography.html">diejenige im Handbuch</link> Verweise auf weitere empfohlene Bücher.
es_es: El proyecto produce un amplio rango de documentación, disponible en linea a través de este link: <uri xlink:href="http://www.FreeBSD.org/docs.html">http://www.FreeBSD.org/docs.html</uri>. Adicionalmente, <link linkend="bibliography">la bibliografía</link> al final de este <acronym>FAQ</acronym>, y <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bibliography.html">la del manual</link> referencian otros libros recomendados.
