Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: <option>-R</option> does a <emphasis>recursive</emphasis> <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Be careful about specifying directories or symlinks to directories to <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry>. To change the permissions of a directory referenced by a symlink, use <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> without any options and follow the symlink with a trailing slash (<filename>/</filename>). For example, if <filename>foo</filename> is a symlink to directory <filename>bar</filename>, to change the permissions of <filename>foo</filename> (actually <filename>bar</filename>), do something like:
de_de: Die Option <option>-R</option> bewirkt ein <emphasis>rekursives</emphasis> <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Seien Sie vorsichtig, wenn Sie bei <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> Verzeichnisse oder symbolische Links zu Verzeichnissen angeben. Wenn Sie die Zugriffsrechte eines Verzeichnisses ändern möchten, das durch einen symbolischen Link referenziert wird, benutzen Sie <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> ohne irgendwelche Optionen und folgen dem symbolischen Link durch einen abschließenden Schrägstrich (<filename>/</filename>). Wenn bspw. <filename>foo</filename> ein symbolischer Link zum Verzeichnis <filename>bar</filename> ist und Sie die Zugriffsrechte von <filename>foo</filename> (tatsächlich <filename>bar</filename>) ändern möchten, dann benutzen Sie etwas ähnliches wie:
es_es: <option>-R</option> hace una <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> <emphasis>recursivo</emphasis>. Tenga cuidado con especificar directorios o symlinks a directorios en <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Para cambiar los permisos de un directorio referenciado por un symlink, use <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> sin opciones y agregue una barra (<filename>/</filename>) al final del symlink. Por ejemplo, si <filename>foo</filename> es un symlink al directorio <filename>bar</filename>, para cambiar los permisos de <filename>foo</filename> (que en realidad es <filename>bar</filename>), haga algo como:
pt_br: <option>-R</option> faz um <emphasis></emphasis><citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> recursivo. Tenha cuidado ao especificar diretórios ou links simbólicos para diretórios para o <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Para alterar as permissões de um diretório referenciado por um link simbólico, use <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> sem nenhuma opção e siga o link simbólico com uma barra à direita (<filename>/</filename>). Por exemplo, se <filename>foo</filename> for um link simbólico para o diretório <filename>bar</filename>, para alterar as permissões de <filename>foo</filename> (na verdade <filename>bar</filename>) faça algo como:

source: With the trailing slash, <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> will follow the symlink, <filename>foo</filename>, to change the permissions of the directory, <filename>bar</filename>.
de_de: Durch den abschließenden Schrägstrich folgt <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> dem symbolischen Link <filename>foo</filename>, um die Zugriffsrechte für das Verzeichnis <filename>bar</filename> zu ändern.
es_es: Con la barra al final, <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> seguirá el symlink, <filename>foo</filename>, para cambiar los permisos del directorio, <filename>bar</filename>.
pt_br: Com a barra final, <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> seguirá o link simbólico, <filename>foo</filename>, para alterar as permissões do diretório, <filename>bar</filename>.

source: Can I run DOS binaries under FreeBSD?
de_de: Kann ich DOS-Programme unter FreeBSD ausführen?
es_es: ¿Puedo correr binarios de DOS bajo FreeBSD?
pt_br: Posso executar binários do DOS no FreeBSD?

source: Yes. A DOS emulation program, <package>emulators/doscmd</package>, is available in the FreeBSD Ports Collection.
de_de: Ja. Sie können <package>emulators/doscmd</package> verwenden, das über die FreeBSD Ports-Sammlung verfügbar ist.
es_es: Si. Un programa de emulación de DOS, <package>emulators/doscmd</package>, esta disponible en la colección de ports de FreeBSD.
pt_br: Sim. Um programa de emulação DOS, <package>emulators/doscmd</package>, está disponível na Coleção de Ports do FreeBSD.

source: If <application>doscmd</application> will not suffice, <package>emulators/pcemu</package> emulates an 8088 and enough BIOS services to run many DOS text-mode applications. It requires the X Window System.
de_de: Falls <application>doscmd</application> nicht ausreicht, können Sie den Port <package>emulators/pcemu</package> verwenden, der einen 8088 und genug BIOS-Funktionen emuliert, um DOS-Textanwendungen laufen zu lassen. Der Port benötigt das X Window System.
es_es: Si <application>doscmd</application> no es suficiente, <package>emulators/pcemu</package> emula un 8088 y suficientes servicios de BIOS para correr muchas aplicaciones de DOS en modo texto. Requiere el sistema X Window.
pt_br: Se o <application>doscmd</application> não for suficiente, o <package>emulators/pcemu</package> emulará um 8088 e serviços de BIOS suficientes para executar muitos aplicativos em modo texto do DOS. Requer o sistema de janelas X.

source: The Ports Collection also has <package>emulators/dosbox</package>. The main focus of this application is emulating old DOS games using the local file system for files.
de_de: Die Ports-Sammlung enthält auch <package>emulators/dosbox</package>. Das Hauptaugenmerk liegt bei dieser Anwendung auf der Emulation alter DOS Spiele, deren Dateien sich im lokalen Dateisystem befinden.
es_es: La colección de ports también tiene <package>emulators/dosbox</package>. El foco principal de esta aplicación es emular juegos viejos de DOS usando el sistema de archivos local para los archivos.
pt_br: A coleção de ports também tem o <package>emulators/dosbox</package>. O foco principal deste aplicativo é emular antigos jogos do DOS usando o sistema de arquivos local para os arquivos.

source: What do I need to do to translate a FreeBSD document into my native language?
de_de: Was muss ich tun, um die FreeBSD-Dokumentation in meine Muttersprache zu übersetzen?
es_es: ¿Qué necesito para traducir un documento de FreeBSD a mi lenguaje nativo?
pt_br: O que eu preciso fazer para traduzir um documento do FreeBSD para minha língua nativa?

source: See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html">Translation <acronym>FAQ</acronym></link> in the FreeBSD Documentation Project Primer.
de_de: Lesen Sie die <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html">Translation <acronym>FAQ</acronym></link> im FreeBSD Documentation Project Primer.
es_es: Vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html"><acronym>FAQ</acronym> de Traducciones</link> en la documentación en el Primer de documentación FreeBSD.
pt_br: Veja a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html"> <acronym>FAQ</acronym> de traduções </link> na Documentação do Primer Project do FreeBSD.

source: Why does my email to any address at <systemitem class="fqdomainname">FreeBSD.org</systemitem> bounce?
de_de: Warum kommen alle meine Mails, die ich an <systemitem class="fqdomainname">FreeBSD.org</systemitem> schicke, wieder zurück?
es_es: ¿Por qué mi correo a cualquier dirección con el dominio <systemitem class="fqdomainname">FreeBSD.org</systemitem> rebota?
pt_br: Por que os meus emails destinados a qualquer endereço no dominio <systemitem class="fqdomainname">FreeBSD.org</systemitem> são sempre rejeitados?

source: The <systemitem class="fqdomainname">FreeBSD.org</systemitem> mail system implements some <application>Postfix</application> checks on incoming mail and rejects mail that is either from misconfigured relays or otherwise appears likely to be spam. Some of the specific requirements are:
de_de: Das Mailsystem von <systemitem class="fqdomainname">FreeBSD.org</systemitem> verwendet einige der strengeren Überprüfungen von <application>Postfix</application> für eingehende Mails. Mails, bei denen es Anzeichen für Konfigurationsprobleme oder Spam gibt, werden nicht akzeptiert. Es gibt einige spezielle Anforderungen:
es_es: El sistema de correo de <systemitem class="fqdomainname">FreeBSD.org</systemitem> implementa algunas de las verificaciones de <application>Postfix</application> sobre el correo entrante y rechaza el correo que proviene de relays mal configurados o que parece ser spam. Algunos de los requisitos específicos son:
pt_br: O sistema de mensagens do <systemitem class="fqdomainname"> FreeBSD.org </systemitem> implementa algumas verificações do <application>Postfix</application> nos e-mails recebidos e rejeita e-mails que são de retransmissões mal configurados ou que parecem ser spam. Alguns dos requisitos específicos são:

source: The IP address of the SMTP client must "reverse-resolve" to a forward confirmed hostname.
de_de: Die IP-Adresse des SMTP-Clients muss symbolisch in einen Hostnamen aufgelöst werden können.
es_es: La dirección de IP del cliente SMTP debe "resolverse inversamente" a un nombre de host confirmado hacia adelante.
pt_br: O endereço IP do cliente SMTP deve possuir um registro de DNS reverso para encaminhar hostnames confirmados.

source: The fully-qualified hostname given in the SMTP conversation (either HELO or EHLO) must resolve to the IP address of the client.
de_de: Der vollqualifizierte Rechnername, der im EHLO/HELO Teil der SMTP Kommunikation übergeben wird, muss zu einer IP-Adresse aufgelöst werden können.
es_es: El nombre de host completo dado en la conversación SMTP (HELO o EHLO) debe resolverse a la dirección IP del cliente.
pt_br: O nome completo do host fornecido na conversação SMTP (HELO ou EHLO) deve ser resolvido para o endereço IP do cliente.

source: Other advice to help mail reach its destination include:
de_de: Damit die Mail auch ihr Ziel erreicht, hier ein paar weitere Ratschläge:
es_es: Otros consejos para ayudar a que el correo llegue incluyen:
pt_br: Outros conselhos para ajudar suas mensagens a chegar ao seu destino incluem:

source: Mail should be sent in plain text, and messages sent to mailing lists should generally be no more than 200KB in length.
de_de: Mail sollte im Klartext gesendet werden. Nachrichten an eine Mailingliste sollten die Größe von 200KB nicht überschreiten.
es_es: El correo debe ser enviado como texto plano, y los mensajes enviados a las listas de correo no deberían ser más largos que 200KB.
pt_br: O email deve ser enviado em texto simples, e as mensagens enviadas para as listas de discussão geralmente não devem ter mais de 200 KB.

source: Avoid excessive cross posting. Choose <emphasis>one</emphasis> mailing list which seems most relevant and send it there.
de_de: Vermeiden Sie übermäßiges Crossposting. Wählen Sie <emphasis>eine</emphasis> für das Problem relevante Mailingliste und senden Sie die Mail dorthin.
es_es: Evite el cross posting excesivo. Elija <emphasis>una</emphasis> lista de correo que parezca relevante y envíelo allí.
pt_br: Evite postagem cruzadas excessivas. Escolha <emphasis>uma</emphasis> lista de discussão que pareça mais relevante e envie-a para lá.

source: If you still have trouble with email infrastructure at <systemitem class="fqdomainname">FreeBSD.org</systemitem>, send a note with the details to <email>postmaster@freebsd.org</email>; Include a date/time interval so that logs may be reviewed — and note that we only keep one week's worth of mail logs. (Be sure to specify the time zone or offset from UTC.)
de_de: Falls Sie immer noch Probleme mit der E-Mail-Infratruktur von <systemitem class="fqdomainname">FreeBSD.org</systemitem> haben, schicken Sie eine Nachricht mit den Details an <email>postmaster@freebsd.org</email>. Fügen Sie Datum/Uhrzeit ein, damit die Logdateien überprüft werden können. Beachten Sie jedoch, dass die Mail-Logs nur eine Woche gespeichert werden. Vergewissern Sich sich auch, die Zeitzone oder einen Offset in UTC anzugeben.
es_es: Si tiene problemas con la infraestructura de correo de <systemitem class="fqdomainname">FreeBSD.org</systemitem>, envíe una nota con los detalles a <email>postmaster@freebsd.org</email>; Incluya un intervalo de hora/fecha de manera que los logs puedan ser revisados — y tenga en cuenta que solo mantenemos logs de correo por una semana. (Asegurese de especificar la zona temporal o el offset desde UTC.)
pt_br: Se você ainda tiver problemas com a infra-estrutura de e-mail no <systemitem class="fqdomainname">FreeBSD.org</systemitem>, envie uma observação com os detalhes para <email>postmaster@freebsd.org</email>; Inclua um intervalo de data/hora para que os registros possam ser revisados ​​-- e observe que apenas mantemos uma semana de registros de e-mail. (Certifique-se de especificar o fuso horário ou o deslocamento de UTC.)

source: Where can I find a free FreeBSD account?
de_de: Wo kann ich einen freien FreeBSD-Account bekommen?
es_es: ¿Dónde puedo encontrar una cuenta gratis de FreeBSD?
pt_br: Onde posso conseguir uma conta gratuita FreeBSD?

source: While FreeBSD does not provide open access to any of their servers, others do provide open access <trademark class="registered">UNIX</trademark> systems. The charge varies and limited services may be available.
de_de: Das FreeBSD Project bietet zwar keinen freien Zugang zu seinen Servern an; andere Firmen bieten jedoch frei zugängliche <trademark class="registered">UNIX</trademark> Systeme. Die Kosten variieren und es kann sein, dass nicht alle Dienste zur Verfügung stehen.
es_es: Mientras que FreeBSD no provee acceso abierto a ninguno de sus servidores, otros proveen sistemas <trademark class="registered">UNIX</trademark> de acceso abierto. El costo varía y puede que estén disponibles servicios limitados.
pt_br: Embora o FreeBSD não forneça acesso aberto a nenhum de seus servidores, outros fornecem sistemas <trademark class="registered">UNIX</trademark> de acesso aberto. A taxa varia e serviços limitados podem estar disponíveis.

source: <link xlink:href="http://www.arbornet.org/">Arbornet, Inc</link>, also known as <emphasis>M-Net</emphasis>, has been providing open access to <trademark class="registered">UNIX</trademark> systems since 1983. Starting on an Altos running System III, the site switched to BSD/OS in 1991. In June of 2000, the site switched again to FreeBSD. <emphasis>M-Net</emphasis> can be accessed via <application>telnet</application> and <application>SSH</application> and provides basic access to the entire FreeBSD software suite. However, network access is limited to members and patrons who donate to the system, which is run as a non-profit organization. <emphasis>M-Net</emphasis> also provides an bulletin board system and interactive chat.
de_de: <link xlink:href="http://www.arbornet.org/">Arbornet, Inc</link>, auch als <emphasis>M-Net</emphasis> bekannt, bietet seit 1983 uneingeschränkten Zugang zu <trademark class="registered">UNIX</trademark> Systemen. Zunächst wurde eine Altos-Maschine mit System III benutzt, 1991 erfolgte dann der Wechsel zu BSD/OS. Im Juni 2000 erfolgte ein erneuter Wechsel, diesmal zu FreeBSD. <emphasis>M-Net</emphasis> bietet Zugang mit <application>telnet</application> und <application>SSH</application> und den Zugang zur gesamten Software von FreeBSD. Allerdings ist der Zugriff auf das Netzwerk auf Mitglieder und Gönner beschränkt, die eine Spende an die nicht-kommerzielle Organisation geleistet haben. <emphasis>M-Net</emphasis> stellt zusätzlich ein Mailbox-System und einen interaktiven Chat zur Verfügung.
es_es: <link xlink:href="http://www.arbornet.org/">Arbornet, Inc</link>, también conocida como <emphasis>M-Net</emphasis>, ha estado proveyendo acceso abierto a sistemas <trademark class="registered">UNIX</trademark> desde 1983. Empezando con un Altos corriendo System III, el sitio cambio a BSD/OS en 1991. En junio del 2000, el sitio cambio nuevamente a FreeBSD. <emphasis>M-Net</emphasis> puede ser accedido mediante <application>telnet</application> y <application>SSH</application> y provee acceso básico para la suite de software entera de FreeBSD. Sin embargo, el acceso a la red esta limitado a miembros y patrocinadores que donan al sistema, el cual es mantenido por una organización sin fines de lucro. <emphasis>M-Net</emphasis> también provee un sistema de bulletin board y un chat interactivo.
pt_br: <link xlink:href="http://www.arbornet.org/"> A Arbornet, Inc </link>, também conhecida como <emphasis> M-Net </emphasis>, oferece acesso livre a sistemas <trademark class="registered">UNIX</trademark> desde 1983. Começando num Altos rodando o System III, o site mudou para o BSD/OS em 1991. Em junho de 2000, o site mudou novamente para o FreeBSD. <emphasis>M-Net</emphasis> pode ser acessado via <application>telnet</application> e <application>SSH</application> e fornece acesso básico a todo o pacote de software FreeBSD. No entanto, o acesso à rede é limitado a membros e usuários que doam para o sistema, que é executado como uma organização sem fins lucrativos. O <emphasis>M-Net</emphasis> também oferece um sistema de quadro de avisos e um bate-papo interativo.

source: What is the cute little red guy's name?
de_de: Wie heißt das niedliche rote Kerlchen?
es_es: ¿Cuál es el nombre del apuesto muchacho de rojo?
pt_br: Qual é o nome do mascotinho vermelho?

source: He does not have one, and is just called <quote>the BSD daemon</quote>. If you insist upon using a name, call him <quote>beastie</quote>. Note that <quote>beastie</quote> is pronounced <quote>BSD</quote>.
de_de: Er ist namenlos, es ist einfach <quote>der BSD Daemon</quote>. Wenn Sie ihm unbedingt einen Namen geben wollen, nennen Sie ihn <quote>beastie</quote>. Beachten Sie aber, dass <quote>beastie</quote> wie <quote>BSD</quote> ausgesprochen wird.
es_es: No tiene ningún nombre, sencillamente se lo llama <quote>el demonio de BSD</quote>. Si insiste en usar un nombre, llamelo <quote>beastie</quote>. Note que <quote>beastie</quote> se pronuncia <quote>BSD</quote>.
pt_br: Ele não tem um, e é chamado apenas de <quote>o daemon BSD</quote>. Se você insistir em usar um nome, chame-o de <quote>beastie</quote>. Note que <quote>beastie</quote> é pronunciado <quote>BSD</quote>.

source: More about the BSD daemon is available on his <link xlink:href="http://www.mckusick.com/beastie/index.html">home page</link>.
de_de: Weitere Informationen über den BSD daemon finden Sie auf seiner <link xlink:href="http://www.mckusick.com/beastie/index.html">Homepage</link>.
es_es: Más información acerca del demonio de BSD esta disponible en su <link xlink:href="http://www.mckusick.com/beastie/index.html">pagina web</link>.
pt_br: Mais informações sobre o daemon BSD estão disponíveis em sua <link xlink:href="http://www.mckusick.com/beastie/index.html">home page</link>.

source: Can I use the BSD daemon image?
de_de: Kann ich das Bild des BSD Daemon verwenden?
es_es: ¿Puedo usar la imagen del demonio de BSD?
pt_br: Posso usar a imagem do daemon do BSD?

source: Perhaps. The BSD daemon is copyrighted by Marshall Kirk McKusick. Check his <link xlink:href="http://www.mckusick.com/beastie/mainpage/copyright.html">Statement on the Use of the BSD Daemon Figure</link> for detailed usage terms.
de_de: Eventuell. Der BSD Daemon unterliegt dem Copyright von Marshall Kirk McKusick. Lesen Sie sein <link xlink:href="http://www.mckusick.com/beastie/mainpage/copyright.html">Statement on the Use of the BSD Daemon Figure</link>, wenn Sie genaue Informationen über die Einschränkungen bei der Nutzung brauchen.
es_es: Tal vez. El demonio de BSD esta registrado con derechos de autor por Marshall Kirk McKusick. Vea su <link xlink:href="http://www.mckusick.com/beastie/mainpage/copyright.html">Declaración acerca del uso de la figura del demonio de BSD</link> para términos de uso detallados.
pt_br: Possivelmente. O daemon BSD tem copyright de Marshall Kirk McKusick. Verifique sua <link xlink:href="http://www.mckusick.com/beastie/mainpage/copyright.html"> Declaração sobre o Uso da Figura do Daemon do BSD</link> para termos de uso detalhados.

source: In summary, the image can be used in a tasteful manner, for personal use, so long as appropriate credit is given. Before using the logo commercially, contact Kirk McKusick <email>mckusick@FreeBSD.org</email> for permission. More details are available on the <link xlink:href="http://www.mckusick.com/beastie/index.html">BSD Daemon's home page</link>.
de_de: Kurz gesagt, können Sie den BSD Daemon benutzen, solange es für einen privaten Zweck ist und die Nutzung geschmackvoll bleibt. Bevor Sie das Logo kommerziell nutzen, bitten Sie Kirk McKusick <email>mckusick@FreeBSD.org</email> um Erlaubnis. Weitere Informationen erhalten Sie auf <link xlink:href="http://www.mckusick.com/beastie/index.html">BSD Daemon's home page</link>
es_es: En resumen, la imagen puede ser usada de una manera respetuosa, para uso personal, mientras que se de el crédito apropiado. Antes de usar el logo comercialmente, contacte a Kirk McKusick <email>mckusick@FreeBSD.org</email> para obtener permiso.
pt_br: Em resumo, a imagem pode ser usada com bom gosto, para uso pessoal, desde que seja dado o crédito apropriado. Antes de usar o logotipo comercialmente, entre em contato com Kirk McKusick <email>mckusick@FreeBSD.org</email> para obter permissão. Mais detalhes estão disponíveis na <link xlink:href="http://www.mckusick.com/beastie/index.html"> Home page do BSD Daemon</link>.

source: Do you have any BSD daemon images I could use?
de_de: Gibt es Bilder des BSD Daemon, die ich benutzen kann?
es_es: ¿Tienen imágenes del demonio de BSD que pueda usar?
pt_br: Vocês tem alguma imagem BSD daemon que eu poderia usar?

source: Xfig and eps drawings are available under <filename>/usr/share/examples/BSD_daemon/</filename>.
de_de: Einige Bilder in den Formaten Xfig und eps sind unter <filename>/usr/share/examples/BSD_daemon/</filename> verfügbar.
es_es: Dibujos en Xfig y eps están disponibles en <filename>/usr/share/examples/BSD_daemon/</filename>.
pt_br: Desenhos Xfig e eps estão disponíveis em <filename>/usr/share/examples/BSD_daemon/</filename>.

source: I have seen an acronym or other term on the mailing lists and I do not understand what it means. Where should I look?
de_de: Ich habe in den Mailinglisten eine Abkürzung oder einen Begriff gesehen, den ich nicht kenne. Wo erhalte ich eine Erklärung dazu?
es_es: He visto un acrónimo u otro término en las listas de correo y no entiendo que significa. ¿Dónde tendría que buscar?
pt_br: Eu vi um acrônimo ou outro termo nas listas de discussão e não entendo o que isso significa. Onde devo procurar?
