Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If the problem is with the server on a local network, configure the server to resolve address-to-hostname queries for the local address range. See <citerefentry><refentrytitle>hosts</refentrytitle><manvolnum>5</manvolnum></citerefentry> and <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> for more information. If this is on the Internet, the problem may be that the local server's resolver is not functioning correctly. To check, try to look up another host such as <systemitem>www.yahoo.com</systemitem>. If it does not work, that is the problem.
de_de: Wenn das Problem vom Server im lokalen Netzwerk verursacht wird, dann müssen Sie den Server so konfigurieren, dass er die lokal genutzten IP-Adressen in Rechnernamen übersetzen kann. Weitere Informationen finden Sie in <citerefentry><refentrytitle>hosts</refentrytitle><manvolnum>5</manvolnum></citerefentry> und <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Wenn dieses Problem im Internet auftritt, könnte die Ursache auch darin liegen, dass die Namensauflösung auf dem Server nicht funktioniert. Versuchen Sie, einen anderen Hostnamen wie z.B. <systemitem>www.yahoo.com</systemitem> aufzulösen. Wenn das nicht funktioniert, ist das System nicht richtig konfiguriert.
es_es: Si el problema es con el servidor en una red local, configure el servidor para resolver consultas de dirección a hostname para el rango de direcciones local. Vea <citerefentry><refentrytitle>hosts</refentrytitle><manvolnum>5</manvolnum></citerefentry> y <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> para más información. Si esto ocurre en la Internet, el problema puede ser que el resolver local del servidor no esta funcionando correctamente. Para verificar, intente buscar otro host tal como <systemitem>www.yahoo.com</systemitem>. Si esto no funciona, ese es el problema.
pt_br: Se o problema for com um servidor em uma rede local, configure o servidor para resolver as consultas de endereço para nome de host para o intervalo de endereços da rede local. Veja as páginas de manual para o <citerefentry><refentrytitle>hosts</refentrytitle><manvolnum>5</manvolnum></citerefentry> e o <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> para maiores informações. Se o problema for com um servidor na Internet, o problema pode ser que o resolver local do servidor não está funcionando corretamente. Para verificar se é isto, tente procurar outro host, como <systemitem>www.yahoo.com</systemitem>. Se isso não funcionar, este é o problema.

source: Following a fresh install of FreeBSD, it is also possible that domain and name server information is missing from <filename>/etc/resolv.conf</filename>. This will often cause a delay in <application>SSH</application>, as the option <literal>UseDNS</literal> is set to <literal>yes</literal> by default in <filename>/etc/ssh/sshd_config</filename>. If this is causing the problem, either fill in the missing information in <filename>/etc/resolv.conf</filename> or set <literal>UseDNS</literal> to <literal>no</literal> in <filename>sshd_config</filename> as a temporary workaround.
de_de: Haben Sie FreeBSD gerade erst installiert, kann es auch sein, dass die Domänen- und Nameserverinformationen noch nicht in <filename>/etc/resolv.conf</filename> vorhanden sind. Dadurch kommt es häufig zu Verzögerungen beim Einsatz von <application>SSH</application>, weil die Option <literal>UseDNS</literal> in <filename>/etc/ssh/sshd_config</filename> in der Voreinstellung auf <literal>yes</literal> gesetzt ist. Wenn dies der Fall, müssen Sie entweder die fehlenden Informationen in <filename>/etc/resolv.conf</filename> eintragen oder als temporäre Maßnahme <literal>UseDNS</literal> auf <literal>no</literal> setzen.
es_es: Luego de una instalación de cero de FreeBSD, también es posible que la información del dominio y servidor de nombres no exista en <filename>/etc/resolv.conf</filename>. Esto frecuentemente causara un retraso en <application>SSH</application>, dado que la opción <literal>UseDNS</literal> esta ajustada a <literal>yes</literal> (si) por defecto en <filename>/etc/ssh/sshd_config</filename>. Si esto esta causando el problema, llene la información faltante en <filename>/etc/resolv.conf</filename> o ajuste <literal>UseDNS</literal> a <literal>no</literal> en <filename>sshd_config</filename> como solución temporal.
pt_br: Após uma nova instalação do FreeBSD, também é possível que as informações do domínio e do servidor de nomes estejam faltando no <filename>/etc/resolv.conf</filename>. Isso geralmente causará um atraso no <application>SSH</application>, já que a opção <literal>UseDNS</literal> é definida como <literal>yes</literal> por padrão no <filename>/etc/ssh/sshd_config</filename>. Se isso estiver causando o problema, preencha as informações ausentes no arquivo <filename>/etc/resolv.conf</filename> ou configure a opção <literal>UseDNS</literal> para <literal>no</literal> no arquivo <filename>sshd_config</filename> como uma solução temporária.

source: Why does <errorname>file: table is full</errorname> show up repeatedly in <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>?
de_de: Warum sehe ich in der Ausgabe von <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> häufig die Meldung <errorname>file: table is full</errorname>?
es_es: ¿Por qué <errorname>file: table is full</errorname> aparece repetidamente en <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>?
pt_br: Por que a mensagem <errorname>file: table is full</errorname> aparece repetidamente no <citerefentry> <refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>?

source: This error message indicates that the number of available file descriptors have been exhausted on the system. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">kern.maxfiles</link> section of the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html">Tuning Kernel Limits</link> section of the Handbook for a discussion and solution.
de_de: Diese Fehlermeldung besagt, dass die zur Verfügung stehenden Datei-Deskriptoren des Systems aufgebraucht sind. Was das genau bedeutet und wie Sie dieses Problem lösen können, steht im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">kern.maxfiles</link> im Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html">Einstellungen von Kernel Limits</link> des Handbuchs.
es_es: Este mensaje de error indica que el número de descriptores de archivo disponibles en el sistema se agoto. Vea la subsección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">kern.maxfiles</link> de la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html">Ajustando límites del kernel</link> del manual para una discusión y una solución.
pt_br: Essa mensagem de erro indica que o número de file descriptors disponíveis no sistema esgotaram. Consulte a informação sobre a variável <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html#kern-maxfiles">kern.maxfiles</link> na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-kernel-limits.html"> Ajustando os Limites do Kernel </link> do Handbook para uma discussão e solução.

source: Why does the clock on my computer keep incorrect time?
de_de: Warum ist die Uhrzeit auf meinem Rechner immer falsch?
es_es: ¿Por qué el reloj de mi computadora tiene el tiempo incorrecto?
pt_br: Por que o relógio do meu computador mantém-se com o horário incorreto?

source: The computer has two or more clocks, and FreeBSD has chosen to use the wrong one.
de_de: Der Rechner verfügt über mehr als eine Uhr und FreeBSD benutzt leider die falsche.
es_es: La computadora tiene dos o más relojes, y FreeBSD eligió usar el incorrecto.
pt_br: O computador tem dois ou mais relógios e o FreeBSD escolheu usar o errado.

source: Run <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and check for lines that contain <literal>Timecounter</literal>. The one with the highest quality value that FreeBSD chose.
de_de: Starten Sie <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> und achten Sie auf die Zeilen, in denen das Wort <literal>Timecounter</literal> vorkommt. Die von FreeBSD benutzte Uhr findet sich in der Zeile mit dem höchsten quality-Wert.
es_es: Corra <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, y verifique las líneas que contengan <literal>Timecounter</literal>. El del valor de calidad más alto que eligio FreeBSD.
pt_br: Execute o comando <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> e verifique as linhas que contêm a palavra <literal>Timecounter</literal>. Aquele com o maior valor de quality é o que o FreeBSD escolheu.

source: Confirm this by checking the <varname>kern.timecounter.hardware</varname> <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
de_de: Sie können das überprüfen, indem Sie den Wert der <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>-Variablen <varname>kern.timecounter.hardware</varname> abfragen.
es_es: Confirme esto verificando el <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry><varname>kern.timecounter.hardware</varname>.
pt_br: Confirme isso verificando o valor da variável <varname>kern.timecounter.hardware</varname> no <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: It may be a broken ACPI timer. The simplest solution is to disable the ACPI timer in <filename>/boot/loader.conf</filename>:
de_de: Es kann sich um einen defekten ACPI-Timer handeln. Die einfachste Lösung besteht darin, den ACPI-Timer in <filename>/boot/loader.conf</filename> zu deaktivieren:
es_es: Puede tratarse de un timer ACPI roto. La solución más simple es deshabilitar el timer ACPI en <filename>/boot/loader.conf</filename>:
pt_br: Pode ser um timer ACPI quebrado. A solução mais simples é desabilitar o timer ACPI no arquivo <filename>/boot/loader.conf</filename>:

source: Or the BIOS may modify the TSC clock—perhaps to change the speed of the processor when running from batteries, or going into a power saving mode, but FreeBSD is unaware of these adjustments, and appears to gain or lose time.
de_de: Es ist aber auch durchaus möglich, dass das BIOS die TSC-Uhr ändert, um beispielsweise den CPU-Takt zu während des Batteriebetrieb zu ändern, oder im Stromsparmodus; leider bemerkt FreeBSD diese Änderungen nicht und daher scheint die Uhr falsch zu gehen.
es_es: O el BIOS puede modificar el reloj TSC quizás para cambiar la velocidad del procesador cuando se agonten las baterías, o al cambiar al modo de ahorro de engería, pero FreeBSD no sabe nada de estos ajustes y parece estar perdiendo o ganando tiempo.
pt_br: Ou a BIOS poderá modificar o relógio TSC - talvez para mudar a velocidade do processador quando estiver funcionando a partir de baterias, ou quando estiver entrando em modo de economia de energia, mas o FreeBSD não tem conhecimento desses ajustes e parece ganhar ou perder tempo.

source: In this example, the <literal>i8254</literal> clock is also available, and can be selected by writing its name to the <varname>kern.timecounter.hardware</varname> <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
de_de: In diesem Beispiel ist die Uhr <literal>i8254</literal> ebenfalls verfügbar; um sie auszuwählen, muss ihr Name in die <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>-Variable <varname>kern.timecounter.hardware</varname> geschrieben werden.
es_es: En este ejemplo, el reloj <literal>i8254</literal> también esta disponible, y puede ser seleccionando escribiendo su nombre en el <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry> <varname>kern.timecounter.hardware</varname>.
pt_br: Neste exemplo, o relógio <literal>i8254</literal> também está disponível e pode ser selecionado alterando-se a variável <varname>kern.timecounter.hardware</varname> do <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: The computer should now start keeping more accurate time.
de_de: Die Uhrzeit des Rechners sollte nun genauer funktionieren.
es_es: La computadora debería empezar a medir el tiempo de manera más correcta a partir de ahora.
pt_br: O computador agora deve começar a manter seu relógio mais preciso.

source: To have this change automatically run at boot time, add the following line to <filename>/etc/sysctl.conf</filename>:
de_de: Damit diese Änderung automatisch beim Start des Systems durchgeführt wird, müssen Sie die folgende Zeile in <filename>/etc/sysctl.conf</filename> eintragen:
es_es: Para que este cambio corra automáticamente en tiempo de arranque, agregue la siguiente línea a <filename>/etc/sysctl.conf</filename>:
pt_br: Para que essa mudança seja executada automaticamente no momento da inicialização, adicione a seguinte linha ao arquivo <filename>/etc/sysctl.conf</filename>:

source: What does the error <errorname>swap_pager: indefinite wait buffer:</errorname> mean?
de_de: Was bedeutet die Meldung <errorname>swap_pager: indefinite wait buffer:</errorname>?
es_es: ¿Qué significa el error <errorname>swap_pager: indefinite wait buffer:</errorname>?
pt_br: O que significa o erro <errorname>swap_pager: indefinite wait buffer:</errorname>?

source: This means that a process is trying to page memory to disk, and the page attempt has hung trying to access the disk for more than 20 seconds. It might be caused by bad blocks on the disk drive, disk wiring, cables, or any other disk I/O-related hardware. If the drive itself is bad, disk errors will appear in <filename>/var/log/messages</filename> and in the output of <command>dmesg</command>. Otherwise, check the cables and connections.
de_de: Ein Prozess wollte Speicher auf der Platte auslagern, und dieser Vorgang konnte nicht innerhalb von 20 Sekunden durchgeführt werden. Mögliche Gründe sind defekte Blöcke auf der Platte, falsche oder fehlerhafte Verkabelung sowie Probleme mit anderen Komponenten, die am Zugriff auf die Festplatte beteiligt sind. Wenn die Festplatte selbst fehlerhaft ist, sollten Sie entsprechende Meldungen in <filename>/var/log/messages</filename> und der Ausgabe von <command>dmesg</command> finden. Andernfalls sollten Sie die Kabel und Verbindungen überprüfen.
es_es: Esto significa que un proceso esta intentando paginar memoria al disco, y el intento de paginación se colgó intentando acceder al disco por más de 20 segundos. Puede estar causado por bloques defectuosos en el disco rígido, cableado del disco, cables, o cualquier otro tipo de hardware de E/S relacionado. Si el disco en si mismo esta defectuoso, los errores de disco aparecerán en <filename>/var/log/messages</filename> y en la salida de <command>dmesg</command>. En otro caso, verifique los cables y las conexiones.

source: What is a <errorname>lock order reversal</errorname>?
de_de: Was ist ein <errorname>lock order reversal</errorname>?
es_es: ¿Qué es un <errorname>lock order reversal</errorname>?
pt_br: O que é um <errorname>lock order reversal</errorname> (inversão de ordem de bloqueio)?

source: The FreeBSD kernel uses a number of resource locks to arbitrate contention for certain resources. When multiple kernel threads try to obtain multiple resource locks, there's always the potential for a deadlock, where two threads have each obtained one of the locks and blocks forever waiting for the other thread to release one of the other locks. This sort of locking problem can be avoided if all threads obtain the locks in the same order.
de_de: Der FreeBSD-Kernel benutzt eine Reihe von Ressource-Locks, um den Zugriff auf Ressourcen zu regeln. Wenn verschiedene Kernel-Threads versuchen mehrere Ressource-Locks zu bekommen, besteht immer die Gefahr eines Deadlocks. Hierbei haben zwei Threads einen der Resource-Locks erhalten und blockieren sich nun gegenseitig, weil sie darauf warten, dass der jeweils andere Thread den Resource-Lock wieder freigibt. Diese Art von Locking-Problem kann vermieden werden, indem alle Threads die Locks in der gleichen Reihenfolge erhalten.
es_es: El kernel de FreeBSD usa un número de primitivas de sincronización para manejar la contención de ciertos recursos. Cuando múltiples hilos de kernel intentan obtener múltiples primitivas de sincronización, existe el potencial para un interbloqueo, en donde dos hilos obtuvieron cada uno una primitiva y se bloquean eternamente esperando que el otro hilo libere la otra. Este tipo de problema de bloqueo puede evitarse si todos los hilos obtienen las primitivas en el mismo orden.
pt_br: O kernel do FreeBSD usa vários locks de recursos para arbitrar a contenção de certos recursos. Quando várias threads do kernel tentam obter vários locks de recursos, há sempre o potencial para um impasse (deadlock), em que duas threads obtiveram cada uma um dos locks e trava para sempre esperando que a outra thread libere um dos outros locks. Esse tipo de problema de locking pode ser evitado se todas as threads obtiverem os locks na mesma ordem.

source: A run-time lock diagnostic system called <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>, enabled in FreeBSD-CURRENT and disabled by default for stable branches and releases, detects the potential for deadlocks due to locking errors, including errors caused by obtaining multiple resource locks with a different order from different parts of the kernel. The <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> framework tries to detect this problem as it happens, and reports it by printing a message to the system console about a <errorname>lock order reversal</errorname> (often referred to also as <acronym>LOR</acronym>).
de_de: In FreeBSD-CURRENT (nicht in STABLE- oder RELEASE-Zweigen) befindet sich das Diagnose-System <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>, das potentielle Deadlocks in verschiedenen Teilen des Kernels zur Laufzeit erkennt. Das <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>-System versucht die Probleme zu erkennen und gibt die Meldung <errorname>lock order reversal</errorname> (auch bekannt als <acronym>LOR</acronym>) auf der Konsole aus.
es_es: Un sistema diagnóstico en tiempo de ejecución llamado <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>, habilitado en FreeBSD-CURRENT y deshabilitado por defecto para ramas stable y lanzamientos, detecta el potencial para interbloques debido a errores de bloque, incluyendo errores causados por la obtención de múltiples primitivas de sincronización con un orden diferente de distintas partes del kernel. El framework <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> intenta detectar este problema mientras ocurre y lo reporta imprimiendo un mensaje en la consola del sistema acerca de un <errorname>lock order reversal</errorname> (también conocido como <acronym>LOR</acronym>).
pt_br: Um sistema de diagnóstico lock em tempo de execução chamado <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>, ativado no FreeBSD-CURRENT e desabilitado por padrão para a branch stable e releases, detecta o potencial para deadlocks devido a erros de locking, incluindo erros causados ​​pela obtenção de vários locks de recursos com uma ordem diferente de partes diferentes do kernel. O framework <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> tenta detectar esse problema quando ele ocorre e relata isso imprimindo uma mensagem no console do sistema sobre um <errorname>lock order reversal</errorname> (geralmente também chamado de <acronym>LOR</acronym>).

source: It is possible to get false positives, as <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> is conservative. A true positive report <emphasis>does not</emphasis> mean that a system is dead-locked; instead it should be understood as a warning that a deadlock could have happened here.
de_de: Weil <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> sehr konservativ vorgeht, ist es ist möglich, ein False Positive (Fehlalarm) zu erhalten. Eine Meldung bedeutet nicht zwangsläufig, dass das System einen Deadlock hat; Stattdessen sollte es als Warnung verstanden werden, dass hier ein Deadlock passiert sein könnte.
es_es: Es posible obtener falsos positivos, dado que <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> es conservativo. Un reporte que realmente sea positivo <emphasis>no</emphasis> significa que el sistema sufrió un interbloqueo; en su lugar, debería ser entendido como una advertencia que un interbloqueo podría haber ocurrido en ese lugar.
pt_br: É possível obter falsos positivos, uma vez que o <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry> é conservador. Um relatório positivo verdadeiro <emphasis>não</emphasis> significa que um sistema está travado; em vez disso, deve ser entendido como um aviso de que um deadlock poderia ter acontecido.

source: Problematic <acronym>LOR</acronym>s tend to get fixed quickly, so check the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">FreeBSD-CURRENT mailing list</link> before posting to it.
de_de: Problematische <acronym>LOR</acronym>s werden schnell behoben. Prüfen Sie daher <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">FreeBSD-CURRENT mailing list</link> bevor Sie diese Mailingliste kontaktieren.
es_es: Los <acronym>LOR</acronym> problemáticos tienden a arreglarse rápidamente, asi que verifique la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">lista de correo de FreeBSD-CURRENT</link> antes de postear allí.
pt_br: Os problemas de <acronym>LOR</acronym> tendem a ser consertados rapidamente, então verifique a lista de discussão do <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">FreeBSD-CURRENT</link> antes de postar sobre um.

source: What does <errorname>Called ... with the following non-sleepable locks held</errorname> mean?
de_de: Was hat die Fehlermeldung <errorname>Called ... with the following non-sleepable locks held</errorname> zu bedeuten?
es_es: ¿Qué significa <errorname>Called ... with the following non-sleepable locks held</errorname>?
pt_br: O que significa o erro <errorname>Called ... with the following non-sleepable locks held</errorname>?
