Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Write to kernel memory via <filename>/dev/mem</filename> and <filename>/dev/kmem</filename>.
de_de: Schreibender Zugriff auf die Speicherbereiche des Kernels mittels <filename>/dev/mem</filename> und <filename>/dev/kmem</filename>.
es_es: Escribir a la memoria del kernel mediante <filename>/dev/mem</filename> y <filename>/dev/kmem</filename>.
pt_br: Escrever na memória do kernel através de <filename>/dev/mem</filename> e <filename>/dev/kmem</filename>.

source: Load kernel modules.
de_de: Laden von Kernel-Modulen.
es_es: Cargar modulos de kernel.
pt_br: Carregar módulos do kernel.

source: Alter firewall rules.
de_de: Änderungen an den Firewall-Regeln.
es_es: Alterar reglas del firewall.
pt_br: Alterar as regras do firewall.

source: To check the status of the securelevel on a running system:
de_de: Das folgende Kommando kann benutzt werden, um die eingestellte Sicherheitsstufe eines aktiven Systems abzufragen:
es_es: Para verificar el estado del securelevel en un sistema corriendo:
pt_br: Para verificar o status do securelevel em um sistema em execução:

source: The output contains the current value of the securelevel. If it is greater than 0, at least some of the securelevel's protections are enabled.
de_de: Die Ausgabe enthält den aktuellen Wert der Sicherheitsstufe. Wenn die Zahl positiv (größer als Null) ist, sind zumindest einige der Schutzmaßnahmen aktiviert.
es_es: La salida contiene el valor actual del securelevel. Si es mayor a 0, al menos algunas de las protecciones de securelevel están habilitadas.
pt_br: A saída contém o valor atual do nível de segurança. Se for maior que 0, pelo menos algumas das proteções do securelevel são ativadas.

source: The securelevel of a running system cannot be lowered as this would defeat its purpose. If a task requires that the securelevel be non-positive, change the <varname>kern_securelevel</varname> and <varname>kern_securelevel_enable</varname> variables in <filename>/etc/rc.conf</filename> and reboot.
de_de: Die Sicherheitsstufe eines laufenden Systems kann nicht verringert werden, da dies den Mechanismus nutzlos machen würde. Wenn Sie eine Tätigkeit ausführen müssen, bei der die Sicherheitsstufe nicht-positiv sein muss, dann müssen Sie die Variablen <varname>kern_securelevel</varname> und <varname>kern_securelevel_enable</varname> in <filename>/etc/rc.conf</filename> ändern und das System neustarten.
es_es: El securelevel de un sistema corriendo no puede ser reducido dado que esto arruinaría su propósito. Si una tarea requiere que el securelevel sea no-positivo, cambie las variables <varname>kern_securelevel</varname> y <varname>kern_securelevel_enable</varname> en <filename>/etc/rc.conf</filename> y reinicie.
pt_br: O securelevel de um sistema em execução não pode ser reduzido, pois isso invalidaria seu propósito. Se uma tarefa exigir que o securelevel seja não-positivo, altere as variáveis ​​<varname>kern_securelevel</varname> e <varname>kern_securelevel_enable</varname> em <filename>/etc/rc.conf</filename> e reinicialize.

source: For more information on securelevel and the specific things all the levels do, consult <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Weitere Informationen über die Sicherheitsstufen und was die Einstellungen bewirken, können Sie <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> entnehmen.
es_es: Para más información acerca de securelevel y lo que hace en particular cada nivel, consulte <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Para obter mais informações sobre o securelevel e as coisas específicas que todos os níveis fazem, consulte <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Securelevel is not a silver bullet; it has many known deficiencies. More often than not, it provides a false sense of security.
de_de: Die Sicherheitsstufen sind kein magischer Zauberstab; es gibt viele bekannte Probleme. Und in der Mehrzahl der Fälle vermitteln sie ein falsches Gefühl von Sicherheit.
es_es: Securelevel no es una bala de plata; tiene varias deficiencias conocidas. Muchas veces provee un falso sentido de seguridad.
pt_br: O securelevel não é uma bala de prata; tem muitas deficiências conhecidas. Mais frequentemente do que não, fornece uma falsa sensação de segurança.

source: One of its biggest problems is that in order for it to be at all effective, all files used in the boot process up until the securelevel is set must be protected. If an attacker can get the system to execute their code prior to the securelevel being set (which happens quite late in the boot process since some things the system must do at start-up cannot be done at an elevated securelevel), its protections are invalidated. While this task of protecting all files used in the boot process is not technically impossible, if it is achieved, system maintenance will become a nightmare since one would have to take the system down, at least to single-user mode, to modify a configuration file.
de_de: Eines der größten Probleme ist, dass alle für den Start des Systems benötigten Dateien geschützt sein müssen, damit die Sicherheitsstufe effektiv sein können. Wenn es ein Angreifer schafft, seine eigenen Programme ausführen zu lassen, bevor die Sicherheitsstufe gesetzt wird (was leider erst gegen Ende des Startvorgangs erfolgen kann, da viele der notwendigen Tätigkeiten für den Systemstart nicht mit einer gesetzten Sicherheitsstufe möglich wären), werden die Schutzmechanismen ausgehebelt. Es ist zwar nicht technisch unmöglich, alle beim Systemstart genutzten Dateien zu schützen; allerdings würde in einem so geschützten System die Administration zu einem Alptraum, da man das System neu starten oder in den Single-User-Modus bringen müsste, um eine Konfigurationsdatei ändern zu können.
es_es: Uno de sus problemas mas importantes es que para que sea efectivo, todos los archivos usados en el proceso de inicio hasta que se ajuste securelevel deben estar protegidos. Si un atacante puede hacer que el sistema ejecute código antes de que se ajuste el securelevel (lo cual pasa bastante tarde en el proceso de inicio dado que algunas de las cosas que el sistema debe hacer al inicio no pueden hacerse con un securelevel elevado), sus protecciones están invalidadas. Mientras que la tarea de proteger todos los archivos usados en el proceso de inicio no es técnicamente imposible, si esto se logra, el mantenimiento del sistema se volverá una pesadilla dado que una persona tendría que apagar el sistema, o al menos cambiar a modo de un solo usuario, para modificar un archivo de configuración.
pt_br: Um dos seus maiores problemas é que, para que seja eficaz, todos os arquivos usados ​​no processo de inicialização até que o nível de segurança seja definido devem ser protegidos. Se um invasor puder fazer o sistema executar seu código antes do nível de segurança que está sendo definido (o que acontece muito tarde no processo de inicialização, pois algumas coisas que o sistema deve fazer na inicialização não podem ser feitas em um nível elevado), suas proteções são invalidadas . Embora essa tarefa de proteger todos os arquivos usados ​​no processo de inicialização não seja tecnicamente impossível, se for obtida, a manutenção do sistema se tornará um pesadelo, já que seria necessário desativar o sistema, pelo menos no modo de usuário único, para modificar um arquivo de configuração.

source: This point and others are often discussed on the mailing lists, particularly the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-security">FreeBSD security mailing list</link>. Search the archives <link xlink:href="@@URL_RELPREFIX@@/search/index.html">here</link> for an extensive discussion. A more fine-grained mechanism is preferred.
de_de: Dieses und andere Probleme werden häufig auf den Mailinglisten diskutiert, speziell auf auf der <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-security">Mailingliste FreeBSD security</link>. Das verfügbare <link xlink:href="@@URL_RELPREFIX@@/search/index.html">Archiv</link> enthält ausgiebige Diskussionen. Einige Benutzer sind guter Hoffnung, dass das System der Sicherheitsstufen bald durch ein besser konfigurierbares System ersetzt wird.
es_es: Este punto y otros son frecuentemente discutidos en las listas de correo, particularmente la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-security">lista de correo de seguridad de FreeBSD</link>. Busque en los archivos <link xlink:href="@@URL_RELPREFIX@@/search/index.html">aqui</link> para una discusión extensiva. Se prefiere un mecanismo de granularidad más fina.
pt_br: Este ponto e outros são frequentemente discutidos nas listas de discussão, particularmente na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-security">lista de discussão de segurança do FreeBSD</link>. Pesquise nos arquivos <link xlink:href="@@URL_RELPREFIX@@/search/index.html">aqui</link> para uma discussão extensa. Um mecanismo mais refinado é o preferido.

source: BIND (<command>named</command>) is listening on some high-numbered ports. What is going on?
de_de: Wieso wartet BIND (<command>named</command>) auf hohen Ports auf Anfragen?
es_es: BIND (<command>named</command>) esta escuchando en algunos puertos de numero alto. ¿Qué esta pasando?

source: BIND uses a random high-numbered port for outgoing queries. Recent versions of it choose a new, random UDP port for each query. This may cause problems for some network configurations, especially if a firewall blocks incoming UDP packets on particular ports. To get past that firewall, try the <literal>avoid-v4-udp-ports</literal> and <literal>avoid-v6-udp-ports</literal> options to avoid selecting random port numbers within a blocked range.
de_de: BIND benutzt einen Port mit einer hohen, zufälligen Nummer für den Versand von Anfragen. Aktuelle Versionen wählen einen neuen, zufälligen UDP-Port für jede Anfrage. Das kann für manche Netzwerkkonfigurationen Probleme verursachen, besonders wenn eine Firewall eingehende UDP-Pakete auf bestimmten Ports blockiert. Wenn Sie durch eine solche Firewall wollen, können Sie die Optionen <literal>avoid-v4-udp-ports</literal> und <literal>avoid-v6-udp-ports</literal> ausprobieren, um ein zufälliges Auswählen von Portnummern innerhalb eines blockierten Bereiches zu verhindern.
es_es: BIND usa un numero al azar de puertos de número alto para consultas saliente. Las versiones recientes elijen un nuevo puerto UDP al azar para cada consulta. Esto puede causar problemas para algunas configuraciones de red, especialmente si un firewall bloquea paquetes UDP entrantes en puertos particulares. Para pasar ese firewall intente usar las opciones <literal>avoid-v4-udp-ports</literal> y <literal>avoid-v6-udp-ports</literal> para evitar elegir números de puertos al azar en un rango bloqueado.
pt_br: O BIND usa uma porta aleatória de numeração alta para consultas de saída. Versões recentes dele escolhem uma nova porta UDP aleatória para cada consulta. Isso pode causar problemas para algumas configurações de rede, especialmente se um firewall bloquear pacotes UDP de entrada em portas específicas. Para passar por esse firewall, tente as opções <literal>avoid-v4-udp-ports</literal> e <literal>avoid-v6-udp-ports</literal> para evitar a seleção de números de porta aleatórios dentro de um intervalo bloqueado.

source: If a port number (like 53) is specified via the <literal>query-source</literal> or <literal>query-source-v6</literal> options in <filename>/etc/namedb/named.conf</filename>, randomized port selection will not be used. It is strongly recommended that these options not be used to specify fixed port numbers.
de_de: Wenn eine Portnummer (wie 53) über die Optionen <literal>query-source</literal> oder <literal>query-source-v6</literal> in <filename>/etc/namedb/named.conf</filename> spezifiziert ist, wird zufällige Portauswahl nicht verwendet. Es wird dringend empfohlen, dass diese Optionen nicht für die Spezifikation von festen Portnummern verwendet wird.
es_es: Si un número de puerto (como el 53) es especificado mediante las opciones <literal>query-source</literal> o <literal>query-source-v6</literal>en <filename>/etc/namedb/named.conf</filename>, no se usara la selección al azar de puertos. Se recomienda fuertemente que estas opciones no se usen para especificar números de puerto fijos.

source: Congratulations, by the way. It is good practice to read <citerefentry><refentrytitle>sockstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> output and notice odd things!
de_de: Es ist eine sehr gute Angewohnheit, die Ausgaben von <citerefentry><refentrytitle>sockstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> durchzusehen und auf merkwürdige Dinge zu achten.
es_es: Felicitaciones por cierto. ¡Es buena práctica leer la salida de <citerefentry><refentrytitle>sockstat</refentrytitle><manvolnum>1</manvolnum></citerefentry>y notar cosas raras!
pt_br: Parabéns, a propósito. É uma boa prática ler a saída <citerefentry><refentrytitle>sockstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> e observar coisas estranhas!

source: The <application>Sendmail</application> daemon is listening on port 587 as well as the standard port 25! What is going on?
de_de: Wieso wartet der <application>Sendmail</application>-Dienst sowohl auf Port 587 als auch auf dem Standard-Port 25 auf Anfragen?
es_es: ¡El demonio de <application>Sendmail</application> esta escuchando en el puerto 587 y además en el puerto estándar 25! ¿Qué esta pasando?
pt_br: O daemon <application>Sendmail</application> está escutando na porta 587, assim como na porta padrão 25! O que está acontecendo?

source: Recent versions of <application>Sendmail</application> support a mail submission feature that runs over port 587. This is not yet widely supported, but is growing in popularity.
de_de: Aktuelle Versionen von <application>Sendmail</application> unterstützen eine Technik zur Einlieferung von Mails, die Port 587 nutzt. Diese Technik wird zwar noch nicht oft angewendet, erfreut sich aber ständig steigender Popularität.
es_es: Las versiones recientes de <application>Sendmail</application> soportan una característica de envió de correo que corre sobre el puerto 587. Esto no esta soportado universalmente, pero esta creciendo en popularidad.
pt_br: Versões recentes do <application>Sendmail</application> suportam um recurso de envio de mensagens que é executado pela porta 587. Isso ainda não é amplamente suportado, mas está crescendo em popularidade.

source: What is this UID 0 <systemitem class="username">toor</systemitem> account? Have I been compromised?
de_de: Woher kommt dieser Benutzer <systemitem class="username">toor</systemitem> mit UID 0? Ist mein System gehackt worden?
es_es: ¿Qué es esta cuenta de <systemitem class="username">toor</systemitem> UID 0 ? ¿He sido comprometido?
pt_br: O que é essa conta UID 0 <systemitem class="username">toor</systemitem>? Eu fui comprometido?

source: Do not worry. <systemitem class="username">toor</systemitem> is an <quote>alternative</quote> superuser account, where toor is root spelled backwards. It is intended to be used with a non-standard shell so the default shell for <systemitem class="username">root</systemitem> does not need to change. This is important as shells which are not part of the base distribution, but are instead installed from ports or packages, are installed in <filename>/usr/local/bin</filename> which, by default, resides on a different file system. If <systemitem class="username">root</systemitem>'s shell is located in <filename>/usr/local/bin</filename> and the file system containing <filename>/usr/local/bin</filename>) is not mounted, <systemitem class="username">root</systemitem> will not be able to log in to fix a problem and will have to reboot into single-user mode in order to enter the path to a shell.
de_de: Keine Panik. <systemitem class="username">toor</systemitem> ist ein <quote>alternativer</quote> Account für den Super-User (wenn man root rückwärts schreibt, erhält man toor). Dieser Account ist für die Verwendung mit einer alternativen Shell vorgesehen; damit ist es nicht mehr erforderlich, die Shell von <systemitem class="username">root</systemitem> zu ändern. Dies ist wichtig, wenn eine Shell verwendet wird, die nicht zum Basissystem von FreeBSD gehört, zum Beispiel aus einem Port oder einem Paket. Diese Shells werden in der Regel in <filename>/usr/local/bin</filename> installiert und dieses Verzeichnis liegt standardmäßig auf einem anderen Dateisystem. Wenn die Shell von <systemitem class="username">root</systemitem> in <filename>/usr/local/bin</filename> liegt und das Dateisystem, auf dem <filename>/usr/local/bin liegt</filename> nicht gemountet werden kann, kann sich <systemitem class="username">root</systemitem> nicht mehr einloggen, um das Problem zu beheben. Es ist allerdings möglich, das System zu rebooten und das Problem im Single-User-Modus zu lösen, da man hier gefragt wird, welche Shell benutzt werden soll.
es_es: No se preocupe. <systemitem class="username">toor</systemitem> es una cuenta de superusuario <quote>alternativa</quote>, en donde toor es root escrito al revés. Su propósito es ser usada como un shell no estándar de manera que el shell por defecto para <systemitem class="username">root</systemitem> no necesite cambiar. Esto es importante dado que los shells que no son parte del sistema base, pero que en su lugar son instalados desde ports o packages, se instalan en <filename>/usr/local/bin</filename> el cual, por defecto, reside en un sistema de archivos distinto. SI el shell de <systemitem class="username">root</systemitem> esta localizado en <filename>/usr/local/bin</filename> y el sistema de archivos conteniendo <filename>/usr/local/bin</filename>) no esta montado, <systemitem class="username">root</systemitem> no sera capaz de autenticarse para arreglar un problema y tenga que reiniciar al modo de un solo usuario para ingresar a la ruta de un shell.
pt_br: Não se preocupe. <systemitem class="username">toor</systemitem> é uma conta de superusuário <quote>alternativa</quote>, onde toor é root soletrada para ao contrário. Ele deve ser usado com um shell não padrão, portanto, o shell padrão para <systemitem class="username">root</systemitem> não precisa ser alterado. Isto é importante porque os shells que não fazem parte da distribuição base, mas que são instalados a partir de ports ou packages, são instalados em <filename>/usr/local/bin</filename> que, por padrão, reside em um sistema de arquivos diferente . Se o shell do <systemitem class="username">root</systemitem> estiver localizado em <filename>/usr/local/bin</filename> e o sistema de arquivos contendo <filename>/usr/local/bin</filename >) não está montado, <systemitem class="username">root</systemitem> não poderá efetuar login para corrigir um problema e terá que reinicializar no modo de usuário único para inserir o caminho para um shell.

source: Some people use <systemitem class="username">toor</systemitem> for day-to-day <systemitem class="username">root</systemitem> tasks with a non-standard shell, leaving <systemitem class="username">root</systemitem>, with a standard shell, for single-user mode or emergencies. By default, a user cannot log in using <systemitem class="username">toor</systemitem> as it does not have a password, so log in as <systemitem class="username">root</systemitem> and set a password for <systemitem class="username">toor</systemitem> before using it to login.
de_de: Einige Anwender benutzen <systemitem class="username">toor</systemitem> mit einer alternativen Shell für die tägliche Arbeit und benutzen <systemitem class="username">root</systemitem> (mit der Standard-Shell) für den Single-User-Modus und für Notfälle. Standardmäßig kann man sich nicht als <systemitem class="username">toor</systemitem> anmelden, da der Account kein gültiges Passwort hat; Sie müssen sich also als <systemitem class="username">root</systemitem> anmelden und ein Passwort für <systemitem class="username">toor</systemitem> setzen, wenn Sie diesen Account benutzen wollen.
es_es: Alguna gente usa <systemitem class="username">toor</systemitem> para tareas diarias de <systemitem class="username">root</systemitem> con un shell no estándar, dejando a <systemitem class="username">root</systemitem>, con un shell estándar, para modo de un solo usuario o emergencias. Por defecto, un usuario no puede autenticarse usando <systemitem class="username">toor</systemitem> dado quen o tiene una contraseña, de modo que autentiquese como <systemitem class="username">root</systemitem> e ingrese una contraseña para <systemitem class="username">toor</systemitem> antes de usarlo para autenticarse.
pt_br: Algumas pessoas usam <systemitem class="username">toor</systemitem> para tarefas do dia-a-dia do <systemitem class="username">root</systemitem> com um shell não padrão, deixando o <systemitem class="username">root</systemitem>, com um shell padrão, para o modo de usuário único ou emergências. Por padrão, um usuário não pode logar usando <systemitem class="username">toor</systemitem> porque ele não tem uma senha, então efetue login como <systemitem class="username">root</systemitem> e defina um senha para <systemitem class="username">toor</systemitem> antes de usá-lo para efetuar login.

source: I cannot make <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> work. What am I doing wrong?
de_de: Ich bekomme <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> nicht zum Laufen. Was mache ich falsch?
es_es: No puedo hacer que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> funcione. ¿Qué estoy haciendo mal?
pt_br: Não consigo fazer o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> funcionar. O que estou fazendo de errado?

source: First, read <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html#userppp">PPP section of the Handbook</link>. To assist in troubleshooting, enable logging with the following command:
de_de: Lesen Sie zuerst <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> und den <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ppp-and-slip.html#userppp">Abschnitt zu PPP im Handbuch</link>. Aktivieren Sie zur Fehlersuche die Protokollierung mit folgendem Befehl:
es_es: Primero, lea <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> y la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html#userppp">sección del manual sobre PPP </link>. Para asistir en la solución de problemas, habilite los logs con el siguiente comando:
pt_br: Primeiro, leia o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> e o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html#userppp">seção sobre PPP do Handbook</link>. Para ajudar na solução de problemas, ative os logs com o seguinte comando:
