Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Replace <emphasis>accf_httpd ipfw</emphasis> with a list of needed modules. Only the listed modules will be built. This reduces the size of the kernel directory and decreases the amount of time needed to build the kernel. For more information, read <filename>/usr/share/examples/etc/make.conf</filename>.
de_de: Ersetzen Sie <emphasis>accf_httpd ipfw</emphasis> durch die gewünschten Module. Nur aufgelistete Module werden gebaut. Dies reduziert die Größe des Kernel-Verzeichnisses sowie die benötigte Zeit, um den Kernel zu übersetzen.
es_es: Reemplaze <emphasis>accf_httpd ipfw</emphasis> con una lista de los módulos que necesita. Solo los módulos listados serán compilados. Esto reduce el tamaño del directorio del kernel y reduce la cantidad de tiempo requerido para compilar el kernel. Para más información, lea <filename>/usr/share/examples/etc/make.conf</filename>.
pt_br: Substitua <emphasis>accf_httpd ipfw</emphasis> com a lista dos módulos que precisa. Apenas os módulos listados serão compilados. Isso reduz o tamanho do diretório do kernel e diminui o tempo necessário para compilar o kernel. Para mais informações, leia <filename>/usr/share/examples/etc/make.conf</filename>.

source: Unneeded devices can be removed from the kernel to further reduce the size. See <xref linkend="make-kernel"/> for more information.
de_de: Um die Größe des Kernels weiter zu reduzieren, können nicht benötigte Geräte aus dem Kernel entfernt werden. <xref linkend="make-kernel"/> enthält weitere Informationen.
es_es: Los dispositivos innecesarios pueden ser removidos del kernel para reducir aún más su tamaño. Vea <xref linkend="make-kernel"/> para más información.
pt_br: Dispositivos desnecessários podem ser removidos do kernel para reduzir ainda mais o tamanho. Veja <xref linkend="make-kernel"/> para mais informações.

source: To put any of these options into effect, follow the instructions to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig-building.html">build and install</link> the new kernel.
de_de: Um eine dieser Optionen in Kraft zu setzen, folgen Sie den Anweisungen zum <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/kernelconfig-building.html">Erstellen und Installieren</link> eines neuen Kernels.
es_es: Para que estas opciones hagan efecto, siga las instrucciones para <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig-building.html">compilar y instalar</link> el nuevo kernel.
pt_br: Para colocar qualquer uma dessas opções em vigor, siga as instruções para <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig-building.html">compilar e instalar</link> um novo kernel.

source: For reference, the FreeBSD 11 amd64 kernel (<filename>/boot/kernel/kernel</filename>) is approximately 25 MB.
de_de: Der FreeBSD 11 amd64 Kernel (<filename>/boot/kernel/kernel</filename>) ist circa 25 MB groß.
es_es: Para referencias, el kernel de FreeBSD 11 en amd64 (<filename>/boot/kernel/kernel</filename>) ocupa aproximadamente approximately 25 MB.
pt_br: Para referência, o kernel amd64 do FreeBSD 11 (<filename>/boot/kernel/kernel</filename>) é de aproximadamente 25 MB.

source: Why does every kernel I try to build fail to compile, even <filename>GENERIC</filename>?
de_de: Wieso kann ich nicht einmal den Standard-Kernel (<filename>GENERIC</filename>) bauen?
es_es: ¿Por qué cada kernel que intento construir falla al compilar, incluso <filename>GENERIC</filename>?
pt_br: Por que todo kernel que eu tento construir falha ao compilar, até mesmo o <filename>GENERIC</filename>?

source: There are a number of possible causes for this problem:
de_de: Es gibt eine Reihe von möglichen Ursachen für dieses Problem:
es_es: Hay varias causas posibles para este problema:
pt_br: Há várias causas possíveis para esse problema:

source: The source tree is different from the one used to build the currently running system. When attempting an upgrade, read <filename>/usr/src/UPDATING</filename>, paying particular attention to the <quote>COMMON ITEMS</quote> section at the end.
de_de: Der Quellbaum unterscheidet sich von dem, der verwendet wird, um das aktuell laufende System zu erstellen. Wenn Sie ein Upgrade durchführen, lesen Sie <filename>/usr/src/UPDATING</filename> und achten Sie besonders auf den Abschnitt <quote>COMMON ITEMS</quote> am Ende.
es_es: El código fuente es diferente del que se usa para compilar el sistema actual que esta corriendo. Al intentar actualizar, lea<filename>/usr/src/UPDATING</filename>, prestando atención especial a la sección <quote>COMMON ITEMS</quote> al final.
pt_br: A o código fonte de origem é diferente do usado para construir o sistema atualmente em execução. Ao tentar uma atualização, leia o arquivo <filename>/usr/src/UPDATING</filename>, prestando atenção especial à seção <quote>ITENS COMUNS</quote> no final.

source: The <command>make buildkernel</command> command did not complete successfully. The <command>make buildkernel</command> target relies on files generated by the <command>make buildworld</command> target to complete its job correctly.
de_de: Beim Kommando <command>make buildworld</command> sind Fehler aufgetreten. Um seine Arbeit erledigen zu können, benötigt <command>make buildkernel</command> Dateien, die von <command>make buildworld</command> erzeugt werden.
es_es: El comando <command>make buildkernel</command> no se completo de manera exitosa. El objetivo <command>make buildkernel</command> depende de archivos generados por el objetivo <command>make buildworld</command> para terminar su trabajo correctamente.

source: Even when building <link linkend="stable">FreeBSD-STABLE</link>, it is possible that the source tree was fetched at a time when it was either being modified or it was broken. Only releases are guaranteed to be buildable, although <link linkend="stable">FreeBSD-STABLE</link> builds fine the majority of the time. Try re-fetching the source tree and see if the problem goes away. Try using a different mirror in case the previous one is having problems.
de_de: Auch wenn Sie <link linkend="stable">FreeBSD-STABLE</link> verwenden, ist es durchaus möglich, dass Sie die Quellen genau zum falschen Zeitpunkt aktualisiert haben: Während Sie gerade modifiziert wurden oder kurzzeitig fehlerhaft waren. Eine Garantie, dass Sie die Quellen übersetzen können, gibt es nur für die Releases, bei <link linkend="stable">FreeBSD-STABLE</link> ist das nicht immer so. Versuchen Sie, die Quellen nochmals zu aktualisieren. Es ist denkbar, dass der von Ihnen genutzte Server zurzeit Probleme hat, benutzen Sie daher auch einmal einen anderen Server.
es_es: Incluso al compilar <link linkend="stable">FreeBSD-STABLE</link>, es posible que árbol de código fuente haya sido obtenido en una etapa en la que esta siendo modificado o estaba roto. Solo se garantiza que los lanzamientos sean compilables, aunque <link linkend="stable">FreeBSD-STABLE</link> compila correctamente la mayor parte del tiempo. Intente re-obtener el árbol de código fuente y vea si el problema desaparece. Intente usar un mirror distinto en casa de que el anterior presente problemas.
pt_br: Mesmo quando estiver compilando o <link linkend="stable">FreeBSD-STABLE</link>, é possível que o código fonte tenha sido obtido em um momento em que estava sendo modificado ou em que estava quebrado. Somente os releases possuem a garantia de que podem ser compilados, apesar do <link linkend="stable">FreeBSD-STABLE</link> compilar corretamente na maioria das vezes. Tente atualizar novamente o código fonte e veja se o problema desaparece. Tente usar um servidor de distribuição diferente, caso o anterior esteja com problemas.

source: Which scheduler is in use on a running system?
de_de: Wie kann ich prüfen, welchen Scheduler das System benutzt?
es_es: ¿Qué planificador esta en uso en un sistema en funcionamiento?
pt_br: Qual agendador está em uso em um sistema em execução?

source: The name of the scheduler currently being used is directly available as the value of the <varname>kern.sched.name</varname> sysctl:
de_de: Der Name des aktuell verwendeten Schedulers steht in der sysctl-Variablen <varname>kern.sched.name</varname>:
es_es: El nombre del planificador siendo usado actualmente esta directamente disponible como el valor del sysctl <varname>kern.sched.name</varname>:
pt_br: O nome do agendador que atualmente sendo usado está diretamente disponível como o valor da variavel <varname>kern.sched.name</varname> do sysctl:

source: What is <varname>kern.sched.quantum</varname>?
de_de: Was bedeutet kern.sched.quantum?
es_es: ¿Qué es <varname>kern.sched.quantum</varname>?
pt_br: O que é o <varname>kern.sched.quantum</varname>?

source: <varname>kern.sched.quantum</varname> is the maximum number of ticks a process can run without being preempted in the 4BSD scheduler.
de_de: <varname>kern.sched.quantum</varname> ist die maximale Anzahl Ticks, die ein Prozess im 4BSD-Scheduler ununterbrochen laufen kann.
es_es: <varname>kern.sched.quantum</varname> es el máximo número de ticks que puede correr un proceso sin ser apropiado por el planificador de 4BSD.
pt_br: A variável <varname>kern.sched.quantum</varname> define o número máximo de pulsos que um processo pode executar sem ser "preempted" no scheduler 4BSD.

source: Disks, File Systems, and Boot Loaders
de_de: Festplatten, Dateisysteme und Boot Loader
es_es: Discos, sistemas de archivos y cargadores de arranque
pt_br: Discos, sistemas de arquivos e boot loaders

source: How can I add my new hard disk to my FreeBSD system?
de_de: Wie kann ich meine neue Festplatte in mein FreeBSD-System einbinden?
es_es: ¿Como puedo agregar mi nuevo disco duro a mi sistema FreeBSD?
pt_br: Como posso adicionar o meu novo disco rígido ao meu sistema FreeBSD?

source: See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-adding.html">Adding Disks</link> section in the FreeBSD Handbook.
de_de: Lesen Sie den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/disks-adding.html">Hinzufügen von Laufwerken</link> im Handbuch.
es_es: Vea la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-adding.html">Añadir discos</link> en el manual de FreeBSD.
pt_br: Veja a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/disks-adding.html">Adicionando Discos</link> no Handbook do FreeBSD.

source: How do I move my system over to my huge new disk?
de_de: Wie verschiebe ich mein System auf meine neue, große Platte?
es_es: ¿Como muevo mi sistema actual a mi nuevo y enorme disco?
pt_br: Como faço para mover meu sistema para o meu novo disco enorme?

source: The best way is to reinstall the operating system on the new disk, then move the user data over. This is highly recommended when tracking <emphasis>-STABLE</emphasis> for more than one release or when updating a release instead of installing a new one. Install booteasy on both disks with <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> and dual boot until you are happy with the new configuration. Skip the next paragraph to find out how to move the data after doing this.
de_de: Die beste Methode ist, das Betriebssystem auf der neuen Platte zu installieren und danach die Daten zu verschieben. Diese Methode ist sehr empfehlenswert, wenn Sie <emphasis>-STABLE</emphasis> über ein Release hinaus genutzt haben oder ein Release aktualisiert haben. Sie können <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf beiden Platten installieren und die beiden Versionen so lange parallel betreiben, bis Ihnen die neue Konfiguration gefällt. Wenn Sie dies tun wollen, können Sie im übernächsten Absatz erfahren, wie sie Ihre Daten verschieben können.
es_es: La mejor manera es reinstalar el sistema operativo en el nuevo disco, y luego mover los datos. Esto es altamente recomendado al seguir <emphasis>-STABLE</emphasis> por más de un lanzamiento o al actualizar una versión en lugar de instalar una nueva. Instale booteasy en ambos discos con <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> y luego arranque en modo dual hasta que este contento con la nueva configuración. Saltéese el próximo párrafo para averiguar como mover los datos luego de hacer esto.
pt_br: A melhor maneira é reinstalar o sistema operacional no novo disco e depois passar os dados do usuário. Isto é altamente recomendado ao seguir o <emphasis>-STABLE</emphasis> por mais de uma release ou ao atualizar uma release ao invés de instalar uma nova. Instale o booteasy em ambos os discos com <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> e use a opção de dual boot até que esteja satisfeito com a nova configuração. Pule o próximo parágrafo para descobrir como mover os dados depois de fazer isso.

source: Alternatively, partition and label the new disk with either <citerefentry><refentrytitle>sade</refentrytitle><manvolnum>8</manvolnum></citerefentry> or <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>. If the disks are MBR-formatted, booteasy can be installed on both disks with <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> so that the computer can dual boot to the old or new system after the copying is done.
de_de: Alternativ können Sie die neue Platte entweder mit <citerefentry><refentrytitle>sade</refentrytitle><manvolnum>8</manvolnum></citerefentry> oder <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry> partitionieren und labeln. Wenn die Festplatten mit MBR formatiert sind, kann booteasy auf beiden Festplatten mit <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> installiert werden, damit der Rechner nach dem Kopieren das alte oder neue System booten kann.
es_es: Alternativamente, particiones y marque el nuevo disco con <citerefentry><refentrytitle>sade</refentrytitle><manvolnum>8</manvolnum></citerefentry> o <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Si los discos están formateados con MBR, booteasy puede instalarse en ambos discos con <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> de manera que la computadora pueda arrancar en modo dual con el viejo o el nuevo sistema luego de que se haya realizado el copiado.
pt_br: Alternativamente, particione e rotule o novo disco utilizando o <citerefentry><refentrytitle>sade</refentrytitle><manvolnum>8</manvolnum></citerefentry> ou o <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Se os discos forem formatados com MBR, o booteasy pode ser instalado em ambos os discos utilizando-se o <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> para que o computador possa inicializar dualmente com o antigo ou novo sistema após a conclusão da cópia.

source: Once the new disk set up, the data cannot just be copied. Instead, use tools that understand device files and system flags, such as <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Although it is recommended to move the data while in single-user mode, it is not required.
de_de: Sobald die neue Festplatte eingerichtet ist, können die Daten nicht einfach kopiert werden. Verwenden Sie stattdessen Werkzeuge, die Gerätedateien und Dateiattribute verstehen, z. B. <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Obwohl empfohlen wird, die Daten im Einzelbenutzermodus zu verschieben, ist dies nicht zwingend erforderlich.
es_es: Una vez configurado el nuevo disco, los datos no pueden simplemente copiarse. En su lugar utilice las herramientas que entiendan los archivos de dispositivos y las banderas del sistema, tales como <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Aunque se recomienda mover los datos mientras se encuentre en modo de un solo usuario, esto no es requerido.
pt_br: Depois que o novo disco estiver configurado, os dados não podem ser simplesmente copiados. Em vez disso, use ferramentas que entendam device files e system flags, tais como o <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Embora seja recomendado que você mova os dados com o sistema em modo single user, isto não é necessário.

source: When the disks are formatted with <acronym>UFS</acronym>, never use anything but <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>restore</refentrytitle><manvolnum>8</manvolnum></citerefentry> to move the root file system. These commands should also be used when moving a single partition to another empty partition. The sequence of steps to use <command>dump</command> to move the data from one <acronym>UFS</acronym> partitions to a new partition is:
de_de: Wenn die Festplatten mit <acronym>UFS</acronym> formatiert sind, verwenden Sie ausschließlich <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> und <citerefentry><refentrytitle>restore</refentrytitle><manvolnum>8</manvolnum></citerefentry>, um das Root-Dateisystem zu verschieben. Diese Befehle sollten auch beim Verschieben einer einzelnen Partition in eine andere, leere Partition verwendet werden. Um die Daten einer <acronym>UFS</acronym>-Partition auf eine andere Partition zu verschieben, müssen Sie die folgenden Schritte ausführen:
es_es: Cuando los discos esten formateados con <acronym>UFS</acronym>, nunca use nada excepto <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> y <citerefentry><refentrytitle>restore</refentrytitle><manvolnum>8</manvolnum></citerefentry> para mover el sistema de archivos raíz. Estos comandos también deberían ser usados al mover una única partición a otra partición vacía. La secuencia de pasos para usar <command>dump</command> para mover los datos de una partición <acronym>UFS</acronym> a una nueva partición es:
pt_br: Quando os discos estiverem formatados com <acronym>UFS</acronym>, nunca use nada além do <citerefentry><refentrytitle>dump</refentrytitle><manvolnum>8</manvolnum></citerefentry> e do <citerefentry><refentrytitle>restore</refentrytitle><manvolnum>8</manvolnum></citerefentry> para mover o sistema de arquivos raiz. Esses comandos também devem ser usados para mover uma única partição para uma outra partição vazia. A seqüência de etapas para usar o comando <command>dump</command> para mover os dados de uma partição <acronym>UFS</acronym> para uma nova partição é:

source: <command>newfs</command> the new partition.
de_de: Richten Sie in der neuen Partition mit <command>newfs</command> ein Dateisystem ein.
es_es: <command>newfs</command> a la nueva partición
pt_br: Execute o <command>newfs</command> na nova partição

source: <command>mount</command> it on a temporary mount point.
de_de: <command>mount</command>en Sie die Partition temporär an einer geeigneten Stelle.
es_es: <command>mount</command> en un punto de montaje temporal.
pt_br: Utilize o <command>mount</command> para disponibilizá-la em um ponto de montagem temporário.

source: <command>cd</command> to that directory.
de_de: Wechseln Sie mit <command>cd</command> in dieses Verzeichnis.
es_es: <command>cd</command> a ese directorio.
pt_br: Vá para o diretório desejado utilizando o comando <command> cd </command>.

source: <command>dump</command> the old partition, piping output to the new one.
de_de: Lesen Sie die alte Partition mit <command>dump</command> aus und lenken Sie die Ausgabe auf die neue Partition um.
es_es: <command>dump</command> la vieja partición, concatenando la salida a la nueva.
pt_br: Faça o <command> dump </command> da partição antiga e redirecione a saída para a nova.

source: For example, to move <filename>/dev/ada1s1a</filename> with <filename>/mnt</filename> as the temporary mount point, type:
de_de: Wenn Sie zum Beispiel das Root-Dateisystem auf <filename>/dev/ad1s1a</filename> verschieben wollen und diese derzeit auf <filename>/mnt</filename> gemountet ist, geben Sie folgendes ein:
es_es: Por ejemplo, para mover <filename>/dev/ada1s1a</filename> con <filename>/mnt</filename> como punto de montaje temporario, escriba:
pt_br: Por exemplo, para mover <filename>/dev/ada1s1a</filename> tendo <filename>/mnt</filename> como o ponto de montagem temporário, digite:

source: Rearranging partitions with <command>dump</command> takes a bit more work. To merge a partition like <filename>/var</filename> into its parent, create the new partition large enough for both, move the parent partition as described above, then move the child partition into the empty directory that the first move created:
de_de: Wenn Sie Partitionen mit <command>dump</command> umorganisieren wollen, bedeutet dies etwas mehr Arbeit. Wenn Sie eine Partition wie <filename>/var</filename> in die übergeordnete Partition verschieben wollen, müssen Sie zunächst eine neue Partition erzeugen, die die beiden alten Partitionen aufnehmen kann. Der zweite Schritt ist, wie oben beschrieben die übergeordnete Partition in die neue Partition zu verschieben. Im dritten und letzten Schritt verschieben Sie dann die untergeordnete Partition in das leere Verzeichnis, das im zweiten Schritt entstanden ist:
es_es: Reorganizar particiones con <command>dump</command> lleva un poco más de trabajo. Para combinar una partición como <filename>/var</filename> con su padre, cree una nueva partición que sea lo suficientemente grande como para ambas, mueva la partición padre como se describió anteriormente, y luego mueva la partición hija al directorio vacío que creo la primera movida:
pt_br: Reorganizar as partições com o comando <command>dump</command> requer um pouco mais de trabalho. Para mesclar uma partição como <filename>/var</filename> com a partição pai, crie uma nova partição grande o suficiente para conter ambas, mova a partição pai conforme descrito acima e mova a partição filha para o diretório vazio criado pela primeira movimentação:

source: To split a directory from its parent, say putting <filename>/var</filename> on its own partition when it was not before, create both partitions, then mount the child partition on the appropriate directory in the temporary mount point, then move the old single partition:
de_de: Wenn Sie ein Verzeichnis aus einer Partition herauslösen wollen, also z.B. <filename>/var</filename> auf eine eigene Partition verlegen wollen, dann müssen Sie zunächst beide Partitionen anlegen. Danach müssen Sie die untergeordnete Partition im passenden Verzeichnis unterhalb des temporären mount points mounten und zum Abschluß die alte Partition verschieben:
es_es: Para separar un directorio de su padre, por ejemplo poniendo <filename>/var</filename> en su propia partición cuando no estaba ahi anteriormente, cree ambas particiones, luego monte la partición hija en el directorio apropiado en el punto de montaje temporario, luego mueva la vieja partición:
pt_br: Para separar um diretório do seu pai, digamos colocar <filename>/var</filename> em sua própria partição quando não era antes, crie as duas partições, monte a partição filho no diretório apropriado no ponto de montagem temporário e mova a antiga partição única:
