Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: By default, ZFS stores the ZIL in the pool with all the data. If an application has a heavy write load, storing the ZIL in a separate device that has very fast synchronous, sequential write performance can improve overall system. For other workloads, a SSD is unlikely to make much of an improvement.
de_de: In der Voreinstellung speichert ZFS das ZIL zusammen mit den anderen Daten innerhalb des Pools. Wenn eine Anwendung viele Schreiboperationen erzeugt, kann es die Gesamtleistung verbessern, wenn das ZIL auf einem separaten Gerät gespeichert wird, welches eine hohe Leistung bei synchronen, sequentiellen Schreibvorgängen erzielt. Bei geringerer Last bieten SSDs kaum eine Verbesserung.
es_es: Por defecto, ZFS guarda el ZIL en el pool junto con el resto de los datos. Si una aplicación tiene una gran carga de escritura, guardar el ZIL en un dispositivo separado que tenga un rendimiento de escritura secuencial muy rápido y asincrónico puede mejorar el sistema en general. Para otro tipo de cargas, es poco probable que un SSD represente una gran mejora.
pt_br: Por padrão, o ZFS armazena o ZIL no pool com todos os demais dados. Se um aplicativo tiver uma carga de gravação pesada, o armazenamento do ZIL em um dispositivo separado e que tenha um desempenho de gravação sequencial síncrono muito rápido pode melhorar a performance do sistema de uma forma geral. Para outras cargas de trabalho, é improvável que um SSD consiga uma melhoria significativa.

source: What is the L2ARC?
de_de: Was ist der L2ARC?
es_es: ¿Qué es el L2ARC?
pt_br: O que é o L2ARC?

source: The <acronym>L2ARC</acronym> is a read cache stored on a fast device such as an <acronym>SSD</acronym>. This cache is not persistent across reboots. Note that RAM is used as the first layer of cache and the L2ARC is only needed if there is insufficient RAM.
de_de: Der <acronym>L2ARC</acronym> ist ein Lese-Cache, der auf einem schnellen Gerät, bspw. einer <acronym>SSD</acronym>, gespeichert wird. Die Daten in diesem Cache gehen bei einem Neustart verloren. Beachten Sie, dass primär RAM als Cache verwendet wird, und dass der <acronym>L2ARC</acronym> nur dann benötigt wird, wenn nicht genügend RAM verfügbar ist.
es_es: El <acronym>L2ARC</acronym> es una cache de lectura guardada en un dispositivo rápido tal como un <acronym>SSD</acronym>. Esta cache no persiste entre reinicios. Notese que la RAM es usada como primera capa de cache y el L2ARC solo es necesitado si hay RAM insuficiente.
pt_br: O <acronym>L2ARC</acronym> é um cache de leitura armazenado em um dispositivo rápido, como um <acronym>SSD</acronym>. Esse cache não é persistente nas reinicializações. Observe que a RAM é usada como a primeira camada de cache e o L2ARC só é necessário se a quantidade de memória RAM for insuficiente.

source: L2ARC needs space in the ARC to index it. So, perversely, a working set that fits perfectly in the ARC will not fit perfectly any more if a L2ARC is used because part of the ARC is holding the L2ARC index, pushing part of the working set into the L2ARC which is slower than RAM.
de_de: L2ARC benötigt Platz im ARC, um es zu indizieren. Ein Arbeitsbereich, der perfekt in den ARC passt, passt nicht mehr, wenn ein L2ARC verwendet wird, da ein Teil des ARC den L2ARC-Index beinhaltet und einen Teil des Arbeitsbereichs in den L2ARC schreibt, der langsamer als der RAM ist.
es_es: L2ARC necesita espacio en el ARC para indexarlo. De modo que, extrañamente, un conjunto de trabajo que encaja perfectamente en el ARC dejara de encajar perfectamente si el L2ARC se usa porque una parte del ARC esta reteniendo el índice el L2ARC, pasando una parte del conjunto de trabajo al L2ARC que es más lento que la memoria RAM.
pt_br: O L2ARC precisa de espaço no ARC para indexá-lo. Então, perversamente, um conjunto de trabalho que se encaixa perfeitamente no ARC não se encaixará mais perfeitamente se um L2ARC for usado porque parte do ARC estará mantendo o índice L2ARC, empurrando parte do conjunto de trabalho para o L2ARC que é mais lento que a RAM.

source: Is enabling deduplication advisable?
de_de: Ist es ratsam, Deduplizierung zu aktivieren?
es_es: ¿Es aconsejable habilitar deduplicación?
pt_br: A ativação da funcionalidade de desduplicação é recomendável?

source: Generally speaking, no.
de_de: Im Allgemeinen nicht.
es_es: Generalmente hablando, no.
pt_br: De um modo geral, não.

source: Deduplication takes up a significant amount of RAM and may slow down read and write disk access times. Unless one is storing data that is very heavily duplicated, such as virtual machine images or user backups, it is possible that deduplication will do more harm than good. Another consideration is the inability to revert deduplication status. If data is written when deduplication is enabled, disabling dedup will not cause those blocks which were deduplicated to be replicated until they are next modified.
de_de: Deduplizierung benötigt sehr viel RAM und kann die Lese- und Schreibzugriffe auf die Festplatte verringern. Wenn Sie keine Daten speichern, die sehr stark dupliziert sind, bspw. Abbilder von virtuellen Maschinen oder Backups von Benutzern, dann ist es eher wahrscheinlich, dass Deplizierung mehr Schaden als Nutzen bringt. Zudem ist es nicht möglich, den Status der Deduplizierung umzukehren. Wenn Daten bei aktivierter Deduplizierung geschrieben werden, werden diese nach einer Deaktivierung der Deduplizierung erst wieder repliziert, nachdem die nächste Änderung stattfindet.
es_es: Deduplicación requiere una cantidad significativa de RAM y puede realentizar los tiempos de acceso del disco para lectura y escritura. A no ser que se estén guardando datos que están altamente duplicados, tales como las maquinas virtuales o respaldos hechos por el usuario, es posible que la dedpulicación haga más mal que bien. Otra consideración es la incapacidad de revertir el estado de deduplicación. Si los datos son escritos al habilitar deduplicación, deshabilitar dedup no causara que los bloques que fueron deduplicados se repliquen hasta que estos vuelvan a ser modificados.
pt_br: A deduplicação ocupa uma quantidade significativa de RAM e pode tornar mais lento os tempos de acesso ao disco para leitura e gravação. A menos que um esteja armazenando dados muito duplicados, como imagens de máquinas virtuais ou backups de usuários, é possível que a deduplicação faça mais mal do que bem. Outra consideração é a incapacidade de reverter o status da deduplicação. Se os dados forem gravados quando a deduplicação estiver ativada, desabilitar a deduplicação não fará com que os blocos deduplicados sejam replicados até que sejam modificados em novamente.

source: Deduplication can also lead to some unexpected situations. In particular, deleting files may become much slower.
de_de: Deduplizierung kann auch zu einigen unerwarteten Situationen führen. Insbesondere kann das Löschen von Dateien viel langsamer sein.
es_es: Deduplicación también puede llevar a situaciones inesperadas. En particular, borrar archivos puede volverse mucho más lento.
pt_br: A deduplicação também pode levar há algumas situações inesperadas. Em particular, a exclusão de arquivos pode se tornar muito mais lenta.

source: I cannot delete or create files on my ZFS pool. How can I fix this?
de_de: Ich kann in meinem ZFS Pool keine Dateien erstellen oder löschen. Wie kann ich das ändern?
es_es: No puedo borrar ni crear archivos en mi pool de ZFS. ¿Como puedo arreglar esto?
pt_br: Não consigo excluir ou criar arquivos no meu pool do ZFS. Como posso consertar isso?

source: This could happen because the pool is 100% full. ZFS requires space on the disk to write transaction metadata. To restore the pool to a usable state, truncate the file to delete:
de_de: Die könnte passieren, wenn der Pool zu 100% belegt ist. ZFS benötigt Platz auf der Festplatte, um Transaktionsmetadaten zu speichern. Um den Pool wieder benutzbar zu machen, kürzen Sie einfach die zu löschende Datei:
es_es: Esto puede ocurrir porque el pool esta 100% lleno. ZFS requiere espacio en el disco para escribir los metadatos de transacción. Para restaurar el pool a un estado usable, trunque el archivo a borrar:
pt_br: Isso pode acontecer porque o pool está 100% cheio. O ZFS requer espaço no disco para gravar metadados de transação. Para restaurar o pool para um estado utilizável, primeiro faça o truncate do arquivo que irá excluir:

source: <prompt>%</prompt> <userinput>truncate -s 0 unimportant-file</userinput>
es_es: <prompt>%</prompt> <userinput>truncate -s 0 archivo-sin-importancia</userinput>

source: File truncation works because a new transaction is not started, new spare blocks are created instead.
de_de: Dies funktioniert, weil keine neue Transaktion gestartet wird, stattdessen werden neue Ersatzblöcke erzeugt.
es_es: La truncación de archivos funciona porque no se inicia una nueva transacción, en su lugar se crean nuevos bloques de repuesto.
pt_br: O truncamento de arquivo funciona porque uma nova transação não é iniciada, novos blocos de reserva são criados.

source: On systems with additional ZFS dataset tuning, such as deduplication, the space may not be immediately available
de_de: Auf Systemen mit zusätzlichen ZFS Optimierungen, wie Deduplizierung, steht der Speicherplatz vielleicht nicht sofort zur Verfügung.
es_es: En sistemas con ajustes adicionales al set de datos de ZFS, tales como deduplicación, el espacio puede no estar inmediatamente disponible.
pt_br: Em sistemas que utilizam o ZFS com um dataset customizado, por exemplo com a funcionalidade de deduplicação ativada, o espaço pode não ficar disponível imediatamente.

source: Does ZFS support TRIM for Solid State Drives?
de_de: Enthält ZFS TRIM-Unterstützung für Solid State Drives?
es_es: ¿Soporta ZFS TRIM para discos de estado sólido?
pt_br: O ZFS suporta TRIM para unidades de estado sólido?

source: ZFS TRIM support was added to FreeBSD 10-CURRENT with revision r<revnumber>240868</revnumber>. ZFS TRIM support was added to all FreeBSD-STABLE branches in r<revnumber>252162</revnumber> and r<revnumber>251419</revnumber>, respectively.
de_de: ZFS TRIM-Unterstützung wurde in FreeBSD 10-CURRENT mit Revision r<revnumber>240868</revnumber> hinzugefügt. In die FreeBSD-STABLE Zweige wurde die Unterstützung mit r<revnumber>252162</revnumber> und <revnumber>251419</revnumber> hinzugefügt.
es_es: El soporte para TRIM en ZFS fue añadido a FreeBSD 10-CURRENT con la revisión r<revnumber>240868</revnumber>. El soporte para TRIM en ZFS se agrego a todas las ramas FreeBSD-STABLE en r<revnumber>252162</revnumber> y r<revnumber>251419</revnumber>, respectivamente.
pt_br: O suporte ao ZFS TRIM foi adicionado ao FreeBSD 10-CURRENT com revisão r<revnumber>240868</revnumber>. O suporte ao ZFS TRIM foi adicionado a todas as branchs do FreeBSD-STABLE na revisão r<revnumber>252162</revnumber> e r<revnumber>251419</revnumber>, respectivamente.

source: ZFS TRIM is enabled by default, and can be turned off by adding this line to <filename>/etc/sysctl.conf</filename>:
de_de: ZFS TRIM ist in der Voreinstellung aktiviert, kann aber mit dem folgenden Eintrag in <filename>/etc/sysctl.conf</filename> deaktiviert werden:
es_es: TRIM esta habilitado por defecto en ZFS, y puede ser deshabilitado agregando esta línea a <filename>/etc/sysctl.conf</filename>:
pt_br: O ZFS TRIM é ativado por padrão e pode ser desativado adicionando-se esta linha ao arquivo <filename>/etc/sysctl.conf</filename>:

source: ZFS TRIM may not work with all configurations, such as a ZFS filesystem on a GELI-backed device.
de_de: ZFS TRIM funktioniert möglicherweise nicht in allen Konfigurationen, beispielsweise mit einem ZFS-Dateisystem auf einer mit GELI verschlüsselten Festplatte.
es_es: TRIM en ZFS puede no funcionar con todas las configuraciones, tales como un sistema de archivos ZFS en un dispositivo respaldado con GELI.
pt_br: O ZFS TRIM pode não funcionar com todas as configurações, tal como um sistema de arquivos ZFS em um dispositivo com suporte a GELI.

source: System Administration
es_es: Administración del sistema
pt_br: Administração do Sistema

source: Where are the system start-up configuration files?
de_de: Wo befinden sich die Konfigurationsdateien für den Systemstart?
es_es: ¿Cuáles son los archivos de configuración para el arranque del sistema?
pt_br: Onde estão os arquivos de configuração de inicialização do sistema?

source: The primary configuration file is <filename>/etc/defaults/rc.conf</filename> which is described in <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. System startup scripts such as <filename>/etc/rc</filename> and <filename>/etc/rc.d</filename>, which are described in <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, include this file. <emphasis>Do not edit this file!</emphasis> Instead, to edit an entry in <filename>/etc/defaults/rc.conf</filename>, copy the line into <filename>/etc/rc.conf</filename> and change it there.
de_de: <filename>/etc/defaults/rc.conf</filename> (siehe <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>) ist die primäre Konfigurationsdatei. Die Startskripten des Systems, wie <filename>/etc/rc</filename> und <filename>/etc/rc.d</filename> (siehe <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>) inkludieren diese Datei. <emphasis>Ändern Sie diese Datei nicht!</emphasis> Wenn Sie den Wert einer der in <filename>/etc/defaults/rc.conf</filename> gesetzten Variablen ändern wollen, kopieren Sie die entsprechende Zeile nach <filename>/etc/rc.conf</filename> und ändern die Zeile dort.
es_es: El archivo de configuración principal es <filename>/etc/defaults/rc.conf</filename> el cual se describe en <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Los scripts de arranque del sistema tales como <filename>/etc/rc</filename> y <filename>/etc/rc.d</filename>, los cuales son descritos en <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, incluyen este archivo. <emphasis>¡No edite este archivo!</emphasis> En su lugar, para editar una entrada en <filename>/etc/defaults/rc.conf</filename>, copie la línea a <filename>/etc/rc.conf</filename> y cámbiela allí.
pt_br: O arquivo de configuração principal é o <filename>/etc/defaults/rc.conf</filename>, o qual está descrito em <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Os scripts de inicialização do sistema, tais como <filename>/etc/rc</filename> e <filename>/etc/rc.d</filename>, que são descritos em <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>, incluem este arquivo. <emphasis>Não edite este arquivo!</emphasis> Em vez disso, para editar uma entrada do <filename>/etc/default/rc.conf</filename>, copie a linha para o arquivo <filename>/etc/rc.conf</filename> e altere-a lá.

source: For example, if to start <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>, the included DNS server:
de_de: Wenn Sie zum Beispiel den mitgelieferten DNS-Server <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> aktivieren wollen, können Sie das folgende Kommando eingeben:
es_es: Por ejemplo, para arrancar <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>, el servidor de DNS incluido
pt_br: Por exemplo, se para iniciar <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o servidor DNS incluído:

source: To start up local services, place shell scripts in the <filename>/usr/local/etc/rc.d</filename> directory. These shell scripts should be set executable, the default file mode is <literal>555</literal>.
de_de: Wenn Sie lokale Server starten wollen, müssen Sie die Shellskripten im Verzeichnis <filename>/usr/local/etc/rc.d/</filename> ablegen. Die Dateien sollten als ausführbar markiert sein und die Dateiberechtigungen <literal>555</literal> besitzen.
es_es: Para arrancar servicios locales, coloque los scripts de shell en el directorio <filename>/usr/local/etc/rc.d</filename>. Los scripts de shell deben ser ejecutables, el modo de archivo por defecto es <literal>555</literal>.
pt_br: Para iniciar serviços locais, coloque seus shell scripts no diretório <filename>/usr/local/etc/rc.d</filename>. Estes shell scripts devem estar definidos como executáveis, o modo de arquivo padrão é <literal>555</literal>.

source: How do I add a user easily?
de_de: Wie kann ich am Einfachsten einen Benutzer hinzufügen?
es_es: ¿Como agrego fácilmente un usuario?
pt_br: Como eu adiciono um usuário facilmente?

source: Use the <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry> command, or the <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry> command for more complicated situations.
de_de: Benutzen Sie den Befehl <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry> und für kompliziertere Fälle den Befehl <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: Use el comando <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o el comando <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry> para situaciones más complicadas.
pt_br: Use o comando <citerefentry> <refentrytitle> adduser </refentrytitle> <manvolnum> 8 </manvolnum> </citerefentry>, para as situações mais complexas utilize o comando <citerefentry> <refentrytitle> pw </refentrytitle> <manvolnum> 8 </manvolnum> </citerefentry>.

source: To remove the user, use the <citerefentry><refentrytitle>rmuser</refentrytitle><manvolnum>8</manvolnum></citerefentry> command or, if necessary, <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Um einen Benutzer wieder zu löschen, können Sie den Befehl <citerefentry><refentrytitle>rmuser</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzen. Sie können, wenn nötig, auch <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzen.
es_es: Para remover el usuario, use el comando <citerefentry><refentrytitle>rmuser</refentrytitle><manvolnum>8</manvolnum></citerefentry>o, si es necesario, <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Para remover o usuário, use o comando <citerefentry><refentrytitle>rmuser</refentrytitle><manvolnum>8</manvolnum></citerefentry> ou, se necessário, o comando <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Why do I keep getting messages like <errorname>root: not found</errorname> after editing <filename>/etc/crontab</filename>?
de_de: Warum erhalte ich Meldungen wie <errorname>root: not found</errorname>, nachdem ich <filename>/etc/crontab</filename> geändert habe?
es_es: ¿Por qué recibo constantemente mensajes del estilo <errorname>root: not found</errorname> luego de editar <filename>/etc/crontab</filename>?
pt_br: Por que eu continuo recebendo mensagens como <errorname>root: not found</errorname> depois de editar o arquivo <filename>/etc/crontab</filename>?

source: This is normally caused by editing the system crontab. This is not the correct way to do things as the system crontab has a different format to the per-user crontabs. The system crontab has an extra field, specifying which user to run the command as. <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> assumes this user is the first word of the command to execute. Since no such command exists, this error message is displayed.
de_de: Dies geschieht in der Regel, wenn sie die crontab des Systems verändern. Das ist aber nicht der richtige Weg, weil die crontab des Systems ein anderes Format hat, als die crontabs der Benutzer. Die crontab des Systems enthält ein zusätzliches Feld für den Benutzer, welcher das Kommando ausführt. <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> geht davon aus, das der Benutzername das auszuführenden Kommando ist. Da ein solches Kommando jedoch nicht existiert, wird diese Meldung angezeigt.
es_es: Esto usualmente esta provocado por editar el crontab del sistema. Esta no es la manera correcta de hacer las cosas, dado que el crontab del sistema tiene un formato distinto para los crontabs por usuario. El crontab del sistema tiene un campo extra, especificando como que usuario se debe correr el comando. <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> asume que este usuario es la primera palabra del comando a ejecutar. Dado que no existe tal comando, aparece este mensaje de error.
pt_br: Isto normalmente é causado pela edição do crontab do sistema. Esta não é a maneira correta de fazer as coisas, pois o crontab do sistema tem um formato diferente dos crontabs por usuário. O crontab do sistema possui um campo extra, especificando qual usuário irá executar o comando. O <citerefentry><refentrytitle>cron</refentrytitle> <manvolnum>8</manvolnum></citerefentry> assume que este usuário é a primeira palavra do comando a ser executado. Como esse comando não existe, essa mensagem de erro é exibida.

source: To delete the extra, incorrect crontab:
de_de: Geben Sie das folgende ein um die zusätzliche, fehlerhafte crontab zu löschen:
es_es: Para borrar el contrab extra e incorrecto:
pt_br: Para excluir o crontab extra incorreto:

source: Why do I get the error, <errorname>you are not in the correct group to su root</errorname> when I try to <command>su</command> to <systemitem class="username">root</systemitem>?
de_de: Wieso erhalte ich die Meldung <errorname>you are not in the correct group to su root</errorname>, wenn ich mit <command>su</command> zu <systemitem class="username">root</systemitem> wechseln will?
es_es: ¿Por qué tengo el error <errorname>you are not in the correct group to su root</errorname> cuando intento hacer <command>su</command> a <systemitem class="username">root</systemitem>?
pt_br: Por que eu recebo o erro, <errorname>you are not in the correct group to su root</errorname> quando tento executar o comando <command>su</command> para o usuário <systemitem class="username">root</systemitem> ?
