Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Long answer: FreeBSD disallows changing system flags at security levels greater than 0. To check the current security level:
de_de: Ausführliche Antwort: Wenn die Sicherheitseinstellung größer als 0 ist, erlaubt es FreeBSD nicht, die Systemeinstellungen zu ändern. Um den aktuellen Securelevel zu ermitteln, können Sie das folgende Kommando benutzen:
es_es: Respuesta larga: FreeBSD deshabilita cambiar las banderas del sistema cuando los niveles de seguridad son mayores a 0. Para verificar el nivel actual de seguridad:
pt_br: Resposta longa: O FreeBSD não permite alterar os flags do sistema em níveis de segurança superiores a 0. Para verificar o nível de segurança atual:

source: The security level cannot be lowered in multi-user mode, so boot to single-user mode to install the kernel, or change the security level in <filename>/etc/rc.conf</filename> then reboot. See the <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page for details on <literal>securelevel</literal>, and see <filename>/etc/defaults/rc.conf</filename> and the <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page for more information on <filename>rc.conf</filename>.
de_de: Sie können die Sicherheitseinstellung im Mehrbenutzer-Modus nicht verringern. Sie müssen das System im Single-User-Modus starten, um den Kernel zu installieren oder den Securelevel in <filename>/etc/rc.conf</filename> zu ändern und anschließend das System neu starten. Lesen Sie Manualpage von <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> für weitere Details zu <literal>securelevel</literal>. Zusätzliche Informationen zu <filename>/etc/rc.conf</filename> finden Sie in <filename>/etc/defaults/rc.conf</filename> und der Manualpage <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: El nivel de seguridad no puede ser bajado en modo multiusuario, de manera que reinicie al modo de un solo usuario para instalar el kernel, o cambie el nivel de seguridad en <filename>/etc/rc.conf</filename> y luego reinicie. Vea la pagina de manial de <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> para más detalles acerca de <literal>securelevel</literal>, y vea <filename>/etc/defaults/rc.conf</filename> y la página de manual de <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para más información acerca de <filename>rc.conf</filename>.
pt_br: O nível de segurança não pode ser diminuído no modo multiusuário, portanto, inicialize no modo single user para instalar o kernel ou altere o nível de segurança em <filename> /etc/rc.conf </filename> e reinicialize. Veja a página de manual <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detalhes sobre o <literal>securelevel</literal>, e veja <filename>/etc/defaults/rc .conf</filename> e a página de manual <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para mais informações sobre o <filename> rc.conf </filename>.

source: I cannot change the time on my system by more than one second! How do I get around this?
de_de: Ich kann die Systemzeit nicht um mehr als eine Sekunde verstellen. Was mache ich jetzt?
es_es: ¡No puedo cambiar el tiempo en mi sistema por más de un segundo! ¿Como soluciono esto?
pt_br: Não consigo alterar a hora no meu sistema em mais de um segundo! Como faço para contornar isso?

source: Short answer: the system is at a security level greater than 1. Reboot directly to single-user mode to change the date.
de_de: Kurze Antwort: Die Sicherheitseinstellung (der securelevel) ist größer als 1. Sie müssen das System neu starten und die Systemzeit im Single-User-Modus verstellen.
es_es: Respuesta corta: el sistema esta en un nivel de seguridad mayor a 1. Reinicie directamente a modo de un solo usuario para cambiar la fecha.
pt_br: Resposta curta: o sistema está em um nível de segurança maior que 1. Reinicialize diretamente para o modo de single user para alterar a data.

source: Long answer: FreeBSD disallows changing the time by more that one second at security levels greater than 1. To check the security level:
de_de: Ausführliche Antwort: Wenn die Sicherheitseinstellung größer als 1 ist, erlaubt es FreeBSD nicht, die Systemzeit zu ändern. Um den aktuellen Securelevel zu ermitteln, können Sie das folgende Kommando benutzen:
es_es: Respuesta larga: FreeBSD deshabilita cambiar el tiempo por más de un segundo a niveles de seguridad mayores que 1. Para verificar el nivel de seguridad:
pt_br: Resposta longa: O FreeBSD proíbe a alteração do tempo em mais de um segundo em níveis de segurança superiores a 1. Para verificar o nível de segurança:

source: The security level cannot be lowered in multi-user mode. Either boot to single-user mode to change the date or change the security level in <filename>/etc/rc.conf</filename> and reboot. See the <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page for details on <literal>securelevel</literal>, and see <filename>/etc/defaults/rc.conf</filename> and the <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page for more information on <filename>rc.conf</filename>.
de_de: Sie können die Sicherheitseinstellung im Mehrbenutzer-Modus nicht verringern. Sie müssen das System im Single-User-Modus starten, um die Systemzeit oder den Securelevel in <filename>/etc/rc.conf</filename> zu ändern und anschließend das System neu starten. Lesen Sie Manualpage von <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> für weitere Details zu <literal>securelevel</literal>. Zusätzliche Informationen zu <filename>/etc/rc.conf</filename> finden Sie in <filename>/etc/defaults/rc.conf</filename> und der Manualpage <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: El nivel de seguridad no puede ser reducido en modo multiusuario. Reinicie a modo de un solo usuario para cambiar la fecha o cambie el nivel de seguridad en <filename>/etc/rc.conf</filename> y reinicie. Vea la página de manual de <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detalles acerca de <literal>securelevel</literal>, y vea <filename>/etc/defaults/rc.conf</filename> y la página de manual de <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para más información acerca de <filename>rc.conf</filename>.
pt_br: O nível de segurança não pode ser diminuído no modo multiusuário. Inicialize no modo single user para alterar a data ou altere o nível de segurança no arquivo <filename>/etc/rc.conf</filename> e reinicialize. Veja a página de manual <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detalhes sobre o <literal>securelevel</literal>, e veja <filename>/etc/defaults/rc .conf</filename> e a página de manual <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para mais informações sobre o <filename> rc.conf </filename>.

source: Why is <command>rpc.statd</command> using 256 MB of memory?
de_de: Warum braucht <command>rpc.statd</command> 256 MB Speicher?
es_es: ¿Por que <command>rpc.statd</command> esta usando 256 MB de memoria?
pt_br: Por que o <command>rpc.statd</command> está usando 256 MB de memória?

source: No, there is no memory leak, and it is not using 256 MB of memory. For convenience, <command>rpc.statd</command> maps an obscene amount of memory into its address space. There is nothing terribly wrong with this from a technical standpoint; it just throws off things like <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>ps</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: Nein, das Programm hat kein Speicherleck und es verbraucht auch nicht 256 MB Speicher. <command>rpc.statd</command> projiziert nur einen übertrieben großen Speicherbereich in seinen eigenen Adressraum. Von einem rein technischen Standpunkt aus ist das nichts verwerfliches, allerdings verwirrt es Programme wie <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>ps</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: No, no hay ningún desbordamiento de memoria, y no esta usando 256 MB de memoria. Para comodidad, <command>rpc.statd</command> mapea una cantidad obscena de memoria a su espacio de direcciones. No hay nada horriblemente malo con esto desde un punto de vista técnico; solo desorienta a procesos como <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>ps</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Não, não há vazamento de memória e ele não está usando 256 MB de memória. Por conveniência, o <command>rpc.statd</command> mapeia uma quantidade obscena de memória em seu espaço de endereço. Não há nada terrivelmente errado com isso do ponto de vista técnico; mas isso confunde o <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> e o <citerefentry><refentrytitle>ps</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: <citerefentry><refentrytitle>rpc.statd</refentrytitle><manvolnum>8</manvolnum></citerefentry> maps its status file (resident on <filename>/var</filename>) into its address space; to save worrying about remapping it later when it needs to grow, it maps it with a generous size. This is very evident from the source code, where one can see that the length argument to <citerefentry><refentrytitle>mmap</refentrytitle><manvolnum>2</manvolnum></citerefentry> is <literal>0x10000000</literal>, or one sixteenth of the address space on an IA32, or exactly 256 MB.
de_de: <citerefentry><refentrytitle>rpc.statd</refentrytitle><manvolnum>8</manvolnum></citerefentry> projiziert seine Statusdatei (die in <filename>/var</filename> liegt) in seinen Adressraum. Um die Probleme zu vermeiden, die bei einer Vergrößerung dieser Projektion entstehen könnten, wird gleich ein möglichst großer Speicherbereich benutzt. Dies kann man sehr schön im Quellcode sehen: Die Längenangabe beim Aufruf von <citerefentry><refentrytitle>mmap</refentrytitle><manvolnum>2</manvolnum></citerefentry> ist <literal>0x10000000</literal>, ein sechzehntel des Adressraums bei IA32, oder genau 256 MB.
es_es: <citerefentry><refentrytitle>rpc.statd</refentrytitle><manvolnum>8</manvolnum></citerefentry> mapea su archivo de estado (residente en <filename>/var</filename>) a su espacio de direcciones; para evitar preocuparse acerca de remapearlo luego cuando necesite crecer, lo mapea con un tamaño generoso. Esto es muy evidente en el código fuente, donde es posible ver que el argumento de longitud de <citerefentry><refentrytitle>mmap</refentrytitle><manvolnum>2</manvolnum></citerefentry> es <literal>0x10000000</literal>, o un dieciseisavo del espacio de direcciones en IA32, o exactamente 256 MB.

source: Why can I not unset the <literal>schg</literal> file flag?
de_de: Warum kann ich das Dateiattribut <literal>schg</literal> nicht löschen?
es_es: ¿Por qué no puedo borrar la bandera de archivo <literal>schg</literal>?
pt_br: Por que não posso dar unset na flag <literal>schg</literal> de um arquivo?

source: The system is running a securelevel greater than 0. Lower the securelevel and try again. For more information, see <link linkend="securelevel">the <acronym>FAQ</acronym> entry on securelevel</link> and the <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page.
de_de: Sie betreiben das System mit einer erhöhten Sicherheitsstufe. Senken Sie die Sicherheitsstufe und versuchen Sie es dann noch einmal. Weitere Informationen erhalten Sie im <link linkend="securelevel"><acronym>FAQ</acronym> Eintrag über Sicherheitsstufen</link> und in der Manualpage <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: El sistema esta corriendo con un securelevel mayor a 0. Baje el securelevel e inténtelo de vuelta. Para mayor información vea <link linkend="securelevel">la entrada de <acronym>FAQ</acronym> de securelevel</link> y la página de manual de <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: What is <literal>vnlru</literal>?
de_de: Was ist <literal>vnlru</literal>?
es_es: ¿Qué es <literal>vnlru</literal>?
pt_br: O que é <literal>vnlru</literal>?

source: <literal>vnlru</literal> flushes and frees vnodes when the system hits the <varname>kern.maxvnodes</varname> limit. This kernel thread sits mostly idle, and only activates when there is a huge amount of RAM and users are accessing tens of thousands of tiny files.
de_de: <literal>vnlru</literal> schreibt vnodes auf Platte und gibt sie wieder frei, falls das System den Grenzwert <varname>kern.maxvnodes</varname> erreicht. Dieser Thread des Kernel tut meistens gar nichts und wird nur aktiv, wenn Sie extrem viel RAM haben und gleichzeitig auf viele zehntausende kleine Dateien zugreifen.
es_es: <literal>vnlru</literal> limpia y libera vnodes cuando el sistema llega al límite de <varname>kern.maxvnodes</varname>. Este hilo de kernel esta ocioso, y solo se activa cuando hay una cantidad enorme de RAM y los usuarios están accediendo a miles de archivos pequeños.
pt_br: O <literal>vnlru</literal> descarrega e libera vnodes quando o sistema atinge o limite de <varname>kern.maxvnodes</varname>. Essa thread do kernel fica ociosa na maior parte do tempo e só é ativada quando existe uma quantidade enorme de RAM e os usuários estiverem acessando dezenas de milhares de arquivos minúsculos.

source: What do the various memory states displayed by <command>top</command> mean?
de_de: Was bedeuten die Zustände, die <command>top</command> für Speicherseiten ausgibt?
es_es: ¿Qué significan los varios estados de memoria mostrados por <command>top</command>?
pt_br: O que os vários estados de memória exibidos pelo <command> top </command> significam?

source: <literal>Active</literal>: pages recently statistically used.
de_de: <literal>Active</literal>: Seiten, die vor Kurzem benutzt wurden.
es_es: <literal>Active</literal>: páginas recientes estadísticamente usadas.
pt_br: <literal>Active</literal>: são páginas usadas recentemente

source: <literal>Inactive</literal>: pages recently statistically unused.
de_de: <literal>Inactive</literal>: Seiten, die länger nicht benutzt wurden.
es_es: <literal>Inactive</literal>: páginas recientes estadísticamente sin uso.
pt_br: <literal>Inactive</literal>: são páginas que não foram utilizadas recentemente.

source: <literal>Cache</literal>: (most often) pages that have percolated from inactive to a status where they maintain their data, but can often be immediately reused (either with their old association, or reused with a new association). There can be certain immediate transitions from <literal>active</literal> to <literal>cache</literal> state if the page is known to be clean (unmodified), but that transition is a matter of policy, depending upon the algorithm choice of the VM system maintainer.
de_de: <literal>Cache</literal>: Meistens Seiten, die vorher im Zustand Inactive waren und noch gültige Daten enthalten. Diese Seiten können sofort in ihrem alten Kontext oder in einem neuen Kontext verwendet werden. Wenn eine Seite unverändert (clean) ist, kann ein Zustandswechsel direkt von <literal>Active</literal> nach <literal>Cache</literal> erfolgen. Ob dieser Zustandswechsel möglich ist, wird durch die Seitenersetzungsstrategie bestimmt, die der Entwickler des VM-Systems festgelegt hat.
es_es: <literal>Cache</literal>: (la mayor parte del tiempo) páginas que se cuelan del estado inactivo a un estado en donde mantienen sus datos, pero pueden con frecuencia ser inmediatamente reusadas (tanto con su vieja asociación, o reusadas con una nueva asociación). Puede haber ciertas transiciones inmediatas desde el estado <literal>active</literal> a <literal>cache</literal> si se sabe que la página esta limpia (sin modificar), pero esta transición es un asunto de políticas, dependiendo de la elección del algoritmo del mantenedor del sistema de VM.
pt_br: <literal>Cache</literal>: (na maioria das vezes) são páginas que foram filtradas de inativas para um status no qual elas mantêm seus dados, mas que podem ser reutilizadas imediatamente (com sua associação antiga ou reutilizadas com uma nova associação). Podem ocorrer certas transições imediatas do estado de <literal>ativa</literal> para o estado de <literal>cache</literal> se a página for conhecida por estar limpa (não modificada), mas essa transição é uma questão de política, dependendo da escolha do algoritmo do mantenedor do sistema de VM.

source: <literal>Free</literal>: pages without data content, and can be immediately used in certain circumstances where cache pages might be ineligible. Free pages can be reused at interrupt or process state.
de_de: <literal>Free</literal>: Seiten, die keine Daten enthalten. Diese Seiten können sofort benutzt werden, wenn Seiten im Zustand Cache nicht benutzt werden können. Seiten im Zustand Free können auch während eines Interrupts angefordert werden.
es_es: <literal>Free</literal>: páginas sin contenido de datos, y que pueden ser usadas inmediatamente en ciertas circunstancias donde las páginas de cache puedan no ser elegibles. Las páginas libres pueden ser reusadas en un estado de proceso o interrupción.
pt_br: <literal>Free</literal>: são páginas sem conteúdo de dados e que podem ser usadas imediatamente em determinadas circunstâncias, nas quais as páginas de cache podem estar inelegíveis. As páginas livres podem ser reutilizadas no estado de interrupção ou de processo.

source: <literal>Wired</literal>: pages that are fixed into memory, usually for kernel purposes, but also sometimes for special use in processes.
de_de: <literal>Wired</literal>: Seiten, die fest im Speicher liegen und nicht ausgelagert werden können. Normalerweise werden solche Seiten vom Kernel benutzt, manchmal werden Sie aber auch für spezielle Zwecke von Prozessen verwendet.
es_es: <literal>Wired</literal>: páginas que están fijas en memoria, usualmente para propósitos del kernel, pero a veces también para su uso especial en los procesos.
pt_br: <literal> Wired </literal>: são páginas que estão fixadas na memória, geralmente para propósitos do kernel, mas também para uso especial em processos.

source: Pages are most often written to disk (sort of a VM sync) when they are in the inactive state, but active pages can also be synced. This depends upon the CPU tracking of the modified bit being available, and in certain situations there can be an advantage for a block of VM pages to be synced, whether they are active or inactive. In most common cases, it is best to think of the inactive queue to be a queue of relatively unused pages that might or might not be in the process of being written to disk. Cached pages are already synced, not mapped, but available for immediate process use with their old association or with a new association. Free pages are available at interrupt level, but cached or free pages can be used at process state for reuse. Cache pages are not adequately locked to be available at interrupt level.
de_de: Seiten im Zustand Inactive werden oft auf Plattenspeicher geschrieben (sozusagen ein sync des VM-Systems). Wenn die CPU erkennen kann, das eine Seite unmodifiziert (clean) ist, kann auch eine Active-Seite auf den Plattenspeicher ausgeschrieben werden. In bestimmten Situationen ist es von Vorteil, wenn ein Block von VM-Seiten, unabhängig von seinem Zustand, ausgeschrieben werden kann. Die Inactive-Liste enthält wenig benutzte Seiten, die ausgeschrieben werden könnten. Seiten im Zustand Cached sind schon ausgeschrieben und stehen Prozessen für die Verwendung im alten oder in einem neuen Kontext zur Verfügung. Seiten im Zustand Cache sind nicht ausreichend geschützt und können während Unterbrechungen nicht benutzt werden.
es_es: Las páginas con frecuencia se escriben a disco (una especie de sincronización de VM) cuando están en el estado inactivo, pero las paginas activas también pueden sincronizarse. Esto depende del rastreo que haga CPU de la disponibilidad del bit de modificación, y en ciertas situaciones puede haber una ventaja para un bloque de páginas de VM al ser sincronizadas, tanto si están activas como inactivas. En la mayoría de los casos comunes, es mejor pensar de la cola inactiva como una cola de páginas relativamente sin usar que pueden o no estar en proceso de ser escritas a disco. La paginas en cache pueden estar ya sincronizadas, no mapeadas, pero disponibles para su uso inmediato por un proceso con su vieja asociación o con una nueva asociación. Las páginas libres están disponibles al nivel de interrupción, pero las páginas en cache o libres pueden ser usadas en el estado de proceso para ser reusadas. Las páginas en cache no se bloquean adecuadamente para estar disponibles al nivel de interrupción.
pt_br: As páginas geralmente são gravadas em disco (um tipo de sincronização de VM) quando elas estão no estado inativo, mas as páginas ativas também podem ser sincronizadas. Isso depende do rastreamento da CPU do bit modificado estar disponível e, em determinadas situações pode haver uma vantagem para um bloco de páginas da VM serem sincronizadas, estejam elas ativas ou inativas. Na maioria dos casos comuns, é melhor pensar na fila inativa como uma fila de páginas relativamente não usadas que podem ou não estar no processo de serem gravadas no disco. As páginas em cache já estão sincronizadas, não mapeadas, mas disponíveis para uso imediato do processo com sua associação antiga ou com uma nova associação. As páginas livres estão disponíveis no nível de interrupção, mas as páginas em cache ou livres podem ser usadas no estado do processo para reutilização. As páginas de cache não estão adequadamente bloqueadas para estarem disponíveis no nível de interrupção.

source: There are some other flags (e.g., busy flag or busy count) that might modify some of the described rules.
de_de: Die eben beschriebene Behandlung von Speicherseiten kann durch weitere Zustände (wie das Busy-Flag) verändert werden.
es_es: Hay algunas otras banderas There are some other flags (e.g., busy flag or busy count) que pueden modificar algunas de las reglas descritas.
pt_br: Existem alguns outros flags (por exemplo, flag de ocupado ou de contagem ocupada) que podem modificar algumas das regras descritas.

source: How much free memory is available?
de_de: Wie viel freien Speicher hat mein System?
es_es: ¿Cuánta memoria libre esta disponible?
pt_br: Quanta memória livre está disponível?
