Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Channel <literal>#FreeBSD</literal> on <link xlink:href="http://www.dal.net/">DALNET</link> is available at <systemitem>irc.dal.net</systemitem> in the US and <systemitem>irc.eu.dal.net</systemitem> in Europe.
de_de: Der Channel <literal>#FreeBSD</literal> im <link xlink:href="http://www.dal.net/">DALNET</link> ist in den USA unter <systemitem>irc.dal.net</systemitem> und in Europa unter <systemitem>irc.eu.dal.net verfügbar</systemitem>.
es_es: El canal <literal>#FreeBSD</literal> en <link xlink:href="http://www.dal.net/">DALNET</link> esta disponible en <systemitem>irc.dal.net</systemitem> en los Estados Unidos y <systemitem>irc.eu.dal.net</systemitem> en Europa.
pt_br: Canal <literal>#FreeBSD</literal> na <link xlink:href="http://www.dal.net/">DALNET</link> está disponível em <systemitem>irc.dal.net</systemitem> nos EUA e <systemitem>irc.eu.dal.net</systemitem> na Europa.

source: Channel <literal>#FreeBSD</literal> on <link xlink:href="http://www.undernet.org/">UNDERNET</link> is available at <systemitem>us.undernet.org</systemitem> in the US and <systemitem>eu.undernet.org</systemitem> in Europe. Since it is a help channel, be prepared to read the documents you are referred to.
de_de: Der Channel <literal>#FreeBSD</literal> im <link xlink:href="http://www.undernet.org/">UNDERNET</link> ist in den USA unter <systemitem>us.undernet.org</systemitem> und in Europa unter <systemitem>eu.undernet.org</systemitem> verfügbar. Es handelt sich hierbei um einen Hilfe-Channel, man wird Sie daher auf Dokumente verweisen, die Sie selbst lesen müssen.
es_es: El canal <literal>#FreeBSD</literal> en <link xlink:href="http://www.undernet.org/">UNDERNET</link> esta disponible en <systemitem>us.undernet.org</systemitem> en los Estados Unidos y <systemitem>eu.undernet.org</systemitem> en Europa. Dado que es un canal de ayuda, preparese para leer los documentos que se le recomiendan.
pt_br: O canal <literal>#FreeBSD</literal> na <link xlink:href="http://www.undernet.org/">UNDERNET</link> está disponível em <systemitem>us.undernet.org</systemitem> nos EUA e <systemitem>eu.undernet.org</systemitem> na Europa. Como é um canal de ajuda, prepare-se para ler os documentos aos quais você for direcionado.

source: Channel <literal>#FreeBSD</literal> on <link xlink:href="http://www.rusnet.org.ru/">RUSNET</link> is a Russian language channel dedicated to helping FreeBSD users. This is also good place for non-technical discussions.
de_de: Der Channel <literal>#FreeBSD</literal> im <link xlink:href="http://www.rusnet.org.ru/">RUSNET</link> ist ein russischsprachiger Channel, der sich der Unterstützung von FreeBSD-Anwendern verschrieben hat. Er ist auch ein guter Startpunkt für nichttechnische Diskussionen.
es_es: El canal <literal>#FreeBSD</literal> en <link xlink:href="http://www.rusnet.org.ru/">RUSNET</link> es un canal en ruso dedicado a ayudar usuarios de FreeBSD. También es un buen lugar para discusiones no técnicas.
pt_br: O canal <literal>#FreeBSD</literal> na <link xlink:href="http://www.rusnet.org.ru/">RUSNET</link> é um canal de língua russa dedicado a ajudar os usuários do FreeBSD. Este também é um bom lugar para discussões não técnicas.

source: Channel <literal>#bsdchat</literal> on <link xlink:href="http://freenode.net/">Freenode</link> is a Traditional Chinese (UTF-8 encoding) language channel dedicated to helping FreeBSD users. This is also good place for non-technical discussions.
de_de: Der Channel <literal>#bsdchat</literal> auf <link xlink:href="http://freenode.net/">Freenode</link> (Sprache: traditionelles Chinesisch, UTF-8-kodiert) hat sich der Unterstützung von FreeBSD-Anwendern verschrieben. Er ist auch ein guter Startpunkt für nichttechnische Diskussionen.
es_es: El canal <literal>#bsdchat</literal> en <link xlink:href="http://freenode.net/">Freenode</link> es un canal en chino tradicional (codificación UTF-8) dedicado a ayudar usuarios de FreeBSD. Este también es un buen lugar para discusiones no técnicas.
pt_br: O canal <literal>#bsdchat</literal> na <link xlink:href="http://freenode.net/">Freenode</link> é um canal de idioma chinês tradicional (codificação UTF-8) dedicado a ajudar os usuários do FreeBSD. Este também é um bom lugar para discussões não técnicas.

source: The FreeBSD wiki has a <link xlink:href="http://wiki.freebsd.org/IrcChannels">good list</link> of IRC channels.
de_de: Das FreeBSD Wiki enthält eine <link xlink:href="http://wiki.freebsd.org/IrcChannels">Liste</link> mit IRC Kanälen.
es_es: La wiki de FreeBSD tiene una <link xlink:href="http://wiki.freebsd.org/IrcChannels">buena lista</link> de canales IRC.

source: Each of these channels are distinct and are not connected to each other. Since their chat styles differ, try each to find one suited to your chat style.
de_de: Alle diese Kanäle unterscheiden sich voneinander und sind nicht miteinander verbunden. Ebenso unterscheiden sich die jeweiligen Chat-Stile, weshalb es sein kann, dass Sie zunächst alle Kanäle ausprobieren müssen, um den zu Ihrem Chat-Stil passenden zu finden.
es_es: Cada uno de estos canales es distinto y no esta conectado a los otros. Dado que sus estilos de conversacion pueden diferir, intente encontrar uno que se adecue a su estilo de conversación.
pt_br: Cada um destes canais são distintos e não estão conectados entre si. Como os estilos de bate-papo diferem, experimente cada um deles para encontrar um adequado ao seu estilo de bate-papo.

source: Are there any web based forums to discuss FreeBSD?
de_de: Gibt es irgendwelche webbasierten Foren, in denen FreeBSD diskutiert wird?
es_es: ¿Existen foros web para discutir acerca de FreeBSD?
pt_br: Existem fóruns na web para discutir o FreeBSD?

source: The official FreeBSD forums are located at <link xlink:href="https://forums.FreeBSD.org/">https://forums.FreeBSD.org/</link>.
de_de: Die offiziellen FreeBSD Foren befinden sich unter <link xlink:href="https://forums.FreeBSD.org/">https://forums.FreeBSD.org/</link>.
es_es: Los foros oficiales de FreeBSD estan ubicados en <link xlink:href="https://forums.FreeBSD.org/">https://forums.FreeBSD.org/</link>.
pt_br: Os fóruns oficiais do FreeBSD estão localizados em <link xlink:href="https://forums.FreeBSD.org/">https://forums.FreeBSD.org/</link>.

source: Where can I get commercial FreeBSD training and support?
de_de: Gibt es Firmen, die Training und Support für FreeBSD anbieten?
es_es: ¿Donde puedo obtener entrenamiento y soporte comercial de FreeBSD?
pt_br: Onde posso obter treinamento e suporte comercial para o FreeBSD?

source: <link xlink:href="http://www.ixsystems.com">iXsystems, Inc.</link>, parent company of the <link xlink:href="http://www.freebsdmall.com/">FreeBSD Mall</link>, provides commercial FreeBSD and PC-BSD software <link xlink:href="http://www.ixsystems.com/support">support</link>, in addition to FreeBSD development and tuning solutions.
de_de: <link xlink:href="http://www.ixsystems.com">iXsystems, Inc.</link>, die Muttergesellschaft der <link xlink:href="http://www.freebsdmall.com/">FreeBSD Mall</link>, bietet kommerziellen <link xlink:href="http://www.ixsystems.com/support">Support</link> für FreeBSD und TrueOS sowie FreeBSD-spezifische Softwareentwicklung und Hilfe bei Optimierung Ihrer vorhandenen Installationen.
es_es: <link xlink:href="http://www.ixsystems.com">iXsystems, Inc.</link>, compañia padre de <link xlink:href="http://www.freebsdmall.com/">FreeBSD Mall</link>, provee <link xlink:href="http://www.ixsystems.com/bsdsupport">soporte</link> comercial de software FreeBSD y PC-BSD, en adición a soluciones para el desarrollo y ajuste de FreeBSD.

source: BSD Certification Group, Inc. provides system administration certifications for DragonFly BSD, FreeBSD, NetBSD, and OpenBSD. Refer to <link xlink:href="http://www.BSDCertification.org">their site</link> for more information.
de_de: Die BSD Certification Group, Inc. bietet Zertifizierungen zur Systemadministration für DragonFly BSD, FreeBSD, NetBSD und OpenBSD. Besuchen Sie <link xlink:href="http://www.BSDCertification.org">deren Webseite</link> für weitere Informationen.
es_es: BSD Certification Group, Inc. PROVEE certificaciones de administración de sistemas para DragonFly BSD, FreeBSD, NetBSD, y OpenBSD. Vea <link xlink:href="http://www.BSDCertification.org">su sitio</link> para más información.
pt_br: A BSD Certification Group, Inc. fornece certificações de administração do sistema para o DragonFly BSD, FreeBSD, NetBSD e OpenBSD. Consulte <link xlink:href="http://www.BSDCertification.org">seu site</link> para maiores informações.

source: Any other organizations providing training and support should contact the Project to be listed here.
de_de: Wenn Ihre Firma oder Organisation ebenfalls Training und Support anbietet und hier genannt werden möchte, wenden Sie sich bitte an das FreeBSD Project.
es_es: Cualquier otra organización que provea entrenamiento y soporte deberá contactar al proyecto para ser listada aquí.
pt_br: Quaisquer outras organizações que forneçam treinamento e suporte devem entrar em contato com o Projeto FreeBSD para serem listadas aqui.

source: Installation
es_es: Instalación
pt_br: Instalação

source: Which platform should I download? I have a 64 bit capable <trademark class="registered">Intel</trademark> CPU, but I only see <literal>amd64</literal>.
de_de: Welche Plattform soll ich herunterladen? Ich habe eine 64-Bit-fähige <trademark class="registered">Intel</trademark> CPU, aber ich sehe nur <literal>amd64</literal>.
es_es: ¿Qué plataforma debería descargar? Tengo una CPU <trademark class="registered">Intel</trademark> con capacidad de 64 Bits, pero solo veo <literal>amd64</literal>.
pt_br: Qual plataforma devo baixar? Eu tenho uma CPU compatível com 64 bits <trademark class="registered">Intel</trademark>, mas eu só encontro <literal>amd64</literal>.

source: amd64 is the term FreeBSD uses for 64-bit compatible x86 architectures (also known as "x86-64" or "x64"). Most modern computers should use amd64. Older hardware should use i386. When installing on a non-x86-compatible architecture, select the platform which best matches the hardware.
de_de: Unter FreeBSD wird der Begriff amd64 für 64-Bit-kompatibel x86-Architekturen verwendet (auch als "x86-64" oder "x64" bekannt). Die meisten modernen Rechner sollten amd64 verwenden. Ältere Hardware sollte i386 verwenden. Wenn Sie FreeBSD auf einer nicht-x86-kompatible Architektur installieren, wählen Sie die Plattform, die am besten mit der verwendeten Hardware übereinstimmt.
es_es: amd64 es el término usado por BSD para las arquitectura de x86 compatibles con 64 bits (también conocido como "x86-64" o "x64"). La mayoría de las computadoras modernas deberían usar amd64. El hardware más antiguo debería usar i386. Al instalar en una arquitectura no compatible con x86, elija la plataforma que se aproxime mejor al hardware.
pt_br: amd64 é o termo que o FreeBSD usa para arquiteturas x86 compatíveis com 64 bits (também conhecidas como "x86-64" ou "x64"). Para a maioria dos computadores modernos você deve usar a opção amd64. Para hardware mais antigo você deve usar o i386. Ao instalar em uma arquitetura não compatível com x86, selecione a plataforma que melhor corresponda ao hardware.

source: Which file do I download to get FreeBSD?
de_de: Welche Datei muss ich herunterladen, um FreeBSD zu bekommen?
es_es: ¿Qué archivo descargo para obtener FreeBSD?
pt_br: Qual arquivo eu baixo para ter o FreeBSD?

source: On the <link xlink:href="http://www.freebsd.org/where.html">Getting FreeBSD</link> page, select <literal>[iso]</literal> next to the architecture that matches the hardware.
de_de: Auf der Seite <link xlink:href="http://www.freebsd.org/de/where.html">Download FreeBSD</link> können Sie das <literal>[iso]</literal> für die entsprechende Hardware wählen.
es_es: En la página <link xlink:href="http://www.freebsd.org/where.html">Obteniendo FreeBSD</link> elija <literal>[iso]</literal> al lado de la arquitectura que coincide con el hardware.

source: Any of the following can be used:
de_de: Sie können eine der folgenden Dateien wählen:
es_es: Cualquiera de los siguientes puede ser usado:
pt_br: Qualquer um dos itens a seguir pode ser usado:

source: file
de_de: Datei
es_es: archivo
pt_br: arquivo

source: description
de_de: Beschreibung
es_es: descripción
pt_br: descrição

source: Contains enough to install FreeBSD and a minimal set of packages.
de_de: Enthält die FreeBSD Installation und einen minimalen Satz an Paketen.
es_es: Contiene lo suficiente para instalar FreeBSD y un set de paquetes mínimo.
pt_br: Contém o suficiente para instalar o FreeBSD e um conjunto mínimo de pacotes.

source: Similar to <filename>disc1.iso</filename> but with additional packages.
de_de: Ähnlich wie <filename>disc1.iso</filename>, aber mit zusätzlichen Paketen.
es_es: Similar a <filename>disc1.iso</filename> pero con paquetes adicionales.
pt_br: Semelhante ao <filename>disc1.iso</filename>, mas com pacotes adicionais.

source: A bootable image sufficient for writing to a USB stick.
de_de: Enthält ein bootfähiges Image, das Sie auf einem USB-Stick speichern können.
es_es: Una imagen arrancable, suficiente para escribir a un dispositivo USB.
pt_br: Uma imagem inicializável para se gravar em um pendrive.

source: A minimal image that requires network access during installation to completely install FreeBSD.
de_de: Ein minimales Image, das für die Installation von FreeBSD Netzwerkzugriff benötigt.
es_es: Una imagen mínima que requiere acceso a la red durante la instalación para instalar completamente FreeBSD.
pt_br: Uma imagem mínima e que requer acesso à rede durante a instalação para que possa instalar completamente o FreeBSD.

source: pc98 users require these floppy images: <filename>floppies/boot.flp</filename>, <filename>floppies/kern1.flp</filename>, <filename>floppies/kern2.flp</filename>, and <filename>floppies/mfsroot1.flp</filename>. These images need to be written onto floppies by tools like <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: pc98-Benutzer benötigen drei Floppy-Images: <filename>floppies/boot.flp</filename>, <filename>floppies/kern1.flp</filename>, <filename>floppies/kern2.flp</filename>, und <filename>floppies/mfsroot1.flp</filename>. Diese Images müssen mit Hilfe von Werkzeugen wie <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry> auf Disketten kopiert werden.
es_es: Los usuarios de pc98 requerirán las siguientes imágenes de disquete: <filename>floppies/boot.flp</filename>, <filename>floppies/kern1.flp</filename>, <filename>floppies/kern2.flp</filename>, y <filename>floppies/mfsroot1.flp</filename>. Estas imagenes necesitaran ser escritas a disquetes por herramientas como <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Full instructions on this procedure and a little bit more about installation issues in general can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">Handbook entry on installing FreeBSD</link>.
de_de: Eine vollständige Anleitung für dieses Vorgehen und weitere Informationen zur Installation finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">Handbucheintrag zur Installation von FreeBSD</link>.
es_es: Instrucciones completas acerca de este procedimiento y mas información acerca de problemas de instalación en general puede encontrarse en este la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">entra de manual acerca de instalar FreeBSD</link>.
pt_br: Instruções completas sobre este procedimento e um pouco mais sobre problemas de instalação em geral podem ser encontradas na seção do Handbook <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">sobre instalação do FreeBSD</link>.

source: What do I do if the install image does not boot?
de_de: Was mache ich, wenn das Image nicht bootet?
es_es: ¿Qué debo hacer si la imagen de instalación no arranca?
pt_br: O que eu faço se a imagem de instalação não inicializar?

source: This can be caused by not downloading the image in <emphasis>binary</emphasis> mode when using <acronym>FTP</acronym>.
de_de: Stellen Sie sicher, dass Sie das Image im <emphasis>binary</emphasis>-Modus herunterladen, wenn Sie <acronym>FTP</acronym> verwenden.
es_es: Esto puede ser ocasionado por no descargar la imagen en modo <emphasis>binary</emphasis> al usar<acronym>FTP</acronym>.
pt_br: Isso pode ocorrer caso você não tenha baixado a imagem no modo <emphasis>binário</emphasis> ao usar o <acronym>FTP</acronym>.

source: Some FTP clients default their transfer mode to <emphasis>ascii</emphasis> and attempt to change any end-of-line characters received to match the conventions used by the client's system. This will almost invariably corrupt the boot image. Check the SHA-256 checksum of the downloaded boot image: if it is not <emphasis>exactly</emphasis> that on the server, then the download process is suspect.
de_de: Einige FTP-Clients benutzen als Voreinstellung den <emphasis>ascii</emphasis>-Modus und versuchen, alle Zeilenendezeichen an das Zielsystem anzupassen. Dadurch wird das Boot-Image fast immer unbrauchbar. Überprüfen Sie daher die SHA-256 Prüfsumme des heruntergeladenen Boot-Images: wenn diese nicht <emphasis>genau</emphasis> mit der Prüfsumme auf dem Server übereinstimmt, sollten Sie das Image verwerfen und den Download erneut versuchen.
es_es: Algunos clientes FTP tienen por defecto el modo de transferencia <emphasis>ascii</emphasis> e intentan cambiar cualquier carácter de fin de línea para que use las convenciones del sistema del cliente. Esto con toda probabilidad corromperá la imagen de arranque. Verifique el checksum SHA-256 de la imagen de arranque descargada: si es <emphasis>exactamente</emphasis> la imagen que se encuentra en el servidor, entonces el proceso de descarga es el sospechoso.
pt_br: Alguns clientes FTP padronizam seu modo de transferência para <emphasis>ascii</emphasis> e tentam alterar quaisquer caracteres de end-of-line recebidos para corresponder às convenções usadas pelo sistema do cliente. Isso quase invariavelmente corromperá a imagem de inicialização. Verifique checksum SHA-256 da imagem de inicialização baixada: se não estiver<emphasis>exatamente</emphasis> como no servidor, o processo de download pode ter corrompido o arquivo.

source: When using a command line FTP client, type <emphasis>binary</emphasis> at the FTP command prompt after getting connected to the server and before starting the download of the image.
de_de: Wenn Sie einen FTP-Client für die Kommandozeile benutzen, geben Sie am FTP-Prompt <emphasis>binary</emphasis> ein, nachdem Sie sich mit dem Server verbunden haben und bevor Sie das Image herunterladen.
es_es: Cuando use un cliente de FTP por línea de comandos, escriba <emphasis>binary</emphasis> en la pantalla de comandos FTP luego de conectarse al servidor y antes de comenzar a descargar la imagen.
pt_br: Ao usar um cliente FTP de linha de comando, digite <emphasis>binary</emphasis> no prompt de comando FTP depois de se conectar ao servidor e antes de iniciar o download da imagem.

source: Where are the instructions for installing FreeBSD?
de_de: Wo befinden sich die Anweisungen zur Installation von FreeBSD?
es_es: ¿Cuáles son las instrucciones para instalar FreeBSD?
pt_br: Onde estão as instruções para instalar o FreeBSD?

source: Installation instructions can be found at <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">Handbook entry on installing FreeBSD</link>.
de_de: Installationsanleitungen finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/bsdinstall.html">Handbucheintrag zur Installation von FreeBSD</link>.
es_es: Las instrucciones de instalación pueden encontrarse en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">la entrada del manual acerca de instalar FreeBSD</link>.
pt_br: As instruções para instalação podem ser encontradas na seção do Handbook <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html">sobre instalação do FreeBSD</link>.

source: What are the minimum requirements to run FreeBSD?
de_de: Was sind die Mindestanforderungen zum Betrieb von FreeBSD?
es_es: ¿Cuáles son los requisitos mínimos para correr FreeBSD?
pt_br: Quais são os requisitos mínimos para executar o FreeBSD?

source: FreeBSD requires a 486 or better PC, 64 MB or more of RAM, and at least 1.1 GB of hard disk space.
de_de: Der Betrieb von FreeBSD erfordert mindestens einen 486er Prozessor, 64 MB RAM sowie mindestens 1.1 GB an Festplattenspeicher.
es_es: FreeBSD requiere una PC 486 o mejor PC, 64 MB o más de RAM, y como mínimo 1.1 GB de espacio en el disco rígido.
pt_br: O FreeBSD requer um PC 486 ou melhor, 64 MB ou mais de RAM e pelo menos 1.1 GB de espaço em disco.

source: How can I make my own custom release or install disk?
de_de: Wie kann ich ein angepasstes Installationsmedium erstellen?
es_es: ¿Como puedo hacer mi propia versión personalizada o disco de instalación?
pt_br: Como posso criar minha própria versão personalizada ou disco de instalação?

source: Customized FreeBSD installation media can be created by building a custom release. Follow the instructions in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link> article.
de_de: Individuelle FreeBSD Installationsmedien können über den Bau eines Releases erzeugt werden. Folgen Sie den Anweisungen im Artikel <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link>.
es_es: Medios de instalación personalizados de FreeBSD pueden crearse compilando una versión personalizada. Siga las instrucciones en el artículo de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Ingeniería de Lanzamientos </link>.
pt_br: Uma mídia customizada de instalação do FreeBSD pode ser criada através da construção de uma release personalizada. Siga as instruções do artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/article.html">Release Engineering</link>.

source: Can <trademark class="registered">Windows</trademark> co-exist with FreeBSD?
de_de: Kann <trademark class="registered">Windows</trademark> neben FreeBSD existieren?
es_es: ¿Puede <trademark class="registered">Windows</trademark> coexistir con FreeBSD?
pt_br: O <trademark class="registered">Windows</trademark> pode coexistir com o FreeBSD?
