Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: When using an external modem, try using <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> to see if the <acronym>TD</acronym> light is flashing when data is transmitted. If it flashes but the <acronym>RD</acronym> light does not, the problem is with the remote end. If <acronym>TD</acronym> does not flash, the problem is local. With an internal modem, use the <literal>set server</literal> command in <filename>ppp.conf</filename>. When the hang occurs, connect to <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> using <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. If the network connection suddenly revives due to the activity on the diagnostic socket, or if it will not connect but the <literal>set socket</literal> command succeeded at startup time, the problem is local. If it can connect but things are still hung, enable local logging with <literal>set log local async</literal> and use <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> from another window or terminal to make use of the link. The async logging will show the data being transmitted and received on the link. If data is going out and not coming back, the problem is remote.
de_de: Wenn Sie ein externes Modem benutzen, können Sie versuchen, <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu benutzen, um zu sehen, ob die <acronym>TD</acronym>-Anzeige aufleuchtet, wenn Daten übertragen werden. Falls sie aufleuchtet (und die <acronym>RD</acronym>-Anzeige nicht), liegt das Problem am anderen Ende. Falls <acronym>TD</acronym> nicht aufleuchtet, handelt es sich um ein lokales Problem. Bei einem internen Modem müssen Sie den Befehl <literal>set server</literal> in <filename>ppp.conf</filename> benutzen. Stellen Sie über <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> eine Verbindung zu <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> her, wenn die Verbindung hängt. Falls die Netzwerkverbindung plötzlich wieder funktioniert (ppp wurde durch die Aktivität auf dem Diagnose-Socket wiederbelebt) oder Sie keine Verbindung bekommen (vorausgesetzt, der Befehl <literal>set socket</literal> wurde beim Start erfolgreich ausgeführt), handelt es sich um ein lokales Problem. Falls Sie eine Verbindung bekommen und die externe Verbindung weiterhin hängt, aktivieren Sie lokales asynchrones Logging mit <literal>set log local async</literal> und benutzen Sie <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> von einem anderen Fenster oder Bildschirm aus, um die externe Verbindung zu benutzen. Das asynchrone Logging zeigt, welche Daten über die Verbindung gesendet und empfangen werden. Falls Daten hinausgehen, aber nicht zurückkommen, handelt es sich um ein externes Problem.
es_es: Al usar un modem externo, intente usar <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ver si la luz <acronym>TD</acronym> se enciendie cuando se transmiten datos. Si se enciende pero la luz <acronym>RD</acronym> no, el problema esta en el otro extremo. Si <acronym>TD</acronym> no se enciende, el problema es local. Con un modem interno, use el comando <literal>set server</literal> en <filename>ppp.conf</filename>. Cuando el cuelgue ocurra, conéctese a <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> usando <citerefentry><refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Si la conexión a la red súbitamente revive debido a la actividad en el socket de diagnóstico, o si no se conecta pero debido al comando <literal>set socket</literal> tiene éxito en tiempo de inicio, el problema es local. Si puede conectarse pero continúan los cuelgues, habilite los logs locales con<literal>set log local async</literal> y use <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> desde otra ventana o terminal para hacer uso del link. El log asincrónico another mostrara los datos siendo transmitidos y recibidos en el link. Si los datos salen pero nunca vuelven, el problema es remoto.
pt_br: Ao usar um modem externo, tente usar <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ver se a luz de <acronym>TD</acronym> está piscando quando os dados são transmitidos . Se piscar, mas a luz de <acronym>RD</acronym> não, o problema é com a extremidade remota. Se <acronym>TD</acronym> não piscar, o problema é local. Com um modem interno, use o comando <literal>set server</literal> em <filename>ppp.conf</filename>. Quando o problema ocorrer, conecte-se ao <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> usando <citerefentry> <refentrytitle>pppctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Se a conexão de rede reviver repentinamente devido à atividade no socket de diagnóstico ou se não se conectar, mas o comando <literal>set socket</literal> for bem-sucedido na inicialização, o problema é local. Se ele puder se conectar, mas as coisas ainda estiverem travadas, ative o log local com <literal>set log local async</literal> e use <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> de outra janela ou terminal para fazer uso do link. O registro assíncrono mostrará os dados sendo transmitidos e recebidos no link. Se os dados estão saindo e não voltando, o problema é remoto.

source: Having established whether the problem is local or remote, there are now two possibilities:
de_de: Wenn Sie festgestellt haben, ob es sich um ein lokales oder um ein externes Problem handelt, haben Sie zwei Möglichkeiten:
es_es: Habiendo establecido si el problema es local o remoto, existen dos posibilidades:
pt_br: Tendo estabelecido se o problema é local ou remoto, existem agora duas possibilidades:

source: If the problem is remote, read on entry <xref linkend="ppp-remote-not-responding"/>.
de_de: Wenn es ein externes Problem ist, lesen Sie bei <xref linkend="ppp-remote-not-responding"/> weiter.
es_es: Si el problema es remoto, lea la entrada <xref linkend="ppp-remote-not-responding"/>.
pt_br: Se o problema for remoto, leia a entrada <xref linkend="ppp-remote-not-responding"/>.

source: If the problem is local, read on entry <xref linkend="ppp-hung"/>.
de_de: Handelt es sich um ein lokales Problem, lesen Sie bitte <xref linkend="ppp-hung"/>.
es_es: Si el problema es local, lea la entrada <xref linkend="ppp-hung"/>.
pt_br: Se o problema é local, leia a entrada <xref linkend="ppp-hung"/>.

source: The remote end is not responding. What can I do?
de_de: Was kann ich machen, wenn die Gegenstelle nicht antwortet?
es_es: El extremo remoto no responde. ¿Qué hago?
pt_br: A ponta remota não está respondendo. O que eu posso fazer?

source: There is very little that can be done about this. Many ISPs will refuse to help users not running a <trademark class="registered">Microsoft</trademark> OS. Add <literal>enable lqr</literal> to <filename>/etc/ppp/ppp.conf</filename>, allowing <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to detect the remote failure and hang up. This detection is relatively slow and therefore not that useful.
de_de: Hier können Sie wenig tun. Die meisten ISPs werden ablehnen, Ihnen zu helfen, wenn Sie kein Betriebssystem von <trademark class="registered">Microsoft</trademark> benutzen. Sie können <literal>enable lqr</literal> in <filename>/etc/ppp/ppp.conf</filename> angeben, wodurch <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ermöglicht wird, ein externes Versagen zu erkennen und aufzulegen. Jedoch ist diese Erkennung relativ langsam und deshalb nicht besonders nützlich.
es_es: Puede hacerse muy poco acerca de esto. Muchos ISPs se rehúsan a ayudar a los usuarios que no corran <trademark class="registered">Microsoft</trademark> OS. Agregue <literal>enable lqr</literal> a <filename>/etc/ppp/ppp.conf</filename>, permitiendo <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detectar el fallo o cuelgue remoto. Esta detección es relativamente lenta y por consiguiente no muy útil.
pt_br: Há muito pouco que pode ser feito sobre isso. Muitos ISPs recusam-se a ajudar usuários que não estejam executando um SO da <trademark class="registered">Microsoft</trademark>. Adicione <literal>enable lqr</literal> ao <filename>/etc/ppp/ppp.conf</filename>, permitindo <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detectar a falha remota e desligar. Essa detecção é relativamente lenta e, portanto, não é tão útil.

source: First, try disabling all local compression by adding the following to the configuration:
de_de: Versuchen Sie zunächst, jegliche Datenkompression auszuschalten, indem Sie folgendes zur Konfiguration hinzufügen:
es_es: Primero, intente deshabilitar toda la compresión local agregando lo siguiente a la configuración:
pt_br: Primeiro, tente desativar toda a compactação local adicionando o seguinte à configuração:

source: Then reconnect to ensure that this makes no difference. If things improve or if the problem is solved completely, determine which setting makes the difference through trial and error. This is good information for the ISP, although it may make it apparent that it is not a <trademark class="registered">Microsoft</trademark> system.
de_de: Stellen Sie nun wieder eine Verbindung her, um festzustellen, ob sich etwas geändert hat. Falls es nun besser läuft oder falls das Problem vollständig behoben ist, versuchen Sie durch schrittweises Ändern der Einstellungen festzustellen, welche Einstellung den Unterschied bewirkt. Hierdurch erhalten Sie schlüssige Fakten für ein Gespräch mit dem ISP. Andererseits wird hierdurch offensichtlich, dass Sie kein <trademark class="registered">Microsoft</trademark>-System benutzen.
es_es: Luego reconectese para asegurarse de que esto no hace la diferencia. Si las cosas mejoran o si el problema se soluciona por completo, determine que ajuste hace la diferencia mediante prueba y error. Esta es información útil para el ISP, aunque puede evidenciar que este no es un sistema <trademark class="registered">Microsoft</trademark>.
pt_br: Em seguida, reconecte para garantir que isso não faz diferença. Se as coisas melhorarem ou se o problema for resolvido completamente, determine qual configuração faz a diferença através de tentativa e erro. Esta é uma boa informação para o ISP, embora possa tornar aparente que não é um sistema <trademark class="registered">Microsoft</trademark>.

source: Before contacting the ISP, enable async logging locally and wait until the connection hangs again. This may use up quite a bit of disk space. The last data read from the port may be of interest. It is usually ASCII data, and may even describe the problem (<errorname>Memory fault</errorname>, <errorname>Core dumped</errorname>).
de_de: Aktivieren Sie asynchrones Logging und warten Sie, bis die Verbindung wieder hängt, bevor Sie sich an den ISP wenden. Hierzu kann einiges an Plattenplatz nötig sein. Die Daten, die als letztes von dem Port gelesen wurden, könnten von Interesse sein. Für gewöhnlich handelt es sich um ASCII-Text, der sogar den Fehler beschreiben kann (<errorname>Memory fault</errorname>, <errorname>Core dumped</errorname>).
es_es: Antes de contactar el ISP, habilite el logueo asincrónico localmente y espere a que la conexión se cuelgue nuevamente. Esto puede usar bastante espacio de disco. La última lectura de datos del puerto puede ser interesante. Usualmente se trata de datos ASCII, y puede incluso describir el problema (<errorname>Memory fault</errorname>, <errorname>Core dumped</errorname>).
pt_br: Antes de entrar em contato com o ISP, ative o registro assíncrono localmente e aguarde até que a conexão seja interrompida novamente. Isso pode usar um pouco de espaço em disco. Os últimos dados lidos da porta podem ser de interesse. Geralmente são dados ASCII e podem até descrever o problema (<errorname>Memory fault</errorname>, <errorname>Core dumped</errorname>).

source: If the ISP is helpful, they should be able to enable logging on their end, then when the next link drop occurs, they may be able to tell why their side is having a problem.
de_de: Falls der ISP hilfsbereit ist, sollte er in der Lage sein, an seinem Ende das Logging zu aktivieren und wenn das nächste Mal die Verbindung abbricht, könnte er Ihnen mitteilen, worin das Problem auf seiner Seite besteht.
es_es: Si el ISP es servicial, deberían poder habilitar logueo en su extremo, luego cuando la siguiente desconexión ocurra, podrían ser capaces de decir porque su extremo tiene un problema.
pt_br: Se o ISP for útil, eles devem ser capazes de habilitar o log em sua finalização, então quando o próximo link falhar, eles poderão dizer por que seu lado está tendo um problema.

source: <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> has hung. What can I do?
de_de: Was kann ich tun, wenn sich <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> aufhängt?
es_es: <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> se colgó. ¿Qué puedo hacer?
pt_br: <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> foi desativado. O que eu posso fazer?

source: In this case, rebuild <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> with debugging information, and then use <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> to grab a stack trace from the <application>ppp</application> process that is stuck. To rebuild the <application>ppp</application> utility with debugging information, type:
de_de: In diesem Fall erstellen Sie am besten <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> mit Debugging-Informationen neu und benutzen dann <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry>, um von dem hängenden <application>ppp</application>-Prozess eine Aufzeichnung des Stacks zu erstellen. Um die <application>ppp</application>-Anwendung mit Debugging-Informationen zu übersetzen, geben Sie folgendes ein:
es_es: En este caso, recompile <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> con información de debug, y luego use <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para obtener un stack trace desde el proceso de <application>ppp</application> que esta parado. Para recompilar la utilidad <application>ppp</application> con información de debug, escriba:
pt_br: Nesse caso, reconstrua o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> com informações de depuração e, em seguida, use <citerefentry><refentrytitle>gdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> para pegar um rastrear uma pilha do processo <application>ppp</application> que está travado. Para reconstruir o utilitário <application>ppp</application> com informações de depuração, digite:

source: Then, restart <application>ppp</application> and wait until it hangs again. When the debug build of <application>ppp</application> hangs, start <application>gdb</application> on the stuck process by typing:
de_de: Anschließend starten Sie <application>ppp</application> neu und warten darauf, dass es wieder hängt. Wenn die Debug-Version von <application>ppp</application> hängt, starten Sie <application>gdb</application> für den steckengebliebenen Prozess, indem Sie folgendes eingeben:
es_es: Luego, reinicie <application>ppp</application> y espere a que se cuelgue nuevamente. Cuando la compilación de depuración de <application>ppp</application> se cuelgue, inicie <application>gdb</application> en el proceso que se colgó escribiendo:
pt_br: Em seguida, reinicie o <application>ppp</application> e espere até que ele seja interrompido novamente. Quando a compilação de depuração do <application>ppp</application> é interrompida, inicie o <application>gdb</application> no processo travado digitando:

source: At the <application>gdb</application> prompt, use the <command>bt</command> or <command>where</command> commands to get a stack trace. Save the output of the <application>gdb</application> session, and <quote>detach</quote> from the running process by typing <command>quit</command>.
de_de: An der Eingabeaufforderung von <application>gdb</application> können Sie die Befehle <command>bt</command> oder <command>where</command> benutzen, um eine Aufzeichnung des Stacks zu erhalten. Speichern Sie die Ausgabe der <application>gdb</application>-Sitzung und <quote>trennen</quote> Sie den laufenden Prozess mit <command>quit</command>.
es_es: En la consola de <application>gdb</application>, use los comandos <command>bt</command> o <command>where</command> para obtener un stack trace. Guarde la salida de la sesión de <application>gdb</application>, y <quote>separese</quote> del proceso que esta corriendo escribiendo <command>quit</command>.
pt_br: No prompt <application>gdb</application>, use os comandos <command> bt </command> ou <command> where </command> para obter um rastreamento de pilha. Salve a saída da sessão <application> gdb </application> e <quote> desconecte </quote> do processo em execução, digitando <command> quit </command>.

source: I keep seeing errors about magic being the same. What does it mean?
de_de: Ich sehe ständig Fehlermeldungen über gleiche <quote>Magic Numbers</quote> Was heißt das?
es_es: Sigo viendo errores acerca de que la magia es la misma. ¿Qué significan?
pt_br: Eu continuo vendo erros sobre a magia sendo a mesma. O que isso significa?

source: Occasionally, just after connecting, there may be messages in the log that say <errorname>Magic is same</errorname>. Sometimes, these messages are harmless, and sometimes one side or the other exits. Most PPP implementations cannot survive this problem, and even if the link seems to come up, there will be repeated configure requests and configure acknowledgments in the log file until <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> eventually gives up and closes the connection.
de_de: Nach dem Aufbau einer Verbindung kann es sein, dass Sie in der Logdatei gelegentlich Meldungen mit dem Hinweis <errorname>magic is the same</errorname> sehen. Manchmal sind diese Meldungen harmlos und manchmal bricht die eine oder andere Seite die Verbindung ab. Die meisten Implementierungen von PPP können dieses Problem nicht handhaben und Sie werden wiederholte Konfigurationsanforderungen und -bestätigungen in der Logdatei finden, bis <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> schließlich aufgibt und die Verbindung beendet.
es_es: Ocasionalmente, justo después de conectare, puede haber mensajes en el log que digan <errorname>Magic is same</errorname>. A veces, estos mensajes son inofensivos, y a veces un lado u el otro sale. La mayoría de las implementaciones de PPP no pueden sobrevivir a este problema, incluso si el link parace activarse, habrá pedidos de configuración repetidos y reconocimientos de configuración en el archivo de log hasta que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> eventualmente se rinda y cierre la conexión.
pt_br: Ocasionalmente, logo após a conexão, pode haver mensagens no log que digam que <errorname>Magic é o mesmo</errorname>. Às vezes, essas mensagens são inofensivas e, às vezes, um lado ou outro termina. A maioria das implementações do PPP não pode sobreviver a esse problema, e mesmo se o link aparecer, haverá solicitações de configuração repetidas e configuração de reconhecimentos no arquivo de log até que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> eventualmente desiste e fecha a conexão.
