Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: When opening <filename>/dev/ttydX</filename> in blocking mode, a process will wait for the corresponding <filename>cuadX</filename> device to become inactive, and then wait for the carrier detect line to go active. When the <filename>cuadX</filename> device is opened, it makes sure the serial port is not already in use by the <filename>ttydX</filename> device. If the port is available, it steals it from the <filename>ttydX</filename> device. Also, the <filename>cuadX</filename> device does not care about carrier detect. With this scheme and an auto-answer modem, remote users can log in and local users can still dial out with the same modem and the system will take care of all the conflicts.
de_de: Wird <filename>/dev/ttydX</filename> im blockierenden Modus geöffnet, wartet ein Prozess darauf, dass das entsprechende <filename>cuadX</filename> Gerät inaktiv und der Empfangssignalpegel aktiv ist. Wird das <filename>cuadX</filename> Gerät geöffnet, vergewissert es sich, dass die serielle Schnittstelle nicht bereits von dem <filename>ttydX</filename> Gerät in Gebrauch ist. Sollte die Schnittstelle verfügbar sein, <quote>stiehlt</quote> es sie von dem <filename>ttydX</filename> Gerät. Das <filename>cuadX</filename> Gerät kümmert sich nicht um Trägersignalerkennung. Mit diesem Schema und einem automatisch antwortenden Modem, können sich Benutzer von aussen einloggen, Sie können weiterhin mit demselben Modem wählen und das System kümmert sich um die Konflikte.
es_es: Al abrir <filename>/dev/ttydX</filename> en modo bloqueante, un proceso esperara a que el correspondiente dispositivo <filename>cuadX</filename> se vuelva inactivo, y luego espera a que la línea de detección del portador pase a estar activa. Cuando el dispositivo <filename>cuadX</filename> es abierto, se asegura de que el puerto en serie no este ya en uso por el dispositivo <filename>ttydX</filename>. Si el puerto esta disponible, se lo roba al dispositivo <filename>ttydX</filename>. Además, el dispositivo <filename>cuadX</filename> no se preocupa por la detección del portador. Con este esquema y un modem de auto-respuesta, los usuarios remotos pueden autenticarse y los usuarios locales aún pueden marcar fuera con el mismo modem y el sistema se ocupara de todos los conflictos.
pt_br: Ao abrir <filename>/dev/ttydX</filename> no modo de bloqueio, um processo aguardará o dispositivo <filename>cuadX</filename> correspondente ficar inativo e, em seguida, aguardar a ativação da linha de detecção. Quando o dispositivo <filename>cuadX</filename> é aberto, ele garante que a porta serial não esteja em uso pelo dispositivo <filename>ttydX</filename>. Se a porta estiver disponível, ela a rouba do dispositivo <filename>ttydX</filename>. Além disso, o dispositivo <filename>cuadX</filename> não se importa com a detecção da portadora. Com este esquema e um modem de resposta automática, os usuários remotos podem efetuar login e os usuários locais ainda podem discar com o mesmo modem e o sistema cuidará de todos os conflitos.

source: How do I enable support for a multi-port serial card?
de_de: Wie kann ich die Unterstützung für eine Karte mit mehreren seriellen Schnittstellen aktivieren?
es_es: ¿Como habilito el soporte para una tarjeta en serie multipuertos?
pt_br: Como habilitar o suporte para uma placa serial com várias portas?

source: The section on kernel configuration provides information about configuring the kernel. For a multi-port serial card, place an <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> line for each serial port on the card in the <citerefentry vendor="current"><refentrytitle>device.hints</refentrytitle><manvolnum>5</manvolnum></citerefentry> file. But place the IRQ specifiers on only one of the entries. All of the ports on the card should share one IRQ. For consistency, use the last serial port to specify the IRQ. Also, specify the following option in the kernel configuration file:
de_de: Der Abschnitt über die Kernelkonfiguration bietet Informationen darüber, wie Sie den Kernel konfigurieren. Für eine Karte mit mehreren seriellen Schnittstellen, schreiben Sie eine <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> Zeile für jede serielle Schnittstelle auf der Karte in die Datei <citerefentry vendor="current"><refentrytitle>device.hints</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Aber achten Sie darauf, den IRQ nur in einem der Einträge zu platzieren. Alle seriellen Schnittstellen auf der Karte sollten sich einen IRQ teilen. Daher sollten Sie den IRQ nur beim letzten Eintrag angeben. Aktivieren Sie auch die folgende Option in der Kernelkonfigurationsdatei:
es_es: La sección acerca de configuración del kernel provee información acerca de configurar el kernel. Para una tarjeta en serie multipuertos, coloque una línea <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> por cada puerte en serie en la tarjeta en el archivo <citerefentry vendor="current"><refentrytitle>device.hints</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Pero coloque los especificadores IRQ en solo una de las entradas. Todos los puertos en la tarjeta deberían compartir un solo IRQ. Por consistencia, use el último puerto en serie para especificar el IRQ. También especifique la siguiente opción en el archivo de configuración del kernel:
pt_br: A seção sobre configuração do kernel fornece informações sobre como configurar o kernel. Para uma placa serial com várias portas, coloque uma linha <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> para cada porta serial na placa no <citerefentry vendor="current"><refentrytitle>device.hints</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Mas coloque os especificadores de IRQ em apenas uma das entradas. Todas as portas no cartão devem compartilhar um IRQ. Para consistência, use a última porta serial para especificar o IRQ. Além disso, especifique a seguinte opção no arquivo de configuração do kernel:

source: The following <filename>/boot/device.hints</filename> example is for an AST 4-port serial card on IRQ 12:
de_de: Das folgende <filename>/boot/device.hints</filename> Beispiel ist geeignet für eine AST Karte mit 4 seriellen Schnittstellen, die IRQ 12 benutzt:
es_es: El siguiente ejemplo de <filename>/boot/device.hints</filename> es para una tarjeta en serie AST de 4 puertos en IRQ 12:
pt_br: O exemplo a seguir <filename>/boot/device.hints</filename> é para uma placa serial AST de 4 portas no IRQ 12:

source: The flags indicate that the master port has minor number <literal>7</literal> (<literal>0x700</literal>), and all the ports share an IRQ (<literal>0x001</literal>).
de_de: Die Flags zeigen an, dass die Master-Schnittstelle die Minor-Nummer <literal>7</literal> (<literal>0x700</literal>) hat und dass sich alle Schnittstellen einen IRQ (<literal>0x001</literal>) teilen.
es_es: Estas banderas indican que el puerto maestro tiene un número menor <literal>7</literal> (<literal>0x700</literal>), y que todos los puertos comparten un IRQ (<literal>0x001</literal>).
pt_br: Os flags indicam que a porta principal possui um número menor <literal>7</literal> (<literal> 0x700 </literal>) e todas as portas compartilham um IRQ (<literal> 0x001 </literal>).

source: Can I set the default serial parameters for a port?
de_de: Kann ich die vorgegebenen seriellen Parameter für eine Schnittstelle einstellen?
es_es: ¿Puedo ajustar los parámetros en serie por defecto para un port?
pt_br: Posso definir os parâmetros seriais padrões para uma porta?

source: See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html#serial-hw-config">Serial Communications</link> section in the FreeBSD Handbook.
de_de: Lesen Sie den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/serial.html#serial-hw-config">Serielle Datenübertragung</filename> im FreeBSD Handbuch.
es_es: Vea la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html#serial-hw-config">Comunicaciones en serie</link>en el manual de FreeBSD.
pt_br: Veja a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html#serial-hw-config"> Comunicações Seriais </link> no Handbook do FreeBSD .

source: How can I enable dialup logins on my modem?
de_de: Wie kann ich Einwahl-Logins über mein Modem aktivieren?
es_es: ¿Como puedo habilitar inicios de sesión por marcado en mi modem?
pt_br: Como posso ativar logins de discagem no meu modem?

source: Refer to the section about <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/dialup.html">Dial-in Services</link> in the FreeBSD Handbook.
de_de: Lesen Sie dazu den Abschnitt über <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/dialup.html">Einwählverbindungen</link> im FreeBSD Handbuch.
es_es: Vea la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/dialup.html">Servicios de marcado</link> en el manual de FreeBSD.
pt_br: Consulte a seção sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/dialup.html">Serviços de Discagem</link> no Handbook do FreeBSD.

source: How can I connect a dumb terminal to my FreeBSD box?
de_de: Wie kann ich ein Hardware-Terminal mit meiner FreeBSD Box verbinden?
es_es: ¿Como puedo conectar una terminal gregaria a mi instalación de FreeBSD?
pt_br: Como posso conectar um terminal burro na minha máquina FreeBSD?

source: This information is in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/term.html">Terminals</link> section of the FreeBSD Handbook.
de_de: Diese Information finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/term.html">Terminals</link> im FreeBSD Handbuch.
es_es: Esta información puede encontrarse en la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/term.html">Terminales</link> del manual de FreeBSD.
pt_br: Esta informação está na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/term.html"> Terminais </link> do Handbook do FreeBSD.

source: Why can I not run <command>tip</command> or <command>cu</command>?
de_de: Warum kann ich <command>tip</command> oder <command>cu</command> nicht laufen lassen?
es_es: ¿Por qué no puedo correr <command>tip</command> o <command>cu</command>?
pt_br: Por que não consigo executar o comando <command>tip</command> ou o <command>cu</command>?

source: The built-in <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilities can only access the <filename>/var/spool/lock</filename> directory via user <systemitem class="username">uucp</systemitem> and group <systemitem class="groupname">dialer</systemitem>. Use the <systemitem class="groupname">dialer</systemitem> group to control who has access to the modem or remote systems by adding user accounts to <systemitem class="groupname">dialer</systemitem>.
de_de: Die Programme <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> können auf das Verzeichnis <filename>/var/spool/lock</filename> nur über den Benutzer <systemitem class="username">uucp</systemitem> und die Gruppe <systemitem class="groupname">dialer</systemitem> zugreifen. Benutzen Sie die Gruppe <systemitem class="groupname">dialer</systemitem> um zu kontrollieren, wer Zugriff auf das Modem oder entfernte Systeme hat. Fügen Sie diese Benutzerkonten einfach selbst zur Gruppe <systemitem class="groupname">dialer</systemitem> hinzu.
es_es: Las utilidades <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> incluidas solo pueden acceder el directorio <filename>/var/spool/lock</filename> mediante el usuario <systemitem class="username">uucp</systemitem> y el grupo <systemitem class="groupname">dialer</systemitem>. Use el grupo <systemitem class="groupname">dialer</systemitem> para controlar quien tiene acceso al modem o sistemas remotos agregando cuentas de usuario a <systemitem class="groupname">dialer</systemitem>.
pt_br: Os utilitários <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> só podem acessar o diretório <filename>/var/spool/lock</filename> via usuário <systemitem class="username">uucp</systemitem> e grupo <systemitem class="groupname">dialer</systemitem> . Use o grupo <systemitem class="groupname">dialer</systemitem> para controlar quem tem acesso ao modem ou sistemas remotos adicionando contas de usuário ao <systemitem class="groupname">dialer</systemitem>.

source: Alternatively, everyone can be configured to run <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> by typing:
de_de: Alternativ können Sie jeden Benutzer auf dem System <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> verwenden lassen, dazu müssen Sie folgendes eingeben:
es_es: Alternativamente, todos pueden configurarse para correr <citerefentry><refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> escribiendo:
pt_br: Como alternativa, todos podem ser configurados para executar <citerefentry> <refentrytitle>tip</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry> <refentrytitle>cu</refentrytitle><manvolnum>1</manvolnum></citerefentry> digitando:

source: Miscellaneous Questions
de_de: Verschiedene Fragen
es_es: Preguntas varias
pt_br: Perguntas Diversas

source: FreeBSD uses a lot of swap space even when the computer has free memory left. Why?
de_de: Wieso benutzt FreeBSD so viel Swap-Speicher, obwohl noch freier Hauptspeicher verfügbar ist?
es_es: FreeBSD usa mucho espacio de swap incluso cuando la computadora aún tiene memoria libre. ¿Por qué?
pt_br: O FreeBSD usa muito espaço de swap mesmo quando o computador tem memória livre sobrando. Por quê?

source: FreeBSD will proactively move entirely idle, unused pages of main memory into swap in order to make more main memory available for active use. This heavy use of swap is balanced by using the extra free memory for caching.
de_de: FreeBSD lagert vorbeugend vollkommen untätige, unbenutzte Seiten aus dem Hauptspeicher in den Swap-Bereich aus, um mehr Hauptspeicher für die aktive Nutzung zur Verfügung zu stellen. Die spürbar höhere Nutzung des Swap-Speichers wird durch die effizientere Nutzung des Hauptspeichers wieder ausgeglichen.
es_es: FreeBSD mueve proactivamente las páginas sin usar, enteramente ociosas de la memoria principal a swap para lograr que mas memoria principal este disponible para su uso. Este uso intensivo de sqp se balancea al usar la memoria extra como cache.
pt_br: O FreeBSD irá proativamente mover páginas ociosas e não usadas da memória principal para swap, a fim de disponibilizar mais memória principal para uso ativo. Esse uso pesado de swap é balanceado usando a memória extra livre para armazenamento em cache.

source: Note that while FreeBSD is proactive in this regard, it does not arbitrarily decide to swap pages when the system is truly idle. Thus, the system will not be all paged out after leaving it idle overnight.
de_de: Beachten Sie, dass FreeBSD in dieser Hinsicht zwar vorbeugend arbeitet, es entscheidet jedoch nicht willkürlich, Seiten auszulagern, wenn das System vollkommen untätig ist. Sie können feststellen, dass nicht alle Seiten des Systems ausgelagert wurden, nachdem das System eine Nacht lang nicht benutzt worden ist.
es_es: Note que mientras que FreeBSD es proactivo en este modo, no decide arbitrariamente hacer swap de páginas cuando el sistema esta verdaderamente ocioso. Por consiguiente, el sistema no habrá pagina completamente a disco luego de dejarlo ocioso por una noche.
pt_br: Note que enquanto o FreeBSD é proativo a esse respeito, ele não decide arbitrariamente trocar páginas quando o sistema está realmente inativo. Assim, o sistema não será todo paginado depois de deixá-lo ocioso durante a noite.

source: Why does <command>top</command> show very little free memory even when I have very few programs running?
de_de: Warum zeigt mir <command>top</command> so wenig freien Speicher an, obwohl nur wenige Programme laufen?
es_es: ¿Por qué <command>top</command> muestra muy poca memoria libre incluso cuando tengo pocos programas corriendo?
pt_br: Por que <command>top</command> mostra pouca memória livre mesmo quando tenho poucos programas em execução?

source: The simple answer is that free memory is wasted memory. Any memory that programs do not actively allocate is used within the FreeBSD kernel as disk cache. The values shown by <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> labeled as <literal>Inact</literal>, <literal>Cache</literal>, and <literal>Buf</literal> are all cached data at different aging levels. This cached data means the system does not have to access a slow disk again for data it has accessed recently, thus increasing overall performance. In general, a low value shown for <literal>Free</literal> memory in <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> is good, provided it is not <emphasis>very</emphasis> low.
de_de: Die Antwort ist ganz einfach: Freier Speicher ist verschwendeter Speicher. Der FreeBSD Kernel verwendet den von den Programmen nicht genutzten Speicher automatisch für den Plattencache. Die in <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> für <literal>Inact</literal>, <literal>Cache</literal> und <literal>Buf</literal> gemeldeten Werte stehen alle für zwischengespeicherte Daten mit unterschiedlichem Alter. Wenn das System wiederholt auf Daten zugreifen muss, braucht es nicht auf die langsame Platte zuzugreifen, da die Daten noch zwischengespeichert sind. Dadurch erhöht sich die Performance. Ganz generell ist es ein gutes Zeichen, wenn <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> einen kleinen Wert bei <literal>Free</literal> anzeigt, solange der Wert nicht <emphasis>extrem</emphasis> klein ist.
es_es: La respuesta simple es que la memoria libre es memoria gastada. Cualquier memoria que los programas no alocan activamente es usada en el kernel de FreeBSD como cache de disco. Los valores mostrados por <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> marcados como <literal>Inact</literal>, <literal>Cache</literal>, y <literal>Buf</literal> son datos en cache con diferentes niveles de envejecimiento. Estos datos en cache significan que el sistema no tiene que acceder a un disco lento nuevamente para datos que accedió recientemente, incrementando la performance general. En general, un valor bajo para <literal>Free</literal> en <citerefentry><refentrytitle>top</refentrytitle><manvolnum>1</manvolnum></citerefentry> es bueno, asumiendo que no sea <emphasis>muy</emphasis> bajo.

source: Why will <command>chmod</command> not change the permissions on symlinks?
de_de: Warum ändert <command>chmod</command> die Zugriffsrechte auf symbolische Links nicht?
es_es: ¿Por qué <command>chmod</command> no cambia los permisos en symlinks?
pt_br: Por que o <command>chmod</command> não altera as permissões nos links simbólicos?

source: Symlinks do not have permissions, and by default, <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> will follow symlinks to change the permissions on the source file, if possible. For the file, <filename>foo</filename> with a symlink named <filename>bar</filename>, this command will always succeed.
de_de: Für symbolische Links gibt es keine separaten Zugriffsrechte und standardmäßig folgt <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> dem Link, wenn möglich; die Zugriffsrechte für die Datei, auf die der symbolische Link zeigt, werden also verändert. Wenn Sie eine Datei mit dem Namen <filename>foo</filename> und einen auf diese Datei zeigenden symbolischen Link mit dem Namen <filename>bar</filename> haben, wird das folgende Kommando niemals einen Fehler melden.
es_es: Los symlinks no tienen permisos, y por defecto, <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> seguirá los symlinks para cambiar los permisos en el archivo fuente, de ser posible. Para el archivo, <filename>foo</filename> co un symlink llamado <filename>bar</filename>, este comando siempre tendrá éxito.
pt_br: Os links simbólicos não têm permissões e, por padrão, <citerefentry> <refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> seguirá links simbólicos para alterar as permissões no arquivo de origem, se possível. Para o arquivo, <filename>foo</filename> com um link simbólico chamado <filename>bar</filename>, este comando será sempre bem-sucedido.

source: However, the permissions on <filename>bar</filename> will not have changed.
de_de: Trotzdem werden die Zugriffsrechte für <filename>bar</filename> nicht geändert.
es_es: Sin embargo, los permisos en <filename>bar</filename> no habrán cambiado.
pt_br: No entanto, as permissões no arquivo <filename>bar</filename> não serão alteradas.

source: When changing modes of the file hierarchies rooted in the files instead of the files themselves, use either <option>-H</option> or <option>-L</option> together with <option>-R</option> to make this work. See <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>symlink</refentrytitle><manvolnum>7</manvolnum></citerefentry> for more information.
de_de: Wenn Sie die Zugriffsrechte in der Dateihierarchie an der Wurzeldatei anstatt der Datei selbst ändern möchten, müssen Sie entweder <option>-H</option> oder <option>-L</option> zusammen mit der Option <option>-R</option> benutzen. Lesen Sie <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <citerefentry><refentrytitle>symlink</refentrytitle><manvolnum>7</manvolnum></citerefentry> für weitere Informationen.
es_es: Al cambiar los modos de las jerarquías de archivo que tienen raíz en los archivos en lugar de los archivos mismos, use <option>-H</option> o <option>-L</option> en conjunto con <option>-R</option> para hacer que esto funciona. Vea <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>symlink</refentrytitle><manvolnum>7</manvolnum></citerefentry> para más información.
pt_br: Ao alterar os modos das hierarquias de arquivos do usuario root em vez dos próprios arquivos, use <option>-H</option> ou <option>-L</option> junto com <option>-R</option> para este trabalho. Veja <citerefentry><refentrytitle>chmod</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry> <refentrytitle>symlink</refentrytitle><manvolnum>7</manvolnum></citerefentry> para mais em formação.
