Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This is discussed continually on the FreeBSD mailing lists but is to be expected since hardware changes so quickly. Read through the Hardware Notes for FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/10.2R/hardware.html">10.2</link> or <link xlink:href="http://www.FreeBSD.org/releases/9.3R/hardware.html">9.3</link> and search the mailing list <link xlink:href="http://www.FreeBSD.org/search/#mailinglists">archives</link> before asking about the latest and greatest hardware. Chances are a discussion about that type of hardware took place just last week.
es_es: Esto se discute continuamente en las listas de correo de FreeBSD pero es de esperar dado que el hardware cambia con rapidez. Lea las Notas de Hardware para FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/10.2R/hardware.html">10.2</link> o <link xlink:href="http://www.FreeBSD.org/releases/9.3R/hardware.html">9.3</link> y busque en los <link xlink:href="http://www.FreeBSD.org/search/#mailinglists">archivos</link>de las listas de correo antes de hacer una pregunta acerca del ultimo y mas nuevo hardware. Es posible que una discusión haya tenido lugar la semana pasada.

source: Before purchasing a laptop, check the archives for <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-mobile">FreeBSD laptop computer mailing list</link> and <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link>, or possibly a specific mailing list for a particular hardware type.
de_de: Befor Sie sich einen Laptop zulegen, sollten Sie einen Blick in das Archiv der <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-mobile">Mailingliste FreeBSD laptop computer</link> werfen. Ansonsten empfiehlt sich ein Blick in das Archiv von <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions</link> oder auch einer spezialisierte Mailingliste für diese Art von Hardware.
es_es: Antes de comprarse una laptop, verifique los archivos de la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-mobile">lista de corroe de laptops de FreeBSD</link> y <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de correo de preguntas generales de FreeBSD</link>, o posiblemente una lista de correo específica para un tipo de hardware en particular.
pt_br: Antes de comprar um laptop, verifique os arquivos da <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-mobile">lista de discussão sobre computadores portáteis FreeBSD</link> e da <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de discussão de questões gerais do FreeBSD</link>, ou possivelmente uma lista de discussão específica para um tipo específico de hardware.

source: What are the limits for memory? Does FreeBSD support more than 4 GB of memory (RAM)? More than 16 GB? More than 48 GB?
de_de: Was sind die Grenzen für Arbeitsspeicher? Unterstützt FreeBSD mehr als 4 GB RAM? Mehr als 16 GB? Mehr als 48 GB?
es_es: ¿Cuáles so los límites para la memoria? ¿Soporta FreeBSD más de 4 GB de memoria (RAM)? ¿Más de 16 GB? ¿Más de 48 GB?
pt_br: Quais são os limites para a memória? O FreeBSD suporta mais de 4 GB de memória (RAM)? Mais de 16 GB? Mais de 48 GB?

source: FreeBSD as an operating system generally supports as much physical memory (RAM) as the platform it is running on does. Keep in mind that different platforms have different limits for memory; for example <trademark>i386</trademark> without <acronym>PAE</acronym> supports at most 4 GB of memory (and usually less than that because of PCI address space) and <trademark>i386</trademark> with PAE supports at most 64 GB memory. As of FreeBSD 10, AMD64 platforms support up to 4 TB of physical memory.
de_de: Generell unterstützt FreeBSD als Betriebssystem so viel physischen Speicher (RAM), wie die Plattform auf der es läuft. Beachten Sie, dass verschiedene Plattformen unterschiedliche Speichergrenzen besitzen. So wird z.B. <trademark>i386</trademark> ohne <acronym>PAE</acronym> höchstens 4 GB Speicher (normalerweise weniger als das wegen des PCI-Adressraums), dagegen wird <trademark>i386</trademark> mit <acronym>PAE</acronym> höchstens 64 GB Speicher bereitstellen. Seit FreeBSD 10 können AMD64 Plattformen bis zu 4 TB physischen Speicher ansprechen.
es_es: FreeBSD como sistema operativo generalmente soporta tanta memoria física (RAM) como la plataforma en la que se encuentre corriendo. Tenga en mente que diferentes plataformas tienen diferentes límites para la memoria; por ejemplo <trademark>i386</trademark> sin <acronym>PAE</acronym> soporta como mucho 4 GB de memoria (y usualmente menos que eso a causa del espacio de direcciones PCI) y <trademark>i386</trademark> con PAE soporta como mucho 64 GB de memoria. En FreeBSD 10, las plataformas AMD64 soportan hasta 4 TB de memoria física.
pt_br: O FreeBSD como sistema operacional geralmente suporta tanta memória física (RAM) quanto a disponível na plataforma em que está rodando. Tenha em mente que plataformas diferentes têm limites diferentes para a memória; por exemplo <trademark>i386</trademark> sem <acronym>PAE</acronym> suporta no máximo 4 GB de memória (e geralmente menos que isso por causa do espaço de endereçamento PCI) e <trademark>i386</trademark> com PAE suporta no máximo 64 GB de memória. A partir do FreeBSD 10, as plataformas AMD64 suportam até 4 TB de memória física.

source: Why does FreeBSD report less than 4 GB memory when installed on an <trademark>i386</trademark> machine?
de_de: Warum zeigt FreeBSD weniger als 4 GB Speicher an, wenn es auf einer <trademark>i386</trademark> Maschine installiert wird?
es_es: ¿Por qué FreeBSD reporta menos de 4 GB memoria cuando se instala en una máquina <trademark>i386</trademark>?
pt_br: Por que o FreeBSD reporta menos de 4 GB de memória quando instalado em uma máquina <trademark>i386</trademark>?

source: The total address space on <trademark>i386</trademark> machines is 32-bit, meaning that at most 4 GB of memory is addressable (can be accessed). Furthermore, some addresses in this range are reserved by hardware for different purposes, for example for using and controlling PCI devices, for accessing video memory, and so on. Therefore, the total amount of memory usable by the operating system for its kernel and applications is limited to significantly less than 4 GB. Usually, 3.2 GB to 3.7 GB is the maximum usable physical memory in this configuration.
de_de: Der Gesamtadressraum beträgt auf <trademark>i386</trademark> Maschinen 32-Bit, was bedeutet, dass maximal 4 GB Speicher adressiert (verwaltet) werden kann. Weiterhin sind viele Adressen in diesem Bereich von der Hardware für bestimmte Aufgaben reserviert, um z.B. PCI-Geräte zu benutzen und zu steuern, auf Videospeicher zuzugreifen und so weiter. Aus diesem Grund ist die Gesamtmenge an Speicher, die vom Betriebssystem für den Kernel und Anwendungen verwendet werden kann, auf wesentlich weniger als 4 GB begrenzt. Normalerweise sind 3.2 GB bis 3.7 GB das Maximum an verfügbarem Speicher in dieser Konfiguration.
es_es: El espacio total direccionable en máquinas <trademark>i386</trademark> es de 32 bits, lo que significa que como mucho 4 GB de memoria son direccionables (pueden ser accedidos). Más aún, en algunas direcciones este rango esta reservado por el hardware para diferentes propósitos, por ejemplo usar y controlar dispositivos PCI, para acceder memoria de video y similares. Por consiguiente, la cantidad total de memoria usable por el sistema operativo para su kernel y aplicaciones esta limitada a significativamente menos que 4 GB. Usualmente, 3.2 GB a 3.7 GB es el máximo de memoria física usable en esta configuración.
pt_br: O espaço total de endereços nas máquinas <trademark>i386</trademark> é de 32 bits, o que significa que no máximo 4 GB de memória são endereçáveis ​​(podem ser acessados). Além disso, alguns endereços nesse intervalo são reservados por hardware para diferentes finalidades, por exemplo, para usar e controlar dispositivos PCI, para acessar a memória de vídeo e assim por diante. Portanto, a quantidade total de memória utilizável pelo sistema operacional para o seu kernel e aplicativos é limitada a significativamente menos de 4 GB. Normalmente, temos de 3,2 GB a 3,7 GB de memória física máxima utilizável nessa configuração.

source: To access more than 3.2 GB to 3.7 GB of installed memory (meaning up to 4 GB but also more than 4 GB), a special tweak called <acronym>PAE</acronym> must be used. PAE stands for Physical Address Extension and is a way for 32-bit x86 CPUs to address more than 4 GB of memory. It remaps the memory that would otherwise be overlaid by address reservations for hardware devices above the 4 GB range and uses it as additional physical memory (see <citerefentry><refentrytitle>pae</refentrytitle><manvolnum>4</manvolnum></citerefentry>). Using PAE has some drawbacks; this mode of memory access is a little bit slower than the normal (without PAE) mode and loadable modules (see <citerefentry><refentrytitle>kld</refentrytitle><manvolnum>4</manvolnum></citerefentry>) are not supported. This means all drivers must be compiled into the kernel.
de_de: Um auf mehr als 3.2 GB bis 3.7 GB des installierten Speichers (was bis zu 4 GB, aber aber auch mehr als 4 GB bedeuten kann) zuzugreifen, muss eine spezielle Manipulation, genannt <acronym>PAE</acronym>, benutzt werden. <acronym>PAE</acronym> steht für Physical Address Extension und ist eine Möglichkeit für 32-Bit x86-CPUs mehr als 4 GB Speicher zu addressieren. Es organisiert den Speicher, der andererseits wegen Adressreservierungen für Hardwaregeräte oberhalb der 4 GB Grenze liegt, um und benutzt diesen als zusätzlichen physischen Speicher (lesen Sie dazu <citerefentry><refentrytitle>pae</refentrytitle><manvolnum>4</manvolnum></citerefentry>). Der Einsatz von PAE ist mit ein paar Nachteilen verbunden: diese Speicherzugriffsmethode ist ein bisschen langsamer als die normale Methode (ohne PAE) und ladbare Module (siehe <citerefentry><refentrytitle>kld</refentrytitle><manvolnum>4</manvolnum></citerefentry>) werden nicht unterstützt. Das bedeutet, dass alle Treiber in den Kernel eingebaut sein müssen.
es_es: Para acceder a más de 3.2 GB a 3.7 GB de memoria instalada (es decir, hasta 4 GB o incluso mas que 4 GB), un ajuste especial llamado <acronym>PAE</acronym> debe ser usado. PAE significa Physical Address Extension (Extensión de Memoria Física) y es una manera para que las CPUs x86 de 32 bits puedan direccionar más de 4 GB de memoria. Remapea la memoria que de otra manera sería sobreescrita por reservaciones de memoria por parte del hardware para dispositivos de hardware por encima del rango de 4 GB y lo usa como memoria física adicional (vea <citerefentry><refentrytitle>pae</refentrytitle><manvolnum>4</manvolnum></citerefentry>). Usar PAE tiene algunas desventajas; este modo de acceso de memoria es un poco mas lento que el modo normal (sin PAE) y los modulos cargables (vea <citerefentry><refentrytitle>kld</refentrytitle><manvolnum>4</manvolnum></citerefentry>) no estan soportados. Esto significa que todos los controladores deben ser compilados en el kernel.
pt_br: Para acessar mais de 3,2 GB a 3,7 GB de memória instalada (ou seja, até 4 GB, mas também mais de 4 GB), um ajuste especial chamado <acronym>PAE</acronym> deve ser usado. PAE significa Physical Address Extension e é uma maneira das CPUs x86 de 32 bits endereçarem mais de 4 GB de memória. Ele remapeia a memória que de outra forma seria sobreposta pelas reservas de endereço para dispositivos de hardware acima do intervalo de 4 GB e a usa como memória física adicional (veja <citerefentry><refentrytitle>pae</refentrytitle><manvolnum>4</manvolnum></citerefentry>). Usar o PAE tem alguns inconvenientes; este modo de acesso à memória é um pouco mais lento que o modo normal (sem PAE) e módulos carregáveis ​​(veja <citerefentry><refentrytitle>kld</refentrytitle><manvolnum>4</manvolnum> </citerefentry>) não são suportados. Isso significa que todos os drivers devem ser compilados estaticamente no kernel.

source: The most common way to enable PAE is to build a new kernel with the special ready-provided kernel configuration file called <filename>PAE</filename>, which is already configured to build a safe kernel. Note that some entries in this kernel configuration file are too conservative and some drivers marked as unready to be used with PAE are actually usable. A rule of thumb is that if the driver is usable on 64-bit architectures (like AMD64), it is also usable with PAE. When creating a custom kernel configuration file, PAE can be enabled by adding the following line:
de_de: Die am häufigsten verwendete Vorgehensweise, PAE zu aktivieren ist die, einen neuen Kernel mit der speziell dafür vorgesehenen Kernelkonfigurationsdatei, <filename>PAE</filename> genannt, zu bauen, die bereits so eingestellt ist, dass ein funktionierender Kernel erstellt wird. Beachten Sie, dass manche Einträge in dieser Kernelkonfigurationsdatei zu konservativ eingestellt sind und dass manche Treiber, die nicht für den Einsatz mit PAE vorgesehen sind, trotzdem funktionieren. Als Faustregel kann man sagen, dass wenn der Treiber auf 64-Bit Architekturen (like AMD64) läuft, er auch mit PAE lauffähig ist. Wenn Sie einen angepassten Kernel erstellen, können Sie PAE aktivieren, indem Sie die folgende Zeile in die Konfiguration hinzufügen:
es_es: La manera más común de habilitar PAE es compilar un nuevo kernel con el archivo especial de configuración de kernel listo para usarse denominado <filename>PAE</filename>, el cual viene configurado para compilar un kernel seguro. Tenga en cuenta que algunas de las entradas en este archivo de configuración de kernel son demasiado conservadoras y algunos controladores marcados como inusables con PAE son perfectamente usables. Una regla práctica es que si el driver es usable en arquitecturas de 64 bits (como AMD64), también es usable con PAE. Al crear un archivo de configuración de kernel personalizado, PAE puede habilitarse agregando la siguiente línea:
pt_br: A maneira mais comum de ativar o PAE é compilar um novo kernel com o arquivo especial de configuração do kernel, chamado <filename>PAE</filename>, que já está configurado para compilar um kernel seguro. Observe que algumas entradas neste arquivo de configuração do kernel são muito conservadoras e alguns drivers marcados como não prontos para serem usados ​​com o PAE na verdade são possíveis de serem utilizados. Uma regra básica é que, se o driver for utilizável em arquiteturas de 64 bits (como o AMD64), ele também poderá ser usado com o PAE. Ao criar um arquivo de configuração de kernel personalizado, o suporte ao PAE pode ser ativada adicionando a seguinte linha:

source: PAE is not much used nowadays because most new x86 hardware also supports running in 64-bit mode, known as AMD64 or <trademark class="registered">Intel</trademark> 64. It has a much larger address space and does not need such tweaks. FreeBSD supports AMD64 and it is recommended that this version of FreeBSD be used instead of the <trademark>i386</trademark> version if 4 GB or more memory is required.
de_de: PAE wird heutzutage nicht sehr häufig verwendet, da die Mehrzahl an neuer x86-Hardware auch den Betrieb im 64-Bit Modus erlaubt, auch als AMD64 oder <trademark class="registered">Intel</trademark> 64 bekannt. Es hat viel mehr Adressraum und benötigt solche Manipulationen nicht. FreeBSD unterstützt AMD64 und es wird empfohlen, diese FreeBSD Version anstatt der <trademark>i386</trademark> Version einzusetzen, wenn 4 GB oder mehr Speicher gebraucht werden.
es_es: PAE no es muy usado hoy en día porque la mayoría del hardware x86 nuevo también soporta correr en modo de 64 bits, conocido como AMD64 o <trademark class="registered">Intel</trademark>64. Tiene un espacio de direcciones mucho más extenso y no necesita tales ajustes. FreeBSD soporta AMD64 y es recomendado que se use esta versión de FreeBSD en lugar de la versión de <trademark>i386</trademark> si se necesita usar 4 GB o más de memoria.
pt_br: O PAE não é muito usado atualmente porque a maioria dos novos hardwares x86 também suporta a execução no modo de 64 bits, conhecido como AMD64 ou <trademark class="registered">Intel</trademark>64. Ele tem um espaço de endereçamento muito maior e não precisa tais ajustes. O FreeBSD suporta o AMD64 e é recomendado que esta versão do FreeBSD seja usada no lugar da versão <trademark>i386</trademark> se forem necessários 4 GB ou mais de memória.

source: Architectures and Processors
de_de: Architekturen und Prozessoren
es_es: Arquitecturas y Procesadores
pt_br: Arquiteturas e Processadores

source: Does FreeBSD support architectures other than the x86?
de_de: Unterstützt FreeBSD neben x86 auch andere Architekturen?
es_es: ¿Soporta FreeBSD otras arquitecturas aparte de x86?
pt_br: O FreeBSD suporta arquiteturas diferentes do x86?

source: Yes. FreeBSD divides support into multiple tiers. Tier 1 architectures, such as i386 or amd64; are fully supported. Tiers 2 and 3 are supported on a best-effort basis. A full explanation of the tier system is available in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">Committer's Guide.</link>
de_de: Ja. FreeBSD teilt die Unterstützung in sogenannte Tiers auf. Tier-1 Architekturen, wie i386 oder amd64 werden vollständig unterstützt. Tier-2 und Tier-3 werden auf der <quote>Best-Effort Basis</quote> unterstützt. Eine vollständige Erklärung dieser Aufteilung finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">Committer's Guide</link>.
es_es: Si. FreeBSD divide el soporte en múltiples categorías. Las arquitecturas de Categoría 1, tales como i386 o amd64; están totalmente soportadas. Las categorías 2 y 3 están soportadas en una base del mejor esfuerzo. Una explicación completa del sistema de categorías esta disponible en la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">Guia del Committer.</link>
pt_br: Sim. O FreeBSD divide o suporte em vários níveis. Arquiteturas de Tier 1, como i386 ou amd64; são totalmente suportados. Tiers 2 e 3 são suportados com base no melhor esforço. Uma explicação completa do sistema de tiers está disponível no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">Guia dos Committers.</link>

source: A complete list of supported architectures can be found on the <link xlink:href="http://www.FreeBSD.org/platforms/">platforms page.</link>
de_de: Eine vollständige Liste der unterstützten Architekturen finden Sie auf der Seite <link xlink:href="http://www.FreeBSD.org/de/platforms/">Unterstützte Plattformen</link>.
es_es: Una lista completa de arquitecturas soportadas puede encontrarse en la <link xlink:href="http://www.FreeBSD.org/platforms/">página de plataformas.</link>

source: Does FreeBSD support Symmetric Multiprocessing (SMP)?
de_de: Unterstützt FreeBSD Symmetric-Multiproccessing (SMP)?
es_es: ¿Soporta FreeBSD multiprocesamiento simétrico (SMP)?
pt_br: O FreeBSD suporta o Multiprocessamento Simétrico (SMP)?

source: FreeBSD supports symmetric multi-processor (SMP) on all non-embedded platforms (e.g, i386, amd64, etc.). SMP is also supported in arm and MIPS kernels, although some CPUs may not support this. FreeBSD's SMP implementation uses fine-grained locking, and performance scales nearly linearly with number of CPUs.
de_de: FreeBSD unterstützt Symmetric-Multiproccessing(SMP) auf allen nicht-Embedded-Plattformen (z.B. i386, amd64, etc.). SMP wird auch in ARM- und MIPS-Kernel unterstützt, obwohl einige CPUs dies vielleicht nicht unterstützen. FreeBSDs SMP-Implementierung verwendet präzises Locking und die Leistung skaliert nahezu linear mit der Anzahl der CPUs.
es_es: FreeBSD soporta multiprocesadores simétricos (SMP) en todas las plataformas no embebidas (e.j, i386, amd64, etc.). SMP también esta soportado en kerneles arm y MIPS, aunque algunas CPUs pueden no soportar esto. La implementación de SMP en FreeBSD usa bloqueo de granularidad fina, y la performance escala casi linealmente con el número de CPUs.
pt_br: O FreeBSD suporta multiprocessadores simétricos (SMP) em todas as plataformas não-embarcadas (por exemplo, i386, amd64, etc.). O SMP também é suportado em kernels arm e MIPS, embora algumas CPUs possam não suportar isso. A implementação do SMP do FreeBSD usa o bloqueio refinado, e o desempenho escala quase linearmente com o número de CPUs.

source: <citerefentry><refentrytitle>smp</refentrytitle><manvolnum>4</manvolnum></citerefentry> has more details.
de_de: <citerefentry><refentrytitle>smp</refentrytitle><manvolnum>4</manvolnum></citerefentry> enthält weitere Informationen.
es_es: <citerefentry><refentrytitle>smp</refentrytitle><manvolnum>4</manvolnum></citerefentry> contiene más detalles.
pt_br: A página de manual do <citerefentry><refentrytitle>smp</refentrytitle><manvolnum>4</manvolnum></citerefentry> tem maiores detalhes.

source: What is microcode? How do I install <trademark class="registered">Intel</trademark> CPU microcode updates?
de_de: Was ist Mikrocode ? Wie kann ich <trademark class="registered">Intel</trademark> CPU Microcode Updates installieren?
es_es: ¿Qué es el microcódigo? ¿Como instalo actualizaciones de microcódigo de <trademark class="registered">Intel</trademark> CPU microcode updates?
pt_br: O que é microcódigo? Como eu instalo as atualizações de microcódigo da <trademark class="registered">Intel</trademark>?

source: Microcode is a method of programmatically implementing hardware level instructions. This allows for CPU bugs to be fixed without replacing the on board chip.
de_de: Mikrocode ist eine Methode um Anweisungen auf Hardware-Ebene programmatisch zu implementieren. Dies ermöglicht es, CPU-Fehler ohne Austausch des Chips zu beheben.
es_es: El microcódigo es un método de implementar programáticamente instrucciones al nivel de hardware. Esto permite que los errores de CPU se corrigan sin reemplazar el chip de la placa.
pt_br: Microcódigo é um método de implementar programaticamente instruções de nível de hardware. Isso permite que os bugs da CPU sejam corrigidos sem a necessidade de substituir fisicamente o chip.

source: Install <package>sysutils/devcpu-data</package>, then add:
de_de: Installieren Sie <package>sysutils/devcpu-data</package> und fügen Sie:
es_es: Instale <package>sysutils/devcpu-data</package>, luego añada:
pt_br: Instale o <package>sysutils/devcpu-data</package> e adicione:

source: to <filename>/etc/rc.conf</filename>
de_de: in <filename>/etc/rc.conf</filename> ein.
es_es: a <filename>/etc/rc.conf</filename>
pt_br: no <filename>/etc/rc.conf</filename>

source: Hard Drives, Tape Drives, and CD and DVD Drives
de_de: Festplatten, Bandlaufwerke, sowie CD- und DVD-Laufwerke
es_es: Discos duros, unidades de cinta y unidades de CD y DVD
pt_br: Discos, Unidades de Fita e Unidades de CD e DVD

source: What kind of hard drives does FreeBSD support?
de_de: Welche Arten von Festplatten werden von FreeBSD unterstützt?
es_es: ¿Qué tipo de discos duros soporta FreeBSD?
pt_br: Que tipo de disco o FreeBSD suporta?
