Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This is a security feature. In order to <command>su</command> to <systemitem class="username">root</systemitem>, or any other account with superuser privileges, the user account must be a member of the <systemitem class="groupname">wheel</systemitem> group. If this feature were not there, anybody with an account on a system who also found out <systemitem class="username">root</systemitem>'s password would be able to gain superuser level access to the system.
de_de: Das ist ein Sicherheitsmerkmal Wenn Sie mit <command>su</command> zu <systemitem class="username">root</systemitem> oder jedem anderen Account mit Super-User-Privilegien wechseln wollen, müssen Sie Mitglied der Gruppe <systemitem class="groupname">wheel</systemitem> sein. Wenn es dieses Merkmal nicht gäbe, könnte jeder, der einen Account auf dem System hat und zufällig das Passwort für <systemitem class="username">root</systemitem> erfährt, mit Super-User-Rechten auf das System zugreifen.
es_es: Esta es una característica de seguridad. Para hacer <command>su</command> a <systemitem class="username">root</systemitem>, o cualquier otra cuenta con privilegios de superusuario, la cuenta de usuario debe ser miembra del grupo <systemitem class="groupname">wheel</systemitem>. Si esta característica no estuviera, cualquiera con una cuenta en el sistema que haya adivinado la contraseña de <systemitem class="username">root</systemitem> podría ganar acceso de superusuario al sistema.
pt_br: Este é um recurso de segurança. Para executar <command>su</command> para <systemitem class="username">root</systemitem>, ou qualquer outra conta com privilégios de superusuário, a conta do usuário deve ser um membro do grupo <systemitem class="groupname">wheel</systemitem>. Se este recurso não estivesse lá, qualquer pessoa com uma conta em um sistema e que também descobrisse a senha do <systemitem class="username">root</systemitem> seria capaz de obter acesso de nível de superusuário ao sistema.

source: To allow someone to <command>su</command> to <systemitem class="username">root</systemitem>, put them in the <systemitem class="groupname">wheel</systemitem> group using <command>pw</command>:
de_de: Um einem Benutzer zu erlauben, mit <command>su</command> <systemitem class="username">root</systemitem> zu werden, müssen Sie ihn mit <command>pw</command> zur Gruppe <systemitem class="groupname">wheel</systemitem> hinzufügen:
es_es: Para permitir que alguien haga <command>su</command> a <systemitem class="username">root</systemitem>, póngalo(s) en el grupo <systemitem class="groupname">wheel</systemitem> usando <command>pw</command>:
pt_br: Para permitir que alguém execute o comando <command>su</command> <systemitem class="username"> root </systemitem>, coloque-os no grupo <systemitem class="groupname">wheel</systemitem> usando o comando <command>pw</command>:

source: The above example will add user <systemitem class="username">lisa</systemitem> to the group <systemitem class="groupname">wheel</systemitem>.
de_de: Das obige Beispiel würde den Benutzer <systemitem class="username">lisa</systemitem> zur Gruppe <systemitem class="groupname">wheel</systemitem> hinzufügen.
es_es: El ejemplo anterior agregara al usuario <systemitem class="username">lisa</systemitem> al grupo <systemitem class="groupname">wheel</systemitem>.
pt_br: O exemplo acima adicionará o usuário <systemitem class="username"> lisa </systemitem> ao grupo <systemitem class="groupname"> wheel </systemitem>.

source: I made a mistake in <filename>rc.conf</filename>, or another startup file, and now I cannot edit it because the file system is read-only. What should I do?
de_de: Ich habe einen Fehler in der <filename>rc.conf</filename> oder einer der anderen Dateien für den Systemstart und jetzt kann ich sie nicht ändern, weil das Dateisystem <quote>read-only</quote> ist. Was kann ich tun?
es_es: Cometi un error en <filename>rc.conf</filename>, u otro archivo de inicio, y ahora no puedo editarlo porque el sistema de archivos es de solo lectura. ¿Qué debo hacer?
pt_br: Cometi um erro no <filename>rc.conf</filename>, ou outro arquivo de inicialização, e agora não posso editá-lo porque o sistema de arquivos está montado somente leitura. O que devo fazer?

source: Restart the system using <userinput>boot -s</userinput> at the loader prompt to enter single-user mode. When prompted for a shell pathname, press <keycap>Enter</keycap> and run <command>mount -urw /</command> to re-mount the root file system in read/write mode. You may also need to run <command>mount -a -t ufs</command> to mount the file system where your favorite editor is defined. If that editor is on a network file system, either configure the network manually before mounting the network file systems, or use an editor which resides on a local file system, such as <citerefentry><refentrytitle>ed</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: Starten Sie das System mittels <userinput>boot -s</userinput> an der Loader-Eingabeaufforderung neu, um in den Single-User-Modus zu gelangen. Wenn Sie aufgefordert werden, den Pfadnamen der Shell einzugeben, drücken Sie einfach Enter. Geben Sie danach <command>mount -urw /</command> ein, um das Root-Dateisystem im Schreib/Lese-Modus zu mounten. Sie werden wahrscheinlich auch <command>mount -a -t ufs</command> ausführen müssen, um das Dateisystem mit Ihrem Lieblingseditor zu mounten. Wenn Ihr Lieblingseditor auf einem Netzwerklaufwerk liegt, müssen Sie entweder das Netzwerk von Hand konfigurieren oder einen Editor benutzen, der auf einem lokalen Laufwerk vorhanden ist, z.B. <citerefentry><refentrytitle>ed</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Reinicie el sistema usando <userinput>boot -s</userinput> en el indicador de arranque para entrar en el modo de un solo usuario. Cuando se le pida un nombre de ruta para el shell, presione <keycap>Enter</keycap> y corra <command>mount -urw /</command> para re-montar el sistema de archivos raíz en modo de lectura/escritura. Quizas también tenga que correr <command>mount -a -t ufs</command> para montar el sistema de archivos donde esta definido su editor favorito. Si ese editor esta en un sistema de archivos de red, configure la red manualmente antes de montar sistemas de archivos en red, o use un editor que redia en el sistema de archivos local, como <citerefentry><refentrytitle>ed</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Reinicie o sistema usando <userinput>boot -s</userinput> no prompt do loader para entrar no modo single user. Quando o sistema solicitar o caminho do shell, apenas pressione <keycap>Enter</keycap> e execute <command>mount -urw /</command> para remontar novamente o sistema de arquivos raiz no modo de leitura e gravação. Você também pode precisar executar o comando <command>mount -a -t ufs</command> para montar o sistema de arquivos no qual seu editor favorito é mantido. Se esse editor estiver em um sistema de arquivos de rede, configure a rede manualmente antes de montar os sistemas de arquivos de rede ou use um editor que resida em um sistema de arquivos local, tal como o <citerefentry><refentrytitle>ed</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: In order to use a full screen editor such as <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry vendor="ports"><refentrytitle>emacs</refentrytitle><manvolnum>1</manvolnum></citerefentry>, run <command>export TERM=xterm</command> on FreeBSD 9.0+ so that these editors can load the correct data from the <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry> database.
de_de: Wenn Sie einen bildschirmorientierten Editor wie zum Beispiel <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> oder <citerefentry vendor="ports"><refentrytitle>emacs</refentrytitle><manvolnum>1</manvolnum></citerefentry> benutzen wollen, werden Sie auch den Befehl <command>export TERM=xterm</command> ausführen müssen, damit diese Editoren die richtigen Einstellungen aus der Datenbank <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry> übernehmen.
es_es: Para usar un editor de pantalla completa tal como <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> o <citerefentry vendor="ports"><refentrytitle>emacs</refentrytitle><manvolnum>1</manvolnum></citerefentry>, corra <command>export TERM=xterm</command> en FreeBSD 9.0+ de manera que estos editores puedan cargar correctamente los datos desde la base de datos de <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: After performing these steps, edit <filename>/etc/rc.conf</filename> to fix the syntax error. The error message displayed immediately after the kernel boot messages should indicate the number of the line in the file which is at fault.
de_de: Sobald Sie diese Schritte ausgeführt haben, können Sie den Fehler in <filename>/etc/rc.conf</filename> ganz normal beheben. Die Fehlermeldungen, die unmittelbar nach den Startmeldungen des Kernels angezeigt wurden, sollten die Nummer der Zeile mit dem Fehler melden.
es_es: Luego de realizar estos pasos, edite <filename>/etc/rc.conf</filename> para arreglar el error de sintaxis. El mensaje de error que se muestra inmediatamente luego de los mensajes de arranque del kernel debería indicar que número de línea en el archivo tiene el problema.
pt_br: Depois de executar estas etapas, edite o arquivo <filename>/etc/rc.conf</filename> para corrigir o erro de sintaxe. A mensagem de erro exibida imediatamente após as mensagens de inicialização do kernel deve indicar o número da linha no arquivo que está com erro.

source: Why am I having trouble setting up my printer?
de_de: Wieso habe ich habe Probleme, meinen Drucker einzurichten?
es_es: ¿Por qué tengo problemas para configurar mi impresora?
pt_br: Por que estou tendo problemas para configurar minha impressora?

source: See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/printing.html">Handbook entry on printing</link> for troubleshooting tips.
de_de: Lesen Sie zur Problembehandlung das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/printing.html">Drucken</link> im Handbuch.
es_es: Vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/printing.html">entrada del manual acerca de imprimir</link> para consejos sobre como solucionar el problema.
pt_br: Consulte a seção sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/printing.html">impressão</link> no Handbook do FreeBSD para dicas de soluções de problemas.

source: How can I correct the keyboard mappings for my system?
de_de: Wie kann ich die Tastaturbelegung meines Systems korrigieren?
es_es: ¿Como puedo corregir los mapeos del teclado para mi sistema?
pt_br: Como posso corrigir os mapeamentos de teclado para o meu sistema?

source: Refer to the Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html">using localization</link>, specifically the section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html#setting-console">console setup</link>.
de_de: Informationen dazu finden Sie im Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/using-localization.html">Lokalisierung</link> des Handbuchs, insbesondere im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/using-localization.html#setting-console">Einrichten der Konsole</link>.
es_es: Vea la sección del manual acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html">utilizar localización</link>, específicamente la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html#setting-console">configuración de la consola</link>.
pt_br: Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html">usando localização</link> do Handbook, mais especificamente a seção sobre a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/using-localization.html#setting-console"> configuração do console </link>.

source: Why can I not get user quotas to work properly?
de_de: Wieso funktionieren die Benutzer-Quotas nicht richtig?
es_es: ¿Por qué no consigo que las quotas de usuario funcionen adecuadamente?
pt_br: Por que não consigo colocar as quotas de usuários para funcionar corretamente?

source: It is possible that the kernel is not configured to use quotas. In this case, add the following line to the kernel configuration file and recompile the kernel:
de_de: Es kann sein, dass der Kernel nicht für den Einsatz von Quotas konfiguriert ist. In diesem Fall müssen Sie folgende Zeile in die Kernelkonfigurationsdatei aufnehmen und den Kernel neu bauen:
es_es: Es posible que el kernel no este configurado para usar quotas. En este caso, añada la siguiente línea al archivo de configuración de kernel y recompile el kernel:
pt_br: É possível que o kernel não esteja configurado para usar quotas. Neste caso, adicione a seguinte linha ao arquivo de configuração do kernel e recompile o kernel:

source: Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/quotas.html">Handbook entry on quotas</link> for full details.
de_de: Weitere Informationen zum Einsatz von Quotas finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/quotas.html">Disk Quotas</link> des Handbuchs.
es_es: Vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/quotas.html">entrada de manual acerca de quotas</link> para más detalles.
pt_br: Consulte a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/quotas.html"> seção do Handbook sobre quotas</link> para obter detalhes completos.

source: Do not turn on quotas on <filename>/</filename>.
de_de: Benutzen Sie keine Quotas für <filename>/</filename>.
es_es: No ponga quotas sobre <filename>/</filename>.
pt_br: Não ative o uso de quotas na partição <filename>/</filename>.

source: Put the quota file on the file system that the quotas are to be enforced on:
de_de: Erstellen Sie die Quotas-Datei in dem Dateisystem, für das die Quotas gelten sollen:
es_es: Agregue el archivo de quota en el sistema de archivo en que se van a aplicar las quotas:
pt_br: Coloque o arquivo de quotas no sistema de arquivos para o qual quotas precisam ser aplicadas:

source: File System
de_de: Dateisystem
es_es: Sistema de archivos
pt_br: Sistema de arquivo

source: Quota file
de_de: Quotas-Datei
es_es: Archivo de quota
pt_br: Arquivo de quota

source: Does FreeBSD support System V IPC primitives?
de_de: Unterstützt FreeBSD IPC-Grundfunktionen von System V?
es_es: ¿Soporta FreeBSD primitivas IPC de SystemV?
pt_br: O FreeBSD suporta System V IPC primitives?

source: Yes, FreeBSD supports System V-style IPC, including shared memory, messages and semaphores, in the <filename>GENERIC</filename> kernel. With a custom kernel, support may be loaded with the <filename>sysvshm.ko</filename>, <filename>sysvsem.ko</filename> and <filename>sysvmsg.ko</filename> kernel modules, or enabled in the custom kernel by adding the following lines to the kernel configuration file:
de_de: Ja, FreeBSD unterstützt IPC im Stil von System V einschließlich gemeinsamen Speicher, Nachrichten und Semaphoren bereits mit dem <filename>GENERIC</filename>-Kernel. Wenn Sie einen angepassten Kernel verwenden, können Sie die für Unterstützung die Kernelmodule <filename>sysvshm.ko</filename>, <filename>sysvsem.ko</filename> und <filename>sysvmsg.ko</filename> laden. Alternativ können Sie die folgenden Zeilen in die Kernelkonfigurationsdatei aufnehmen:
es_es: Si, FreeBSD soporta IPC de tipo System V, incluyendo memoria compartida, mensajes y semáforos, en el kernel <filename>GENERIC</filename>. Con un kernel personalizado, el soporte puede cargarse con los módulos de kernel <filename>sysvshm.ko</filename>, <filename>sysvsem.ko</filename> y <filename>sysvmsg.ko</filename>, o habilitado en el kernel por defecto agregando las siguientes líneas al archivo de configuración del kernel:
pt_br: Sim, o FreeBSD suporta o IPC no estilo do System V, incluindo memória compartilhada, mensagens e semáforos, no kernel <filename>GENERIC</filename>. Em um kernel personalizado, o suporte pode ser por meio do carregamento dos módulos de kernel <filename>sysvshm.ko</filename>, <filename>sysvsem.ko</filename> e <filename>sysvmsg.ko</filename>, ou habilitado de forma estática no kernel personalizado adicionando as seguintes linhas ao arquivo de configuração do mesmo:

source: Recompile and install the kernel.
de_de: Danach kompilieren und installieren Sie den neuen Kernel.
es_es: Recompile e instale el kernel.
pt_br: Recompile e instale o kernel.

source: What other mail-server software can I use instead of <application>Sendmail</application>?
de_de: Welchen Mail-Server kann ich an Stelle von <application>Sendmail</application> benutzen?
es_es: ¿Qué otro software de servidor de correo puedo usar en lugar de <application>Sendmail</application>?
pt_br: Qual outro software de servidor de correio posso usar em substituição ao <application>Sendmail</application>?

source: The <link xlink:href="http://www.sendmail.org/"><application>Sendmail</application></link> server is the default mail-server software for FreeBSD, but it can be replaced with another MTA installed from the Ports Collection. Available ports include <package>mail/exim</package>, <package>mail/postfix</package>, and <package>mail/qmail</package>. Search the mailing lists for discussions regarding the advantages and disadvantages of the available MTAs.
de_de: Der <link xlink:href="http://www.sendmail.org/"><application>Sendmail</application></link> Server ist der voreingestellte Mail-Server unter FreeBSD. Sie können ihn aber problemlos durch einen anderen MTA aus der Ports-Sammlung ersetzen, z.B. <package>mail/exim</package>, <package>mail/postfix</package>, oder <package>mail/qmail</package>. Diskussionen über die Vor- und Nachteile der einzelnen MTAs finden Sie auf den Mailinglisten.
es_es: El servidor <link xlink:href="http://www.sendmail.org/"><application>Sendmail</application></link> es el software servidor de correo por defecto para FreeBSD, pero puede ser reemplazado con otro MTA instalado desde la colección de ports. Los ports disponibles incluyen <package>mail/exim</package>, <package>mail/postfix</package>, y <package>mail/qmail</package>. Busque en las listas de correo para discusiones sobre las ventajas y desventajas de los MTAs disponibles.
pt_br: O servidor <link xlink:href="http://www.sendmail.org/"><application>Sendmail</application> </link> é o software de servidor de email padrão do FreeBSD, mas pode ser substituído por outro MTA instalado a partir da coleção de ports. Os ports disponíveis incluem o <package>mail/exim</package>, o <package>mail/postfix</package> e o <package>mail/qmail</package>. Procure informações nas listas de discussão sobre as vantagens e desvantagens dos MTAs disponíveis.

source: I have forgotten the <systemitem class="username">root</systemitem> password! What do I do?
de_de: Was kann ich machen, wenn ich das Passwort für <systemitem class="username">root</systemitem> vergessen habe?
es_es: ¡He olvidado la contraseña de <systemitem class="username">root</systemitem>! ¿Qué hago?
pt_br: Esqueci a senha do <systemitem class="username">root</systemitem>! O que eu faço?

source: Do not panic! Restart the system, type <userinput>boot -s</userinput> at the <literal>Boot:</literal> prompt to enter single-user mode. At the question about the shell to use, hit <keycap>Enter</keycap> which will display a <prompt>#</prompt> prompt. Enter <command>mount -urw /</command> to remount the root file system read/write, then run <command>mount -a</command> to remount all the file systems. Run <command>passwd root</command> to change the <systemitem class="username">root</systemitem> password then run <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>1</manvolnum></citerefentry> to continue booting.
de_de: Keine Panik! Starten Sie das System neu und geben Sie <userinput>boot -s</userinput> an der Eingabeaufforderung <literal>Boot:</literal> ein, um in den Single-User-Modus zu gelangen. Bei der Frage, welche Shell benutzt werden soll, drücken Sie einfach <keycap>Enter</keycap>. Nun erscheint die Eingabeaufforderung <prompt>#</prompt>. Geben Sie <command>mount -urw /</command> ein, um das Root-Dateisystem für Lese- und Schreibzugriffe zu mounten und dann <command>mount -a</command> um alle Dateisysteme zu mounten. Mit <command>passwd root</command> können Sie das Passwort für <systemitem class="username">root</systemitem> ändern und mit <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>1</manvolnum></citerefentry> können Sie mit dem Booten fortfahren.
es_es: ¡No se desespere! Reinicie el sistema, escriba <userinput>boot -s</userinput> en el indicador <literal>Boot:</literal> para entrar en modo de un solo usuario. Cuando se le pregunte que shell usar, presione <keycap>Enter</keycap> lo cual mostrara el símbolo <prompt>#</prompt>. Ingrese <command>mount -urw /</command> para remontar el sistema de archivos raíz como lectura/escritura, luego corra <command>mount -a</command> para remontar todos los sistemas de archivos. Corra <command>passwd root</command> para cambiar la contraseña de <systemitem class="username">root</systemitem> luego corra <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>1</manvolnum></citerefentry> para continuar con el arranque.
pt_br: Não entre em pânico! Reinicie o sistema, digite <userinput>boot -s</userinput> no prompt <literal>Boot:</literal> para entrar no modo single user. Na pergunta sobre o shell a ser usado, pressione <keycap>Enter</keycap>, que será exibido um prompt <prompt>#</prompt>. Insira o comando <command>mount -urw /</command> para remontar o sistema de arquivos raiz no modo de leitura e gravação e, em seguida, execute o comando <command>mount -a</command> para remontar todos os sistemas de arquivos. Execute o comando <command>passwd root</command> para alterar a senha do usuário <systemitem class="username">root</systemitem> e então execute o comando <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>1</manvolnum></citerefentry> para continuar a inicialização.
