Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: For example, to map the 3 keys to be <keycap>F13</keycap>, <keycap>F14</keycap>, and <keycap>F15</keycap>, respectively. This would make it easy to map them to useful functions within applications or the window manager.
de_de: Sie könnten die drei Tasten zum Beispiel mit den Funktionen <keycap>F13</keycap>, <keycap>F14</keycap>, und <keycap>F15</keycap> belegen. Dadurch ist es sehr einfach, diese Tasten mit nützlichen Funktionen eines Programmes oder Desktops zu verknüpfen.
es_es: Por ejemplo, para mapear las 3 teclas para que sean <keycap>F13</keycap>, <keycap>F14</keycap>, y <keycap>F15</keycap>, respectivamente. Esto haría relativamente simple mapearlas a funciones útiles dentro de aplicaciones o del gestor de ventanas.
pt_br: Por exemplo, para mapear as 3 chaves para serem <keycap>F13</keycap>, <keycap>F14</keycap> e <keycap>F15</keycap>, respectivamente. Isso facilitaria mapeá-los para funções úteis em aplicativos ou no gerenciador de janelas.

source: To do this, put the following in <filename>~/.xmodmaprc</filename>.
de_de: Um dies zu tun, fügen Sie die folgenden Zeilen in <filename>~/.xmodmaprc</filename> ein.
es_es: Para hacer esto, coloque lo siguiente en <filename>~/.xmodmaprc</filename>.
pt_br: Para fazer isto, coloque o seguinte em <filename> ~/.xmodmaprc</filename>.

source: For the <package>x11-wm/fvwm2</package> desktop manager, one could map the keys so that <keycap>F13</keycap> iconifies or de-iconifies the window the cursor is in, <keycap>F14</keycap> brings the window the cursor is in to the front or, if it is already at the front, pushes it to the back, and <keycap>F15</keycap> pops up the main Workplace menu even if the cursor is not on the desktop, which is useful when no part of the desktop is visible.
de_de: Falls Sie zum Beispiel <package>x11-wm/fvwm2</package> benutzen, können Sie ihn so einstellen, dass <keycap>F13</keycap> das Fenster unter dem Mauszeiger minimiert bzw. maximiert. <keycap>F14</keycap> holt das Fenster unter dem Mauszeiger in den Vordergrund bzw. ganz nach hinten, wenn es bereits im Vordergrund ist. <keycap>F15</keycap> öffnet das Arbeitsplatz-Menü, auch wenn der Cursor nicht auf den Hintergrund zeigt. Dies ist extrem praktisch, wenn der gesamte Bildschirm von Fenster belegt wird.
es_es: Para el gestor de escritorio <package>x11-wm/fvwm2</package>, uno podría mapear las teclas de manera que <keycap>F13</keycap> iconifique o desiconofique la ventana en la que esta el cursor, <keycap>F14</keycap> traiga la ventana en la que esta el cursor al frente o, si ya se encuentra al frente la lleve al fondo, y <keycap>F15</keycap> haga surgir el menu principal de Workplace incluso si el cursor no esta en el escritorio, lo cual es útil cuando no hay ninguna parte del escritorio visible.
pt_br: Para o gerenciador da área de trabalho <package>x11-wm/fvwm2</package>, pode-se mapear as chaves para que <keycap>F13</keycap> seja minimizada a janela em que o cursor está ou a maximize, <keycap>F14</keycap> traz a janela em que o cursor está para a frente ou, se já estiver na frente, a coloca em background <keycap>F15</keycap> aparece no menu principal do Workplace mesmo que o cursor não esteja a área de trabalho, o que é útil quando nenhuma parte da área de trabalho está visível.

source: The following entries in <filename>~/.fvwmrc</filename> implement the aforementioned setup:
de_de: Dieses Verhalten erhält man mit den folgenden Einträgen in <filename>~/.fvwmrc</filename>:
es_es: Las siguientes entradas en <filename>~/.fvwmrc</filename> implementan la configuración mencionada:
pt_br: As seguintes entradas em <filename> ~/.fvwmrc </filename> implementam a configuração acima mencionada:

source: How can I get 3D hardware acceleration for <trademark class="registered">OpenGL</trademark>?
de_de: Wird 3D Hardware Beschleunigung für <trademark class="registered">OpenGL</trademark> unterstützt?
es_es: ¿Como puedo obtener aceleración de hardware 3D para <trademark class="registered">OpenGL</trademark>?
pt_br: Como posso obter aceleração de hardware 3D para o <trademark class="registered"> OpenGL </trademark>?

source: The availability of 3D acceleration depends on the version of Xorg and the type of video chip. For an nVidia chip, use the binary drivers provided for FreeBSD by installing one of the following ports:
de_de: Dies hängt davon ab, welche Version von Xorg und welche Grafikkarte Sie verwenden. Wenn Sie eine Karte mit nVidia-Chipsatz besitzen, benutzen Sie die binären Treiber für FreeBSD, indem Sie einen der folgenden Ports installieren:
es_es: La disponibilidad de la aceleración 3D depende de la versión de Xorg y el tipo de chip de video. Para un chip nVidia, use los controladores binarios provistos por FreeBSD instalando uno de los siguientes ports:
pt_br: A disponibilidade da aceleração 3D depende da versão do Xorg e do tipo de chip de vídeo. Para um chip da nVidia, use os drivers binários fornecidos para o FreeBSD instalando um dos seguintes ports:

source: The latest versions of nVidia cards are supported by the <package>x11/nvidia-driver</package> port.
de_de: Die aktuelle Version von nVidia-Karten wird durch den Port <package>x11/nvidia-driver</package> unterstützt.
es_es: Las ultimas versiones de tarjetas nVidia estan soportadas por el port <package>x11/nvidia-driver</package>.
pt_br: As versões mais recentes das placas nVidia são suportadas pelo port <package> x11/nvidia-driver </package>.

source: Older drivers are available as <package>x11/nvidia-driver-<replaceable>###</replaceable></package>
de_de: Unterstützung für ältere Treiber finden Sie in <package>x11/nvidia-driver-<replaceable>###</replaceable></package>
es_es: Los controladores más viejos están disponibles como <package>x11/nvidia-driver-<replaceable>###</replaceable></package>
pt_br: Drivers mais antigos estão disponíveis como <package>x11/nvidia-driver-<replaceable> ###</replaceable> </package>

source: nVidia provides detailed information on which card is supported by which driver on their web site: <uri xlink:href="http://www.nvidia.com/object/IO_32667.html">http://www.nvidia.com/object/IO_32667.html</uri>.
de_de: nVidia liefert detaillierte Informationen darüber, welche Karte von welchem Treiber unterstützt wird. Diese Information finden Sie auf der Website <uri xlink:href="http://www.nvidia.com/object/IO_32667.html">http://www.nvidia.com/object/IO_32667.html</uri>.
es_es: nVidia provee información detallada acerca de que tarjeta esta soportada por que controlador en su sitio web: <uri xlink:href="http://www.nvidia.com/object/IO_32667.html">http://www.nvidia.com/object/IO_32667.html</uri>.
pt_br: A nVidia fornece informações detalhadas sobre qual placa é suportada por qual driver em seu site: <uri xlink:href="http://www.nvidia.com/object/IO_32667.html">http://www.nvidia.com /object/IO_32667.html</uri>.

source: For Matrox G200/G400, check the <package>x11-servers/mga_hal</package> port.
de_de: Für Matrox G200/400 können Sie den Port <package>x11-servers/mga_hal</package> benutzen.
es_es: Para Matrox G200/G400, vea el port <package>x11-servers/mga_hal</package>.

source: For ATI Rage 128 and Radeon see <citerefentry vendor="xorg"><refentrytitle>ati</refentrytitle><manvolnum>4</manvolnum></citerefentry>, <citerefentry vendor="xorg"><refentrytitle>r128</refentrytitle><manvolnum>4</manvolnum></citerefentry> and <citerefentry vendor="xorg"><refentrytitle>radeon</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
de_de: Bei ATI Rage 128 und Radeon lesen Sie <citerefentry vendor="xorg"><refentrytitle>ati</refentrytitle><manvolnum>4</manvolnum></citerefentry>, <citerefentry vendor="xorg"><refentrytitle>r128</refentrytitle><manvolnum>4</manvolnum></citerefentry> und <citerefentry vendor="xorg"><refentrytitle>radeon</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
es_es: Para ATI Rage 128 y Radeon vea <citerefentry vendor="xorg"><refentrytitle>ati</refentrytitle><manvolnum>4</manvolnum></citerefentry>, <citerefentry vendor="xorg"><refentrytitle>r128</refentrytitle><manvolnum>4</manvolnum></citerefentry> y <citerefentry vendor="xorg"><refentrytitle>radeon</refentrytitle><manvolnum>4</manvolnum></citerefentry>.
pt_br: Para a ATI Rage 128 e Radeon, consulte <citerefentry vendor="xorg"><refentrytitle>ati</refentrytitle><manvolnum>4</manvolnum></citerefentry>, <citerefentry vendor="xorg"><refentrytitle>r128</refentrytitle><manvolnum>4</manvolnum></citerefentry> and <citerefentry vendor="xorg"><refentrytitle>radeon</refentrytitle><manvolnum>4</manvolnum></citerefentry>.

source: Networking
de_de: Netzwerke
es_es: Redes

source: Where can I get information on <quote>diskless booting</quote>?
de_de: Woher kann ich Informationen über <quote>Diskless Booting</quote> bekommen?
es_es: ¿Donde puedo obtener información acerca del <quote>arranque sin disco rígido</quote>?
pt_br: Onde posso obter informações sobre a <quote>inicialização sem disco</quote>?

source: <quote>Diskless booting</quote> means that the FreeBSD box is booted over a network, and reads the necessary files from a server instead of its hard disk. For full details, see <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-diskless.html">the Handbook entry on diskless booting</link>.
de_de: <quote>Diskless Booting</quote> bedeutet, dass die FreeBSD-Maschine über ein Netzwerk gebootet wird und die notwendigen Dateien von einem Server anstatt von der Festplatte liest. Vollständige Details finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/network-diskless.html">Handbucheintrag über den plattenlosen Betrieb</link>.
es_es: <quote>Arranque sin disco rígido</quote> significa que la instalación de FreeBSD se arranca desde la red, y lee los archivos necesarios desde un servidor en lugar del disco rígido. Para más detalles, vea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-diskless.html">la entrada del manual acerca del arranque sin disco rígido</link>.
pt_br: <quote>Inicialização sem disco</quote> significa que o sistema FreeBSD é inicializado através de uma rede e lê os arquivos necessários de um servidor ao invés de seu disco rígido. Para maiores detalhes, consulte a entrada do Handbook <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-diskless.html">Inicialização sem disco</link>.

source: Can a FreeBSD box be used as a dedicated network router?
de_de: Kann eine FreeBSD-Maschine als Netzwerkrouter genutzt werden?
es_es: ¿Puede una instalación de FreeBSD usarse como un router dedicado?
pt_br: Uma maquina FreeBSD pode ser usada como um roteador de rede dedicado?

source: Yes. Refer to the Handbook entry on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/advanced-networking.html">advanced networking</link>, specifically the section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-routing.html">routing and gateways</link>.
de_de: Ja. Genaue Informationen zu diesem Thema finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/network-routing.html">Gateways und Routen</link> des Handbuchkapitels <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/advanced-networking.html">Weiterführende Netzwerkthemen</link>.
es_es: Si. Vea la entrada del manual acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/advanced-networking.html">redes avanzadas</link>, específicamente la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-routing.html">routing y gateways</link>.
pt_br: Sim. Consulte a entrada do Manual em <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/advanced-networking.html">rede avançada</link>, especificamente a seção sobre <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/network-routing.html">roteamento e gateways</link>.

source: Can I connect my <trademark class="registered">Windows</trademark> box to the Internet via FreeBSD?
de_de: Kann ich meine <trademark class="registered">Windows</trademark>-Maschine über FreeBSD ans Internet anbinden?
es_es: ¿Puedo conectar mi instalación de <trademark class="registered">Windows</trademark> a la Internet mediante FreeBSD?
pt_br: Posso conectar minha maquina <trademark class="registered">Windows</trademark> à Internet via FreeBSD?

source: Typically, people who ask this question have two PCs at home, one with FreeBSD and one with some version of <trademark class="registered">Windows</trademark> the idea is to use the FreeBSD box to connect to the Internet and then be able to access the Internet from the <trademark class="registered">Windows</trademark> box through the FreeBSD box. This is really just a special case of the previous question and works perfectly well.
de_de: Personen, die diese Frage stellen, haben typischerweise zwei PCs zu Hause: einen mit FreeBSD und einen mit einer <trademark class="registered">Windows</trademark>-Variante. Die Idee ist, die FreeBSD-Maschine an das Internet anzubinden, um in der Lage zu sein, von der <trademark class="registered">Windows</trademark>-Maschine über die FreeBSD-Maschine auf das Internet zuzugreifen. Das ist tatsächlich nur ein Spezialfall der vorherigen Frage.
es_es: Usualmente, la gente que pregunta esto tiene dos PCs en su casa, una con FreeBSD y una con alguna versión de <trademark class="registered">Windows</trademark> la idea es usar la instalación de FreeBSD para conectarse a la Internet y así poder usar Internet desde la instalación de <trademark class="registered">Windows</trademark> a través de FreeBSD. Esto es únicamente un caso especial de la pregunta anterior y funciona perfectamente bien.
pt_br: Normalmente, as pessoas que fazem essa pergunta têm dois PCs em casa, um com o FreeBSD e outro com alguma versão do <trademark class="registered">Windows</trademark>, a idéia é usar o sistema FreeBSD para conectar-se à Internet e depois ser capaz de acessar a Internet a partir do sistema <trademark class="registered">Windows</trademark> através do sistema FreeBSD. Este é realmente apenas um caso especial da pergunta anterior e funciona perfeitamente bem.

source: Dialup users must use <option>-nat</option> and set <literal>gateway_enable</literal> to <emphasis>YES</emphasis> in <filename>/etc/rc.conf</filename>. For more information, refer to <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> or the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html">Handbook entry on user PPP</link>.
de_de: Wenn Sie eine Einwahlverbindung benutzen, müssen Sie <command>ppp</command> mit der Option <option>-nat</option> verwenden und in <filename>/etc/rc.conf</filename> die Variable <literal>gateway_enable</literal> auf <emphasis>YES</emphasis> setzen. Weitere Informationen erhalten Sie in <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> oder im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/userppp.html">User-PPP des Handbuchs</link>.
es_es: Los usuarios de dialup deben usar <option>-nat</option> y ajustar <literal>gateway_enable</literal> a <emphasis>YES</emphasis> en <filename>/etc/rc.conf</filename>. Para más información, vea <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> o la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html">entrada del manual acerca de PPP de usuario</link>.
pt_br: Usuários de rede discada devem usar <option>-nat</option> e definir <literal>gateway_enable</literal> para <emphasis>YES</emphasis> no arquivo <filename>/etc/rc.conf</filename>. Para obter mais informações, consulte <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ou o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html ">manual no usuário PPP</link>.

source: If the connection to the Internet is over Ethernet, use <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry>. A tutorial can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> section of the Handbook.
de_de: Wenn die Verbindung zum Internet über Ethernet erstellt wurde, müssen Sie <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzen. Weitere Informationen dazu finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> des Handbuchs.
es_es: Si la conexión a Internet es sobre Ethernet, use <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Puede encontrarse un tutorial en la sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> del manual.
pt_br: Se a conexão com a Internet for pela Ethernet, use <citerefentry><refentrytitle>natd</refentrytitle><manvolnum>8</manvolnum> </citerefentry>. Um tutorial pode ser encontrado na seção <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> do manual.

source: Does FreeBSD support PPP?
de_de: Unterstützt FreeBSD und PPP?
es_es: ¿FreeBSD soporta PPP?
pt_br: O FreeBSD suporta PPP?

source: Yes. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> provides support for both incoming and outgoing connections.
de_de: Ja. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> bietet Unterstützung für eingehende und ausgehende Verbindungen.
es_es: Si. <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> provee soporte para conexiones entrantes y salientes.
pt_br: Sim. O <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> fornece suporte para conexões de entrada e saída.

source: For more information on how to use this, refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html">Handbook chapter on PPP</link>.
de_de: Weitere Informationen finden Sie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ppp-and-slip.html">Kapitel PPP im Handbuch</link>.
es_es: Para más información acerca de como usar esto, vea el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html">capítulo del manual acerca de PPP</link>.
pt_br: Para obter mais informações sobre como usar isso, consulte o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ppp-and-slip.html">capítulo sobre o PPP</link> no Handbook.

source: Does FreeBSD support NAT or Masquerading?
de_de: Unterstützt FreeBSD NAT oder Masquerading?
es_es: ¿FreeBSD soporta NAT o Masquerading?
pt_br: O FreeBSD suporta NAT ou Mascaramento de IPs?

source: Yes. For instructions on how to use NAT over a PPP connection, see the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html">Handbook entry on PPP</link>. To use NAT over some other sort of network connection, look at the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> section of the Handbook.
de_de: Ja. Wenn Sie NAT über eine User-PPP-Verbindung einsetzen wollen, lesen Sie den <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/userppp.html">Abschnitt PPP des Handbuchs</link>. Wollen Sie NAT über eine andere Verbindung einsetzen, lesen Sie bitte den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">NAT Konfiguration</link> im Handbuch.
es_es: Si. Para instrucciones acerca de como usar NAT sobre una conexión PPP, vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/userppp.html">entrada de manual acerca de PPP</link>. Para usar NAT sobre otro tipo de conección de red, vea la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> en el manual.
pt_br: Sim. Para obter instruções sobre como usar o NAT em uma conexão PPP, consulte a seção do <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/userppp.html">PPP</link> no manual. Para usar o NAT em algum outro tipo de conexão de rede, consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/pt_BR.ISO8859-1/books/handbook/firewalls-ipfw.html#network-natd">natd</link> do manual.

source: How can I set up Ethernet aliases?
de_de: Wie kann ich Ethernet-Aliase einrichten?
es_es: ¿Como configuro aliases de Ethernet?
pt_br: Como posso configurar aliases de Ethernet?

source: If the alias is on the same subnet as an address already configured on the interface, add <literal>netmask 0xffffffff</literal> to this command:
de_de: Wenn sich die zweite Adresse im gleichen Subnetz befindet wie eine der Adressen, die bereits auf der Schnittstelle konfiguriert sind, benutzen Sie <literal>netmask 0xffffffff</literal> wie in diesem Beispiel:
es_es: Si el alias esta en la misma subred que una dirección ya configurada en la interfaz, agregue <literal>netmask 0xffffffff</literal> a este comando:
pt_br: Se o alias estiver na mesma sub-rede que um endereço já configurado na interface, adicione <literal>netmask 0xffffffff </literal>a este comando:

source: Otherwise, specify the network address and netmask as usual:
de_de: Andernfalls geben sie die Adresse und die Netzmaske wie gewohnt an:
es_es: De otro modo, especifique la dirección de red y netmask de la manera usual:
pt_br: Caso contrário, especifique o endereço de rede e a máscara de rede como de costume:

source: More information can be found in the FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-virtual-hosts.html">Handbook</link>.
de_de: Weitere Informationen finden Sie im FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/configtuning-virtual-hosts.html">Handbuch</link>.
es_es: Puede encontrarse más información en el manual <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-virtual-hosts.html">Handbook</link> de FreeBSD.
pt_br: Mais informações podem ser encontradas <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/configtuning-virtual-hosts.html">Handbook</link> do FreeBSD.

source: Why can I not NFS-mount from a <trademark class="registered">Linux</trademark> box?
de_de: Warum kann ich per NFS nicht von einer <trademark class="registered">Linux</trademark>-Maschine mounten?
es_es: ¿Por qué no puedo realizar un montado NFS desde una instalación <trademark class="registered">Linux</trademark>?
pt_br: Por que não posso montar o NFS de uma máquina <trademark class="registered">Linux</trademark>?

source: Some versions of the <trademark class="registered">Linux</trademark> NFS code only accept mount requests from a privileged port; try to issue the following command:
de_de: Einige Versionen des <trademark class="registered">Linux</trademark> NFS-Codes akzeptieren Mount-Anfragen nur von einem privilegierten Port. Versuchen Sie den folgenden Befehl:
es_es: Algunas versiones del código NFS de <trademark class="registered">Linux</trademark> solo aceptan pedidos de montaje de un puerto privilegiado; intente con el siguiente comando:
pt_br: Algumas versões do código NFS do <trademark class="registered">Linux</trademark> aceitam somente solicitações de montagem vindas de uma porta privilegiada; tente executar o seguinte comando:
