Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: 773 pages
de_de: 773 Seiten
es_es: 773 paginas

source: <citetitle>FreeBSD for PC 98'ers (in Japanese)</citetitle> <_:publisher-1/> <_:biblioid-2/>
de_de: <citetitle>FreeBSD for PC 98'ers (in Japanisch)</citetitle> <_:publisher-1/> <_:biblioid-2/>
es_es: <citetitle>FreeBSD for PC 98'ers (en Japonés)</citetitle> <_:publisher-1/> <_:biblioid-2/>

source: <citetitle>FreeBSD (in Japanese)</citetitle> <_:publisher-1/> <_:biblioid-2/>
de_de: <citetitle>FreeBSD (in Japanisch)</citetitle> <_:publisher-1/> <_:biblioid-2/>
es_es: <citetitle>FreeBSD (en Japonés)</citetitle> <_:publisher-1/> <_:biblioid-2/>

source: <citetitle>Complete Introduction to FreeBSD (in Japanese)</citetitle> <_:publisher-1/> <_:biblioid-2/>
de_de: <citetitle>Complete Introduction to FreeBSD (in Japanisch)</citetitle> <_:publisher-1/> <_:biblioid-2/>
es_es: <citetitle>Complete Introduction to FreeBSD (en Japonés)</citetitle> <_:publisher-1/> <_:biblioid-2/>

source: <citetitle>FreeBSD Handbook (Japanese translation)</citetitle> <_:publisher-1/> <_:biblioid-2/>
de_de: <citetitle>FreeBSD Handbook (Japanische Übersetzung)</citetitle> <_:publisher-1/> <_:biblioid-2/>
es_es: <citetitle>FreeBSD Handbook (traducción al Japonés)</citetitle> <_:publisher-1/> <_:biblioid-2/>

source: <citetitle>FreeBSD mit Methode (in German)</citetitle> <_:publisher-1/> <_:pubdate-2/> <_:biblioid-3/>
de_de: <citetitle>FreeBSD mit Methode (in Deutsch)</citetitle> <_:publisher-1/> <_:pubdate-2/> <_:biblioid-3/>
es_es: <citetitle>FreeBSD mit Methode (en Alemán)</citetitle> <_:publisher-1/> <_:pubdate-2/> <_:biblioid-3/>

source: <citetitle>FreeBSD install and Utilization Manual (in Japanese)</citetitle> <_:publisher-1/>
de_de: <citetitle>FreeBSD install and Utilization Manual (in Japanisch)</citetitle> <_:publisher-1/>
es_es: <citetitle>FreeBSD install and Utilization Manual (en Japonés)</citetitle> <_:publisher-1/>

source: <citetitle>Building Internet Server with FreeBSD (in Indonesia Language)</citetitle> <_:publisher-1/> <_:authorgroup-2/>
de_de: <citetitle>Building Internet Server with FreeBSD (in Indonesisch)</citetitle> <_:publisher-1/> <_:authorgroup-2/>
es_es: <citetitle>Building Internet Server with FreeBSD (en idioma Indonesio)</citetitle> <_:publisher-1/> <_:authorgroup-2/>

source: <citetitle>FreeBSD User's Reference Manual (Japanese translation)</citetitle> <_:publisher-1/> <_:author-2/> <_:pubdate-3/> <_:biblioid-4/>
de_de: <citetitle>FreeBSD User's Reference Manual (Japanische Übersetzung)</citetitle> <_:publisher-1/> <_:author-2/> <_:pubdate-3/> <_:biblioid-4/>
es_es: <citetitle>FreeBSD User's Reference Manual (traducción al Japonés)</citetitle> <_:publisher-1/> <_:author-2/> <_:pubdate-3/> <_:biblioid-4/>

source: 2nd edition
de_de: Zweite Auflage
es_es: 2a edición

source: 4th edition
de_de: Vierte Auflage
es_es: 4a edición

source: December 1994
de_de: Dezember 1994
es_es: Diciembre 1994

source: January 1991-July 1992
de_de: Januar 1991 - Juli 1992
es_es: Enero 1991-Julio 1992

source: July-August 1978
de_de: Juli - August 1978
es_es: Enero-Agosto 1978

source: Vol 57, No 6, Part 2
es_es: Vol 57, No 6, Parte 2

source: 6th edition
de_de: Sechste Ausgabe
es_es: 6a edición

source: June 2002
de_de: Juni 2002
es_es: Junio 2002

source: Copyright
de_de: Rechtlicher Hinweis

source: $FreeBSD: head/en_US.ISO8859-1/books/faq/book.xml 49565 2016-10-24 19:11:30Z bhd $
de_de: $FreeBSD: head/en_US.ISO8859-1/books/faq/book.xml 48288 2016-02-28 14:41:01Z blackend $

source: Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.0-RELEASE/">11.0</link> is the latest release from the <emphasis>10-STABLE</emphasis> branch; it was released in October 2016. Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.3-RELEASE/">10.3</link> is the latest release from the <emphasis>9-STABLE</emphasis> branch; it was released in April 2016.
de_de: Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.3-RELEASE/">10.3</link> ist das aktuelle Release des <emphasis>10-STABLE</emphasis>-Zweigs und ist im April 2016 erschienen. Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/9.3-RELEASE/">9.3</link> ist das aktuelle Release aus dem <emphasis>9-STABLE</emphasis>-Zweig und ist im Juli 2014 erschienen.

source: Back when FreeBSD 2.0.5 was released, FreeBSD development branched in two. One branch was named <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, one <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link>. <emphasis>FreeBSD-STABLE</emphasis> is the development branch from which major releases are made. Changes go into this branch at a slower pace and with the general assumption that they have first been tested in FreeBSD-CURRENT. However, at any given time, the sources for FreeBSD-STABLE may or may not be suitable for general use, as it may uncover bugs and corner cases that were not yet found in FreeBSD-CURRENT. Users who do not have the resources to perform testing should instead run the most recent release of FreeBSD. <emphasis>FreeBSD-CURRENT</emphasis>, on the other hand, has been one unbroken line since 2.0 was released, leading towards 11.0-RELEASE and beyond. For more detailed information on branches see <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">FreeBSD Release Engineering: Creating the Release Branch</link></quote>, the status of the branches and the upcoming release schedule can be found on the <link xlink:href="http://www.FreeBSD.org/releng">Release Engineering Information</link> page.
de_de: Zur der Zeit, als FreeBSD 2.0.5 herausgegeben wurde, wurde entschieden, die Entwicklung von FreeBSD zweizuteilen. Ein Zweig wurde <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/current-stable.html#stable">-STABLE</link>, der andere <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/current-stable.html#current">-CURRENT</link> genannt. <emphasis>FreeBSD-STABLE</emphasis> ist der Entwicklungszweig aus dem die Hauptversionen erstellt werden. In diesem Zweig gehen nur Änderungen ein, wenn sie zuvor sorgfältig in FreeBSD-CURRENT getestet wurden. Gelegentlich können die Quellen für FreeBSD-STABLE möglicherweise nicht für den allgemeinen Gebrauch geeignet sein, da es Fehler enthalten können, die noch nicht in FreeBSD-CURRENT gefunden wurden. Benutzer, die nicht über genügend Ressourcen verfügen um zu testen, sollten stattdessen die aktuelle Version von FreeBSD verwenden. <emphasis>FreeBSD-CURRENT</emphasis> ist eine ununterbrochene Linie seitdem die Version 2.0 herausgegeben worden ist. Sie führt zu 11.0-RELEASE (und darüber hinaus). Weitere Informationen zu diesen Zweigen finden Sie unter <quote><link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-proc.html#rel-branch">FreeBSD Release Engineering: Creating the Release Branch</link></quote>, der Status der Zweige und der Zeitplan zur anstehenden Veröffentlichung kann auf der Seite <link xlink:href="http://www.FreeBSD.org/releng">Release Engineering Information</link> gefunden werden.

source: 11.0-STABLE is the actively developed <emphasis>-STABLE</emphasis> branch. The latest release on the 11.0-STABLE branch is 11.0-RELEASE, which was released in October 2016.
de_de: 11.0-STABLE ist der Zweig, auf den sich die Entwicklung von <emphasis>-STABLE</emphasis> zur Zeit konzentriert. Das neueste Release aus dem 11.0-STABLE-Zweig ist 11.0-RELEASE und ist im Oktober 2016 erschienen.

source: The latest <emphasis>10-STABLE</emphasis> release, 11.0-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.0-RELEASE/">11.0-RELEASE directory</link>.
de_de: Das aktuelle <emphasis>10-STABLE</emphasis>-Release, 10.3-RELEASE, finden Sie im <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.3-RELEASE/">Verzeichnis 10.3-RELEASE</link>.

source: The latest <emphasis>9-STABLE</emphasis> release, 10.3-RELEASE can be found in the <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.3-RELEASE/">10.3-RELEASE directory</link>.
de_de: Das aktuelle <emphasis>10-STABLE</emphasis>-Release, 10.3-RELEASE, finden Sie im <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/10.3-RELEASE/">Verzeichnis 10.3-RELEASE</link>.

source: <prompt>#</prompt> <userinput>fetch ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</userinput> <prompt>#</prompt> <userinput>tar xvf book.html-split.tar.bz2</userinput>
de_de: <prompt>#</prompt> <userinput>fetch ftp://ftp.de.FreeBSD.org/pub/FreeBSD/doc/en_US.ISO8859-1/books/faq/book.html-split.tar.bz2</userinput> <prompt>#</prompt> <userinput>tar xvf book.html-split.tar.bz2</userinput>

source: General
de_de: Allgemeines
pt_br: Geral

source: This is discussed continually on the FreeBSD mailing lists but is to be expected since hardware changes so quickly. Read through the Hardware Notes for FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/11.0R/hardware.html">11.0</link> or <link xlink:href="http://www.FreeBSD.org/releases/10.3R/hardware.html">10.3</link> and search the mailing list <link xlink:href="http://www.FreeBSD.org/search/#mailinglists">archives</link> before asking about the latest and greatest hardware. Chances are a discussion about that type of hardware took place just last week.
de_de: Diese Frage wird ständig auf den FreeBSD-Mailinglisten diskutiert. Da sich die Hardware ständig ändert, ist das allerdings keine Überraschung. Lesen Sie die Hardware-Informationen für FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/11.0R/hardware.html">11.0</link> oder <link xlink:href="http://www.FreeBSD.org/releases/10.3R/hardware.html">10.3</link> und durchsuchen Sie die Mailinglisten-<link xlink:href="http://www.FreeBSD.org/search/#mailinglists">Archive</link>, bevor Sie nach der neuesten/besten Hardware fragen. Oft gab es kurz zuvor eine Diskussion über genau die Hardware, die Sie sich zulegen wollen.

source: See the complete list in the Hardware Notes for FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/11.0R/hardware.html">11.0</link> or <link xlink:href="http://www.FreeBSD.org/releases/10.3R/hardware.html">10.3</link>.
de_de: Sie finden eine vollständige und aktuelle Liste in den Hardware-Informationen zu FreeBSD <link xlink:href="http://www.FreeBSD.org/releases/11.0R/hardware.html">11.0</link> oder <link xlink:href="http://www.FreeBSD.org/releases/9.3R/hardware.html">9.3</link>.

source: Use <citerefentry><refentrytitle>tzsetup</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Benutzen Sie <citerefentry><refentrytitle>tzsetup</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Use o <citerefentry><refentrytitle>tzsetup</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: The detailed answer for this question can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot-splash.html">Boot Time Splash Screens</link> section of the FreeBSD Handbook.
de_de: Die detaillierte Antwort auf diese Frage finden Sie im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/boot-splash.html">Willkommensbildschirme während des Bootvorgangs konfigurieren</link> des FreeBSD Handbuchs.
pt_br: A resposta detalhada para essa pergunta pode ser encontrada na seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot-splash.html">Telas de inicialização do tempo de inicialização</link> do FreeBSD Handbook.

source: <citetitle>Personal UNIX Starter Kit FreeBSD (in Japanese)</citetitle> <_:publisher-1/> <_:biblioid-2/>
de_de: <citetitle>Personal UNIX Starter Kit FreeBSD (in Japanisch)</citetitle> <_:publisher-1/> <_:biblioid-2/>

source: Frequently Asked Questions for FreeBSD 10.<replaceable>X</replaceable> and 11.<replaceable>X</replaceable>
pt_br: Perguntas freqüentes para o FreeBSD 10.<replaceable>X</replaceable> e 11.<replaceable>X</replaceable>

source: <year>1995</year> <year>1996</year> <year>1997</year> <year>1998</year> <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <year>2008</year> <year>2009</year> <year>2010</year> <year>2011</year> <year>2012</year> <year>2013</year> <year>2014</year> <year>2015</year> <year>2016</year> <year>2017</year> <year>2018</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>1995</year> <year>1996</year> <year>1997</year> <year>1998</year> <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <year>2008</year> <year>2009</year> <year>2010</year> <year>2011</year> <year>2012</year> <year>2013</year> <year>2014</year> <year>2015</year> <year>2016</year> <year>2017</year> <year>2018</year> <holder>Projeto de Documentação do FreeBSD</holder>

source: This is the Frequently Asked Questions <acronym>(FAQ)</acronym> for FreeBSD versions 10.<replaceable>X</replaceable> and 11.<replaceable>X</replaceable>. Every effort has been made to make this <acronym>FAQ</acronym> as informative as possible; if you have any suggestions as to how it may be improved, send them to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
pt_br: Estas são as Perguntas Mais Frequentes <acronym>(FAQ)</acronym> para as versões do FreeBSD 10.<replaceable>X</replaceable> e 11.<replaceable>X</replaceable>. Todos os esforços foram feitos para tornar este <acronym>FAQ</acronym> o mais informativo possível; Se você tiver alguma sugestão de como ele pode ser melhorado, envie-a para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>.

source: The latest version of this document is always available from the <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/index.html">FreeBSD website</link>. It may also be downloaded as one large <link xlink:href="book.html">HTML</link> file with HTTP or as a variety of other formats from the <link xlink:href="https://download.freebsd.org/ftp/doc/">FreeBSD FTP server</link>.
pt_br: A versão mais recente deste documento está sempre disponível no <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/index.html">website do FreeBSD</link>. Ela também pode ser baixada como um grande arquivo <link xlink:href="book.html">HTML</link> por HTTP ou em uma grande variedade de outros formatos a partir do <link xlink:href="https://download.freebsd.org/ftp/doc/">servidor de FTP do projeto FreeBSD</link>.

source: FreeBSD is a modern operating system for desktops, laptops, servers, and embedded systems with support for a large number of <link xlink:href="https://www.FreeBSD.org/platforms/">platforms</link>.
pt_br: O FreeBSD é um sistema operacional moderno para desktops, laptops, servidores e sistemas embarcados, com suporte para um grande número de <link xlink:href="https://www.FreeBSD.org/platforms/">plataformas</link>.

source: Yes. Those restrictions do not control how the code is used, but how to treat the FreeBSD Project itself. The license itself is available at <link xlink:href="https://www.FreeBSD.org/copyright/freebsd-license.html">license</link> and can be summarized like this:
pt_br: Sim. Essas restrições não controlam como o código é usado, mas como tratar o próprio projeto FreeBSD. A licença em si está disponível em <link xlink:href="https://www.FreeBSD.org/copyright/freebsd-license.html">licença</link> e pode ser resumida da seguinte forma:

source: Code in our source tree which falls under the <link xlink:href="https://www.FreeBSD.org/copyright/COPYING">GNU General Public License (GPL)</link> or <link xlink:href="https://www.FreeBSD.org/copyright/COPYING.LIB">GNU Library General Public License (LGPL)</link> comes with slightly more strings attached, though at least on the side of enforced access rather than the usual opposite. Due to the additional complexities that can evolve in the commercial use of GPL software, we do, however, endeavor to replace such software with submissions under the more relaxed <link xlink:href="https://www.FreeBSD.org/copyright/freebsd-license.html">FreeBSD license</link> whenever possible.
pt_br: O código em nosso repositório de código-fonte que se enquadra na <link xlink:href="https://www.FreeBSD.org/copyright/COPYING">Licença Pública Geral GNU (GPL)</link> ou na <link xlink:href="https://www.FreeBSD.org/copyright/COPYING.LIB">Licença Pública Geral da Biblioteca GNU (LGPL)</link> vem com algumas restrições adicionais, ainda que sejam no sentido de forçar o acesso, em vez do habitual oposto. Devido às complexidades adicionais que podem surgir no uso comercial de um software GPL, nós nos esforçamos para substituir tais softwares por outros sob a <link xlink:href="https://www.FreeBSD.org/copyright/freebsd-license.html">Licença FreeBSD</link> que é menos restritiva, sempre que possível.

source: Most people do not actually use an operating system. They use applications. The applications are what really use the operating system. FreeBSD is designed to provide a robust and full-featured environment for applications. It supports a wide variety of web browsers, office suites, email readers, graphics programs, programming environments, network servers, and much more. Most of these applications can be managed through the <link xlink:href="https://www.FreeBSD.org/ports/">Ports Collection</link>.
pt_br: A maioria das pessoas não usa um sistema operacional. Elas usam aplicativos. São os aplicativos que realmente usam o sistema operacional. O FreeBSD é projetado para fornecer um ambiente robusto e completo para aplicativos. Ele suporta uma grande variedade de navegadores da web, pacotes de escritório, leitores de e-mail, programas gráficos, ambientes de programação, servidores de rede e muito mais. A maioria destes aplicativos pode ser gerenciada através da <link xlink:href="https://www.FreeBSD.org/ports/">Coleção de Ports</link>.

source: Users migrating to FreeBSD from another <trademark class="registered">UNIX</trademark>-like environment will find FreeBSD to be similar. <trademark class="registered">Windows</trademark> and <trademark class="registered">Mac OS</trademark> users may be interested in instead using <link xlink:href="https://www.trueos.org">TrueOS</link>, a FreeBSD-based desktop distribution. Non-<trademark class="registered">UNIX</trademark> users should expect to invest some additional time learning the <trademark class="registered">UNIX</trademark> way of doing things. This <acronym>FAQ</acronym> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">FreeBSD Handbook</link> are excellent places to start.
pt_br: Os usuários que migrarem para o FreeBSD vindos de outro ambiente <trademark class="registered">UNIX</trademark>-like irão achar o FreeBSD bastante similar. Os usuários de <trademark class="registered">Windows</trademark> e do <trademark class="registered">Mac OS</trademark> podem se interessar em usar o <link xlink:href="https://www.trueos.org">TrueOS</link>, uma distribuição de desktop baseada no FreeBSD. Os usuários que não estão habituados ao uso de sistemas <trademark class="registered">UNIX</trademark> devem investir algum tempo adicional aprendendo a maneira de fazer as coisas no <trademark class="registered">UNIX</trademark>. Este <acronym>FAQ</acronym> e o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Manual do FreeBSD </link> são excelentes lugares para iniciar.

source: James Howard wrote a good explanation of the history and differences between the various projects, called <link xlink:href="https://jameshoward.us/archive/the-bsd-family-tree/">The BSD Family Tree</link> which goes a fair way to answering this question. Some of the information is out of date, but the history portion in particular remains accurate.
pt_br: O James Howard escreveu uma boa explicação da história e das diferenças entre os vários projetos BSD, chamada <link xlink:href="https://jameshoward.us/archive/the-bsd-family-tree/">A árvore genealógica do BSD</link>, a qual é uma boa forma de responder a esta pergunta. Algumas das informações estão desatualizadas, mas a parte da história em particular permanece precisa.

source: At any point in the development of FreeBSD, there can be multiple parallel branches. 11.<replaceable>X</replaceable> releases are made from the <emphasis>11-STABLE</emphasis> branch, and 10.<replaceable>X</replaceable> releases are made from the <emphasis>10-STABLE</emphasis> branch.
pt_br: A qualquer momento no desenvolvimento do FreeBSD, podem existir vários branches paralelos. As releases 11.<replaceable>X</replaceable> são geradas a partir da branch <emphasis>11-STABLE</emphasis> e as releases 10.<replaceable>X</replaceable> são geradas a partir do branch <emphasis>10-STABLE</emphasis>.

source: Up until the release of 9.0, the 10.<replaceable>X</replaceable> series was the one known as <emphasis>-STABLE</emphasis>. However, as of 12.<replaceable>X</replaceable>, the 10.<replaceable>X</replaceable> branch will be designated for an <quote>extended support</quote> status and receive only fixes for major problems, such as security-related fixes.
pt_br: Até o lançamento da versão 9.0, a série 10.<replaceable>X</replaceable> era a conhecida como <emphasis>-STABLE</emphasis>. No entanto, a partir da 12.<replaceable>X</replaceable>, a branch 10.<replaceable>X</replaceable> será designada para um status de <quote>suporte estendido</quote> e passará a receber apenas correções para problemas maiores, como as correções relacionadas à segurança.

source: Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.2-RELEASE/">11.2</link> is the latest release from the <emphasis>11-STABLE</emphasis> branch; it was released in June 2018. Version <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.4-RELEASE/">10.4</link> is the latest release from the <emphasis>10-STABLE</emphasis> branch; it was released in October 2017.
pt_br: A versão <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/i386/11.2-RELEASE/">11.2</link> é a última release da branch <emphasis>11-STABLE</emphasis>; ela foi lançada em junho de 2018. A versão <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/10.4-RELEASE/">10.4</link> é a release mais recente da branch <emphasis>10-STABLE</emphasis>; e foi lançada em outubro de 2017.

source: More information on FreeBSD releases can be found on the <link xlink:href="https://www.FreeBSD.org/releng/index.html#release-build">Release Engineering page</link> and in <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.
pt_br: Mais informações sobre as releases do FreeBSD podem ser encontradas na <link xlink:href="https://www.FreeBSD.org/releng/index.html#release-build">página de Engenharia de Releases</link> e em <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.
