Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This kernel message indicates that some activity is provoking it to send a large amount of ICMP or TCP reset (RST) responses. ICMP responses are often generated as a result of attempted connections to unused UDP ports. TCP resets are generated as a result of attempted connections to unopened TCP ports. Among others, these are the kinds of activities which may cause these messages:
de_de: Diese Kernelmeldung deutet darauf hin, dass irgend jemand versucht, die Generierung von sehr vielen ICMP oder TCP reset (RST) Antworten zu provozieren. ICMP Antworten sind oft das Ergebnis von Verbindungsversuchen zu unbenutzten UDP Ports. TCP Resets werden generiert, wenn jemand versucht, eine Verbindung zu einem ungenutzten TCP Port aufzubauen. Die Meldungen können unter anderem durch die folgenden Ereignisse ausgelöst werden:
es_es: Este mensaje del kernel indica que alguna actividad esta provocando que envie una gran cantidad de respuestas ICMP o TCP reset (RST). Las respuestas ICMP son con frecuencia generadas como un resultado de intentos de conexiones a puertos UDP sin usar. Los resets de TCP son generados como el resultado de intentos de conexiones a puertos TCP sin abrir. Entre otros, este tipo de actividades puede causar los siguientes mensajes:
pt_br: Esta mensagem do kernel indica que alguma atividade está provocando o envio de uma grande quantidade de respostas de reset de ICMP ou TCP (RST). As respostas ICMP são frequentemente geradas como resultado de tentativas de conexão a portas UDP não utilizadas. Os resets TCP são geradas como resultado de tentativas de conexão a portas TCP não abertas. Entre outros, esses são os tipos de atividades que podem causar essas mensagens:

source: Brute-force denial of service (DoS) attacks (as opposed to single-packet attacks which exploit a specific vulnerability).
de_de: Brute-force Denial of Service (DoS) Angriffe (im Gegensatz zu Angriffen mit einzelnen Paketen, welche gezielt eine Schwachstelle des Systems ausnutzen).
es_es: Ataques de denegación de servicio por fuerza bruta (DoS) (en lugar de ataques de un solo paquete que explotan una vulnerabilidad específica).
pt_br: Ataques de negação de serviço (DoS) de força bruta (em oposição a ataques de pacote único que exploram uma vulnerabilidade específica).

source: Port scans which attempt to connect to a large number of ports (as opposed to only trying a few well-known ports).
de_de: Port Scans, bei denen versucht wird, Verbindungen zu einer großen Anzahl von Ports (und nicht nur einigen bekannten Ports) herzustellen.
es_es: Escaneos de puertos que intentan conectar un gran número de puertos (en lugar de solo intentar con un par de puertos bien conocidos).
pt_br: Varreduras de porta que tentam se conectar a um grande número de portas (em oposição a apenas tentar algumas portas conhecidas).

source: The first number in the message indicates how many packets the kernel would have sent if the limit was not in place, and the second indicates the limit. This limit is controlled using <varname>net.inet.icmp.icmplim</varname>. This example sets the limit to <literal>300</literal> packets per second:
de_de: Die erste Zahl gibt an, wie viele Pakete vom Kernel ohne das Limit versendet worden wären; die zweite Zahl gibt das Limit an. Sie können das Limit mit der sysctl-Variable <varname>net.inet.icmp.icmplim</varname> einstellen. Im Beispiel wird das Limit auf <literal>300</literal> Pakete pro Sekunde gesetzt:
es_es: El primer número en el mensaje indica cuantos paquetes hubiera enviado el kernel si el límite no existiera, y el segundo indica el límite. Este límite se controla usando <varname>net.inet.icmp.icmplim</varname>. Este ejemplo ajusta el límite a <literal>300</literal> paquetes por segundo:
pt_br: O primeiro número na mensagem indica quantos pacotes o kernel teria enviado se o limite não estivesse no lugar e o segundo indica o limite. Este limite é controlado usando <varname>net.inet.icmp.icmplim</varname>. Este exemplo define o limite para <literal>300</literal> pacotes por segundo:

source: To disable these messages without disabling response limiting, use <varname>net.inet.icmp.icmplim_output</varname> to disable the output:
de_de: Wenn Sie zwar die Begrenzung benutzen möchten, aber die Meldungen nicht in den Logdateien sehen möchten, können Sie die Meldungen mit der sysctl-Variable <varname>net.inet.icmp.icmplim_output</varname> abschalten:
es_es: Para deshabilitar estos mensajes sin deshabilitar la limitación de la respuesta, use <varname>net.inet.icmp.icmplim_output</varname> para deshabilitar la salida:
pt_br: Para desativar essas mensagens sem desativar a limitação de resposta, use o <varname>net.inet.icmp.icmplim_output</varname> para desativar a saída:

source: Finally, to disable response limiting completely, set <varname>net.inet.icmp.icmplim</varname> to <literal>0</literal>. Disabling response limiting is discouraged for the reasons listed above.
de_de: Falls Sie die Begrenzung ganz abschalten wollen, können Sie die sysctl-Variable <varname>net.inet.icmp.icmplim</varname> auf <literal>0</literal>. Wir raten Ihnen aus den oben genannten Gründen dringend von diesem Schritt ab.
es_es: Finalmente, para deshabilitar completamente la limitación de la respuesta, ajuste <varname>net.inet.icmp.icmplim</varname> a <literal>0</literal>. Deshabilitar la limitación de respuesta esta desaconsejado por las razones listadas anteriormente.
pt_br: Finalmente, para desabilitar completamente a limitação de resposta, configure <varname>net.inet.icmp.icmplim</varname> para <literal>0</literal>. Desabilitar a limitação de resposta é desencorajado pelos motivos listados acima.

source: What are these <errorname>arp: unknown hardware address format</errorname> error messages?
de_de: Was bedeutet die Meldung <errorname>arp: unknown hardware address format</errorname>?
es_es: ¿Qué significan los mensajes de error <errorname>arp: unknown hardware address format</errorname>?
pt_br: O que são essas mensagens de erro <errorname>arp: unknown hardware address format</errorname>?

source: This means that some device on the local Ethernet is using a MAC address in a format that FreeBSD does not recognize. This is probably caused by someone experimenting with an Ethernet card somewhere else on the network. This is most commonly seen on cable modem networks. It is harmless, and should not affect the performance of the FreeBSD system.
de_de: Ein Gerät im lokalen Ethernet verwendet eine MAC-Adresse in einem Format, das FreeBSD nicht kennt. Der wahrscheinlichste Grund ist, dass jemand Experimente mit einer Ethernet-Karte anstellt. Die Meldung tritt sehr häufig in Netzwerken mit Cable Modems auf. Die Meldung ist harmlos und sollte die Leistung des Systems nicht negativ beeinflussen.
es_es: Esto significa que algún dispositivo en la Ethernet local esta usando una dirección MAC en un formato que FreeBSD no reconoce. Esto fue probablemente causado por alguien que experimento con una tarjeta Ethernet en otro lugar de la red. Esto puede verse más comúnmente en redes de cable modem modernas. No es dañino, y no debería afectar el rendimiento del sistema en FreeBSD.
pt_br: Isso significa que algum dispositivo na Ethernet local está usando um endereço MAC em um formato que o FreeBSD não reconhece. Isso provavelmente é causado por alguém que está experimentando uma placa Ethernet em algum outro lugar da rede. Isso é mais comumente visto em redes de modem a cabo. É inofensivo e não deve afetar o desempenho do sistema FreeBSD.

source: Why do I keep seeing messages like: <errorname>192.168.0.10 is on fxp1 but got reply from 00:15:17:67:cf:82 on rl0</errorname>, and how do I disable it?
de_de: Warum sehe ich ständig Nachrichten wie: <errorname>192.168.0.10 is on fxp1 but got reply from 00:15:17:67:cf:82 on rl0</errorname>, und wie stelle ich das ab?
es_es: ¿Por qué sigo obteniendo mensajes como: <errorname>192.168.0.10 is on fxp1 but got reply from 00:15:17:67:cf:82 on rl0</errorname>, y como lo deshabilito?
pt_br: Por que eu continuo vendo mensagens como: <errorname>192.168.0.10 is on fxp1 but got reply from 00:15:17:67:cf:82 on rl0</errorname>, e como desabilitá-lo?

source: Because a packet is coming from outside the network unexpectedly. To disable them, set <varname>net.link.ether.inet.log_arp_wrong_iface</varname> to <literal>0</literal>.
de_de: Weil ein Paket unerwartet von außerhalb des Netzwerks empfangen wurde. Um die Nachrichten abzustellen, ändern Sie <varname>net.link.ether.inet.log_arp_wrong_iface</varname> auf <literal>0</literal>.
es_es: Porque un paquete esta viniendo de afuera de la red inesperadamente. Para deshabilitarlos, ajuste <varname>net.link.ether.inet.log_arp_wrong_iface</varname> a <literal>0</literal>.
pt_br: Porque um pacote está vindo de fora da rede inesperadamente. Para desativá-los, defina <varname>net.link.ether.inet.log_arp_wrong_iface</varname> como <literal>0</literal>.

source: Security
de_de: Sicherheit
es_es: Seguridad
pt_br: Segurança

source: What is a sandbox?
de_de: Was ist ein Sandkasten (sandbox)?
es_es: ¿Qué es un sandbox?
pt_br: O que é uma caixa de areia (sandbox)?

source: <quote>Sandbox</quote> is a security term. It can mean two things:
de_de: <quote>Sandkasten</quote> (sandbox) ist ein Ausdruck aus dem Bereich Sicherheit. Er hat zwei Bedeutungen:
es_es: <quote>Sandbox</quote>es un término de seguridad. Puede significar dos cosas:
pt_br: <quote>Sandbox</quote> é um termo de segurança. Isso pode significar duas coisas:

source: A process which is placed inside a set of virtual walls that are designed to prevent someone who breaks into the process from being able to break into the wider system.
de_de: Ein Programm, das innerhalb virtueller Wände ausgeführt wird. Wenn ein Angreifer über eine Sicherheitslücke in diesen Programm einbricht, verhindern diese Wände ein tieferes Vordringen in das System.
es_es: Un proceso que se coloca adentro de un conjunto de paredes virtuales que están designadas para impedir que alguien que logra explotar el proceso no pueda explotar el ecosistema mayor.
pt_br: Um processo que é colocado dentro de um conjunto de paredes virtuais que são projetadas para impedir que alguém que interrompa o processo seja capaz de invadir o sistema mais amplo.

source: The process is be able to run inside the walls. Since nothing the process does in regards to executing code is supposed to be able to breech the walls, a detailed audit of its code is not needed in order to be able to say certain things about its security.
de_de: Der Prozess kann innerhalb der Wände laufen, das heißt nichts, was der Prozess in Bezug auf die Ausführung von Code tut, kann die Wände durchbrechen. Es ist also keine detaillierte Revision des Codes erforderlich, um gewisse Aussagen über seine Sicherheit machen zu können.
es_es: El proceso que puede correr adentro de estas paredes. Dado que nada de lo que el proceso haga con respecto a ejecutar código puede romper las paredes, una auditoría detallada del código es innecesaria para poder decir ciertas cosas acerca de su seguridad.

source: The walls might be a user ID, for example. This is the definition used in the <citerefentry><refentrytitle>security</refentrytitle><manvolnum>7</manvolnum></citerefentry> and <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> man pages.
de_de: Die Wände könnten z.B. eine Benutzerkennung sein. Dies ist die Definition, die in den Manualpages <citerefentry><refentrytitle>security</refentrytitle><manvolnum>7</manvolnum></citerefentry> und <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzt wird.
es_es: Estas paredes pueden ser un ID de usuario, por ejemplo. Esta es la definición usada en las páginas de manual de <citerefentry><refentrytitle>security</refentrytitle><manvolnum>7</manvolnum></citerefentry> y <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: As barreiras podem ser um ID do usuário, por exemplo. Esta é a definição usada nas páginas de manual de <citerefentry><refentrytitle>security</refentrytitle><manvolnum>7</manvolnum></citerefentry> e <citerefentry> <refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Take the <literal>ntalk</literal> service, for example (see <citerefentry><refentrytitle>inetd</refentrytitle><manvolnum>8</manvolnum></citerefentry>). This service used to run as user ID <systemitem class="username">root</systemitem>. Now it runs as user ID <systemitem class="username">tty</systemitem>. The <systemitem class="username">tty</systemitem> user is a sandbox designed to make it more difficult for someone who has successfully hacked into the system via <literal>ntalk</literal> from being able to hack beyond that user ID.
de_de: Nehmen Sie zum Beispiel den Dienst <literal>ntalk</literal> (siehe <citerefentry><refentrytitle>inetd</refentrytitle><manvolnum>8</manvolnum></citerefentry>). Dieser Dienst ist früher mit der Benutzerkennung <systemitem class="username">root</systemitem> gelaufen; nun läuft er mit der Benutzerkennung <systemitem class="username">tty</systemitem>. Der Benutzer <systemitem class="username">tty</systemitem> ist ein Sandkasten, der dazu gedacht ist, es jemandem, der über <literal>ntalk</literal> erfolgreich in das System eingebrochen ist, schwer zu machen, über diese Benutzerkennung hinaus vorzudringen.
es_es: Considere el servicio <literal>ntalk</literal>, por ejemplo (vea <citerefentry><refentrytitle>inetd</refentrytitle><manvolnum>8</manvolnum></citerefentry>). Este servicio solía correr con ID de usuario <systemitem class="username">root</systemitem>. Ahora corre con ID de usuario <systemitem class="username">tty</systemitem>. El usuario <systemitem class="username">tty</systemitem> es un sandbox designado para hacer más difícil para alguien que ya ha irrumpido en el sistema mediante <literal>ntalk</literal> pueda comprometer el sistema más allá de esa ID de usuario.
pt_br: Veja o serviço <literal>ntalk</literal>, por exemplo (veja <citerefentry><refentrytitle>inetd</refentrytitle><manvolnum>8</manvolnum></citerefentry>). Este serviço costumava rodar como ID de usuário <systemitem class="username">root</systemitem>. Agora ele é executado como ID do usuário <systemitem class="username">tty</systemitem>. O usuário <systemitem class="username">tty</systemitem> é um sandbox projetado para tornar mais difícil para alguém que invadiu o sistema com sucesso através do <literal>ntalk</literal> ser capaz de hackear além do seu ID de usuário.

source: A process which is placed inside a simulation of the machine. It means that someone who is able to break into the process may believe that he can break into the wider machine but is, in fact, only breaking into a simulation of that machine and not modifying any real data.
de_de: Ein Prozess, der sich innerhalb einer simulierten Maschine befindet. Dies ist etwas fortgeschrittener; grundsätzlich bedeutet es, dass jemand, der in der Lage ist, in einen Prozess einzudringen, annehmen könnte, er könnte weiter in die Maschine eindringen, tatsächlich aber nur in eine Simulation der Maschine einbricht und keine echten Daten verändert.
es_es: Un proceso que se inserta en una simulación de la máquina. Esto significa que alguien que puede irrumpir en el proceso podría creer que puede irrumpir en la máquina entera pero esta, en efecto solo irrumpiendo en una simulación de esa máquina sin modificar ningún dato real.
pt_br: Um processo que é colocado dentro de uma simulação da máquina. Isso significa que alguém que é capaz de entrar no processo pode acreditar que ele pode invadir a máquina mais ampla, mas está, na verdade, apenas invadindo uma simulação dessa máquina e não modificando nenhum dado real.

source: The most common way to accomplish this is to build a simulated environment in a subdirectory and then run the processes in that directory chrooted so that <filename>/</filename> for that process is this directory, not the real <filename>/</filename> of the system).
de_de: Der gängigste Weg, dies zu erreichen, ist, in einem Unterverzeichnis eine simulierte Umgebung zu erstellen und den Prozess in diesem Verzeichnis mit chroot auszuführen (für diesen Prozess ist <filename>/</filename> dieses Verzeichnis und nicht das echte <filename>/</filename> des Systems).
es_es: La manera más común de lograr esto es construir un ambiente simulado en un subdirectorio y luego correr el proceso dentro de un chroot en ese directorio de manera que <filename>/</filename> para ese proceso sea este directorio, en lugar de la verdadera <filename>/</filename> del sistema.
pt_br: A maneira mais comum de fazer isso é construir um ambiente simulado em um subdiretório e então executar os processos nesse diretório chrooted para que o diretório <filename> / </filename> para esse processo seja este, não o diretório <filename>/</filename> real do sistema).

source: Another common use is to mount an underlying file system read-only and then create a file system layer on top of it that gives a process a seemingly writeable view into that file system. The process may believe it is able to write to those files, but only the process sees the effects — other processes in the system do not, necessarily.
de_de: Eine weitere gebräuchliche Anwendung ist, ein untergeordnetes Dateisystem nur mit Leserechten zu mounten, und dann darüber eine Dateisystemebene zu erstellen, die einem Prozess einen scheinbar schreibberechtigten Blick in das Dateisystem gibt. Der Prozess mag glauben, dass er in der Lage ist, diese Dateien zu verändern, aber nur der Prozess sieht diesen Effekt - andere Prozesse im System natürlich nicht.
es_es: Otro uso común es montar un sistema de archivos subyacente como de solo lectura y crear una capa de sistema de archivos encima del mismo que provea a un proceso una vista aparentemente de escritura en el sistema de archivos. El proceso puede creer que esta habilitado para escribir esos archivos, pero solo el proceso en cuestión ve los efectos, y otros procesos en el sistema no.
pt_br: Outro uso comum é montar um sistema de arquivos subjacente somente leitura e, em seguida, criar uma camada do sistema de arquivos sobre ele, o que dá a um processo uma visualização aparentemente gravável nesse sistema de arquivos. O processo pode acreditar que é capaz de escrever nesses arquivos, mas o processo apenas vê os efeitos - outros processos no sistema não, necessariamente.

source: An attempt is made to make this sort of sandbox so transparent that the user (or hacker) does not realize that he is sitting in it.
de_de: Es wird versucht, diese Art von Sandkasten so transparent zu gestalten, dass der Benutzer (oder Hacker) nicht merkt, dass er sich in ihm befindet.
es_es: Se hace un intento de que este tipo de sandbox sea tan transparente que el usuario (o el hacker) no se de cuenta de que esta usándola.
pt_br: Foi feita uma tentativa de tornar esse tipo de sandbox tão transparente que o usuário (ou hacker) não percebe que está dentro dele.

source: <trademark class="registered">UNIX</trademark> implements two core sandboxes. One is at the process level, and one is at the userid level.
de_de: <trademark class="registered">UNIX</trademark> implementiert zwei Arten von Sandkästen - eine auf Prozessebene und die andere auf der Ebene der Benutzerkennung.
es_es: <trademark class="registered">UNIX</trademark> implementa dos sandboxes principales. Uno es a nivel proceso, el otro es a nivel userid.
pt_br: O <trademark class="registered">UNIX</trademark> implementa dois sandboxes principais. Um está no nível do processo e o outro está no nível do usuário.

source: Every <trademark class="registered">UNIX</trademark> process is completely firewalled off from every other <trademark class="registered">UNIX</trademark> process. One process cannot modify the address space of another.
de_de: Jeder Prozess unter <trademark class="registered">UNIX</trademark> ist komplett von allen anderen Prozessen abgeschirmt. Ein Prozess kann den Adressraum eines anderen Prozesses nicht modifizieren.
es_es: Cada proceso <trademark class="registered">UNIX</trademark> esta completamente aislado de cualquier otro proceso <trademark class="registered">UNIX</trademark>. Un proceso no puede modificar el espacio de direcciones de otro.
pt_br: Todo processo <trademark class="registered">UNIX</trademark> é completamente protegido contra qualquer outro processo <trademark class="registered">UNIX</trademark>. Um processo não pode modificar o espaço de endereço de outro.

source: A <trademark class="registered">UNIX</trademark> process is owned by a particular userid. If the user ID is not the <systemitem class="username">root</systemitem> user, it serves to firewall the process off from processes owned by other users. The user ID is also used to firewall off on-disk data.
de_de: Ein <trademark class="registered">UNIX</trademark> Prozess gehört einer bestimmten Benutzerkennung. Falls die Benutzerkennung nicht die von <systemitem class="username">root</systemitem> ist, dient sie dazu, den Prozess von Prozessen anderer Benutzer abzuschirmen. Die Benutzerkennung wird außerdem dazu genutzt, Daten auf der Festplatte abzuschirmen.
es_es: Un proceso <trademark class="registered">UNIX</trademark> tiene por dueño una userid en particular. Si el ID de susuario no es el usuario <systemitem class="username">root</systemitem>, es útil aislar el proceso de procesos adueñados por otros usuarios. El ID de usuario también se usa para aislar datos del disco.
pt_br: Um processo <trademark class="registered">UNIX</trademark> é de propriedade de um determinado ID de usuário. Se o ID de usuário não for o usuário <systemitem class="username">root</systemitem>, ele servirá para proteger o processo contra processos pertencentes a outros usuários. O ID do usuário também é usado para proteger os dados no disco.

source: What is securelevel?
de_de: Was sind die Sicherheitsstufen (securelevel)?
es_es: ¿Qué es securelevel?
pt_br: O que é securelevel?

source: <literal>securelevel</literal> is a security mechanism implemented in the kernel. When the securelevel is positive, the kernel restricts certain tasks; not even the superuser (<systemitem class="username">root</systemitem>) is allowed to do them. The securelevel mechanism limits the ability to:
de_de: Sicherheitsstufen (<literal>securelevel</literal>) sind ein Sicherheitsmechanismus, der im Kernel implementiert ist. Wenn die Sicherheitsstufe einen positiven Wert hat, verhindert der Kernel die Ausführung bestimmter Tätigkeiten; nicht einmal der Super-User (<systemitem class="username">root</systemitem>) darf sie durchführen. Zurzeit können über die Sicherheitsstufen unter anderem die folgenden Tätigkeiten geblockt werden:
es_es: <literal>securelevel</literal> es un mecanismo de seguridad implementado en el kernel. Cuando un securelevel es positivo, el kernel restringe ciertas tareas; ni siquiera el superusuario (<systemitem class="username">root</systemitem>) tiene permitido hacerlas. El mecanismo securelevel limita la habilidad de:
pt_br: <literal>securelevel</literal> é um mecanismo de segurança implementado no kernel. Quando o nível de segurança é positivo, o kernel restringe certas tarefas; nem mesmo o superusuário (<systemitem class="username">root</systemitem>) pode executá-los. O mecanismo de securelevel limita a capacidade de:

source: Unset certain file flags, such as <literal>schg</literal> (the system immutable flag).
de_de: Zurücksetzen bestimmter Dateiattribute, wie zum Beispiel <literal>schg</literal> (das <quote>system immutable</quote> Attribut).
es_es: Borrar ciertas banderas de archivo, tales como <literal>schg</literal> (the system immutable flag).
pt_br: Desativar determinados flags de arquivo, tais como <literal>schg</literal> (o flag de sistema imutável).
