Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Yes! While a recent system will run with software compiled under an older release, things will randomly crash and fail to work once other ports are installed or updated.
de_de: Ja! Obwohl ein aktuelles System mit Software für eine ältere Version funktionieren wird, werden Sie mit zufälligen Abstürzen und nicht funktionierenden Ports zurückbleiben, sobald Sie anfangen, andere Ports zu installieren oder diejenigen, die Sie bereits haben, aktualisieren möchten.
es_es: ¡Si! Mientras que un sistema reciente correrá con software compilado bajo una versión vieja, hay cosas que pueden fallar al azar o no funcionar una vez que otros ports sean instalados o actualizados.
pt_br: Sim! Apesar de um sistema recente ser capaz de executar os softwares compilados em uma versão mais antiga, as coisas irão falhar aleatoriamente e deixar de funcionar quando outros ports forem instalados ou atualizados.

source: When the system is upgraded, various shared libraries, loadable modules, and other parts of the system will be replaced with newer versions. Applications linked against the older versions may fail to start or, in other cases, fail to function properly.
de_de: Wenn das System aktualisiert wird, werden verschiedene Shared-Libraries, ladbare Module und andere Systembestandteile durch neuere Versionen ersetzt. Anwendungen, die gegen die älteren Versionen gelinkt sind, werden nicht starten oder in anderen Fällen nicht korrekt funktionieren.
es_es: Cuando el sistema se actualiza, varias librerías compartidas, módulos cargables y otras partes del sistema serán reemplazadas por versiones más nuevas. Las aplicaciones que estén vinculadas contra las version más viejas pueden fallar al iniciar o, en otros casos, fallar al funcionar con propiedad.
pt_br: Quando o sistema é atualizado, várias bibliotecas compartilhadas, módulos carregáveis ​​e outras partes do sistema serão substituídas por versões mais recentes. Os aplicativos vinculados às versões mais antigas podem não iniciar ou, em outros casos, não funcionar corretamente.

source: For more information, see <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html#freebsdupdate-upgrade">the section on upgrades</link> in the FreeBSD Handbook.
de_de: Für weitere Informationen lesen Sie den Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html#freebsdupdate-upgrade">FreeBSD-Update</link> im FreeBSD Handbuch.
es_es: Para más información, vea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html#freebsdupdate-upgrade">la sección acerca de actualizaciones</link> en el manual de FreeBSD.
pt_br: Para obter maiores informações, consulte a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html#freebsdupdate-upgrade">seção sobre atualizações</link> no Handbook do FreeBSD.

source: Do I need to recompile every port each time I perform a minor version update?
de_de: Muss ich nach der Aktualisierung einer FreeBSD-Unterversion jedes Mal alle Ports neu erstellen?
es_es: ¿Debo recompilar todos los ports cada vez que realizo una actualización a una versión menor?
pt_br: Preciso recompilar cada port toda vez que faço uma atualização de versão secundária?

source: In general, no. FreeBSD developers do their utmost to guarantee binary compatibility across all releases with the same major version number. Any exceptions will be documented in the Release Notes, and advice given there should be followed.
de_de: Generell nicht. Die FreeBSD-Entwickler tun ihr möglichstes, um die Binärkompatibilität über alle Veröffentlichungen mit der gleichen Hauptversionsnummer zu garantieren. Ausnahmen werden in den Release Notes dokumentiert und die darin enthaltenen Hinweise sollten befolgt werden.
es_es: En general, no. Los desarrolladores de FreeBSD hacen lo posible para garantizar compatibilidad binaria en todas las versiones con el mismo número de versión mayor. Cualquier excepción será documentada en las notas de lanzamiento, y los consejos que se presenten allí deberán ser seguidos.
pt_br: Em geral, não. Os desenvolvedores do FreeBSD fazem o máximo para garantir compatibilidade binária em todos os releases com o mesmo número de versão principal. Quaisquer exceções serão documentadas nas Release Notes, e os conselhos dados lá devem ser seguidos.

source: Why is <command>/bin/sh</command> so minimal? Why does FreeBSD not use <command>bash</command> or another shell?
de_de: Warum ist <command>/bin/sh</command> so spartanisch? Warum benutzt FreeBSD nicht die <command>bash</command> oder eine andere Shell?
es_es: ¿Por qué es <command>/bin/sh</command> tan mínimo? ¿Por qué FreeBSD no usa <command>bash</command> u otro shell?
pt_br: Por que o <command>/bin/sh</command> é tão pequeno? Por que o FreeBSD não usa o <command>bash</command> ou outro shell?

source: Many people need to write shell scripts which will be portable across many systems. That is why <trademark class="registered">POSIX</trademark> specifies the shell and utility commands in great detail. Most scripts are written in Bourne shell (<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>), and because several important programming interfaces (<citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>system</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>popen</refentrytitle><manvolnum>3</manvolnum></citerefentry>, and analogues in higher-level scripting languages like Perl and Tcl) are specified to use the Bourne shell to interpret commands. Because the Bourne shell is so often and widely used, it is important for it to be quick to start, be deterministic in its behavior, and have a small memory footprint.
de_de: Viele Leute müssen Shell-Programme schreiben, die auf vielen verschiedenen Systemen nutzbar sein müssen. Aus diesem Grund enthält der <trademark class="registered">POSIX</trademark>-Standard eine sehr detaillierte Definition der Shell und der Hilfsprogramme. Die meisten Programme werden für die Bourne Shell (<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>) geschrieben; außerdem nutzen mehrere wichtige Schnittstellen (<citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>system</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>popen</refentrytitle><manvolnum>3</manvolnum></citerefentry> und höhere Programmiersprachen wie Perl und Tcl) die Bourne Shell, um Befehle auszuführen. Da die Bourne Shell an so vielen Stellen und so häufig genutzt wird, muss sie die folgenden Anforderungen erfüllen: Schneller Start, ein klar definiertes Verhalten und ein geringer Speicherverbrauch.
es_es: Mucha gente necesita escribir scripts de shell que sean portables a muchos sistemas. Por eso es que <trademark class="registered">POSIX</trademark> especifica el shell y los comandos utilitarios en gran detalle. La mayoría de los scripts están escritors en el shell de Bourne (<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>), y porque varias interfaces de programación importantes (<citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>system</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>popen</refentrytitle><manvolnum>3</manvolnum></citerefentry>, y análogos en lenguajes de scripting de alto nivel como Perl y Tcl) son instruidos para usar el shell de Bourne para interpretar comandos. Porque el shell de Bourne es usado frecuentemente y ampliamente, es importante que sea rápido al iniciar, que se comporte de manera determinística, y que tenga una pequeña huella de memoria.
pt_br: Muitas pessoas precisam escrever shell scripts que serão portados para muitos sistemas. É por isso que o <trademark class="registered">POSIX</trademark> especifica os comandos shell e utilitários em grande detalhe. A maioria dos scripts são escritos em Bourne shell (<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>) e porque várias interfaces de programação importantes (<citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>system</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>popen</refentrytitle><manvolnum>3</manvolnum></citerefentry> e análogos em linguagens de script de alto nível como Perl e Tcl) são especificados para usar o Bourne shell para interpretar comandos. Como o Bourne shell é usado com tanta frequência e em larga escala, é importante que ele seja iniciado rapidamente, que seja determinístico em seu comportamento e que ocupe o menor espaço possível na memória.

source: The existing implementation is our best effort at meeting as many of these requirements simultaneously as we can. To keep <command>/bin/sh</command> small, we have not provided many of the convenience features that other shells have. That is why other more featureful shells like <command>bash</command>, <command>scsh</command>, <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <command>zsh</command> are available. Compare the memory utilization of these shells by looking at the <quote>VSZ</quote> and <quote>RSS</quote> columns in a <command>ps -u</command> listing.
de_de: Wir haben bei der vorliegenden Implementierung versucht, möglichst viele dieser Anforderungen zu erfüllen. Um <command>/bin/sh</command> nicht zu groß werden zu lassen, haben wir viele der Annehmlichkeiten der anderen Shells weggelassen. Aus diesem Grund gibt stehen die luxuriöseren Shells wie <command>bash</command>, <command>scsh</command>, <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> und <command>zsh</command> zur Verfügung. Vergleichen Sie den Speicherverbrauch der verschiedenen Shells, indem Sie <command>ps -u</command> aufrufen und sich die Angaben in den Spalten <quote>VSZ</quote> und <quote>RSS</quote> ansehen.
es_es: La implementación existente es nuestro mejor esfuerzo para satisfacer simultaneamente el mayor número de requerimientos de este tipo que podamos. Para mantener <command>/bin/sh</command> pequeña, no proveemos muchas de las características convenientes que tienen otros shells. Por esto es que otras shells con más características como <command>bash</command>, <command>scsh</command>, <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, y <command>zsh</command> están disponibles. Compare el uso de memoria de estas shell mirando las columnas <quote>VSZ</quote> y <quote>RSS</quote> en el listado del comando <command>ps -u</command>.
pt_br: A implementação existente é resultado do nosso melhor esforço para atender simultaneamente o quanto pudermos desses requisitos. Para manter o <command>/bin/sh</command> pequeno, não fornecemos muitos dos recursos de conveniência que os outros shells possuem. É por isso que outras shells com mais recursos, como o <command>bash</command>, o <command>scsh</command>, o <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, e o <command>zsh</command> estão disponíveis. Compare a utilização de memória desses shells observando as colunas <quote> VSZ </quote> e <quote> RSS </quote> em uma listagem gerada com o comando <command>ps -u</command>.

source: How do I create audio CDs from my MIDI files?
de_de: Wie erzeuge ich Audio-CDs aus MIDI-Dateien?
es_es: ¿Cómo creo CDs de audio a partir de mis archivos MIDI?
pt_br: Como faço para criar CDs de áudio dos meus arquivos MIDI?

source: To create audio CDs from MIDI files, first install <package>audio/timidity++</package> from ports then install manually the GUS patches set by Eric A. Welsh, available at <uri xlink:href="http://alleg.sourceforge.net/digmid.html">http://alleg.sourceforge.net/digmid.html</uri>. After <application>TiMidity++</application> has been installed properly, MIDI files may be converted to WAV files with the following command line:
de_de: Installieren Sie zuerst den Port <package>audio/timidity++</package>. Danach müssen Sie manuell die GUS-Patche von Eric A. Welsh von <uri xlink:href="http://alleg.sourceforge.net/digmid.html">http://alleg.sourceforge.net/digmid.html</uri>. installieren. Wenn <application>TiMidity++</application> richtig installiert wurde, können Sie mit dem folgenden Kommando MIDI-Dateien in das WAV-Format konvertieren:
es_es: Para crear CDs de audio a partir de archivos MIDI, primero instale <package>audio/timidity++</package> desde ports y luego instale manualmente el set de parches GUS por Eric A. Welsh, disponible en <uri xlink:href="http://alleg.sourceforge.net/digmid.html">http://alleg.sourceforge.net/digmid.html</uri>. Luego de que <application>TiMidity++</application> haya sido instalada con propiedad, los archivos MIDI pueden convertirse a archivos WAV con el siguiente comando:
pt_br: Para criar CDs de áudio a partir de arquivos MIDI, primeiro instale o <package> audio/timidity++</package> a partir dos ports e instale manualmente os patches GUS criados por Eric A. Welsh, disponíveis em <uri xlink:href="http://alleg.sourceforge.net/digmid.html">http://alleg.sourceforge.net/digmid.html</uri>. Depois que o <application>TiMidity++</application> estiver corretamente instalado, os arquivos MIDI poderão ser convertidos em arquivos WAV com a seguinte linha de comando:

source: The WAV files can then be converted to other formats or burned onto audio CDs, as described in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html">FreeBSD Handbook</link>.
de_de: Die WAV-Dateien können dann in andere Formate konvertiert werden oder (wie im <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/creating-cds.html">FreeBSD Handbuch</link>. beschrieben) auf Audio-CDs gebrannt werden.
es_es: Los archivos WAV pueden posteriormente convertirse a otros formatos o grabarse en CDs de audio, como se describe en el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html">manual de FreeBSD</link>.
pt_br: Os arquivos WAV podem ser convertidos para outros formatos ou gravados em CDs de áudio, conforme descrito no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/creating-cds.html"> Handbook do FreeBSD</link>.

source: Kernel Configuration
de_de: Kernelkonfiguration
es_es: Configuración del Kernel
pt_br: Configuração do Kernel

source: I would like to customize my kernel. Is it difficult?
de_de: Ich möchte meinen Kernel anpassen. Ist das schwierig?
es_es: Quisiera personalizar mi kernel. ¿Es esto difícil?
pt_br: Eu gostaria de customizar meu kernel. É difícil?

source: Not at all! Check out the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig.html">kernel config section of the Handbook</link>.
de_de: Überhaupt nicht! Lesen Sie den <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/kernelconfig.html">Abschnitt zur Kernelkonfiguration im Handbuch</link>.
es_es: ¡En absoluto! Vea la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig.html">sección del manual acerca de configuración del kernel</link>.
pt_br: De modo nenhum! Confira a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig.html">configuração do kernel do Handbook</link>.

source: The new <filename>kernel</filename> will be installed to the <filename>/boot/kernel</filename> directory along with its modules, while the old kernel and its modules will be moved to the <filename>/boot/kernel.old</filename> directory. If a mistake is made in the configuration, simply boot the previous version of the kernel.
de_de: Der neue <filename>kernel</filename> wird zusammen mit seinen Modulen im Verzeichnis <filename>/boot/kernel</filename> installiert werden. Der alte Kernel und dessen Module wird in das Verzeichnis <filename>/boot/kernel.old</filename> verschoben, damit Sie, wenn Sie einen Fehler in Ihrer Konfiguration haben, die vorherige Version des Kernels starten können.
es_es: El nuevo <filename>kernel</filename> será instalado en el directorio <filename>/boot/kernel</filename> junto con sus módulos, mientras que el viejo kernel y sus módulos serán movidos al directorio <filename>/boot/kernel.old</filename>. Si ocurre un error en la configuración, simplemente arranque desde la versión anterior del kernel.
pt_br: O novo <filename>kernel</filename> será instalado no diretório <filename>/boot/kernel</filename> junto com os seus módulos, enquanto o kernel antigo e seus módulos serão movidos para o diretório <filename>/boot/kernel.old</filename>. Se um erro for cometido na configuração, basta inicializar utilizando a versão anterior do kernel.

source: Why is my kernel so big?
de_de: Warum ist mein Kernel so groß?
es_es: ¿Por qué es mi kernel tan grande?
pt_br: Por que meu kernel é tão grande?

source: <literal>GENERIC</literal> kernels shipped with FreeBSD are compiled in <emphasis>debug mode</emphasis>. Kernels built in debug mode contain debug data in separate files that are used for debugging. FreeBSD releases prior to 11.0 store these debug files in the same directory as the kernel itself, <filename>/boot/kernel/</filename>. In FreeBSD 11.0 and later the debug files are stored in <filename>/usr/lib/debug/boot/kernel/</filename>. Note that there will be little or no performance loss from running a debug kernel, and it is useful to keep one around in case of a system panic.
de_de: FreeBSDs <literal>GENERIC</literal>-Kernels werden im <emphasis>Debug-Modus</emphasis> erstellt. Ein Debug-Kernel enthält viele zusätzliche Informationen für die Fehlersuche. In FreeBSD 11.0 und neueren Versionen werden diese Debug-Dateien in <filename>/usr/lib/debug/boot/kernel</filename> gespeichert. Ältere Versionen von FreeBSD speichern diese Dateien im selben Verzeichnis wie den Kernel, <filename>/boot/kernel</filename>. Bitte beachten Sie, dass die Verwendung eines Debug-Kernels die Performance des Systems nicht oder nur minimal reduziert; außerdem ist es für den Fall einer system panic sehr praktisch, einen Debug-Kernel zur Hand zu haben.
es_es: Los kérneles <literal>GENERIC</literal> que vienen con FreeBSD son compilados en <emphasis>modo de depuración</emphasis>. Los kernels que se compilan en modo de depuración contienen datos de depuración en archivos separados que se usan para la depuración. Las versiones de FreeBSD anteriores a 11.0 guardan estos archivos de depuración en el mismo directorio en que se encuentra el kernel , <filename>/boot/kernel/</filename>. En FreeBSD 11.0 y posteriores los archivos de depuración se guardan en <filename>/usr/lib/debug/boot/kernel/</filename>. Nótese que habrá muy poca o ninguna perdida de desempeño debida al uso de un kernel de depuración, y es útil mantener uno en caso de un pánico del sistema.
pt_br: Os kernels <literal>GENERIC</literal> enviados com o FreeBSD são compilados com o <emphasis>modo de depuração</emphasis> habilitado. Kernels compilados no modo de depuração contêm dados de depuração em arquivos separados que são usados ​​para depuração. Versões do FreeBSD anteriores a 11.0 armazenam esses arquivos de depuração no mesmo diretório que o próprio kernel, <filename>/boot/kernel/</filename>. No FreeBSD 11.0 e posterior, os arquivos de depuração são armazenados em <filename>/usr/lib/debug/boot/kernel/</filename>. Observe que haverá pouca ou nenhuma perda de desempenho ao executar um kernel com o modo de depuração habilitado, e é útil manter um por perto em caso de panic no sistema.

source: When running low on disk space, there are different options to reduce the size of <filename>/boot/kernel/</filename> and <filename>/usr/lib/debug/</filename>.
de_de: Wenn Ihnen allerdings der Plattenplatz ausgeht, gibt es verschiedene Möglichkeiten die Größe von <filename>/boot/kernel/</filename> und <filename>/usr/lib/debug/</filename> zu reduzieren.
es_es: Cuando se agote el espacio en disco, hay diferentes opciones para reducir el tamaño de <filename>/boot/kernel/</filename> y <filename>/usr/lib/debug/</filename>.
pt_br: Quando estiver com pouco espaço em disco, existem diferentes opções para reduzir o tamanho de <filename>/boot/kernel/</filename> e <filename>/usr/lib/debug/</filename>.

source: To not install the symbol files, make sure the following line exists in <filename>/etc/src.conf</filename>:
de_de: Um die Kernel-Symbole nicht zu installieren, nehmen Sie folgende Zeile in <filename>/etc/src.conf</filename> auf:
es_es: Para no instalar los archivos de símbolos, asegúrese de que la siguiente línea exista en <filename>/etc/src.conf</filename>:
pt_br: Para não instalar os arquivos de símbolos, certifique-se que a seguinte linha existe em <filename>/etc/src.conf</filename>:

source: For more information see <citerefentry><refentrytitle>src.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
de_de: Weitere Informationen finden Sie in <citerefentry><refentrytitle>src.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: Para más información vea <citerefentry><refentrytitle>src.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
pt_br: Para mais informações veja <citerefentry><refentrytitle>src.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: If you want to avoid building debug files altogether, make sure that both of the following are true:
de_de: Wenn Sie überhaupt keine Debug-Dateien erzeugen möchten, müssen Sie folgendes sicherstellen:
es_es: Si desea evitar por completo compilar archivos de depuración, asegurese de que se cumpla lo siguiente:
pt_br: Se você quiser evitar completamente a criação de arquivos de depuração, certifique-se de que ambos os itens a seguir sejam verdadeiros:

source: This line does not exist in the kernel configuration file:
de_de: Die folgende Zeile darf nicht in der Kernelkonfigurationsdatei enthalten sein:
es_es: Esta línea no existe en el archivo de configuración del kernel:
pt_br: Esta linha não existe no arquivo de configuração do kernel:

source: Do not run <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> with <option>-g</option>.
de_de: Rufen Sie nicht <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> mit <option>-g</option> auf.
es_es: No corra <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> con <option>-g</option>.
pt_br: Não execute o comando <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> com a opção <option>-g</option>.

source: Either of the above settings will cause the kernel to be built in debug mode.
de_de: Jede der oben genannten Einstellungen bewirkt, dass der Kernel im Debug-Modus erstellt wird.
es_es: Cualquiera de las opciones anteriores causaran que el kernel se compile en modo de depuración.
pt_br: Qualquer uma das configurações acima fará com que o kernel seja construído com suporte ao modo de depuração.

source: To build and install only the specified modules, list them in <filename>/etc/make.conf</filename>:
de_de: Um nur die angegebenen Module zu erstellen und zu installieren, nehmen Sie diese in <filename>/etc/make.conf</filename> auf:
es_es: Para compilar e instalar solo los módulos especificados, listelos en <filename>/etc/make.conf</filename>:
pt_br: Para construir e instalar somente os módulos desejados, liste-os em <filename>/etc/make.conf</filename>:
