Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: This normally happens on server machines with slow disks that are spawning a <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> on the port, and executing <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> from a login script or program after login. There were reports of it happening consistently when using slirp. The reason is that in the time taken between <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> exiting and <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> starting, the client-side <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> starts sending Line Control Protocol (LCP) packets. Because ECHO is still switched on for the port on the server, the client <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sees these packets <quote>reflect</quote> back.
de_de: Dies geschieht normalerweise auf Servern mit langsamen Festplatten, bei denen ein <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf dem Port ausgeführt und <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> nach dem Einloggen von einem Login-Skript oder einem Programm aus gestartet wird. Es wurde auch schon berichtet, dass dies bei der Benutzung von slirp regelmäßig auftritt. Der Grund hierfür ist, dass das <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf der Client-Seite in der Zeit, die benötigt wird, <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu beenden und <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu starten, bereits beginnt, Line Control Protocol (LCP) Pakete zu senden. Da ECHO auf dem Serverport weiterhin eingeschaltet ist, werden diese Pakete zum <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf der Client-Seite <quote>reflektiert</quote>.
es_es: Esto normalemente sucede en maquinas del servidor con discos lentos que lancen una <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> en el puerto y ejectuen <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> desde un script de inicio u otro programa luego de la autenticación. Existen reportes de que esto sucede consistentemente al usar slirp. La razón es que en el tiempo entre que <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>salga y <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> inicie, el <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> del lado del cliente comienza a enviar paquetes Line Control Protocol (LCP). Porque ECHO sigue siendo cambiado para el puerto en el servidor, el cliente <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ve estos paquetes <quote>reflejarse</quote> de vuelta.
pt_br: Isso normalmente acontece em máquinas servidor com discos lentos que estão gerando um <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> na porta e executando <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> a partir de um script de login ou programa após o login. Houve relatos de que isso acontecia de forma consistente ao usar slirp. A razão é que no tempo entre <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> terminar e o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> iniciar, o cliente <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> inicia o envio de pacotes do protocolo de controle de linha (LCP). Como o ECHO ainda está ligado à porta do servidor, o cliente <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> vê esses pacotes sendo <quote> refletidos </quote> de volta.

source: One part of the LCP negotiation is to establish a magic number for each side of the link so that <quote>reflections</quote> can be detected. The protocol says that when the peer tries to negotiate the same magic number, a NAK should be sent and a new magic number should be chosen. During the period that the server port has ECHO turned on, the client <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sends LCP packets, sees the same magic in the reflected packet and NAKs it. It also sees the NAK reflect (which also means <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> must change its magic). This produces a potentially enormous number of magic number changes, all of which are happily piling into the server's tty buffer. As soon as <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> starts on the server, it is flooded with magic number changes and almost immediately decides it has tried enough to negotiate LCP and gives up. Meanwhile, the client, who no longer sees the reflections, becomes happy just in time to see a hangup from the server.
de_de: Ein Teil der LCP-Verhandlungen ist die Einrichtung einer <quote>Magic Number</quote> für jede Seite der Verbindung, damit <quote>Echos</quote> erkannt werden können. Das Protokoll besagt, dass, wenn der Partner versucht, die gleiche <quote>Magic Number</quote> auszuhandeln, ein NAK zurückgesendet und eine neue <quote>Magic Number</quote> gewählt werden soll. Während der Server das ECHO eingeschaltet hat, sendet der Client LCP Pakete, sieht die gleiche <quote>Magic Number</quote> im reflektierten Paket und erzeugt ein NAK. Er sieht auch das reflektierte NAK (was bedeutet, dass <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> seine <quote>Magic Number</quote> ändern muss). Hierdurch wird eine Vielzahl von Änderungen der <quote>Magic Number</quote> hervorgerufen, die sich allesamt im tty-Puffer des Servers ansammeln. Sobald <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf dem Server startet, wird es mit Änderungen der <quote>Magic Number</quote> überflutet und entscheidet, dass es sich zur Genüge mit den LCP-Verhandlungen beschäftigt hat und gibt auf. Und während sich der Client noch darüber freut, dass er keine weiteren Reflexionen sieht, wird ihm gemeldet, dass der Server auflegt.
es_es: Una parte de la negociación LCP consiste en establecer un numero mágico para cada lado del link de manera que se puedan detectar <quote>reflexiones</quote>. El protocolo dice que cuando el peer intenta negociar el mismo número mágico, debe enviarse un NAK y se debe elegir un nuevo numero mágico. Durante el período en que el puerto del servidor tiene ECHO prendido, el cliente <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> envía paquetes LCP, ve el mismo numero mágico en el paquete reflejado y le envía un NAK. También ve el reflejado el NAK (lo que también significa que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> debe cambiar su numero mágico). Esto produce un enorme número de potenciales cambios de números mágicos, todos los cuales se apilan en el buffer del tty del servidor. Tan pronto como <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> inicia en el servidor, se satura de cambios de numero mágico y casi inmediatamente decide que intento lo suficiente negociar LCP y termina. Mientras tanto, el cliente, que ha dejado de ver las reflexiones, se vuelve satisfecho justo a tiempo para ver un cuelgue del servidor.
pt_br: Uma parte da negociação do LCP é estabelecer um número mágico para cada lado do link para que as <quote>reflexões</quote> possam ser detectadas. O protocolo diz que quando o parceiro tenta negociar o mesmo número mágico, um NAK deve ser enviado e um novo número mágico deve ser escolhido. Durante o período em que a porta do servidor tem o ECHO ligado, o cliente <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> envia pacotes LCP, vê o mesmo numero mágica no pacote refletido e reflete o NAK. Ele também vê a reflexão NAK (que também significa que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> deve mudar seu numero magico). Isso produz um número potencialmente enorme de mudanças no número mágico, todas as quais estão se acumulando alegremente no buffer tty do servidor. Assim que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> é iniciado no servidor, ele é inundado com alterações de numeros mágicos e quase imediatamente decide que tentou o suficiente para negociar LCP e desiste. Enquanto isso, o cliente, que não vê mais as reflexões, fica feliz a tempo de ver um desligamento do servidor.

source: This can be avoided by allowing the peer to start negotiating with the following line in <filename>ppp.conf</filename>:
de_de: Dies kann verhindert werden, indem dem Partner durch die folgende Zeile in <filename>ppp.conf</filename> erlaubt wird, mit der Verhandlung zu beginnen:
es_es: Esto puede evitarse permitiéndole al peer comenzar la negocación con la siguiente línea en <filename>ppp.conf</filename>:
pt_br: Isto pode ser evitado permitindo que o par comece a negociar com a seguinte linha em <filename>ppp.conf</filename>:

source: This tells <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to wait for the server to initiate LCP negotiations. Some servers however may never initiate negotiations. In this case, try something like:
de_de: Hierdurch wird <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> mitgeteilt, darauf zu warten, dass der Server mit den LCP-Verhandlungen beginnt. Einige Server starten jedoch nie mit der Verhandlungen; falls dies der Fall ist, können Sie folgendes tun:
es_es: Esto le dice a <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> que espere al que el servidor inicie las negociaciones LCP. Algunos servidor pueden no obstante nunca iniciar las negociaciones. En este caso, intente algo como:
pt_br: Isto diz ao <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para esperar que o servidor inicie as negociações do LCP. Alguns servidores, no entanto, nunca podem iniciar negociações. Nesse caso, tente algo como:

source: This tells <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to be passive for 3 seconds, and then to start sending LCP requests. If the peer starts sending requests during this period, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> will immediately respond rather than waiting for the full 3 second period.
de_de: Hierdurch bleibt <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> für drei Sekunden passiv und fängt dann erst an, LCP-Anforderungen zu senden. Falls der Partner während dieser Zeit beginnt, Anforderungen zu senden, wird <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> direkt antworten und nicht erst, nachdem die drei Sekunden abgelaufen sind.
es_es: Esto le dice a <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> que sea pasivo por 3 segundos, y luego comience a enviar pedidos LCP. Si el peer comienza a enviar pedidos durante este período, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> responderá inmediatamente en lugar de esperar el período completo de 3 segundos.
pt_br: Isso informa ao <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ser passivo por 3 segundos e, em seguida, para iniciar o envio de solicitações de LCP. Se o peer começar a enviar pedidos durante este período, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> responderá imediatamente, em vez de esperar pelo período completo de 3 segundos.

source: LCP negotiations continue until the connection is closed. What is wrong?
de_de: Die LCP-Verhandlungen dauern an, bis die Verbindung geschlossen wird. Was mache ich falsch?
es_es: Las negociaciones LCP continúan hasta que la conexión se cierre. ¿Cuál es el problema?
pt_br: As negociações LCP continuam até que a conexão seja encerrada. O que está errado?

source: There is currently an implementation mis-feature in <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> where it does not associate LCP, CCP &amp; IPCP responses with their original requests. As a result, if one PPP implementation is more than 6 seconds slower than the other side, the other side will send two additional LCP configuration requests. This is fatal.
de_de: Es gibt derzeit eine Fehlfunktion in der Implementierung von <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry>, die darin besteht, dass LCP-, CCP- und IPCP-Antworten nicht mit den ursprünglichen Anforderungen assoziiert werden. Für den Fall, dass eine Implementation von PPP mehr als sechs Sekunden langsamer ist, als die andere Seite, resultiert das darin, dass die andere Seite zwei weitere LCP-Konfigurationsanforderungen sendet, was fatale Auswirkungen hat.
es_es: Eixte actualmente un error de implementación en <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> donde no se asocian las respuesta LCP, CCP &amp; IPCP con sus pedidos originales. Como resultado, si una implementación de PPP es más lenta que la del otro lado por 6 segundos o más, el otro lado enviara dos pedidos de configuración LCP adicionales. Esto es fatal.
pt_br: Há atualmente uma implementação incorreta no <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> onde ele não associa LCP, CCP &amp; Respostas IPCP com seus pedidos originais. Como resultado, se uma implementação de PPP for mais de 6 segundos mais lenta do que o outro lado, o outro lado enviará duas solicitações adicionais de configuração de LCP. Isso é fatal.

source: Consider two implementations, <systemitem>A</systemitem> and <systemitem>B</systemitem>. <systemitem>A</systemitem> starts sending LCP requests immediately after connecting and <systemitem>B</systemitem> takes 7 seconds to start. When <systemitem>B</systemitem> starts, <systemitem>A</systemitem> has sent 3 LCP REQs. We are assuming the line has ECHO switched off, otherwise we would see magic number problems as described in the previous section. <systemitem>B</systemitem> sends a REQ, then an ACK to the first of <systemitem>A</systemitem>'s REQs. This results in <systemitem>A</systemitem> entering the <acronym>OPENED</acronym> state and sending and ACK (the first) back to <systemitem>B</systemitem>. In the meantime, <systemitem>B</systemitem> sends back two more ACKs in response to the two additional REQs sent by <systemitem>A</systemitem> before <systemitem>B</systemitem> started up. <systemitem>B</systemitem> then receives the first ACK from <systemitem>A</systemitem> and enters the <acronym>OPENED</acronym> state. <systemitem>A</systemitem> receives the second ACK from <systemitem>B</systemitem> and goes back to the <acronym>REQ-SENT</acronym> state, sending another (forth) REQ as per the RFC. It then receives the third ACK and enters the <acronym>OPENED</acronym> state. In the meantime, <systemitem>B</systemitem> receives the forth REQ from <systemitem>A</systemitem>, resulting in it reverting to the <acronym>ACK-SENT</acronym> state and sending another (second) REQ and (forth) ACK as per the RFC. <systemitem>A</systemitem> gets the REQ, goes into <acronym>REQ-SENT</acronym> and sends another REQ. It immediately receives the following ACK and enters <acronym>OPENED</acronym>.
de_de: Stellen Sie sich zwei Implementierungen <systemitem>A</systemitem> und <systemitem>B</systemitem> vor. <systemitem>A</systemitem> beginnt unmittelbar nach der Verbindung, LCP-Anforderungen zu senden und <systemitem>B</systemitem> benötigt sieben Sekunden, zu starten. Wenn <systemitem>B</systemitem> startet, hat <systemitem>A</systemitem> bereits drei LCP-Anforderungen gesendet. Wir nehmen an, dass ECHO ausgeschaltet ist; andernfalls würden wir Probleme mit der <quote>Magic Number</quote> beobachten, wie bereits im vorherigen Abschnitt beschrieben. <systemitem>B</systemitem> sendet eine Anforderung und anschließend eine Bestätigung der ersten Anforderung von <systemitem>A</systemitem>. Dies führt dazu, dass <systemitem>A</systemitem> in den Zustand <acronym>OPENED</acronym> übergeht und eine Bestätigung (die erste) zurück an <systemitem>B</systemitem> sendet. In der Zwischenzeit sendet <systemitem>B</systemitem> zwei weitere Bestätigungen als Antwort auf die zusätzlichen Anforderungen, die von <systemitem>A</systemitem> gesendet worden sind, bevor <systemitem>B</systemitem> gestartet ist. <systemitem>B</systemitem> empfängt dann die erste Bestätigung von <systemitem>A</systemitem> und geht in den Zustand <acronym>OPENED</acronym> über. <systemitem>A</systemitem> empfängt die zweite Bestätigung von <systemitem>B</systemitem>, geht zurück in den Zustand <acronym>REQ-SENT</acronym> und sendet eine weitere (vierte) Anforderung entsprechend dem RFC. <systemitem>A</systemitem> empfängt dann die dritte Bestätigung und geht in den Zustand <acronym>OPENED</acronym> über. In der Zwischenzeit empfängt <systemitem>B</systemitem> die vierte Anforderung von <systemitem>A</systemitem>, wechselt in den Zustand <acronym>ACK-SENT</acronym> und sendet eine weitere (zweite) Anforderung und (vierte) Bestätigung entsprechend dem RFC. <systemitem>A</systemitem> erhält die Anforderung, geht in den Zustand <acronym>REQ-SENT</acronym> über, sendet eine weitere Anforderung, erhält unverzüglich die nächste Bestätigung und geht in <acronym>OPENED</acronym> über.
es_es: Considere dos implementaciones, <systemitem>A</systemitem> y <systemitem>B</systemitem>. <systemitem>A</systemitem> comienza a enviar pedidos LCP inmediatamente luego de conectarse y a <systemitem>B</systemitem> le lleva 7 segundos iniciar. Cuando <systemitem>B</systemitem> inicia, <systemitem>A</systemitem> ha enviado 3 REQs LCP. Asumimos que la línea tiene ECHO desactivado, de otra forma veríamos problemas con los números mágicos como vimos en la sección previa. <systemitem>B</systemitem> envía una REQ, y luego un ACK al primero de los REQs de <systemitem>A</systemitem>. Esto resulta en <systemitem>A</systemitem> entrando al estado <acronym>OPENED</acronym> y enviando un ACK (del primero) de vuelta a <systemitem>B</systemitem>. Mientras tanto, <systemitem>B</systemitem> envía de vuelta dos ACKs más en respuesta a las dos REQs adicionales enviadas por <systemitem>A</systemitem> antes de que <systemitem>B</systemitem> haya iniciado. <systemitem>B</systemitem> luego pasa a recibir el primero ACK de <systemitem>A</systemitem> y entra al estado <acronym>OPENED</acronym>. <systemitem>A</systemitem> revice el segundo ACK de <systemitem>B</systemitem> y vuelve al estado <acronym>REQ-SENT</acronym>, enviando otro REQ (adelantado) de acuerdo con la RFC. Luego recibe el tercer ACK y entra en el estado <acronym>OPENED</acronym>. En el entremedio, <systemitem>B</systemitem> recibe el REQ adelantado desde <systemitem>A</systemitem>, resultando en el mismo revirtiendo al estado <acronym>ACK-SENT</acronym> y enviando otro (segundo) REQ y ACK (adelantado) de acuerdo con la RFC. <systemitem>A</systemitem> obtiene el REQ, se pone en modo<acronym>REQ-SENT</acronym> y envía otra REQ. Inmediatamente recive el siguiente ACK y entra a modo <acronym>OPENED</acronym>.
pt_br: Considere duas implementações, <systemitem>A</systemitem> e <systemitem>B</systemitem>. <systemitem>A</systemitem> começa a enviar solicitações LCP imediatamente após a conexão e <systemitem>B</systemitem> leva 7 segundos para iniciar. Quando <systemitem>B</systemitem> é iniciado, <systemitem>A</systemitem> enviou 3 LCP REQs. Estamos supondo que a linha esteja com ECHO desligado, caso contrário, veríamos problemas com números mágicos conforme descrito na seção anterior. <systemitem>B</systemitem> envia um REQ e, em seguida, um ACK para o primeiro dos REQs de <systemitem>A</systemitem>. Isso resulta em <systemitem>A</systemitem> inserindo o estado <acronym>OPENED</acronym> e enviando e ACK (o primeiro) de volta para <systemitem>B</systemitem>. Enquanto isso, <systemitem>B</systemitem> envia de volta mais dois ACKs em resposta aos dois REQs adicionais enviados por <systemitem>A</systemitem> antes de <systemitem>B</systemitem> ser iniciado. <systemitem>B</systemitem> recebe o primeiro ACK de <systemitem>A</systemitem> e entra no estado <acronym>OPENED</acronym>. <systemitem>A</systemitem> recebe o segundo ACK de <systemitem>B</systemitem> e retorna ao estado de <acronym>REQ-SENT</acronym>, enviando outro (adiante) REQ de acordo com o RFC. Em seguida, recebe o terceiro ACK e entra no estado <acronym>OPENED</acronym>. Enquanto isso, <systemitem>B</systemitem> recebe o quarto REQ de <systemitem>A</systemitem>, resultando na sua reversão para o estado <acronym>ACK-SENT</acronym> e enviando outro (segundo) REQ e (adiante) ACK de acordo com o RFC. <systemitem>A</systemitem> obtém o REQ, entra em <acronym>REQ-SENT</acronym> e envia outro REQ. Ele recebe imediatamente o seguinte ACK e insere <acronym>OPENED</acronym>.

source: This goes on until one side figures out that they are getting nowhere and gives up.
de_de: Das geht so lange weiter, bis eine Seite erkennt, dass man zu keinem Ergebnis gelangt und aufgibt.
es_es: Esto continua hasta que uno de los lados se de cuenta de que no están llegando a ningún lado y termine.
pt_br: Isso continua até que um lado conclui que eles estão chegando a lugar nenhum e desiste.

source: The best way to avoid this is to configure one side to be <literal>passive</literal> — that is, make one side wait for the other to start negotiating. This can be done with the following command:
de_de: Am besten verhindert man solche Situationen, indem man eine Seite als <literal>passiv</literal> konfiguriert, also dafür sorgt, dass eine Seite darauf wartet, dass die andere mit den Verhandlungen beginnt. Das kann durch den folgenden Befehl geschehen:
es_es: La mejor manera de evitar esto es configurar un lado para ser <literal>passive</literal> — esto es, hacer que un lado espere al otro para comenzar a negociar. Esto puede hacerse con el siguiente comando:
pt_br: A melhor maneira de evitar isso é configurar um lado para ser <literal>passivo</literal> - isto é, fazer um lado esperar que o outro comece a negociar. Isso pode ser feito com o seguinte comando:
