Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: When the chat interpreter parses each argument, it re-interprets the argument to find any special escape sequences such as <literal>\P</literal> or <literal>\T</literal>. As a result of this double-parsing, remember to use the correct number of escapes.
de_de: Wenn der Chat-Interpreter jedes Argument analysiert, reinterpretiert er die Argumente, um irgendwelche speziellen Escape-Sequenzen wie z.B. <literal>\P</literal> oder <literal>\T</literal> zu finden. Das Ergebnis dieser Doppelanalyse ist, dass Sie daran denken müssen, die richtige Anzahl an Escape-Zeichen zu verwenden.
es_es: Cuando el interprete de chat parsea cada argumento, reinterpreta el argumento para buscar cualquier secuencia de escape especial tales como <literal>\P</literal> o <literal>\T</literal>. Como resultado de este doble parsea, recuerde usar el número correcto de escapes.
pt_br: Quando o interpretador de conversas analisa cada argumento, ele reinterpreta o argumento para encontrar qualquer sequência especiais escapadas, como <literal>\P</literal> ou <literal>\T</literal>. Como resultado dessa análise dupla, lembre-se de usar o número correto de escapes.

source: To actually send a <literal>\</literal> character, do something like:
de_de: Falls Sie tatsächlich das Zeichen <literal>\</literal> senden möchten, benutzen Sie etwas wie:
es_es: Para realmente envíar un carácter <literal>\</literal>, haga algo como:
pt_br: Para realmente enviar um caractere <literal> \ </literal>, faça algo como:

source: It will result in the following sequence:
de_de: Woraus sich folgende Zeichen ergeben:
es_es: Esto resultara en la siguiente secuencia:
pt_br: Isso resultará na seguinte seqüência:

source: Or:
de_de: Oder:
es_es: Ó:
pt_br: Ou:

source: What are FCS errors?
de_de: Was sind FCS-Fehler?
es_es: ¿Qué son los errores FCS?
pt_br: Quais são os erros do FCS?

source: FCS stands for Frame Check Sequence. Each PPP packet has a checksum attached to ensure that the data being received is the data being sent. If the FCS of an incoming packet is incorrect, the packet is dropped and the HDLC FCS count is increased. The HDLC error values can be displayed using the <literal>show hdlc</literal> command.
de_de: FCS steht für Frame Check Sequence. Jedes PPP-Paket besitzt eine Checksumme, um sicherzustellen, dass die empfangenen Daten dieselben sind, wie die versendeten. Falls die FCS eines ankommenden Paketes fehlerhaft ist, wird das Paket verworfen und der Zähler HDLC FCS wird erhöht. Der HDLC-Fehlerwert kann durch den Befehl <literal>show hdlc</literal> angezeigt werden.
es_es: FCS significa Frame Check Secuence (secuencia de verificación de marcos). Cada paquete PPP tiene un checksum asignado para asegurarse que los datos que están siendo recibidos son los datos que se envían. Si el FCS de un paquete entrante es incorrecto, el paquete es tirado y la cuenta de HDLC de FCS se incrementa. Los valores de error de HDLC pueden mostrarse usando el comando <literal>show hdlc</literal>.
pt_br: FCS significa Sequência de Verificação de Quadro. Cada pacote PPP tem uma soma de verificação anexada para garantir que os dados sendo recebidos sejam os dados que estão sendo enviados. Se o FCS de um pacote de entrada estiver incorreto, o pacote será descartado e a contagem HDLC FCS será aumentada. Os valores de erro HDLC podem ser exibidos usando o comando <literal>show hdlc</literal>.

source: If the link is bad or if the serial driver is dropping packets, it will produce the occasional FCS error. This is not usually worth worrying about although it does slow down the compression protocols substantially.
de_de: Falls die Leitung schlecht ist, oder falls der serielle Treiber Pakete verwirft, werden gelegentliche FCS-Fehler generiert. Normalerweise lohnt es sich nicht, sich hierüber Gedanken zu machen, obwohl das Kompressionsprotokoll hierdurch wesentlich langsamer wird.
es_es: Si el link esta mal o el controlador de serie comienza a desechar paquetes, producirá el error de FCS ocasional. Esto no suele ser algo por lo que valga la pena preocuparse, aunque ralentiza los protocolos de compresión substancialmente.
pt_br: Se o link for ruim ou se o driver serial estiver descartando pacotes, ele produzirá o erro ocasional de FCS. Isso geralmente não vale a pena se preocupar, embora deixe substancialmente lento os protocolos de compactação.

source: If the link freezes as soon as it connects and produces a large number of FCS errors, make sure the modem is not using software flow control (XON/XOFF). If the link must use software flow control, use <literal>set accmap 0x000a0000</literal> to tell <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to escape the <literal>^Q</literal> and <literal>^S</literal> characters.
de_de: Falls die Leitung einfriert, sobald die Verbindung steht, und viele FCS-Fehler auftreten, müssen Sie sicherstellen, dass das Modem keinen Software-Flow-Control (XON/XOFF) verwendet. Falls die Datenschnittstelle Software-Flow-Control verwenden muss, benutzen Sie den Befehl <literal>set accmap 0x000a0000</literal>, um <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu sagen, dass es die Zeichen <literal>^Q</literal> und <literal>^S</literal> maskieren soll.
es_es: Si el link se paraliza tan pronto como se conecta y produce ung ran numero de errores de FCS, asegurese de que el modem no este usando control de flujo por software (XON/XOFF). Si el link debe usar control de flujo por software, use <literal>set accmap 0x000a0000</literal> para decirle a <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> que escapee los caracteres <literal>^Q</literal> y <literal>^S</literal>.
pt_br: Se o link congelar assim que se conectar e produzir um grande número de erros de FCS, verifique se o modem não está usando o controle de fluxo de software (XON/XOFF). Se o link precisar usar o controle de fluxo de software, use <literal>set accmap 0x000a0000</literal> para informar o <citerefentry> <refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para escapar o <literal >^Q</literal> e caracteres <literal>^S</literal>.

source: Another reason for too many FCS errors may be that the remote end has stopped talking <acronym>PPP</acronym>. In this case, enable <literal>async</literal> logging to determine if the incoming data is actually a login or shell prompt. If it is a shell prompt at the remote end, it is possible to terminate <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> without dropping the line by using <command>close lcp</command> followed by <command>term</command>) to reconnect to the shell on the remote machine.
de_de: Ein weiterer Grund dafür, dass zu viele FCS-Fehler auftreten, könnte der sein, dass das andere Ende aufgehört hat, <acronym>PPP</acronym> zu sprechen. Aktivieren Sie <literal>async</literal> Logging, um festzustellen, ob es sich bei den eingehenden Daten tatsächlich um einen login- oder Shell-Prompt handelt. Wenn Sie am anderen Ende einen Shell-Prompt haben, ist es möglich, durch den Befehl <command>close lcp</command> gefolgt von <command>term</command> zu benutzen, um <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu beenden, ohne die Verbindung zu beenden und Sie wieder mit der Shell auf dem entfernten Rechner verbinden.
es_es: Otra razón para tener demasiados errores de FCS puede ser que el extremo remoto haya dejado de comunicarse con <acronym>PPP</acronym>. En este caso, habilite el logueo <literal>async</literal> para determinar si los datos entrantes son de un inicio de sesión o un indicador del shell. Si se trata de un indicador del shell en el textrmo remoto, es posible terminar <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sin desechar la línea usando <command>close lcp</command> seguido de <command>term</command>) para reconectarse al shell en la máquina remota.
pt_br: Outra razão para muitos erros de FCS, pode ser que o terminal remoto parou de falar com <acronym>PPP</acronym>. Nesse caso, ative o log do <literal>async</literal> para determinar se os dados recebidos são realmente um login ou prompt de shell. Se for um prompt de shell no final remoto, é possível terminar o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sem eliminar a linha usando <command>close lcp</command> seguido de <command>term</command>) para reconectar ao shell na máquina remota.

source: If nothing in the log file indicates why the link was terminated, ask the remote administrator or ISP why the session was terminated.
de_de: Falls nichts in der Logdatei darauf hindeutet, warum die Verbindung beendet wurde, sollten Sie den Administrator oder ISP des externen Rechners fragen, warum die Sitzung beendet worden ist.
es_es: Si nada en el archivo de log indica porque el ink fue terminado, pregúntele al administrador remoto o su ISP porque la sesión termino.
pt_br: Se nada no arquivo de log indicar por que o link foi encerrado, pergunte ao administrador remoto ou ISP por que a sessão foi encerrada.

source: None of this helps — I am desperate! What can I do?
de_de: Nichts von alledem hilft - ich bin verzweifelt! Was soll ich machen?
es_es: Nada de esto ayuda — ¡Estoy desesperado! ¿Qué puedo hacer?
pt_br: Nada disso ajudou - estou desesperado! O que eu posso fazer?

source: If all else fails, send the details of the error, the configuration files, how <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> is being started, the relevant parts of the log file, and the output of <command>netstat -rn</command>, before and after connecting, to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link>.
de_de: Falls alles andere fehlschlägt, senden Sie möglichst umfangreiche Informationen, einschließlich Ihrer Konfigurationsdateien, wie Sie <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> starten, die relevanten Teile Ihrer Logdateien und die Ausgabe von <command>netstat -rn</command> (vor und nach Aufbau der Verbindung) an die <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link>.
es_es: Si todo lo demás falla, envíe los detalles del error, los archivos de configuración, como se esta iniciando <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry>, las partes reelevantes del archivo de log, y la salida de <command>netstat -rn</command>, antes y después de conectarse, a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de correo de preguntas generales de FreeBSD</link>.
pt_br: Se tudo mais falhar, envie os detalhes do erro, os arquivos de configuração, como <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> está sendo iniciado, as partes relevantes no arquivo de log , e a saída de <command>netstat -rn</command>, antes e depois de conectar, para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">Lista de discussão de questões gerais do FreeBSD</link>.

source: Serial Communications
de_de: Serielle Verbindungen
es_es: Comunicaciones en serie
pt_br: Comunicações Seriais

source: This section answers common questions about serial communications with FreeBSD. PPP is covered in the <link linkend="networking">Networking</link> section.
de_de: Dieses Kapitel beantwortet häufig gestellte Fragen zu seriellen Verbindungen mit FreeBSD. PPP wird im Abschnitt <link linkend="networking">Netzwerke</link> behandelt.
es_es: Esta sección responde preguntas comunes acerca de comunicaciones en serie con FreeBSD. PPP esta cubierto en la sección de <link linkend="networking">Redes</link>.
pt_br: Esta seção responde a perguntas comuns sobre comunicação serial com o FreeBSD. O PPP é abordado na seção <link linkend="networking">Networking</link>.

source: Which multi-port serial cards are supported by FreeBSD?
de_de: Welche seriellen Multi-Port-Karten werden von FreeBSD unterstützt?
es_es: ¿Qué tarjetas en serie multi-puerto están soportadas por FreeBSD?
pt_br: Quais placas multi-seriais são suportadas pelo FreeBSD?

source: There is a list of these in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html">Serial Communications</link> chapter of the Handbook.
de_de: Es existiert eine Liste der unterstützten Karten im Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/serial.html">Serielle Datenübertragung</link> des Handbuchs.
es_es: Hay una lista de las mismas en el capítulo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html">Comunicaciones en serie</link> del manual.
pt_br: Há uma lista destas no capítulo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serial.html"> Comunicações Seriais </link> do Handbook.

source: Most multi-port PCI cards that are based on 16550 or clones are supported with no extra effort.
de_de: Die meisten auf den 16550 basierten PCI Multi-Port-Karten werden mühelos unterstützt.
es_es: Las tarjetas multipuertos PCI que estén basadas en 16550 o clones están soportadas sin ningún esfuerzo extra.
pt_br: A maioria das placas PCI multi-portas baseadas em 16550 ou nos seus clones são suportadas sem esforço extra.

source: Some unnamed clone cards have also been known to work, especially those that claim to be AST compatible.
de_de: Von einigen NoName-Nachbauten ist ebenfalls bekannt, dass sie funktionieren, speziell von den AST-kompatiblen.
es_es: Se ha reportado tambíen que algunas tarjetas clon variadas funcionan, especialmente aquellas que dicen ser compatibles con AST.
pt_br: Alguns cartões clone não-nomeados também são conhecidos por funcionar, especialmente aqueles que afirmam ser compatíveis com AST.

source: Check <citerefentry><refentrytitle>uart</refentrytitle><manvolnum>4</manvolnum></citerefentry> and <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> to get more information on configuring such cards.
de_de: In <citerefentry><refentrytitle>uart</refentrytitle><manvolnum>4</manvolnum></citerefentry> und <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> finden Sie weitere Informationen zur Konfiguration solcher Karten.
es_es: Vea <citerefentry><refentrytitle>uart</refentrytitle><manvolnum>4</manvolnum></citerefentry> and <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> para obtener más información acerca de configurar tales tarjetas.
pt_br: Verifique <citerefentry><refentrytitle>uart</refentrytitle><manvolnum>4</manvolnum></citerefentry> e <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> para obter mais informações sobre como configurar esses cartões.

source: How do I get the boot: prompt to show on the serial console?
de_de: Wie kann ich den boot:-Prompt auf einer seriellen Konsole anzeigen lassen?
es_es: ¿Como hago que boot: prompt se muestre en la consola de serie?
pt_br: Como obtenho o prompt de boot: em um console serial?

source: See <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serialconsole-setup.html">this section of the Handbook</link>.
de_de: Lesen Sie <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/serialconsole-setup.html">diesen Abschnitt</link> des Handbuchs.
es_es: Vea <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serialconsole-setup.html">esta sección del manual</link>.
pt_br: Veja <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/serialconsole-setup.html"> esta seção do Handbook</link>.

source: How do I tell if FreeBSD found my serial ports or modem cards?
de_de: Wie kann ich feststellen, ob FreeBSD meine seriellen Schnittstellen oder Modemkarten gefunden hat?
es_es: ¿Cómo puedo saber si FreeBSD encontró mis puertos en serie o tarjetas de modem?
pt_br: Como sei se o FreeBSD encontrou minhas portas seriais ou placas de modem?

source: As the FreeBSD kernel boots, it will probe for the serial ports for which the kernel is configured. Either watch the boot messages closely or run this command after the system is up and running:
de_de: Wenn der FreeBSD Kernel bootet, testet er die seriellen Schnittstellen, für die er konfiguriert wurde. Sie können entweder aufmerksam die Bootmeldungen verfolgen, oder Sie führen den folgenden Befehl aus, nachdem das System hochgefahren ist und läuft:
es_es: Mientras el kernel de FreeBSD arranca, verificara los puertos en serie para los que esta configurado el kernel. Vea los mensajes de inicio con atención o corra este comando luego de que el sistema haya arrancado:
pt_br: Quando o kernel do FreeBSD for inicializado, ele irá sondar as portas seriais para as quais o kernel está configurado. Observe atentamente as mensagens de inicialização ou execute este comando após o sistema estar ativo e em execução:

source: This example shows two serial ports. The first is on IRQ4, port address <literal>0x3f8</literal>, and has a 16550A-type UART chip. The second uses the same kind of chip but is on IRQ3 and is at port address <literal>0x2f8</literal>. Internal modem cards are treated just like serial ports, except that they always have a modem attached to the port.
de_de: Dieses Beispiel zeigt zwei serielle Schnittstellen. Die erste verwendet Port-Adresse <literal>0x3f8</literal>, IRQ4 und hat einen 16550A UART Chip. Die zweite benutzt ebenfalls einen 16550A UART, jedoch Port-Adresse <literal>0x2f8</literal> und IRQ3. Modemkarten werden wie serielle Schnittstellen behandelt. Der einzige Unterschied ist, dass an diesen Schnittstellen immer ein Modem angeschlossen ist.
es_es: Esta salida de ejemplo muestra dos puertos en serie. El primero esta en IRQ4, en la dirección de puerto <literal>0x3f8</literal>, y tiene un chip de tipo 16550A-type UART. El segundo usa el mismo tipo de chip pero esta en IRQ3 y esta en la dirección de puerto <literal>0x2f8</literal>. Las tarjetas de modem internas también son tratadas como puertos en serie, excepto que siempre tienen un modem adjuntado al puerto.
pt_br: Este exemplo mostra duas portas seriais. O primeiro está no IRQ4, endereço de porta <literal>0x3f8</literal>, e possui um chip UART tipo 16550A. O segundo usa o mesmo tipo de chip, mas está no IRQ3 e está no endereço de porta <literal>0x2f8</literal>. As placas de modem internas são tratadas como portas seriais, exceto pelo fato de sempre terem um modem conectado à porta.

source: The <filename>GENERIC</filename> kernel includes support for two serial ports using the same IRQ and port address settings in the above example. If these settings are not right for the system, or if there are more modem cards or serial ports than the kernel is configured for, reconfigure using the instructions in <link linkend="make-kernel">building a kernel</link> for more details.
de_de: Der <filename>GENERIC</filename>-Kernel beinhaltet Unterstützung für zwei serielle Schnittstellen, die den im Beispiel genannten Port und IRQ verwenden. Wenn diese Einstellungen nicht richtig für das System sind, Sie Modemkarten hinzugefügt oder mehr serielle Schnittstellen haben als die Kernelkonfiguration zulässt, konfigurieren Sie den Kernel einfach neu. In dem Kapitel über die <link linkend="make-kernel">Kernelkonfiguration</link> finden Sie mehr Details.
es_es: El kernel <filename>GENERIC</filename> incluye soporte para dos puertos en serie usando los mismos ajustes de dirección de puerto e IRQ en el ejemplo anterior. Si estos ajustes no son adecuados para el sistema, o si hay más tarjetas de modem o puertos en serie que los que tiene configurado el kernel, reconfigure usando las instrucciones en <link linkend="make-kernel">compilar un kernel</link> para más detalles.
pt_br: O kernel <filename>GENERIC</filename> inclui suporte para duas portas seriais usando as mesmas configurações de IRQ e endereço de porta no exemplo acima. Se estas configurações não forem adequadas para o sistema, ou se houver mais placas de modem ou portas seriais do que o kernel está configurado, reconfigure usando as instruções em <link linkend="make-kernel">construindo um kernel</link> para mais detalhes.

source: How do I access the serial ports on FreeBSD?
de_de: Wie kann ich unter FreeBSD auf die seriellen Schnittstellen zugreifen?
es_es: ¿Como accedo a los puertos en serie en FreeBSD?
pt_br: Como eu acesso as portas seriais no FreeBSD?

source: The third serial port, <filename>sio2</filename>, or <filename>COM3</filename>, is on <filename>/dev/cuad2</filename> for dial-out devices, and on <filename>/dev/ttyd2</filename> for dial-in devices. What is the difference between these two classes of devices?
de_de: Die dritte serielle Schnittstelle, <filename>sio2</filename> (<filename>COM3</filename>), ist <filename>/dev/cuad2</filename> für Geräte mit abgehenden Verbindungen und <filename>/dev/ttyd2</filename> für Geräte mit eingehenden Verbindungen. Was ist der Unterschied zwischen den beiden Geräteklassen?
es_es: El tercer puerto en serie <filename>sio2</filename>, o <filename>COM3</filename>, esta en <filename>/dev/cuad2</filename> para dispositivos de marcado saliente, y en <filename>/dev/ttyd2</filename> para dispositivos de marcado entrante. ¿Cuál es la diferencia entre estas dos clases de dispositivos?
pt_br: A terceira porta serial, <filename>sio2</filename>, ou <filename>COM3</filename>, está em <filename>/dev/cuad2</filename> para dispositivos dial-out e em <filename>/dev/ttyd2</filename> para dispositivos dial-in. Qual é a diferença entre essas duas classes de dispositivos?
