Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Some people prefer to use <filename>/dev/mouse</filename> under X. To make this work, <filename>/dev/mouse</filename> should be linked to <filename>/dev/sysmouse</filename> (see <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry>) by adding the following line to <filename>/etc/devfs.conf</filename> (see <citerefentry><refentrytitle>devfs.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>):
de_de: Einige Leute ziehen es vor, unter X <filename>/dev/mouse</filename> zu benutzen. Hierzu sollte <filename>/dev/mouse</filename> nach <filename>/dev/sysmouse</filename> (siehe <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry>) gelinkt werden, indem Sie die folgende Zeile in <filename>/etc/devfs.conf</filename> (siehe <citerefentry><refentrytitle>devfs.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>) hinzufügen:
es_es: Algunas personas prefieran usar <filename>/dev/mouse</filename> bajo X. Para hacer que esto funcione, <filename>/dev/mouse</filename> debería estar vinculado a <filename>/dev/sysmouse</filename> (vea <citerefentry><refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry>) añadiendo la siguiente línea a <filename>/etc/devfs.conf</filename> (vea <citerefentry><refentrytitle>devfs.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>):
pt_br: Algumas pessoas preferem usar o <filename>/dev/mouse </filename> com o X. Para fazer esse trabalho, <filename>/dev/mouse</filename> deve estar vinculado a <filename>/dev/sysmouse</filename> (veja <citerefentry> <refentrytitle>sysmouse</refentrytitle><manvolnum>4</manvolnum></citerefentry>) adicionando a seguinte linha ao <filename>/etc/devfs.conf</filename> (veja <citerefentry><refentrytitle>devfs.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>):

source: This link can be created by restarting <citerefentry vendor="current"><refentrytitle>devfs</refentrytitle><manvolnum>5</manvolnum></citerefentry> with the following command (as <systemitem class="username">root</systemitem>):
de_de: Die Verknüpfung kann durch Neustart von <citerefentry vendor="current"><refentrytitle>devfs</refentrytitle><manvolnum>5</manvolnum></citerefentry> über das folgende Kommando (als <systemitem class="username">root</systemitem>) erzeugt werden:
es_es: Este vínculo puede ser creado reiniciando <citerefentry vendor="current"><refentrytitle>devfs</refentrytitle><manvolnum>5</manvolnum></citerefentry> con el siguiente comando (como <systemitem class="username">root</systemitem>):
pt_br: Este link pode ser criado reiniciando o <citerefentry vendor="current"><refentrytitle>devfs</refentrytitle><manvolnum>5</manvolnum></citerefentry> com o seguinte comando (executado como <systemitem class="username"> root </systemitem>):

source: My mouse has a fancy wheel. Can I use it in X?
de_de: Kann ich meine Rad-Maus auch unter X benutzen?
es_es: Mi mouse tiene una flamante rueda. ¿Puedo usarla en X?
pt_br: Meu mouse tem uma fancy wheel. Posso usá-lo no X?

source: Yes, if X is configured for a 5 button mouse. To do this, add the lines <literal>Buttons 5</literal> and <literal>ZAxisMapping 4 5</literal> to the <quote>InputDevice</quote> section of <filename>/etc/X11/xorg.conf</filename>, as seen in this example:
de_de: Dazu müssen Sie X nur mitteilen, dass Sie eine Maus mit 5 Tasten haben. Dazu fügen Sie die Zeilen <literal>Buttons 5</literal> sowie <literal>ZAxisMapping 4 5</literal> in den Abschnitt <quote>InputDevice</quote> von <filename>/etc/X11/xorg.conf</filename> ein. Das Beispiel zeigt, wie ein solcher Abschnitt aussehen könnte.
es_es: Si, si X se configura para un mouse de 5 botones. Para hacer esto, agregue las líneas <literal>Buttons 5</literal> y <literal>ZAxisMapping 4 5</literal> a la sección <quote>InputDevice</quote> de <filename>/etc/X11/xorg.conf</filename>, como se ve en este ejemplo:
pt_br: Sim, se o X estiver configurado para um mouse de 5 botões. Para fazer isso, adicione as linhas <literal>Buttons 5</literal> e <literal>ZAxisMapping 4 5</literal> na seção <quote>InputDevice</quote> do arquivo <filename>/etc/X11/xorg.conf</filename>, como visto neste exemplo:

source: To use the mouse in <application>Emacs</application>, also add the following lines to<filename>~/.emacs</filename>:
de_de: Wenn Sie die Maus in <application>Emacs</application> benutzen wollen, fügen Sie auch die folgenden Zeilen in <filename>~/.emacs</filename> ein:
es_es: Para usar el mouse en <application>Emacs</application>, también agregue las siguientes líneas a <filename>~/.emacs</filename>:

source: My laptop has a Synaptics touchpad. Can I use it in X?
de_de: Mein Laptop hat ein Synaptics Touchpad. Kann ich das unter X benutzen?
es_es: Mi laptop tiene un touchpad Synaptics. ¿Puedo usarlo en X?
pt_br: Meu laptop tem um touchpad Synaptics. Posso usá-lo no X?

source: Yes, after configuring a few things to make it work.
de_de: Ja, aber damit es funktioniert, müssen Sie ein paar Dinge konfigurieren.
es_es: Si, luego de configurar un par de cosas para hacerlo funcionar.
pt_br: Sim, depois de configurar algumas coisas para que funcione.

source: In order to use the Xorg synaptics driver, first remove <literal>moused_enable</literal> from <filename>rc.conf</filename>.
de_de: Damit Sie den Xorg synaptics Treiber benutzen können, müssen Sie zuerst <literal>moused_enable</literal> aus <filename>/etc/rc.conf</filename> entfernen.
es_es: Para usar el controlador de synaptics de Xorg, primero remueva <literal>moused_enable</literal> de <filename>rc.conf</filename>.
pt_br: Para usar o driver synaptics do Xorg, primeiro remova <literal> moused_enable </literal> do <filename> rc.conf </filename>.

source: To enable synaptics, add the following line to <filename>/boot/loader.conf</filename>:
de_de: Um synaptics zu aktivieren, fügen Sie die folgende Zeile in <filename>/boot/loader.conf</filename> ein:
es_es: Para habilitar synaptics, agregue las siguiente línea a <filename>/boot/loader.conf</filename>:
pt_br: Para habilitar a synaptics, adicione a seguinte linha ao <filename> /boot/loader.conf </filename>:

source: Add the following to <filename>/etc/X11/xorg.conf</filename>:
de_de: Fügen Sie die folgende Zeile in <filename>/etc/X11/xorg.conf</filename> ein:
es_es: Agregue lo siguiente a <filename>/etc/X11/xorg.conf</filename>:
pt_br: Adicione o seguinte ao <filename> /etc/X11/xorg.conf </filename>:

source: And be sure to add the following into the <quote>ServerLayout</quote> section:
de_de: Und fügen Sie die folgende Zeile in den Abschnitt <quote>ServerLayout</quote> hinzu:
es_es: Y asegurese de añadir la siguiente línea a la sección <quote>ServerLayout</quote>:
pt_br: E não se esqueça de adicionar o seguinte na seção <quote> ServerLayout </quote>:

source: How do I use remote X displays?
de_de: Wie verwende ich entfernte X-Displays?
es_es: ¿Como use pantallas X remotas?
pt_br: Como eu uso displays X remotos?

source: For security reasons, the default setting is to not allow a machine to remotely open a window.
de_de: Aus Sicherheitsgründen verbietet der X-Server in der Voreinstellung Verbindungen von entfernten Systemen.
es_es: Por razones de seguridad, la configuración por defecto es no permitir que la maquina abra una ventana directamente.
pt_br: Por motivos de segurança, a configuração padrão é não permitir que uma máquina abra remotamente uma janela.

source: To enable this feature, start <application>X</application> with the optional <option>-listen_tcp</option> argument:
de_de: Starten Sie den <application>X</application> mit der Option <option>-listen_tcp</option>, wenn Sie Verbindungen von entfernten Systemen erlauben wollen:
es_es: Para habilitar esta característica arranque <application>X</application> con el argumento opcional <option>-listen_tcp</option>:
pt_br: Para ativar esse recurso, inicie o <application> X </application> com o argumento opcional <option> -listen_tcp </option>:

source: What is a virtual console and how do I make more?
de_de: Was ist eine virtuelle Konsole und wie erstelle ich mehr davon?
es_es: ¿Qué es una consola virtual y como hago más?
pt_br: O que é um console virtual e como faço outros?

source: Virtual consoles provide several simultaneous sessions on the same machine without doing anything complicated like setting up a network or running X.
de_de: Mit virtuellen Konsolen können Sie mehrere simultane Sitzungen auf einer Maschine laufen lassen, ohne so komplizierte Dinge wie die Einrichtung eines Netzwerkes oder die Benutzung von X zu benötigen.
es_es: Las consolas virtuales proveen varias sesiones simultaneas en una misma máquina sin hacer nada complicado como configurar una red o correr X.
pt_br: Os consoles virtuais fornecem várias sessões simultâneas na mesma máquina sem fazer nada complicado, como configurar uma rede ou executar o X.

source: When the system starts, it will display a login prompt on the monitor after displaying all the boot messages. Type in your login name and password to start working on the first virtual console.
de_de: Wenn das System startet, wird es nach der Anzeige aller Bootmeldungen eine Eingabeaufforderung auf dem Bildschirm anzeigen. Sie können dann auf der ersten virtuellen Konsole Ihren Benutzernamen und das Passwort eingeben und anfangen, zu arbeiten.
es_es: Cuando arranca el sistema, se mostrara un indicador de arranque en el monitor luego de mostrar los mensajes de inicio. Escriba su nombre de usuario y contraseña para comenzar a trabajar en la primera consola virtual.
pt_br: Quando o sistema iniciar, ele exibirá um prompt de login no monitor depois de exibir todas as mensagens de inicialização. Digite seu nome de login e senha para começar a trabalhar no primeiro console virtual.

source: To start another session, perhaps to look at documentation for a program or to read mail while waiting for an FTP transfer to finish, hold down <keycap>Alt</keycap> and press <keycap>F2</keycap>. This will display the login prompt for the second virtual console. To go back to the original session, press <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>.
de_de: Um eine weitere Sitzung zu starten, vielleicht, um die Dokumentation zu einem Programm, das Sie gerade benutzen, einzusehen, oder, um Ihre Mails zu lesen, während Sie auf das Ende einer FTP-Übertragung warten. Drücken Sie <keycap>Alt</keycap><keycap>F2</keycap> und Sie gelangen zur Anmelde-Aufforderung auf der zweiten virtuellen Konsole. Wenn Sie zurück zur ersten Sitzung möchten, drücken Sie <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>.
es_es: Para iniciar otra sesion, tal vez para ver documentación para un programa o para leer mail mientras espera que termine una transferencia por FTP, mantenga <keycap>Alt</keycap> y presione <keycap>F2</keycap>. Esto mostrara el indicador de inicio para la segunda consola virtual. Para volver a la sesión original presione <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>.
pt_br: Para iniciar outra sessão, talvez para examinar a documentação de um programa ou para ler mensagens enquanto aguarda a conclusão de uma transferência por FTP, pressione <keycap>Alt</keycap> e pressione <keycap>F2</keycap>. Isso exibirá o prompt de login do segundo console virtual. Para voltar à sessão original, pressione <keycombo action="simul"> <keycap>Alt</keycap><keycap>F1</keycap></keycombo>.

source: The default FreeBSD installation has eight virtual consoles enabled. <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F2</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F3</keycap></keycombo>, and so on will switch between these virtual consoles.
de_de: Die Standardinstallation von FreeBSD bietet acht aktivierte virtuelle Konsolen. Mit <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F2</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F3</keycap></keycombo> und so weiter wechseln Sie zwischen diesen virtuellen Konsolen.
es_es: La instalación por defecto de FreeBSD tiene ocho consolas virtuales habilitadas. <keycombo action="simul"><keycap>Alt</keycap><keycap>F1</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F2</keycap></keycombo>, <keycombo action="simul"><keycap>Alt</keycap><keycap>F3</keycap></keycombo>, y demás iran cambiando entre estas consolas virtuales.
pt_br: A instalação padrão do FreeBSD possui oito consoles virtuais habilitados. A combinação de teclas <keycombo action="simul"> <keycap> Alt </keycap> <keycap> F1 </keycap> </keycombo>, <keycombo action="simul"> <keycap> Alt </keycap> <keycap> F2 </keycap> </keycombo>, <keycombo action="simul"> <keycap> Alt </keycap> <keycap> F3 </keycap> </keycombo>, e assim por diante alternará entre esses consoles virtuais.

source: To enable more of virtual consoles, edit <filename>/etc/ttys</filename> (see <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) and add entries for <filename>ttyv8</filename> to <filename>ttyvc</filename>, after the comment on <quote>Virtual terminals</quote>:
de_de: Um weitere virtuelle Konsolen zu aktivieren, editieren Sie <filename>/etc/ttys</filename> (<citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) und fügen Einträge für <filename>ttyv8</filename> bis zu <filename>ttyvc</filename> nach dem Kommentar zu <quote>Virtual terminals</quote> ein:
es_es: Para habilitar más consolas virtuales, edite <filename>/etc/ttys</filename> (vea <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) y añada entradas para <filename>ttyv8</filename> hasta <filename>ttyvc</filename>, luego del comentario acerca de <quote>terminales virtuales</quote>:
pt_br: Para habilitar mais consoles virtuais, edite <filename>/etc/ttys</filename> (veja <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>) e adicione entradas do <filename> ttyv8 </filename> até o <filename> ttyvc </filename>, após os comentários na seção <quote>Virtual terminals</quote>:

source: The more virtual terminals, the more resources that are used. This can be problematic on systems with 8 MB RAM or less. Consider changing <literal>secure</literal> to <literal>insecure</literal>.
de_de: Benutzen Sie so wenig oder so viele, wie Sie möchten. Je mehr virtuelle Terminals Sie benutzen, desto mehr Ressourcen werden gebraucht; das kann wichtig sein, wenn Sie 8 MB RAM oder weniger besitzen. Sie können auch <literal>secure</literal> in <literal>insecure</literal> ändern.
es_es: Cuantas más terminales virtuales, más recursos son usados. Esto puede ser problemático en sistemas con 8 MB de RAM o menos. Considere cambiar <literal>secure</literal> a <literal>insecure</literal>.
pt_br: Quanto mais terminais virtuais estiverem ativos, mais recursos serão usados. Isso pode ser um problema em sistemas com 8 MB de RAM ou menos. Considere mudar a opção <literal>secure</literal> para <literal>insecure</literal>.

source: Versions of FreeBSD prior to 9.0 used the <quote> cons25</quote> terminal type, and not <quote> xterm</quote>. Use the format of existing entries in when adding entries to <filename>/etc/ttys</filename>.
de_de: FreeBSD 9.0 und ältere Versionen verwenden den Terminaltyp <quote>cons25</quote> und nicht <quote>xterm</quote>. Benutzen Sie beim Hinzufügen von neuen Einträgen in <filename>/etc/ttys</filename> das Format der bereits bestehenden Einträge.
es_es: Versions de FreeBSD anteriores a 9.0 usaban el tipo de terimnal <quote> cons25</quote>, en lugar de <quote> xterm</quote>. Use el format de las entradas existentes al añadir entradas a <filename>/etc/ttys</filename>.

source: In order to run an X server, at least one virtual terminal must be left to <literal>off</literal> for it to use. This means that only eleven of the Alt-function keys can be used as virtual consoles so that one is left for the X server.
de_de: Wenn Sie einen X-Server benutzen möchten, müssen Sie mindestens ein virtuelles Terminal ausgeschaltet (<literal>off</literal>) lassen damit der Server es benutzen kann. Das heißt, dass Ihnen nur 11 Alt-Funktionstasten für virtuelle Konsolen zur Verfügung stehen, die letzte ist für den X-Server bestimmt.
es_es: Para correr un servidor X, al menos una terminal virtual debe estar en<literal>off</literal> para que la use. Esto significa que solo once de las teclas Alt-function pueden ser usadas como consolas virtuales de manera que una queda para el servidor X.
pt_br: Para executar um servidor X, pelo menos um terminal virtual deverá ser deixado como <literal>off</literal> para ele usar. Isso significa que apenas onze das teclas de função Alt podem ser usadas como consoles virtuais, de modo que uma deverá ser deixada livre para uso do servidor X.

source: For example, to run X and eleven virtual consoles, the setting for virtual terminal 12 should be:
de_de: Um beispielsweise X und elf virtuelle Konsolen auszuführen, sollte die Einstellung für das virtuelle Terminal 12 wie folgt sein:
es_es: Por ejemplo, para correr X y once consolas virtuales, la configuración para la terminal 12 debería ser:
pt_br: Por exemplo, para executar o X e onze consoles virtuais, a configuração para o terminal virtual 12 deve ser:

source: The easiest way to activate the virtual consoles is to reboot.
de_de: Sie können das System neu starten, um die virtuellen Konsolen zu aktivieren.
es_es: La manera más fácil de activar las consolas virtuales es reiniciar.
pt_br: A maneira mais fácil de ativar os consoles virtuais é reinicializar.

source: How do I access the virtual consoles from X?
de_de: Wie greife ich von X aus auf virtuelle Konsolen zu?
es_es: ¿Como accedo a las consolas virtuales desde X?
pt_br: Como eu acesso os consoles virtuais a partir do X?

source: Use <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> to switch back to a virtual console. Press <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> to return to the first virtual console.
de_de: Benutzen Sie <keycombo action="simul"><keycap>Strg</keycap><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> um auf eine virtuelle Konsole umzuschalten. Mit <keycombo action="simul"><keycap>Strg</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> schalten Sie zur ersten virtuellen Konsole.
es_es: Use <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> para cambiar a una consola virtual. Presione <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> para volver a la primera consola virtual.
pt_br: Utilize <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> para voltar a um console virtual. Pressione <keycombo action="simul"> <keycap> Ctrl </keycap> <keycap> Alt </keycap> <keycap> F1 </keycap> </keycombo> para retornar ao primeiro console virtual.

source: Once at a text console, use <keycombo action="simul"><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> to move between them.
de_de: Sobald Sie auf eine virtuelle Konsole umgeschaltet haben, können Sie <keycombo action="simul"><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> benutzen, um zwischen den einzelnen virtuellen Konsolen umzuschalten.
es_es: Al estar en una consola de texto, use <keycombo action="simul"><keycap>Alt</keycap><keycap>F<replaceable>n</replaceable></keycap></keycombo> para moverse entre ellas.
pt_br: Uma vez em um console de texto, use <keycombo action="simul"> <keycap> Alt </keycap> <keycap> F <replaceable> n </replaceable> </keycap> </keycombo> para mover-se entre eles.

source: To return to the X session, switch to the virtual console running X. If X was started from the command line using <command>startx</command>, the X session will attach to the next unused virtual console, not the text console from which it was invoked. For eight active virtual terminals, X will run on the ninth, so use <keycombo action="simul"><keycap>Alt</keycap><keycap>F9</keycap></keycombo>.
de_de: Um zur X-Sitzung zurückzukehren, müssen Sie auf die virtuelle Konsole umschalten, auf der X läuft. Wenn Sie X über der Eingabeaufforderung mit <command>startx</command> gestartet haben, benutzt X die nächste freie virtuelle Konsole und nicht die Konsole, von der es gestartet wurde. Wenn Sie acht aktive virtuelle Konsolen haben, dann wird X die neunte benutzen und Sie können mit <keycombo action="simul"><keycap>Alt</keycap><keycap>F9</keycap></keycombo> umschalten.
es_es: Para volver a la sesión de X, cambie a la consola virtual corriendo X. Si se inicio X desde la línea de comandos usando <command>startx</command>, la sesión X se adjuntara a la siguiente consola virtual sin uso, no la consola de texto desde la cual fue invocada. Para ocho terminales virtuales activas, X correra en la novena, de modo que use<keycombo action="simul"><keycap>Alt</keycap><keycap>F9</keycap></keycombo>.
pt_br: Para retornar à sessão X, mude para o console virtual que está executando o X. Se o X foi iniciado a partir da linha de comando usando <command> startx </command>, a sessão X será anexada ao próximo console virtual não utilizado, e não ao console de texto no qual foi invocado. Para oito terminais virtuais ativos, o X será executado no nono, portanto use <keycombo action="simul"> <keycap> Alt </keycap> <keycap> F9 </keycap> </keycombo>.

source: How do I start <application>XDM</application> on boot?
de_de: Wie starte ich <application>XDM</application> beim Booten?
es_es: ¿Como arranco <application>XDM</application> al iniciar?
pt_br: Como faço para carregar o <application> XDM </application> na inicialização?
