Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If <trademark class="registered">Windows</trademark> is installed first, then yes. FreeBSD's boot manager will then manage to boot <trademark class="registered">Windows</trademark> and FreeBSD. If <trademark class="registered">Windows</trademark> is installed afterwards, it will overwrite the boot manager. If that happens, see the next section.
de_de: Ja, vorausgesetzt Sie installieren zuerst <trademark class="registered">Windows</trademark>. Der Bootmanager von FreeBSD kann dann entweder <trademark class="registered">Windows</trademark> oder FreeBSD booten. Falls Sie <trademark class="registered">Windows</trademark> nach FreeBSD installieren, wird es, ohne zu fragen, den Bootmanager überschreiben. Lesen Sie den nächsten Abschnitt, falls das passieren sollte.
es_es: Si <trademark class="registered">Windows</trademark> es instalado primero, entonces si. El gestor de arranque de FreeBSD se las arreglara para arrancar tanto <trademark class="registered">Windows</trademark> como FreeBSD. Si <trademark class="registered">Windows</trademark> es instalado después, sobrescribirá el gestor de arranque. Si esto ocurre, vea la siguiente sección.
pt_br: Se <trademark class="registered">o Windows</trademark> for instalado primeiro, então sim. O gerenciador de boot do FreeBSD irá então inicializar o <trademark class="registered">Windows</trademark> e o FreeBSD. Se o <trademark class="registered">Windows</trademark> for instalado posteriormente, ela sobrescreverá o gerenciador de inicialização. Se isso acontecer, veja a próxima seção.

source: Another operating system destroyed my Boot Manager. How do I get it back?
de_de: Ein anderes Betriebssystem hat meinen Bootmanager zerstört! Wie stelle ich ihn wieder her?
es_es: Otro sistema operativo destruyo mi Gestor de Arranque. ¿Como lo recupero?
pt_br: Outro sistema operacional destruiu meu gerenciador de inicialização. Como faço para recuperá-lo?

source: This depends upon the boot manager. The FreeBSD boot selection menu can be reinstalled using <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry>. For example, to restore the boot menu onto the disk <replaceable>ada0</replaceable>:
de_de: Das hängt vom Bootmanager ab. Der FreeBSD Bootmanager kann mit <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry> neu installiert werden. Benutzen Sie bspw. folgendes Kommando, um den auf der Platte <replaceable>ada0</replaceable> wiederherzustellen:
es_es: Depende del gestor de arranque. El menú de selección de arranque de FreeBSD puede reinstalarse usando <citerefentry><refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Por ejemplo, para restaurar el menu de arranque al disco <replaceable>ada0</replaceable>:
pt_br: Isso depende do gerenciador de inicialização. O menu de seleção de inicialização do FreeBSD pode ser reinstalado usando <citerefentry> <refentrytitle>boot0cfg</refentrytitle><manvolnum>8</manvolnum> </citerefentry>. Por exemplo, para restaurar o menu de inicialização no disco <replaceable>ada0</replaceable>:

source: The non-interactive MBR bootloader can be installed using <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
de_de: Der MBR Bootloader kann mit <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry> installiert werden:
es_es: El cargador de arranque no interactivo MBR bootloader puede instalarse usando <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
pt_br: O gerenciador de inicialização MBR não interativo pode ser instalado usando <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>:

source: For more complex situations, including GPT disks, see <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Für anspruchsvollere Situationen, u. a. mit GPT partitionierte Platten, lesen Sie <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: Para situaciones mas complejas, incluyendo discos GPT, véase <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Para situações mais complexas, incluindo discos GPT, consulte <citerefentry><refentrytitle>gpart</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: I booted from a CD, but the install program says no CD-ROM is found. Where did it go?
de_de: Ich habe zur Installation von CD gebootet, aber das Installationsprogramm sagt mir, dass es kein CD-ROM gefunden hat. Wo ist es hin?
es_es: Arranque desde un CD, pero el programa de instalación dice que no encuentra un CD-ROM. ¿Hacia donde fue?

source: The usual cause of this problem is a mis-configured CD-ROM drive. Many PCs now ship with the CD-ROM as the slave device on the secondary IDE controller, with no master device on that controller. This is illegal according to the ATAPI specification, but <trademark class="registered">Windows</trademark> plays fast and loose with the specification, and the BIOS ignores it when booting. This is why the BIOS was able to see the CD-ROM to boot from it, but why FreeBSD cannot see it to complete the install.
de_de: Dieses Problem wird üblicherweise durch ein falsch konfiguriertes CD-ROM verursacht. Bei vielen PCs ist das CD-ROM der Slave am zweiten IDE-Controller, ein Master ist nicht vorhanden. Laut ATAPI-Spezifikation ist diese Konfiguration ungültig, aber <trademark class="registered">Windows</trademark> verletzt die Spezifikation und das BIOS ignoriert sie, wenn es von einem CD-ROM booten soll. Daher konnten Sie zwar vom CD-ROM booten, während FreeBSD es nicht für die Installation benutzen kann.
es_es: La causa más frecuente de este problema es un lector de CD-ROM mal configurado. Muchas PCs se suministran con el CD-ROM como la unidad esclava en el controlador IDE secundario, sin ningún dispositivo maestro en el controlador. Esto es ilegal en la especificación ATAPI, pero <trademark class="registered">Windows</trademark> no sigue la misma al pie de la letra, y el BIOS la ignora al arrancar. Esta es la causa de que el BIOS pudo ver el CD-ROM para arrancar del mismo, pero FreeBSD no puede verlo para completar la instalación.

source: Reconfigure the system so that the CD-ROM is either the master device on the IDE controller it is attached to, or make sure that it is the slave on an IDE controller that also has a master device.
de_de: Um dieses Problem zu lösen, müssen Sie entweder das CD-ROM als Master an den IDE-Controller anschließen oder dafür sorgen, dass an dem vom CD-ROM genutzten IDE-Controller das CD-ROM als Slave und ein anderes Gerät als Master angeschlossen ist.
es_es: Reconfigure el sistema de manera que el CD-ROM se encuentre en el dispositivo maestro del controlador al que esta acoplado, o asegúrese de que es el esclavo en un controlador IDE que también tiene un dispositivo maestro.

source: Do I need to install the source?
de_de: Muss ich den vollständigen Quellcode installieren?
es_es: ¿Necesito instalar el código fuente?
pt_br: Preciso instalar o código fonte?

source: In general, no. There is nothing in the base system which requires the presence of the source to operate. Some ports, like <package>sysutils/lsof</package>, will not build unless the source is installed. In particular, if the port builds a kernel module or directly operates on kernel structures, the source must be installed.
de_de: Im allgemeinen nicht. Es gibt keine Komponenten im Betriebssystem, welche das Vorhandensein des Quellcodes erfordern. Einge Ports, wie <package>sysutils/lsof</package>, werden aber nicht bauen solange der Quellcode nicht installiert ist. Insbesondere dann, wenn der Port ein Kernel-Modul erzeugt oder direkt mit den Strukturen des Kernels arbeitet, müssen die Quellen installiert werden.
es_es: En general, no. No hay nada en el sistema base que requiera la presencia del código fuente para operar. Algunos ports como <package>sysutils/lsof</package>, no compilaran a menos que el código este instalado. En particular, si el port compila un modulo de kernel u opera directamente sobre estructuras del kernel, el código fuente debe estar instalado.
pt_br: Em geral, não. Não há nada no sistema base que exija a presença do código fonte para operar. Alguns ports, como o <package>sysutils/lsof</package>, não serão compilados a menos que o código fonte esteja instalado. Em particular, se o port compila um módulo de kernel ou opera diretamente em estruturas de kernel, o código fonte deve ser instalado.

source: Do I need to build a kernel?
de_de: Muss ich einen Kernel erstellen?
es_es: ¿Necesito compilar un kernel?
pt_br: Eu preciso compilar um kernel?

source: Usually not. The supplied <literal>GENERIC</literal> kernel contains the drivers an ordinary computer will need. <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry>, the FreeBSD binary upgrade tool, cannot upgrade custom kernels, another reason to stick with the <literal>GENERIC</literal> kernel when possible. For computers with very limited RAM, such as embedded systems, it may be worthwhile to build a smaller custom kernel containing just the required drivers.
de_de: Normalerweise nicht. Der <literal>GENERIC</literal>-Kernel enthält bereits die Treiber, die ein gewöhnlicher Rechner benötigt. <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry>, das Werkzeug zur binären Aktualisierung von FreeBSD, ist jedoch nicht in der Lage angepasste Kernel zu aktualisieren. Dies ist ein weiterer Grund, wenn möglich, den <literal>GENERIC</literal>-Kernel einzusetzen. Für Rechner mit wenig RAM, bspw. eingebettete Systeme, kann es sich lohnen einen kleinen, angepassten Kernel zu erstellen, der nur die erforderlichen Treiber enthält.
es_es: Usualmente no. El kernel <literal>GENERIC</literal> incluido contiene los controladores que una computadora ordinaria requiere. <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry>, la herramienta de actualización binaria de FreeBSD, no puede actualizar kernels hechos a medida, otra razón para quedarse con el kernel <literal>GENERIC</literal> cuando sea posible. Para computadoras con una cantidad limitada de RAM, tales como los sistemas embebidos, puede valer la pena compilar una kernel mas pequeño, hecho a medida conteniendo únicamente los controladores requeridos.
pt_br: Geralmente não. O kernel <literal>GENERIC</literal> fornecido contém todos os drivers que um computador comum precisará. O <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry>, a ferramenta de atualização binária do FreeBSD, não pode atualizar kernels customizados, o que é uma outra razão para se manter com o kernel <literal>GENERIC</literal> sempre que possível. Para computadores com uma quantidade de memória RAM muito limitada, como sistemas embarcados, pode valer a pena compilar um kernel customizado menor contendo apenas os drivers necessários.

source: Should I use DES, Blowfish, or MD5 passwords and how do I specify which form my users receive?
de_de: Soll ich DES, Blowfish oder MD5 zur Verschlüsselung der Passwörter benutzen?
es_es: ¿Debería utilizar contraseñas en DES, Blowfish, o MD5 y como especifico que formato usan mis usuarios?
pt_br: Devo usar senhas DES, Blowfish ou MD5 e como eu específico qual tipo meus usuários irão receber?

source: FreeBSD 9 and later use <emphasis>SHA512</emphasis> by default. DES passwords are still available for backwards compatibility with legacy operating systems which still use the less secure password format. FreeBSD also supports the Blowfish and MD5 password formats. Which password format to use for new passwords is controlled by the <literal>passwd_format</literal> login capability in <filename>/etc/login.conf</filename>, which takes values of <literal>des</literal>, <literal>blf</literal> (if these are available) or <literal>md5</literal>. See the <citerefentry><refentrytitle>login.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page for more information about login capabilities.
de_de: FreeBSD 9 und neuere Versionen verwenden voreingestellt <emphasis>SHA512</emphasis>. Für die Abwärtskompatibilität mit älteren Betriebssystemen werden auch noch die weniger sicheren DES Passwörter unterstützt. FreeBSD unterstützt auch noch die Passwort-Formate Blowfish und MD5. Welches Format für neue Benutzer verwendet wird, wird mit <literal>passwd_format</literal> in <filename>/etc/login.conf</filename> gesteuert. Mögliche Werte sind <literal>des</literal>, <literal>blf</literal> (falls verfügbar), oder <literal>md5</literal>. Weitere Informationen finden Sie in der Manualpage <citerefentry><refentrytitle>login.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: FreeBSD 9 y posterior usan <emphasis>SHA512</emphasis> por defecto. Las contraseñas en formato DES siguen estando disponibles para mantener compatibilidad con sistemas operativos viejos que usan el formato de contraseñas menos seguro. FreeBSD también soporta los formatos de contraseña Blowfish y MD5. Que formato de contraseña usar para las contraseñas nuevas esta controlado por la capacidad de autenticación <literal>passwd_format</literal> en <filename>/etc/login.conf</filename>, la cual toma los valores <literal>des</literal>, <literal>blf</literal> (si estos están disponibles) o <literal>md5</literal>. Vea la página de manual de <citerefentry><refentrytitle>login.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para más información acerca de capacidades de autenticación.

source: What are the limits for FFS file systems?
de_de: Wo liegen die Grenzen für FFS-Dateisysteme?
es_es: ¿Cuáles son los límites para los sistemas de archivos FFS?
pt_br: Quais são os limites para sistemas de arquivos FFS?

source: For FFS file systems, the largest file system is practically limited by the amount of memory required to <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> the file system. <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> requires one bit per fragment, which with the default fragment size of 4 KB equates to 32 MB of memory per TB of disk. This does mean that on architectures which limit userland processes to 2 GB (e.g., <trademark>i386</trademark>), the maximum <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry>'able filesystem is ~60 TB.
de_de: Für FFS Dateisysteme ist die Größe des Dateisystems durch den Arbeitsspeicher abhängig, der benötigt wird um das Dateisystem mit <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu prüfen. <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> benötigt pro Fragment ein Bit, was bei einer Fragmentgröße von 4 KB bis 32 MB Arbeitsspeicher pro Terrabyte Plattenspeicher entspricht. Das bedeutet, dass auf Architekturen, die Userland-Prozesse auf 2 GB beschränken (zum Beispiel bei <trademark>i386</trademark>), <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> ein Dateisystem von ~ 60 TB prüfen kann.
es_es: Para sistemas de archivos FFS, el sistema de archivo mas extenso esta limitado en la práctica por la cantidad de memoria requeridad para correr <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> en el sistema de archivos. <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> requiere un bit por fragmento, lo cual, con el tamaño de fragmentos por defecto de 4 KB es igual a 32 MB de memoria por cada TB de disco. Esto significa que en arquitecturas que limiten los procesos en espacio de usuario a 2 GB (e.j., <trademark>i386</trademark>), el máximo sistema de archivos <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry>'able es de ~60 TB.
pt_br: Para os sistemas de arquivos FFS, o tamanho máximo é praticamente limitado pela quantidade de memória necessária para executar o <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> no sistema de arquivo. O <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> requer um bit por fragmento, que com o tamanho de fragmento padrão de 4 KB equivale a 32 MB de memória por TB de disco. Isso significa que nas arquiteturas que limitam os processos userland a 2 GB (por exemplo, <trademark>i386</trademark>), o tamanho máximo do sistema de arquivos que o <citerefentry><refentrytitle> fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> permite operar é de ~ 60 TB.

source: If there was not a <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> memory limit the maximum filesystem size would be 2 ^ 64 (blocks) * 32 KB =&gt; 16 Exa * 32 KB =&gt; 512 ZettaBytes.
de_de: Wenn es kein <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> Limit gäbe, würde die maximale Größe eines Dateisystems 2 ^ 64 (Blöcke) * 32 KB =&gt; 16 Exa * 32 KB =&gt; 512 ZettaBytes betragen.
es_es: Si no hubiera un límite de memoria de <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> en máximo tamaño de archivo sería de 2^64 (bloques) * 32 KB =&gt; 16 Exa * 32 KB =&gt; 512 ZettaBytes.
pt_br: Se não houvesse um limite de memória para o <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o tamanho máximo do sistema de arquivos seria 2 ^ 64 (blocks) * 32 KB =&gt; 16 Exa * 32 KB =&gt; 512 ZettaBytes.

source: The maximum size of a single FFS file is approximately 2 PB with the default block size of 32 KB. Each 32 KB block can point to 4096 blocks. With triple indirect blocks, the calculation is 32 KB * 12 + 32 KB * 4096 + 32 KB * 4096^2 + 32 KB * 4096^3. Increasing the block size to 64 KB will increase the max file size by a factor of 16.
de_de: Die maximale Größer einer einzelnen FFS-Datei würde mit einer Standard-Blockgröße von 32 KB in etwa 2 Petabyte betragen. Jeder 32 KB-Block kann auf bis zu 4096 Blöcke verweisen. Mit dreifacher Indirektion ist die Berechnung 32 KB * 12 + 32 KB * 4096 + 32 KB * 4096 ^ 2 + 32 KB * 4096 ^ 3. Eine Erhöhung der Blockgröße auf 64 KB wird die maximale Dateigröße um den Faktor 16 erhöhen.
es_es: El máximo tamaño para un archivo de FFS es aproximadamente 2 PB con el tamaño de bloque por decto de 32 KB. Cada bloque de 32 KB puede apuntar a 4096 bloques. Con bloques triplemente indirectos, el cálculo es 32 KB * 12 + 32 KB * 4096 + 32 KB * 4096^2 + 32 KB * 4096^3. Incrementar el tamaño de bloque a 64 KB incrementara el tamaño máximo de archivo por un factor de 16.
pt_br: O tamanho máximo de um único arquivo FFS é de aproximadamente 2 PB com o tamanho de bloco padrão de 32 KB. Cada bloco de 32 KB pode apontar para 4096 blocos. Com blocos triplo indiretos, o cálculo é 32 KB * 12 + 32 KB * 4096 + 32 KB * 4096 ^ 2 + 32 KB * 4096 ^ 3. Aumentar o tamanho do bloco para 64 KB aumentará o tamanho máximo do arquivo por um fator de 16.

source: Why do I get an error message, <errorname>readin failed</errorname> after compiling and booting a new kernel?
de_de: Wieso erhalte ich die Fehlermeldung <errorname>readin.failed</errorname>, nachdem ich einen neuen Kernel erstellt und gebootet habe?
es_es: ¿Por qué obtengo un mensaje de error, <errorname>readin failed</errorname> luego de compilar y arrancar desde un nuevo kernel?
pt_br: Por que recebo uma mensagem de erro, <errorname>readin failed</errorname> depois de compilar e inicializar um novo kernel?

source: The world and kernel are out of sync. This is not supported. Be sure to use <command>make buildworld</command> and <command>make buildkernel</command> to update the kernel.
de_de: Das System und der Kernel sind nicht synchron. Dies wird nicht unterstützt. Stellen Sie sicher, dass Sie <command>make buildworld</command> und <command>make buildkernel</command> zum Aktualisieren des Kernels benutzen.
es_es: El mundo y kernel están fuera de sincronización. Esto no esta soportado. Asegurese de usar <command>make buildworld</command> y <command>make buildkernel</command> para actualizar el kernel.
pt_br: O world (aplicativos e bicliotecas do userland)e o kernel estão fora de sincronia. Isso não é suportado. Certifique-se de usar <command>make buildworld</command> e <command>make build-kernel</command> para atualizar o kernel.

source: Boot the system by specifying the kernel directly at the second stage, pressing any key when the <literal>|</literal> shows up before loader is started.
de_de: Starten Sie das System und wählen Sie den Kernel während der zweiten Bootphase aus. Drücken Sie dazu eine beliebige Taste, wenn das Zeichen <literal>|</literal> erscheint und bevor der Loader gestartet wird.
es_es: Arranque el sistema especificando el kernel directamente en la segunda fase, presionando cualquier tecla cuando <literal>|</literal> aparezca antes de que arranque el cargador.
pt_br: Inicialize o sistema especificando o kernel diretamente no segundo estágio, pressionando qualquer tecla quando o <literal>|</literal> aparecer antes que o utilitário de carga (loader) seja iniciado.

source: Is there a tool to perform post-installation configuration tasks?
de_de: Gibt es ein Programm, mit dem ich nach der Installation weitere Konfigurationen ausführen kann?
es_es: ¿Hay alguna herramienta para realizar tareas de configuración post-instalación?
pt_br: Existe uma ferramenta para realizar tarefas de configuração pós-instalação?

source: Yes. <application>bsdconfig</application> provides a nice interface to configure FreeBSD post-installation.
de_de: Ja. <application>bsdconfig</application> bietet eine einfache Oberfläche zur Konfiguration von FreeBSD.
es_es: Si. <application>bsdconfig</application> provee una buena interfaz para configurar FreeBSD post-instalación.
pt_br: Sim. O <application>bsdconfig</application> fornece uma boa interface para configurar o FreeBSD na pós-instalação.

source: Hardware Compatibility
de_de: Hardware-Kompatibilität
es_es: Compatibilidad de Hardware
pt_br: Compatibilidade de Hardware

source: I want to get a piece of hardware for my FreeBSD system. Which model/brand/type is best?
de_de: Ich will mir neue Hardware für mein FreeBSD-System zulegen. Welches Modell/Hersteller/Typ ist das Beste?
es_es: ¿Quiero obtener hardware para mi sistema FreeBSD. Que modelo/marca/tipo es mejor?
pt_br: Eu quero obter um componente de hardware para o meu sistema FreeBSD. Qual modelo/marca/tipo é o melhor?
