Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Unmounting the device is simple:
de_de: Das Aushängen eines Gerätes ist einfach:
es_es: Desmontar el dispositivo es fácil:
pt_br: Desmontar o dispositivo é simples:

source: Enabling <varname>vfs.usermount</varname>, however, has negative security implications. A better way to access <trademark class="registered">MS-DOS</trademark> formatted media is to use the <package>emulators/mtools</package> package in the Ports Collection.
de_de: Die Aktivierung von <varname>vfs.usermount</varname> hat jedoch negative Auswirkungen auf Sicherheitsaspekte. Ein besserer Weg, um auf <trademark class="registered">MS-DOS</trademark>-formatierte Datenträger zuzugreifen, ist die Benutzung des Pakets oder Ports <package>emulators/mtools</package>.
es_es: Habilitar <varname>vfs.usermount</varname>, no obstante, tiene implicaciones de seguridad negativas. Una mejor manera de acceder a medios formateados con <trademark class="registered">MS-DOS</trademark> es usar el paquete <package>emulators/mtools</package> en la colección de ports.
pt_br: Ativar a variável <varname>vfs.usermount</varname>, no entanto, tem implicações negativas de segurança. Uma maneira melhor de acessar uma mídia formatada para o <trademark class="registered">MS-DOS</trademark> é usar o pacote <package>emulators/mtools</package> da Coleção de Ports.

source: The device name used in the previous examples must be changed according to the configuration.
de_de: Der Gerätename in diesen Beispielen muss an die Konfiguration angepasst werden.
es_es: El nombre de dispositivo usado en los ejemplos anteriores debe ser cambiado de acuerdo a la configuración.
pt_br: O nome do dispositivo usado nos exemplos anteriores deve ser alterado de acordo com a configuração.

source: The <command>du</command> and <command>df</command> commands show different amounts of disk space available. What is going on?
de_de: Wieso geben die Befehle <command>du</command> und <command>df</command> unterschiedliche Werte für den freien Plattenplatz aus?
es_es: Los comandos <command>du</command> y <command>df</command> muestran diferentes cantidades de espacio en disco disponible. ¿Qué esta pasando?
pt_br: Os comandos <command>du</command> e <command>df</command> mostram informações diferentes sobre a quantia disponível de espaço em disco. O que está acontecendo?

source: This is due to how these commands actually work. <command>du</command> goes through the directory tree, measures how large each file is, and presents the totals. <command>df</command> just asks the file system how much space it has left. They seem to be the same thing, but a file without a directory entry will affect <command>df</command> but not <command>du</command>.
de_de: Der Grund liegt in der unterschiedlichen Funktionsweise der beiden Befehle. <command>du</command> durchläuft einen Dateibaum, ermittelt die Größe jeder einzelnen Datei, und gibt die Summe aus. <command>df</command> fragt lediglich das Dateisystem wie viel Platz noch frei ist. Das scheint zwar auf den ersten Blick sehr ähnlich zu sein; allerdings wird sich ein leeres Verzeichnis auf die Ausgabe von <command>df</command> auswirken, während es auf das Ergebnis von <command>du</command> keinen Einfluss hat.
es_es: Esto se debe a como funcionan ambos comandos. <command>du</command> atraviesa el árbol de directorio, mide que tan largo es cada archivo, y presenta los totales. <command>df</command> únicamente le pregunta al sistema de archivos cuanto espacio tiene disponible. Pueden parecer cosas idénticas, pero un archivo sin una entrada de directorio afectara a <command>df</command> pero no a <command>du</command>.
pt_br: Isso se deve ao modo como esses comandos realmente funcionam. O <command>du</command> passa pela árvore de diretórios, ele mede o tamanho de cada arquivo e apresenta os totais. O <command> df </command> apenas pergunta ao sistema de arquivos quanto espaço ainda resta. Eles parecem ser a mesma coisa, mas um arquivo sem uma entrada de diretório afetará <command>df</command> mas não <command>du</command>.

source: When a program is using a file, and the file is deleted, the file is not really removed from the file system until the program stops using it. The file is immediately deleted from the directory listing, however. As an example, consider a file large enough to affect the output of <command>du</command> and <command>df</command>. A file being viewed with <command>more</command> can be deleted wihout causing an error. The entry is removed from the directory so no other program or user can access it. However, <command>du</command> shows that it is gone as it has walked the directory tree and the file is not listed. <command>df</command> shows that it is still there, as the file system knows that <command>more</command> is still using that space. Once the <command>more</command> session ends, <command>du</command> and <command>df</command> will agree.
de_de: Wenn Sie eine Datei löschen, während sie von einem Programm genutzt wird, wird diese Datei erst gelöscht, wenn sie vom Programm freigegeben wird. Allerdings wird die Datei sofort aus dem Verzeichnis entfernt. Sie können dieses Verhalten sehr einfach nachvollziehen. Dazu brauchen Sie nur eine Datei, die groß genug ist, um die Ausgabe von <command>du</command> und <command>df</command> zu beeinflussen. Bei der Größe aktueller Platten muss diese Datei schon sehr groß sein! Wenn Sie diese Datei löschen, während Sie sie sich in <command>more</command> anzeigen lassen, hat <command>more</command> kein Problem. Der Eintrag für die Datei wird lediglich aus dem Verzeichnis entfernt, damit kein anderes Programm mehr darauf zugreifen kann. Laut <command>du</command> ist die Datei verschwunden – es hat das Verzeichnis untersucht und die Datei nicht gefunden. Laut <command>df</command> ist die Datei aber vorhanden, da sie im Dateisystem immer noch Platz belegt. Sobald Sie <command>more</command> beenden, werden die Ergebnisse von <command>du</command> und <command>df</command> wieder übereinstimmen.
es_es: Cuando un programa esta usando un archivo, y el mismo es borrado, el archivo no se borra realmente del sistema de archivos hasta que el programa deja de usarlo. El archivo es luego inmediatamente borrado del listado de directorio, de todas formas. Como ejemplo, considere un archivo que sea lo suficientemente grande como para afectar la salida de <command>du</command> y <command>df</command>. Un archivo que este siendo visto con <command>more</command> puede ser borrado sin causar un error. La entrada es borrada del directorio de modo que ningún otro programa o usuario pueda accederla. No obstante, <command>du</command> muestra que el archivo no existe dado que ha atravesado el árbol de directorios y el archivo no esta listado. <command>df</command> muestra que sigue alli, dado que el sistema de archivos sabe que <command>more</command> sigue usando ese espacio. Una vez que la sesión de <command>more</command> termine, <command>du</command> y <command>df</command> estarán de acuerdo.
pt_br: Quando um programa está usando um arquivo e o arquivo é excluído, o arquivo não é realmente removido do sistema de arquivos até que o programa pare de usá-lo. O arquivo é imediatamente excluído da listagem do diretório, no entanto. Como exemplo, considere um arquivo grande o suficiente para afetar a saída de <command>du</command> e <command>df</command>. Um arquivo sendo visualizado com <command> more </command> pode ser excluído sem causar um erro. A entrada é removida do diretório para que nenhum outro programa ou usuário possa acessá-la. No entanto, o <command>du</command> mostra que ele desapareceu, já que percorreu a árvore de diretórios e o arquivo não está mais listado. Já o <command>df</command> mostra que ele ainda está lá, pois o sistema de arquivos sabe que o comando <command>more</command> ainda está usando esse espaço. Quando a sessão do <command>more</command> terminar, o <command>du</command> e <command>df</command> apresentarão o mesmo resultado.

source: This situation is common on web servers. Many people set up a FreeBSD web server and forget to rotate the log files. The access log fills up <filename>/var</filename>. The new administrator deletes the file, but the system still complains that the partition is full. Stopping and restarting the web server program would free the file, allowing the system to release the disk space. To prevent this from happening, set up <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Die oben beschriebene Situation tritt sehr häufig auf Webservern auf. Viele Anwender installieren einen FreeBSD Webserver und vergessen die Rotation der Logdateien, bis irgendwann die Partition <filename>/var</filename> überläuft. Der Administrator löscht die Datei, aber das System beschwert sich immer noch über fehlenden Plattenplatz. Die Datei wird erst freigegeben, wenn der Webserver beendet und neu gestartet wird; dadurch kann das System den Plattenplatz freigeben. Um dies zu verhindern, sollten Sie <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry> einsetzen.
es_es: Esta situación es común en servidores web. Mucha gente crea un servidor web en FreeBSD y ser olvida de rotar los archivos de log. El log de acceso llena <filename>/var</filename>. El nuevo administrador borra el archivo, pero el sistema se seguira quejando de que la partición esta llena. Parar y reiniciar el programa del servidor web liberara el archivo, permitiendo que el sistema libere espacio en disco. Para prevenir que esto pase, configure <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Essa situação é comum em servidores web. Muitas pessoas configuram um servidor web no FreeBSD e esquecem de rotacionar os arquivos de log. O log de acesso enche o <filename>/var</filename>. O administrador novato exclui o arquivo, mas o sistema ainda reclama que a partição está cheia. Parar e reiniciar o programa do servidor Web liberaria o arquivo, permitindo que o sistema liberasse o espaço em disco. Para evitar que isso aconteça, configure o <citerefentry><refentrytitle>newsyslog</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Note that Soft Updates can delay the freeing of disk space and it can take up to 30 seconds for the change to be visible.
de_de: Bitte beachten Sie, dass die Freigabe des Plattenplatzes durch Soft Updates um bis zu 30 Sekunden verzögert werden kann.
es_es: Note que Soft Updates puede retrasar la liberación de espacio en el disco y que puede tomar hasta 30 segundos para que el cambio sea visible.
pt_br: Observe que o Soft Updates pode atrasar a liberação de espaço em disco e pode levar até 30 segundos para que a alteração fique visível.

source: How can I add more swap space?
de_de: Wie kann ich den Swap-Bereich vergrößern?
es_es: ¿Como agrego más espacio swap?
pt_br: Como posso adicionar mais espaço de swap?

source: This section <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/adding-swap-space.html">of the Handbook</link> describes how to do this.
de_de: Der Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/adding-swap-space.html">Hinzufügen von Swap-Bereichen</link> im Handbuch enthält hierzu eine Schritt-für-Schritt Anleitung.
es_es: Esta sección <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/adding-swap-space.html">del manual</link> describe como hacer esto.
pt_br: Esta seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/adding-swap-space.html">do Handbook</link> descreve como fazer isso.

source: Why does FreeBSD see my disk as smaller than the manufacturer says it is?
de_de: Warum ist meine Festplatte unter FreeBSD kleiner, als sie laut Hersteller sein soll?
es_es: ¿Por qué FreeBSD ve mi disco como mas pequeño de lo que el fabricante dice que es?
pt_br: Por que o FreeBSD vê meu disco como sendo menor do que o fabricante diz que ele é?

source: Disk manufacturers calculate gigabytes as a billion bytes each, whereas FreeBSD calculates them as 1,073,741,824 bytes each. This explains why, for example, FreeBSD's boot messages will report a disk that supposedly has 80 GB as holding 76,319 MB.
de_de: Festplattenhersteller definieren ein Gigabyte als eine Milliarde Bytes, für FreeBSD ist ein Gigabyte hingegen 1.073.741.824 Bytes groß. Aus diesem Grund wird für eine Platte, die laut Herstellerangaben 80 GB groß ist, während des Bootvorgangs eine Größe von 76.319 MB angezeigt.
es_es: Los fabricantes de discos calculan gigabytes como un millón de bytes cada uno, mientras que FreeBSD los calcula como 1,073,741,824 bytes cada uno. Esto explica porque, por ejemplo, los mensajes de arranque de FreeBSD reportan un disco que se supone que tenga 80 GB como si tuviera 76,319 MB.
pt_br: Os fabricantes de discos calculam gigabytes como um bilhão de bytes cada, enquanto o FreeBSD os calcula como 1.073.741.824 bytes cada. Isso explica por que, por exemplo, as mensagens de boot do FreeBSD reportarão um disco que supostamente tem 80 GB como contendo 76.319 MB.

source: Also note that FreeBSD will (by default) <link linkend="disk-more-than-full">reserve</link> 8% of the disk space.
de_de: Beachten Sie auch, dass FreeBSD (in der Voreinstellung) 8 % des Plattenplatzes für sich <link linkend="disk-more-than-full">reserviert</link>.
es_es: También note que FreeBSD (por defecto) <link linkend="disk-more-than-full">reserva</link> 8% de espacio del disco.
pt_br: Observe também que o FreeBSD irá (por padrão) <link linkend="disk-more-than-full">reservar</link> cerca de 8% do espaço em disco.

source: How is it possible for a partition to be more than 100% full?
de_de: Warum kann eine Partition zu mehr als 100% gefüllt sein?
es_es: ¿Como es posible para una partición estar más del 100% llena?
pt_br: Como é possível que uma partição esteja com mais de 100% de ocupação?

source: A portion of each UFS partition (8%, by default) is reserved for use by the operating system and the <systemitem class="username">root</systemitem> user. <citerefentry><refentrytitle>df</refentrytitle><manvolnum>1</manvolnum></citerefentry> does not count that space when calculating the <literal>Capacity</literal> column, so it can exceed 100%. Notice that the <literal>Blocks</literal> column is always greater than the sum of the <literal>Used</literal> and <literal>Avail</literal> columns, usually by a factor of 8%.
de_de: Ein Teil jeder UFS Partition (8% in der Voreinstellung) ist für das Betriebssystem und den Benutzer <systemitem class="username">root</systemitem> reserviert. <citerefentry><refentrytitle>df</refentrytitle><manvolnum>1</manvolnum></citerefentry> rechnet diesen Teil bei der Ausgabe der Spalte <literal>Capacity</literal> nicht ein, so dass dort Werte über 100% angezeigt werden können. Die Anzahl der Blöcke in der Spalte <literal>Blocks</literal> ist ebenfalls um 8% größer als die Summe der benutzten und verfügbaren Blöcke (die Spalten <literal>Used</literal> und <literal>Avail</literal>).
es_es: Una porción de cada partición UFS (8%, por defecto) esta reservada para su uso por el sistema operativo y el <systemitem class="username">root</systemitem> usuario. <citerefentry><refentrytitle>df</refentrytitle><manvolnum>1</manvolnum></citerefentry> no cuenta ese espacio al calcular la columna <literal>Capacity</literal> (Capacidad), de modo que puede exceder el 100%. Note que la columna <literal>Blocks</literal> (Bloques) siempre es mayor que la suma de las columnas <literal>Used</literal> (Usado) y <literal>Avail</literal> (Disponibilidad), usualmente por un factor del 8%.
pt_br: Uma parte de cada partição UFS (8%, por padrão) é reservada para uso pelo sistema operacional e pelo usuário <systemitem class="username">root</systemitem>. O <citerefentry><refentrytitle>df</refentrytitle><manvolnum>1</manvolnum></citerefentry> não contabiliza esse espaço ao calcular a coluna <literal>Capacity</literal>, portanto, ela pode exceder 100%. Observe que a coluna <literal>Blocks</literal> é sempre maior que a soma das colunas <literal>Used</literal> e <literal>Avail</literal>, geralmente por um fator de 8%.

source: For more details, look up <option>-m</option> in <citerefentry><refentrytitle>tunefs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Wie viel Platz reserviert wird, können Sie mit der Option <option>-m</option> von <citerefentry><refentrytitle>tunefs</refentrytitle><manvolnum>8</manvolnum></citerefentry> einstellen.
es_es: Para más detalles, busque <option>-m</option> en <citerefentry><refentrytitle>tunefs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Para mais detalhes, procure prls opção <option>-m</option> em <citerefentry><refentrytitle>tunefs</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Why does FreeBSD pause for a long time at boot when the system has large amounts of ram?
de_de: Warum pausiert FreeBSD beim Booten so lange, wenn das System große Mengen RAM hat?
es_es: ¿Por qué FreeBSD pausa por un largo tiempo al iniciar cuando el sistema tiene gran cantidad de ram?

source: FreeBSD 10.1 and earlier executes a memory test early in the boot process. When the system has a small amount of memory, the test takes a few seconds. Computers with tens or hundreds of gigabytes of memory can take several minutes to complete the test. The memory test can be disabled by adding <literal>hw.memtest.tests=0</literal> to <filename>/boot/loader.conf</filename>.
de_de: FreeBSD 10.1 und ältere Versionen führen zu Beginn des Bootens einen Speichertest aus. Wenn das System wenig Arbeitsspeicher hat, dauert dieser Test nur wenige Sekunden. Systeme mit zehn oder hunderten von Gigabytes Arbeitsspeicher benötigen mehrere Minuten. Durch Hinzufügen von <literal>hw.memtest.tests=0</literal> in <filename>/boot/loader.conf</filename> können Sie diesen Test deaktivieren.
es_es: FreeBSD 10.1 y versiones anteriores hacen una prueba de memoria tempranamente en el proceso de arranque. Cuando el sistema tiene una cantidad pequeña de memoria, la prueba toma un par de segundos. A las computadoras con diez o miles de gigabytes de memoria puede llevarles varios minutos completar el test. El test de memoria puede deshabilitarse añadiendo <literal>hw.memtest.tests=0</literal> a <filename>/boot/loader.conf</filename>.

source: For more details, see <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
de_de: Für weitere Informationen, lesen Sie <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es_es: Para más detalles, vea <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: What is the minimum amount of RAM one should have to run ZFS?
de_de: Wieviel RAM wird mindestens benötigt, wenn ich ZFS einsetzen möchte?
es_es: ¿Cuál es la cantidad mínima de RAM necesaria para correr ZFS?
pt_br: Qual é a quantidade mínima de RAM que um usuário deve ter para utilizar o ZFS?

source: A minimum of 4GB of RAM is required for comfortable usage, but individual workloads can vary widely.
de_de: Für eine komfortable Nutzung werden mindestens 4 GB RAM empfohlen. Dies ist jedoch auch von der individuellen Auslastung abhängig.
es_es: Se necesita un mínimo de 4GB de RAM para un uso típico, pero la carga de trabajo individual puede variar ampliamente.
pt_br: É necessário um mínimo de 4 GB de RAM para uso confortável, mas as cargas de trabalho individuais podem variar muito.

source: What is the ZIL and when does it get used?
de_de: Was ist das ZIL und für was wird es benutzt?
es_es: ¿Qué es el ZIL y cuando se usa?
pt_br: O que é o ZIL e quando ele é usado?

source: The <acronym>ZIL</acronym> (<acronym>ZFS</acronym> intent log) is a write log used to implement posix write commitment semantics across crashes. Normally writes are bundled up into transaction groups and written to disk when filled (<quote>Transaction Group Commit</quote>). However syscalls like <citerefentry><refentrytitle>fsync</refentrytitle><manvolnum>2</manvolnum></citerefentry> require a commitment that the data is written to stable storage before returning. The ZIL is needed for writes that have been acknowledged as written but which are not yet on disk as part of a transaction. The transaction groups are timestamped. In the event of a crash the last valid timestamp is found and missing data is merged in from the ZIL.
de_de: Das <acronym>ZIL</acronym> (<acronym>ZFS</acronym> intent log) ist ein Schreib-Cache, der verwendet wird, um posix verpflichtende Schreib-Semantiken über Abstürze hinweg zu implementieren. Normalerweise werden Schreiboperationen in Transaktionsgruppen zusammengefasst und auf den Datenträger geschrieben (<quote>Transaction Group Commit</quote>). Systemaufrufe wie <citerefentry><refentrytitle>fsync</refentrytitle><manvolnum>2</manvolnum></citerefentry> benötigen jedoch eine Bestätigung, dass die Daten auf den Datenträger geschrieben wurden, bevor sie weitermachen. Das ZIL wird für Schreibvorgänge verwendet, welche zwar als gespeichert bestätigt, jedoch noch nicht als Teil einer Transaktion auf die Festplatte geschrieben wurden. Im Fall eines Systemabsturzes wird der letzte gültige Zeitstempel ermittelt und die fehlenden Daten werden aus dem ZIL zusammengesetzt.
es_es: El <acronym>ZIL</acronym> (<acronym>ZFS</acronym> intent log) es un log de escritura utilizado para implementar semánticas de commiteo de escritura de posix entre fallos del sistema. Normalmente las escrituras están empaquetadas en grupos de transacción para escribirse al disco al llenarse (<quote>Transaction Group Commit</quote>). No obstante syscalls tales como <citerefentry><refentrytitle>fsync</refentrytitle><manvolnum>2</manvolnum></citerefentry> requieren un compromiso de que los datos se escriban a un almacenamiento estable antes de regresar. El ZIL es necesario para escrituras que se reconocieron como realizadas pero que no estan en disco aún como parte de una transacción. Los grupos de transacción tienen una marca de tiempo. En el caso de un fallo la última marca de tiempo válida es encontrada y los datos faltantes se combinan desde el ZIL.
pt_br: O <acronym>ZIL</acronym> (log de intenção do <acronym> ZFS </acronym>) é um log de gravação usado para implementar semânticas de compromisso de escrita posix entre travamentos. Normalmente, as gravações são agrupadas em grupos de transações e gravadas no disco quando preenchidas (<quote>Transaction Group Commit </quote>). No entanto, syscalls como <citerefentry><refentrytitle>fsync</refentrytitle><manvolnum>2</manvolnum></citerefentry> requerem um compromisso de que os dados são gravados no armazenamento estável antes de retornar. O ZIL é necessário para gravações que foram reconhecidas como gravadas, mas que ainda não estão no disco como parte de uma transação. Os grupos de transações contam com registro de data e hora. No caso de uma falha, o último registro de data e hora válido é encontrado e os dados ausentes são mesclados a partir do ZIL.

source: Do I need a SSD for ZIL?
de_de: Benötige ich für den Einsatz von ZIL eine SSD?
es_es: ¿Necesito un SSD para el ZIL?
pt_br: Preciso de um SSD para o ZIL?
