Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: Care should be taken with this option. This command can also be used to limit the amount of time that <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> waits for the peer to begin negotiations:
de_de: Diese Option sollten Sie mit Vorsicht genießen. Folgenden Befehl sollten Sie benutzen, um die Wartezeit auf den Beginn der Verhandlungen des Partners von <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu begrenzen:
es_es: Se debe tener cuidado con esta opción. Este comando también puede usarse para limitar la cantidad de tiempo que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> espera a que el peer comienze las negociaciones.
pt_br: Deve ser tomado cuidado com esta opção. Este comando também pode ser usado para limitar a quantidade de tempo que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> aguarda que o par inicie as negociações:

source: Alternatively, the following command (where <replaceable>N</replaceable> is the number of seconds to wait before starting negotiations) can be used:
de_de: Alternativ kann der folgende Befehl (wobei <replaceable>N</replaceable> die Wartezeit in Sekunden vor Beginn der Verhandlungen angibt) benutzt werden:
es_es: Alternativamente, el siguiente comando (donde <replaceable>N</replaceable> es el número de segundos a esperar antes de iniciar las negociaciones) puede ser usado:
pt_br: Alternativamente, o seguinte comando (onde <replaceable>N</replaceable> é o número de segundos a aguardar antes de iniciar as negociações) pode ser usado:

source: Check the manual page for details.
de_de: Weitere Informationen finden Sie in der Manualpage.
es_es: Verifique la página de manual para detalles.
pt_br: Verifique a página de manual para detalhes.

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> lock up when I shell out to test it?
de_de: Warum reagiert <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> nicht mehr, wenn ich es mit shell verlassen habe?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> se bloquea cuando intento probarlo en el shell?
pt_br: Por que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> bloqueia quando eu me deponho a testá-lo?

source: When using <command>shell</command> or <command>!</command>, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> executes a shell or the passed arguments. The <application>ppp</application> program will wait for the command to complete before continuing. Any attempt to use the PPP link while running the command will appear as a frozen link. This is because <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> is waiting for the command to complete.
de_de: Wenn Sie den Befehl <command>shell</command> oder <command>!</command> benutzen, führt <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> eine Shell aus (falls Sie Argumente übergeben haben, führt <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> diese Argumente aus). Das Programm <application>ppp</application> wartet auf die Beendigung des Befehls, bevor es seine Arbeit fortsetzt. Falls Sie versuchen, die PPP-Verbindung während der Programmausführung zu benutzen, wird es so aussehen, als wäre die Verbindung eingefroren. Das liegt daran, dass <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> auf die Beendigung des Befehls wartet.
es_es: Al usar <command>shell</command> o <command>!</command>, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ejecuta un shell o los argumentos pasados. El programa <application>ppp</application> esperara a que el comando se complete antes de continuar. Cualquier intento de usar el link de PPP mientras se correr el comando aparecerá como un link paralizado. Esto es porque <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> espera a que el comando se complete.
pt_br: Ao usar <command>shell</command> ou <command>!</command>, <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> executa um shell ou os argumentos passados. O programa <application>ppp</application> aguardará a conclusão do comando antes de continuar. Qualquer tentativa de usar o link PPP durante a execução do comando aparecerá como um link congelado. Isso ocorre porque <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> está aguardando a conclusão do comando.

source: To execute commands like this, use <command>!bg</command> instead. This will execute the given command in the background, and <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> can continue to service the link.
de_de: Falls Sie solche Befehle verwenden möchten, benutzen Sie stattdessen den Befehl <command>!bg</command>. Hierdurch wird der angegebene Befehl im Hintergrund ausgeführt und <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> kann fortfahren, die Verbindung zu bedienen.
es_es: Para ejecutar comandos como este, use <command>!bg</command> en su lugar. Esto ejecutara el comando dado en el trasfondo, y <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> puede continuar sirviendo el link.
pt_br: Para executar comandos como este, use <command>!bg</command>. Isso executará o comando fornecido em segundo plano e <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> pode continuar a fornecer o link.

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> over a null-modem cable never exit?
de_de: Warum wird <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> niemals beendet, wenn es über ein Nullmodem-Kabel benutzt wird?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sobre un cable de modem nulo nunca termina?
pt_br: Por que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> sobre um cabo de modem nulo nunca finaliza?

source: There is no way for <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to automatically determine that a direct connection has been dropped. This is due to the lines that are used in a null-modem serial cable. When using this sort of connection, LQR should always be enabled with the following line:
de_de: Es gibt keine Möglichkeit für <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry>, automatisch festzustellen, ob eine direkte Verbindung beendet worden ist. Das liegt an den Leitungen, die bei einem seriellen Nullmodem-Kabel benutzt werden. Wenn Sie diese Art der Verbindung verwenden, sollte LQR immer mit der folgenden Zeile aktiviert werden:
es_es: No hay forma de que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> automáticamente determine que una conexión directa fue terminada. Esto es debido a que las líneas usadas en el cable de serie de un modem nulo. Al usar este tipo de conexión, LQR siempre debería ser habilitado con la siguiente línea:
pt_br: Não há nenhuma maneira do <citerefentry><refentrytitle>ppp</refentrytitle> <manvolnum>8</manvolnum></citerefentry> determinar automaticamente que uma conexão direta foi eliminada. Isso se deve às linhas usadas em um cabo serial de modem nulo. Ao usar esse tipo de conexão, o LQR deve estar sempre ativado com a seguinte linha:

source: LQR is accepted by default if negotiated by the peer.
de_de: LQR wird standardmäßig akzeptiert, wenn es vom Partner ausgehandelt wird.
es_es: LQR es aceptado por defecto si es negociado por el peer.
pt_br: O LQR é aceito por padrão se negociado pelo par.

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> dial for no reason in <option>-auto</option> mode?
de_de: Warum wählt <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> im Modus <option>-auto</option> ohne Grund?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> marca en modo <option>-auto</option> sin razón?
pt_br: Por que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> disca sem motivo no modo <option>-auto</option>?

source: If <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> is dialing unexpectedly, determine the cause, and set up dial filters to prevent such dialing.
de_de: Falls <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> unerwartet wählt, müssen Sie den Grund herausfinden und Wählfilter (dfilters) einsetzen, um dies zu verhindern.
es_es: Si <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> marca de manera inesperada, determine la causa y ajuste los filtros de marcación para prevenir dicha llamada.
pt_br: Se o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> estiver discando inesperadamente, determine a causa e configure os filtros de discagem para evitar que isso ocorra.

source: To determine the cause, use the following line:
de_de: Benutzen Sie die folgende Zeile, um den Grund herauszufinden:
es_es: Para determinar la causa, use la próxima línea:
pt_br: Para determinar a causa, use a seguinte linha:

source: This will log all traffic through the connection. The next time the line comes up unexpectedly, the reason will be logged with a convenient timestamp next to it.
de_de: Dadurch wird jeglicher Verkehr über die Verbindung protokolliert. Wenn das nächste mal unerwartet eine Verbindung hergestellt wird, wird der Grund zusammen mit einer hilfreichen Zeitangabe in der Logdatei gespeichert.
es_es: Esto escribirá un log con todo el trafico de la conexión. La próxima vez que esta línea surja inesperadamente, la razón será logueada con una conveniente estampa temporal a su lado.
pt_br: Isso registrará todo o tráfego através da conexão. Na próxima vez que a linha conectar inesperadamente, o motivo será registrado e terá um carimbo conveniente com a data e hora ao lado dele.

source: Next, disable dialing under these circumstances. Usually, this sort of problem arises due to DNS lookups. To prevent DNS lookups from establishing a connection (this will <emphasis>not</emphasis> prevent <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> from passing the packets through an established connection), use the following:
de_de: Sie können nun das Wählen aufgrund dieser Bedingungen verhindern. Normalerweise wird diese Art von Problemen durch Anfragen an den DNS verursacht. Um zu verhindern, dass DNS-Anfragen den Aufbau der Verbindung hervorrufen (das verhindert <emphasis>nicht</emphasis>, dass Pakete über eine bestehende Verbindung gesendet werden), benutzen Sie die folgenden Zeilen:
es_es: Luego, deshabilite el marcado bajo estas circunstancias. Usualmente, este tipo de problema se da debido a las búsquedas de DNS. Para prevenir que las búsquedas de DNS establezcan una conexión (esto <emphasis>no</emphasis> prevendrá que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> pase los paquetes a través de una conexión establecida), use lo siguiente:
pt_br: Em seguida, desative a discagem nessas circunstâncias. Geralmente, esse tipo de problema surge devido a pesquisas de DNS. Para impedir que as pesquisas de DNS estabeleçam uma conexão (isso <emphasis>não</emphasis> impedirá que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> passe os pacotes através de um diretório estabelecido) conexão), use o seguinte:

source: This is not always suitable, as it will effectively break demand-dial capabilities. Most programs will need a DNS lookup before doing any other network related things.
de_de: Dies ist nicht immer brauchbar, weil es effektiv die Fähigkeit, auf Anforderung wählen zu können einschränkt - die meisten Programme müssen eine DNS-Anfrage durchführen, bevor Sie andere, das Netzwerk betreffenden Dinge tun können.
es_es: Esto no siempre es aceptable, dado que romperá las capacidades de demanda de marcado. La mayoría de los programas necesitaran una búsqueda de DNS antes de hacer otras cosas relacionadas con la red.
pt_br: Isso nem sempre é adequado, já que efetivamente quebra os recursos de discagem por demanda. A maioria dos programas precisará de uma pesquisa de DNS antes de fazer qualquer outra coisa relacionada à rede.

source: In the DNS case, try to determine what is actually trying to resolve a host name. A lot of the time, <application>Sendmail</application> is the culprit. Make sure to configure <application>Sendmail</application> not to do any DNS lookups in its configuration file. See the section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/smtp-dialup.html">using email with a dialup connection</link> in the FreeBSD Handbook for details. You may also want to add the following line to <filename>.mc</filename>:
de_de: Im Fall von DNS sollten Sie versuchen, herauszufinden, welches Programm tatsächlich versucht, einen Hostnamen aufzulösen. Sehr oft handelt es sich hier um <application>Sendmail</application>. Sie sollten sicherstellen, dass Sie <application>Sendmail</application> in der Konfigurationsdatei sagen, dass es keine DNS-Anfragen durchführen soll. Weitere Details enthält der Abschnitt <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/smtp-dialup.html">E-Mail über Einwahl-Verbindungen</link> des Handbuchs. Sie könnten z.B. die folgende Zeile in die <filename>.mc</filename>-Datei einfügen:
es_es: En el caso del DNS, intente determinar que es lo que esta realmente intentando resolver un nombre de host. La mayoría del tiempo, <application>Sendmail</application> es el culpable. Asegúrese de configurar <application>Sendmail</application> para que no realize ninguna búsqueda de DNS en su archivo de configuración. Vea la sección acerca de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/smtp-dialup.html">usar email con una conexión de dialup</link> en el manual de FreeBSD para los detalles. Probablemente también quiera además agregar la siguiente línea a <filename>.mc</filename>:
pt_br: No caso do DNS, tente determinar o que realmente está tentando resolver um nome de host. A maior parte do tempo, o <application>Sendmail</application> é o culpado. Certifique-se de configurar o <application>Sendmail</application> para não fazer nenhuma pesquisa de DNS em seu arquivo de configuração. Veja a seção sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/smtp-dialup.html">usando e-mail com uma conexão discada</link> no manual do FreeBSD para detalhes. Você também pode adicionar a seguinte linha ao <filename>.mc</filename>:

source: This will make <application>Sendmail</application> queue everything until the queue is run, usually, every 30 minutes, or until a <command>sendmail -q</command> is done, perhaps from <filename>/etc/ppp/ppp.linkup</filename>.
de_de: Das veranlasst <application>Sendmail</application> dazu, alles in eine Warteschlange einzureihen, bis die Warteschlange verarbeitet wird (normalerweise alle 30 Minuten) oder wenn <command>sendmail -q</command> ausgeführt wird (z.B. aus <filename>/etc/ppp/ppp.linkup</filename> heraus).
es_es: Esto hara que <application>Sendmail</application> encole todo hasta que se corra la cola, usualmente cada 30 minutos, o hasta que se haga <command>sendmail -q</command>, tal vez desde <filename>/etc/ppp/ppp.linkup</filename>.
pt_br: Isso fará com que o <application>Sendmail</application> enfileire tudo até que a fila seja executada, normalmente, a cada 30 minutos, ou até que um <command>sendmail -q</command> seja feito, talvez do <filename>/etc/ppp/ppp.linkup</filename>.

source: What do these CCP errors mean?
de_de: Was bedeuten diese CCP-Fehler?
es_es: ¿Qué significan estos errores de CCP?
pt_br: O que esses erros de CCP significam?

source: I keep seeing the following errors in my log file:
de_de: Ich sehe ständig folgende Fehler in meiner Logdatei:
es_es: Continuo viendo los siguientes errores en mi archivo de log:
pt_br: Eu continuo vendo os seguintes erros no meu arquivo de log:

source: This is because <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> is trying to negotiate Predictor1 compression, but the peer does not want to negotiate any compression at all. The messages are harmless, but can be silenced by disabling the compression:
de_de: Das liegt daran, dass <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> versucht, die Komprimierung Predictor1 auszuhandeln und der Partner über keinerlei Komprimierung verhandeln will. Die Meldungen sind harmlos, aber wenn Sie sie beseitigen möchten, können Sie die Komprimierung auch lokal ausschalten:
es_es: Esto ocurre porque <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> esta intentando negociar compresión Predictor1, pero el peer no quiere negociar compresión en absoluto. Los mensajes son inofensivos, pero pueden ser silenciados deshabilitando la compresión:
pt_br: Isso ocorre porque o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> está tentando negociar a compactação Predictor1, mas o par não deseja negociar nenhuma compactação. As mensagens são inofensivas, mas podem ser silenciadas desativando a compactação:

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> not log my connection speed?
de_de: Warum protokolliert <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> die Geschwindigkeit meiner Verbindung nicht?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> no escribe en el log mi velocidad de conexión?
pt_br: Por que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> não registra minha velocidade de conexão?

source: To log all lines of the modem conversation, enable the following:
de_de: Um alle Zeilen der Modemkonversation zu protokollieren, müssen Sie folgendes einstellen:
es_es: Para escribir en el log todas las líneas de la conversación de modem, agregue lo siguiente:
pt_br: Para registrar todas as linhas da conversação do modem, ative o seguinte:

source: This will make <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> log everything up until the last requested <quote>expect</quote> string.
de_de: Dies veranlasst <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> dazu, alles bis zur letzten angeforderten <quote>expect</quote>-Zeile zu protokollieren.
es_es: Esto hara que <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> escriba en el log todo hasta la última cadena <quote>expect</quote> pedida.
pt_br: Isso fará com que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> registre tudo até a última string <quote>expect</quote> seja solicitada.

source: To see the connect speed when using PAP or CHAP, make sure to configure <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to expect the whole CONNECT line, using something like this:
de_de: Falls Sie die Geschwindigkeit der Verbindung erfahren möchten und PAP oder CHAP nutzen, müssen Sie sicherstellen, dass Sie <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> so konfigurieren, die gesamte CONNECT-Zeile zu erwarten, etwa so:
es_es: Para ver la velocidad de conexión al usar PAP o CHAP, asegúrese de configurar <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para que espere la línea CONNECT entera, usando algo como esto:
pt_br: Para ver a velocidade de conexão ao usar o PAP ou o CHAP, certifique-se de configurar <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> para esperar toda a linha CONNECT, usando algo assim:

source: This gets the CONNECT, sends nothing, then expects a line-feed, forcing <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> to read the whole CONNECT response.
de_de: Hier bekommen wir unser CONNECT, senden nichts, erwarten dann einen Line-Feed, der <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> zwingt, die gesamte CONNECT-Antwort zu lesen.
es_es: Esto obtiene la línea CONNECT, no envía nada, y luego espera una nueva línea, forzando a <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> a leer toda la respuesta CONNECT.
pt_br: Isso obtém o CONNECT, não envia nada, então espera um avanço de linha, forçando o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> a ler toda a resposta CONNECT.

source: Why does <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ignore the <literal>\</literal> character in my chat script?
de_de: Warum ignoriert <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> das Zeichen <literal>\</literal> in meinem Chat-Skript?
es_es: ¿Por qué <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ignora el carácter <literal>\</literal> en mi script de chat?
pt_br: Por que o <citerefentry><refentrytitle>ppp</refentrytitle><manvolnum>8</manvolnum></citerefentry> ignora o caractere <literal>\</literal> no meu script de bate-papo?

source: The <application>ppp</application> utility parses each line in its configuration files so that it can interpret strings such as <literal>set phone "123 456 789"</literal> correctly and realize that the number is actually only one argument. To specify a <literal>"</literal> character, escape it using a backslash (<literal>\</literal>).
de_de: Das Programm <application>ppp</application> analysiert jede Zeile seiner Konfigurationsdatei, damit es Zeichenketten wie z.B. <literal>set phone "123 456 789"</literal> korrekt interpretieren und zudem erkennen kann, dass es sich bei der Nummer tatsächlich nur um ein Argument handelt. Um das Zeichen <literal>"</literal> anzugeben, müssen Sie ihm einen Backslash (<literal>\</literal>) voranstellen.
es_es: La utilidad <application>ppp</application> parsea cada línea en sus archivos de configuración de manera que pueda interpretar cadenas como <literal>set phone "123 456 789"</literal> correctamente y darse cuenta de que el número es solo un argumento. Para especificar un carácter <literal>"</literal>, escapeelo utilizando una barra invertida (<literal>\</literal>).
pt_br: O utilitário <application>ppp</application> analisa cada linha em seus arquivos de configuração para que ela possa interpretar corretamente seqüências de caracteres como <literal>set phone "123 456 789"</literal> e perceber que o número é realmente apenas um argumento . Para especificar um caractere <literal>"</literal>, escape-o usando uma barra invertida (<literal>\</literal>).
