Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/faq/*.po
Languages: de_de, es_es, pt_br

source: If <varname>KERNCONF</varname> is not included, the <filename>GENERIC</filename> kernel will instead be built and installed.
de_de: Falls Sie <varname>KERNCONF</varname> nicht verwenden, wird ein <filename>GENERIC</filename> Kernel gebaut und installiert.
es_es: Si <varname>KERNCONF</varname> no esta incluida, el kernel <filename>GENERIC</filename> sera compilado e instalado en su lugar.
pt_br: Se a variável <varname>KERNCONF</varname> não for informada na linha de comando, o kernel <filename>GENERIC</filename> será compilado e instalado.

source: The <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> process will have built two kernels. <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel</filename> and <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel.debug</filename>. <filename>kernel</filename> was installed as <filename>/boot/kernel/kernel</filename>, while <filename>kernel.debug</filename> can be used as the source of debugging symbols for <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
de_de: Der <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>-Prozess wird zwei Kernel erstellen: <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel</filename> und <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel.debug</filename>. <filename>kernel</filename> wurde als <filename>/boot/kernel</filename> installiert, während <filename>kernel.debug</filename> als Quelle für Debuggersymbole für <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> benutzt werden kann.
es_es: El proceso <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> habrá compilado dos kernels. <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel</filename> y <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel.debug</filename>. <filename>kernel</filename> fue instalado como <filename>/boot/kernel/kernel</filename>, mientras que <filename>kernel.debug</filename> puede ser usado como la fuente de símbolos de depuración para <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: O processo <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> terá compilado dois kernels. O <filename>/usr/obj/usr/src/sys/MYKERNEL/kernel</filename> e o <filename> /usr/obj/usr/src/sys/MYKERNEL/kernel.debug </filename>. O <filename>kernel</filename> foi instalado como <filename>/boot/kernel/kernel</filename>, enquanto o <filename>kernel.debug</filename> pode ser usado como fonte de símbolos de depuração para o <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: To capture a crash dump, edit <filename>/etc/rc.conf</filename> and set <literal>dumpdev</literal> to point to either the swap partition or <literal>AUTO</literal>. This will cause the <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> scripts to use the <citerefentry><refentrytitle>dumpon</refentrytitle><manvolnum>8</manvolnum></citerefentry> command to enable crash dumps. This command can also be run manually. After a panic, the crash dump can be recovered using <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry>; if <literal>dumpdev</literal> is set in <filename>/etc/rc.conf</filename>, the <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> scripts will run <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> automatically and put the crash dump in <filename>/var/crash</filename>.
de_de: Damit ein Crash-Dump erhalten bleibt, müssen Sie <filename>/etc/rc.config</filename> editieren und <literal>dumpdev</literal> so setzen, dass es entweder auf die Swap-Partition, oder auf <literal>AUTO</literal> zeigt. Das bewirkt, dass die <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Skripte den Befehl <citerefentry><refentrytitle>dumpon</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzen, um Crash-Dumps zu ermöglichen. Sie können den Befehl auch manuell ausführen. Nach einer Panik kann der Crash-Dump mit <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> wiederhergestellt werden; wenn <literal>dumpdev</literal> in <filename>/etc/rc.conf</filename> gesetzt ist, werden die <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>-Skripte <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> automatisch ausführen und den Crash-Dump unter <filename>/var/crash</filename> ablegen.
es_es: Para capturar un volcado de pila, edite <filename>/etc/rc.conf</filename> y ajuste <literal>dumpdev</literal> para que apunte a la partición swap o <literal>AUTO</literal>. Esto causara que los scripts de <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> usen el comando <citerefentry><refentrytitle>dumpon</refentrytitle><manvolnum>8</manvolnum></citerefentry> para habilitar vocados de fallos. Este comando también puede correrse manualmente. Luego de un pánico, el volcado de fallos puede recuperarse usando <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry>; si <literal>dumpdev</literal> esta ajustado en <filename>/etc/rc.conf</filename>, los scripts de <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> correran <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> automáticamente y colocaran en volcado de fallos en <filename>/var/crash</filename>.
pt_br: Para capturar um despejo de memória, edite o <filename>/etc/rc.conf</filename> e defina o <literal>dumpdev</literal> para apontar para a partição de swap ou para <literal>AUTO</literal>. Isso fará com que os scripts <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> usem o comando <citerefentry><refentrytitle>dumpon</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ativar os despejos de memória. Este comando também pode ser executado manualmente. Após um panic, o despejo de memória pode ser recuperado usando o <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry>; se o <literal>dumpdev</literal> estiver configurado em <filename>/etc/rc.conf</filename>, os scripts <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> executarão o <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> automaticamente e colocarão o despejo de memória em <filename>/var/crash</filename>.

source: FreeBSD crash dumps are usually the same size as physical RAM. Therefore, make sure there is enough space in <filename>/var/crash</filename> to hold the dump. Alternatively, run <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> manually and have it recover the crash dump to another directory with more room. It is possible to limit the size of the crash dump by using <literal>options MAXMEM=N</literal> where <replaceable>N</replaceable> is the size of kernel's memory usage in KBs. For example, for 1 GB of RAM, limit the kernel's memory usage to 128 MB, so that the crash dump size will be 128 MB instead of 1 GB.
de_de: FreeBSD Crash-Dumps sind für gewöhnlich genauso groß wie der physikalische Hauptspeicher des Rechners. Deshalb müssen Sie dafür sorgen, dass genügend Speicherplatz in <filename>/var/crash</filename> zur Verfügung steht, um den Dump aufnehmen zu können. Alternativ führen Sie <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> manuell aus und lassen es den Crash-Dump in einem anderen Verzeichnis mit mehr Platz wiederherstellen Es ist möglich, die Größe des Crash-Dumps zu begrenzen, indem <literal>options MAXMEM=N</literal>, wobei <replaceable>N</replaceable> die Größe des verwendeten Kernelspeichers in KBs ist. Wenn Sie z.B. 1 GB RAM haben, können Sie die Speicherbenutzung des Kernels damit auf 128 MB begrenzen, so dass die Größe des Crash-Dumps 128 MB anstatt 1 GB betragen wird.
es_es: Los volcados de fallos de FreeBSD suelen ser del mismo tamaño que la RAM física. Por consiguiente, asegúrese de que haya suficiente espacio en <filename>/var/crash</filename> para contener el volcado. Alternativamente, corra <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> manualmente y haga que recupere el volcado de fallos desde otro directorio con más espacio. Es posible limitar el tamaño del volcado de fallos usando <literal>options MAXMEM=N</literal> donde <replaceable>N</replaceable>es el tamaño del uso de memoria de kernel KBs. Por ejemplo, para 1 GB de RAM, limite el uso de memoria del kernel a 128 MB de modo que el tamaño del volcado de fallos sea de 128 MB en lugar de 1 GB.
pt_br: Os despejos de memória do FreeBSD são geralmente do mesmo tamanho que a RAM física. Portanto, verifique se há espaço suficiente em <filename>/var/crash</filename> para manter o despejo. Como alternativa, execute <citerefentry><refentrytitle>savecore</refentrytitle><manvolnum>8</manvolnum></citerefentry> manualmente e faça com que recupere o despejo de memória para outro diretório com mais espaço. É possível limitar o tamanho do despejo de memória usando <literal>options MAXMEM=N</literal> onde <replaceable>N</replaceable> é o tamanho da memória utilizada do kernel em KBs. Por exemplo, para 1 GB de RAM, limite o uso de memória pelo kernel a 128 MB, para que o tamanho do despejo de memória seja de 128 MB em vez de 1 GB.

source: Once the crash dump has been recovered , get a stack trace as follows:
de_de: Sobald der Crash-Dump wiederhergestellt wurde, können Sie den Stack zurückverfolgen:
es_es: Una vez que se haya recuperado el volcado de fallos, obtenga un seguimiento de pila de esta manera:
pt_br: Depois que o despejo de memória for recuperado, obtenha um rastreamento de pilha da seguinte maneira:

source: Note that there may be several screens worth of information. Ideally, use <citerefentry><refentrytitle>script</refentrytitle><manvolnum>1</manvolnum></citerefentry> to capture all of them. Using the unstripped kernel image with all the debug symbols should show the exact line of kernel source code where the panic occurred. The stack trace is usually read from the bottom up to trace the exact sequence of events that lead to the crash. <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> can also be used to print out the contents of various variables or structures to examine the system state at the time of the crash.
de_de: Beachten Sie, dass es mehrere Seiten mit wertvollen Informationen geben könnte; idealerweise sollten Sie <citerefentry><refentrytitle>script</refentrytitle><manvolnum>1</manvolnum></citerefentry> benutzen, um sie alle festzuhalten. Wenn Sie das vollständige Kernelimage mit allen Debugginginformationen benutzen, müssten Sie exakt die Zeile des Kernel-Quellcodes finden, wo die Panik aufgetreten ist. Für gewöhnlich müssen Sie den Stack von unten an zurückverfolgen, um die genaue Ereignisabfolge, die zum Crash führte, zurückzuverfolgen. Sie können <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> auch zum Ausdrucken der Inhalte verschiedener Variablen oder Strukturen benutzen, um den Systemstatus zum Zeitpunkt des Absturzes zu untersuchen.
es_es: Nótese que hay varias pantallas de información. En lo posible, use <citerefentry><refentrytitle>script</refentrytitle><manvolnum>1</manvolnum></citerefentry> para capturarlas todas. Usar la imagen unstripped del kernel con todos los símbolos de depuración debería ahora mostrar la línea exacta del codigo fuente del kernel donde ocurrio el pánico. El seguimiento de pila suele leerse desde el fondo hacía arriba para rastrear la secuencia exacta de eventos que llevaron al fallo. <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> puede también usarse para imprimir el contenido de varias variables o estructuras para examinar el estado del sistema en el momento del fallo.
pt_br: Note que pode haver várias telas de informação valiosa. Idealmente, use <citerefentry><refentrytitle>script</refentrytitle><manvolnum>1</manvolnum></citerefentry> para capturar todas elas. Usar a imagem do kernel unstripped com todos os símbolos de depuração deve mostrar a linha exata do código fonte do kernel onde o panic ocorreu. O rastreamento de pilha geralmente é lido de baixo para cima para rastrear a sequência exata de eventos que levam à falha. O <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> também pode ser usado para imprimir o conteúdo de várias variáveis ​​ou estruturas para examinar o estado do sistema no momento da falha.

source: If a second computer is available, <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> can be configured to do remote debugging, including setting breakpoints and single-stepping through the kernel code.
de_de: Wenn Sie einen zweiten Rechner haben, können Sie <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> auch für entferntes Debugging konfigurieren, einschließlich dem Setzen von Haltepunkten und dem Bewegen in Einzelschritten durch den Kernelcode.
es_es: Si una segunda computadora esta disponible <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> puede configurarse para realizar la depuración remota, incluyendo ajustar breakpoints y hacer single-stepping en el código del kernel.
pt_br: Se um segundo computador estiver disponível, o <citerefentry><refentrytitle>kgdb</refentrytitle><manvolnum>1</manvolnum></citerefentry> pode ser configurado para fazer uma depuração remota, incluindo pontos de interrupção de configuração e passos únicos através do código do kernel.

source: If <literal>DDB</literal> is enabled and the kernel drops into the debugger, a panic and a crash dump can be forced by typing <literal>panic</literal> at the <literal>ddb</literal> prompt. It may stop in the debugger again during the panic phase. If it does, type <literal>continue</literal> and it will finish the crash dump.
de_de: Wenn Sie <literal>DDB</literal> aktiviert haben und der Kernel im Debugger landet, können Sie eine Panik und einen Crash-Dump erzwingen, indem Sie einfach <literal>panic</literal> am <literal>ddb</literal>-Prompt eingeben. Er könnte während der Panikphase wieder im Debugger stoppen. Falls er das tut, geben Sie <literal>continue</literal> ein, dann wird er den Crash-Dump beenden.
es_es: Si <literal>DDB</literal> esta habilitado y el kernel pasa el depurado, se pueden forzar un pánico y un volcado de fallos escribiendo <literal>panic</literal> en la consola de <literal>ddb</literal>. Esto puede detener el depurador nuevamente durante la fase de pánico. Si lo hace, escriba <literal>continue</literal> y finalizara el volcado de fallos.
pt_br: Se o <literal>DDB</literal> estiver habilitado e o kernel cair no depurador, um panic e um despejo de memória podem ser forçados digitando <literal>panic</literal> no prompt do <literal>ddb</literal>. O processo pode parar no depurador novamente durante a fase de panic. Se isso acontecer, digite <literal>continue</literal> e ele concluirá o despejo de memória.

source: Why has <function>dlsym()</function> stopped working for ELF executables?
de_de: Wieso funktioniert <function>dlsym()</function> nicht mehr für ELF-Executables?
es_es: ¿Por qué <function>dlsym()</function> ha dejado de funcionar para ejecutables ELF?
pt_br: Por que <function>dlsym()</function> parou de funcionar para executáveis ​​ELF?

source: The ELF toolchain does not, by default, make the symbols defined in an executable visible to the dynamic linker. Consequently <function>dlsym()</function> searches on handles obtained from calls to <function>dlopen(NULL, flags)</function> will fail to find such symbols.
de_de: Die ELF-Werkzeuge machen die in einem Executable definierten Symbole dem dynamischen Linker nicht standardmäßig sichtbar. Konsequenterweise werden <function>dlsym()</function>-Suchen nach Handlern aus Aufrufen von <function>dlopen(NULL, flags)</function> diese Symbole nicht finden können.
es_es: ELF toolchain por defecto no hace que los símbolos definidos a un ejecutable sean visibles al linker dinámico. Consecuentemente <function>dlsym()</function> busca en los descriptores obtenidos desde llamadas a <function>dlopen(NULL, flags)</function> y no podrá encontrar tales símbolos.
pt_br: A toolchain ELF não faz, por padrão, os símbolos definidos em um executável visíveis para o vinculador dinâmico. Consequentemente, a busca da função <function>dlsym()</function> por identificadores obtidos de chamadas para <function>dlopen(NULL, flags)</function> não conseguirá encontrar tais símbolos.

source: To search, using <function>dlsym()</function>, for symbols present in the main executable of a process, link the executable using the <option>--export-dynamic</option> option to the ELF linker (<citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry>).
de_de: Wenn Sie mit <function>dlsym()</function> nach im Hauptexecutable eines Prozesses vorhandenen Symbolen suchen wollen, müssen Sie das Executable mit der Option <option>--export-dynamic</option> von <citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry> linken.
es_es: Para buscar, usando <function>dlsym()</function>, por símbolos presentes en el ejecutable principal de un proceso, vincule el ejecutable usando la opción <option>--export-dynamic</option> para el linker ELF (<citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry>).
pt_br: Para pesquisar, usando a função <function>dlsym()</function>, os símbolos presentes no executável principal de um processo, vincule o executável usando a opção <option>- export-dynamic</option> ao vinculador ELF (<citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry>).

source: How can I increase or reduce the kernel address space on i386?
de_de: Wie kann ich den Adressraum des Kernels auf i386 vergrössern oder verkleinern?
es_es: ¿Como puedo incrementar o reducir el espacio de direcciones del kernel en i386?
pt_br: Como posso aumentar ou reduzir o espaço de endereçamento do kernel em uma máquina i386?

source: By default, the kernel address space is 1 GB (2 GB for PAE) for i386. When running a network-intensive server or using ZFS, this will probably not be enough.
de_de: Standardmäßig beträgt der Adressraum des Kernels 1 GB (2 GB für PAE) auf i386. Wenn Sie einen netzwerkintensiven Server oder ZFS verwenden möchten, kann es sein, dass dies nicht ausreichend ist.
es_es: Por defecto, el espacio de direcciones del kernel es de 1 GB (2 GB ppara PAE) para i386. Al correr un servidor que es intensivo sobre la red o usar ZFS, esto probablemente no sea suficiente.
pt_br: Por padrão, o espaço de endereço do kernel é de 1 GB (2 GB para PAE) para a arquitetura i386. Se você estiver executando um servidor com uso intensivo de rede ou utilizando o ZFS, isso provavelmente não será suficiente.

source: Add the following line to the kernel configuration file to increase available space and rebuild the kernel:
de_de: Fügen Sie die folgende Zeile zur Kernelkonfigurationsdatei hinzu, um den verfügbaren Speicher zu erhöhen und erstellen Sie dann einen neuen Kernel:
es_es: Agregue la siguiente línea al archivo de configuración del kernel para incrementar el espacio disponible y recompile el kernel:
pt_br: Adicione a seguinte linha ao arquivo de configuração do kernel para aumentar o espaço disponível e recompile o kernel:

source: To find the correct value of <replaceable>N</replaceable>, divide the desired address space size (in megabytes) by four. (For example, it is <literal>512</literal> for 2 GB.)
de_de: Um den richtigen Wert von <replaceable>N</replaceable> zu bestimmen, teilen Sie den gewünschte Größe des Adressraumes (in Megabyte) durch vier (z.B. beträgt er <literal>512</literal> für 2 GB).
es_es: Para encontrar el valor correcto de <replaceable>N</replaceable>, divida el tamaño de espacio de direcciones deseado (en megabytes) por cuatro. (Por ejemplo, <literal>512</literal> para 2 GB.)
pt_br: Para encontrar o valor correto de <replaceable>N</replaceable>, divida o tamanho do espaço de endereço desejado (em megabytes) por quatro. (Por exemplo, é <literal> 512</literal> para 2 GB.)

source: Acknowledgments
de_de: Danksagung
es_es: Reconocimientos
pt_br: Agradecimentos

source: This innocent little Frequently Asked Questions document has been written, rewritten, edited, folded, spindled, mutilated, eviscerated, contemplated, discombobulated, cogitated, regurgitated, rebuilt, castigated, and reinvigorated over the last decade, by a cast of hundreds if not thousands. Repeatedly.
de_de: Dieses kleine unschuldige Dokument mit Häufig gestellten Fragen wurde die letzten Jahrzehnte von Hunderten, wenn nicht Tausenden, geschrieben, neu geschrieben, überarbeitet, gefaltet, verdreht, durcheinander gebracht, wieder aufgebaut, verstümmelt, seziert, durchgekaut, überdacht, und wiederbelebt. Und das nicht nur einmal.
es_es: Este inocente y pequeño documento de Preguntas Frecuentes ha sido escrito, reescrito, editado, doblado, girado, mutilado, eviscerado, contemplado, confundido, reflexionado, regurgitado, reconstruido, castigado y revitalizado en el curso de la ultima década, por un equipo de cientos si no miles. Repetidamente.
pt_br: Este inocente documento de Perguntas Frequentes foi escrito, reescrito, editado, dobrado, fustigado, mutilado, eviscerado, contemplado, desconcertado, cogitado, regurgitado, reconstruído, castigado e revigorado na última década, por um elenco de centenas, se não milhares de voluntários. Repetidamente.

source: We wish to thank every one of the people responsible, and we encourage you to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">join them</link> in making this <acronym>FAQ</acronym> even better.
de_de: Wir möchten allen dafür Verantwortlichen danken und wir fordern auch Sie auf, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">dieser Gruppe beizutreten</link>, um diese <acronym>FAQ</acronym> noch besser zu machen.
es_es: Queremos agradecerles a cada una de las personas responsables, y lo animamos a que <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">se les una</link> para hacer este <acronym>FAQ</acronym> aún mejor.
pt_br: Gostaríamos de agradecer a cada uma das pessoas responsáveis, e nós o encorajamos a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/article.html">se juntar a eles</link> para tornar este <acronym>FAQ </acronym> ainda melhor.

source: Bibliography
de_de: Bibliographie
es_es: Bibliografía

source: 1st edition
de_de: Erste Ausgabe
es_es: 1a edición

source: 992 pages
de_de: 992 Seiten
es_es: 992 páginas

source: October 2001
de_de: Oktober 2001
es_es: Octubre 2001

source: June 1994
de_de: Juni 1994
es_es: Junio 1994

source: 804 pages
de_de: 804 Seiten
es_es: 804 paginas

source: 905 pages
de_de: 905 Seiten
es_es: 905 paginas

source: 712 pages
de_de: 712 Seiten
es_es: 712 paginas

source: 866 pages
de_de: 866 Seiten
es_es: 866 paginas

source: 596 pages
de_de: 596 Seiten
es_es: 596 paginas

source: 3rd edition
de_de: Dritte Ausgabe
es_es: 3ra edición

source: June 1999
de_de: Juni 1999
es_es: Junio 1999
