Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/hubs/_index.po
Languages: es, pt_br, ru

source: Due to very high requirements of bandwidth, storage and adminstration the FreeBSD Project has decided not to allow public mirrors of packages. For sites with lots of machines, it might be advantagous to run a caching HTTP proxy for the man:pkg[8] process. Alternatively specific packages and their dependencies can be fetched by running something like the following:
es: El Proyecto FreeBSD ha decidido no permitir la replicación pública de paquetes debido a los altos requisitos de ancho de banda, almacenamiento y administración. Para sitios con muchas máquinas, podría ser una ventaja tener un proxy HTTP para el proceso de man:pkg[8]. De forma alternativa, se pueden descargar paquetes específicos junto con sus dependencias ejecutando algo como lo siguiente:
pt_br: Devido aos requisitos muito altos de largura de banda, armazenamento e administração, o Projeto FreeBSD decidiu não permitir espelhos públicos de pacotes pré compilados. Para sites com muitas máquinas, pode ser vantajoso executar um proxy HTTP com cache habilitado para o processo man:pkg[8]. Alternativamente, pacotes específicos e suas dependências podem ser baixados executando algo como o seguinte:

source: Once those packages have been fetched, the repository metadata must be generated by running:
es: Cuando estos paquetes se descarguen, los metadatos del repositorio se deben generar ejecutando:
pt_br: Quando esses pacotes forem baixados, os metadados do repositório devem ser gerados executando:
ru: После загрузки этих пакетов необходимо сгенерировать метаданные репозитория, выполнив:

source: Once the packages have been fetched and the metadata for the repository has been generated, serve the packages up to the client machines via HTTP. For additional information see the man pages for man:pkg[8], specifically the man:pkg-repo[8] page.
es: Una vez que los paquetes se han descargado y que se ha generado la metadata del repositorio, puedes servir los paquetes hasta las máquinas cliente mediante HTTP. Para obtener información adicional, lee las páginas de manual para man:pkg[8], en concreto la página man:pkg-repo[8].
pt_br: Depois que os pacotes forem baixados e os metadados do repositório forem gerados, sirva os pacotes para as máquinas clientes via HTTP. Para obter informações adicionais, consulte as páginas man do man:pkg[8], especificamente a página man:pkg-repo[8].
ru: После загрузки пакетов и генерации метаданных репозитория предоставьте пакеты клиентским машинам через HTTP. Дополнительную информацию можно найти на man-страницах man:pkg[8], в частности на странице man:pkg-repo[8].

source: How Often Should I Mirror?
es: ¿Con qué frecuencia debo actualizar el contenido de mi replica?
pt_br: Com que frequência eu devo atualizar o conteúdo do meu site espelho?
ru: Как часто синхронизироваться?

source: Every mirror should be updated at a minimum of once per day. Certainly a script with locking to prevent multiple runs happening at the same time will be needed to run from man:cron[8]. Since nearly every admin does this in their own way, specific instructions cannot be provided. It could work something like this:
es: Cada réplica se debería actualizar como mínimo una vez al día. Seguramente para ejecutar un script desde man:cron[8] el script necesite bloqueos para evitar varias instancias ejecutándose al mismo tiempo. Puesto que prácticamente cada administrador hace esto de una forma distinta, no se pueden proporcionar instrucciones específicas. Podría funcionar algo como esto:
pt_br: Todo espelho deve ser atualizado pelo menos uma vez por dia. Certamente, um script com bloqueio para evitar que várias execuções ocorram ao mesmo tempo será necessário para ser executado pelo man:cron[8]. Como cada administrador faz isso de sua própria maneira, instruções específicas não podem ser fornecidas. Este processo poderia funcionar , por exemplo, desta forma:
ru: Каждое зеркало должно обновляться как минимум раз в день. Конечно, потребуется скрипт с блокировкой, чтобы предотвратить одновременный запуск нескольких копий, который будет запускаться из man:cron[8]. Поскольку почти каждый администратор делает это по-своему, конкретные инструкции предоставить невозможно. Это может работать примерно так:

source: Put the command to run your mirroring application in a script. Use of a plain `/bin/sh` script is recommended.
es: Escribe el comando para ejecutar su réplica en un script. Se recomienda el uso de un script simple de `/bin/sh`.
pt_br: Coloque o comando para executar sua aplicação de espelhamento em um script. O uso de um script `/bin/sh` simples é recomendado.
ru: Создайте скрипт с командой, которая запустит нужное приложение для обновления зеркала. Рекомендуем использовать скрипт на языке обычного `/bin/sh`.

source: Add some output redirections so diagnostic messages are logged to a file.
es: Agrega algunas redirecciones de salida para que los mensajes de diagnóstico se registren en un archivo.
pt_br: Adicione alguns redirecionamentos de saída para que as mensagens de diagnóstico sejam registradas em um arquivo.
ru: Добавьте команд перенаправления вывода, чтобы записать диагностику работы в файл.

source: Test if your script works. Check the logs.
es: Comprueba si el script funciona. Comprueba los logs.
pt_br: Teste se o seu script funciona. Verifique os logs.
ru: Попробуйте, как ваш скрипт работает. По завершении проверьте журналы.

source: Use man:crontab[1] to add the script to the appropriate user's man:crontab[5]. This should be a different user than what your FTP daemon runs as so that if file permissions inside your FTP area are not world-readable those files cannot be accessed by anonymous FTP. This is used to "stage" releases - making sure all of the official mirror sites have all of the necessary release files on release day.
es: Usa man:crontab[1] para añadir el script al man:crontab[5] del usuario correspondiente. Este debería ser un usuario diferente del que utiliza tu demonio de FTP de forma que si los permisos de los ficheros dentro de tu área de FTP no son legibles para todo el mundo esos ficheros no pueden ser accedidos mediante un FTP anónimo. Esto es lo que se usa para "preparar" las releases - asegurarse de que todas las réplicas oficiales tienen todos los ficheros de release el día de la liberación de la misma.
pt_br: Use o man:crontab[1] para adicionar o script ao man:crontab[5] do usuário apropriado. Este deve ser um usuário diferente do que seu daemon FTP é executado, para que, se as permissões de arquivo dentro de sua área FTP não forem legíveis por todo o mundo, esses arquivos não possam ser acessados pelo FTP anônimo. Isso é usado para "preparar" as releases - garantindo que todos os sites de espelho oficiais tenham todos os arquivos da release necessários no dia do seu lançamento.
ru: При помощи утилиты man:crontab[1] добавьте ваш скрипт в таблицу регулярных заданий man:crontab[5] соответствующего пользователя. Это должен быть пользователь, отличный от пользователя FTP-даемона, чтобы файлы в FTP-области без атрибута "чтение для всех" не были доступны анонимным FTP-пользователям. Данное свойство используется для тестирования перед выходом новых релизов, для того чтобы удостовериться, что все официальные зеркала содержат все необходимые файлы к моменту официального объявления релиза.

source: Here are some recommended schedules:
es: Aquí hay algunas programaciones recomendadas:
pt_br: Aqui estão alguns agendamentos recomendados:
ru: Некоторые рекомендуемые установки частоты обновления:

source: FTP fileset: daily
es: Conjunto de archivos FTP: diario
pt_br: Conjunto de arquivos FTP: diariamente
ru: FTP-набор: раз в сутки

source: WWW pages: daily
es: Páginas WWW: diario
pt_br: Páginas WWW: diariamente
ru: WWW-страницы: раз в сутки

source: Where to Mirror From
es: De donde replicar
pt_br: De onde fazer o espelhamento
ru: С какого сервера синхронизироваться

source: This is an important issue. So this section will spend some effort to explain the backgrounds. We will say this several times: under no circumstances should you mirror from `ftp.FreeBSD.org`.
es: Este es un punto importante. Así que en esta sección vamos a esforzarnos un poco para explicar los antecedentes. Lo diremos varias veces: bajo ninguna circunstancia deberías replicar desde `ftp.FreeBSD.org`.
pt_br: Esta é uma questão importante. Portanto, esta seção dedicará algum esforço para explicar o os motivos que estão por trás desta orientação. Diremos isso várias vezes: em nenhuma circunstância você deve espelhar a partir de `ftp.FreeBSD.org`.
ru: Это важный вопрос, так что мы попытаемся пояснить, откуда берутся ответы. Для начала повторим еще несколько раз: _никогда не синхронизируйтесь с ftp.FreeBSD.org_.

source: A few Words About the Organization
es: Algunas palabras sobre la organización
pt_br: Algumas palavras sobre a organização
ru: Организация системы зеркал

source: Mirrors are organized by country. All official mirrors have a DNS entry of the form `ftpN.CC.FreeBSD.org`. _CC_ (i.e., country code) is the _top level domain_ (TLD) of the country where this mirror is located. _N_ is a number, telling that the host would be the _Nth_ mirror in that country. (Same applies to `wwwN.CC.FreeBSD.org`, etc.) There are mirrors with no _CC_ part. These are the mirror sites that are very well connected and allow a large number of concurrent users. `ftp.FreeBSD.org` is actually two machines, one currently located in Denmark and the other in the United States. It is _NOT_ a master site and should never be used to mirror from. Lots of online documentation leads "interactive"users to `ftp.FreeBSD.org` so automated mirroring systems should find a different machine to mirror from.
es: Las réplicas se organizan por país. Todas las réplicas oficiales tienen una entrada DNS de la forma `ftpN.CC.FreeBSD.org`. _CC_ (es decir, código de país o country code) es el _top level domain_ (TLD) del país donde se encuentra la réplica. _N_ es un número que indica que el host debería ser la réplica número _N_ en ese país. (Lo mismo se aplica a `wwwN.CC.FreeBSD.org`, etc.) Hay réplicas sin la parte _CC_. Estas son las réplicas que están bien conectadas y que soportan un gran número concurrente de usuarios. `ftp.FreeBSD.org` son en realidad dos máquinas, una situada actualmente en Dinamarca y la otra en los Estados Unidos. _NO_ es un sitio maestro y no debería utilizarse para replicar desde él. Muchos documentos online guían a los usuarios "interactivos" a `ftp.FreeBSD.org` por lo que lo sistemas automáticos de replicado deberían encontrar una máquina diferente desde la que replicar.
pt_br: Os espelhos são organizados por país. Todos os espelhos oficiais têm uma entrada DNS com a forma `ftpN.CC.FreeBSD.org`. _CC_ (ou seja, código do país) é o _domínio de nível superior_ (TLD) do país onde esse espelho está localizado. _N_ é um número, indicando que o host seria o _N-ésimo_ espelho nesse país. (O mesmo se aplica a `wwwN.CC.FreeBSD.org`, etc.) Existem espelhos sem a parte _CC_. Esses são os sites de espelho que estão muito bem conectados e permitem um grande número de usuários simultâneos. O `ftp.FreeBSD.org` na verdade são duas máquinas, uma atualmente localizada na Dinamarca e outra nos Estados Unidos. Não é um site principal e nunca deve ser usado para se espelhar a partir dele. Muita documentação online direciona usuários "interativos" para `ftp.FreeBSD.org`, portanto, sistemas automatizados de espelhamento devem encontrar um servidor diferente para espelhar.
ru: Зеркала организуются по странам. Имена хостов всех официальных зеркал построены по принципу `ftpN.CC.FreeBSD.org`, где _CC_ (country code) - домен верхнего уровня страны, где расположено зеркало, _N_ - номер зеркала в данной стране. Этот же принцип применим к именам хостов `wwwN.CC.FreeBSD.org` и т.п. Кроме того, есть зеркала без доменной части, обозначающей страну. Все они имеют очень хорошие внешние каналы и обслуживают большое число одновременных соединений. Имя `ftp.FreeBSD.org` на самом деле указывает на две машины, одна из которых в настоящее время находится в Дании, а другая в США. Ни одна из этих машин _НЕ_ является основным сайтом, и потому не должна использоваться для синхронизации. Масса документации для "живых" пользователей указывает на `ftp.FreeBSD.org`, так что автоматическим системам ведения зеркал следует выбирать другие источники синхронизации.

source: Additionally there exists a hierarchy of mirrors, which is described in terms of __tiers__. The master sites are not referred to but can be described as __Tier-0__. Mirrors that mirror from these sites can be considered __Tier-1__, mirrors of __Tier-1__-mirrors, are __Tier-2__, etc. Official sites are encouraged to be of a low __tier__, but the lower the tier the higher the requirements in terms as described in <<mirror-requirements>>. Also access to low-tier-mirrors may be restricted, and access to master sites is definitely restricted. The __tier__-hierarchy is not reflected by DNS and generally not documented anywhere except for the master sites. However, official mirrors with low numbers like 1-4, are usually _Tier-1_ (this is just a rough hint, and there is no rule).
es: Existe además una jerarquía de réplicas que se describe en base a niveles (__tiers__). Los sitios maestros no están referenciados pero se pueden describir como __Tier-0__. Los mirrors que replican de estos sitios se consideran __Tier-1__, réplicas de los __Tier-1__ son __Tier-2__, etc. Se recomienda que los sitios oficiales estén en un __tier__ bajo, pero cuanto más bajo el tier mayores son los requisitos en los términos descritos en <<mirror-requirements>>. Además el acceso a las réplicas de tier bajos podría estar restringido y seguro que el acceso a los sitios maestros está restringido. La jerarquía basada en niveles no tiene relación con DNS y en general no está documentada excepto para los sitios maestros. Sin embargo, las réplicas oficiales con números bajos como 1-4 son normalmente _Tier-1_ (esto es sólo una aproximación, no hay una regla).
pt_br: Além disso, existe uma hierarquia de espelhos, que é descrita em termos de __níveis__. Os sites principais não são mencionados, mas podem ser descritos como __Nível-0__. Espelhos que espelham a partir desses sites podem ser considerados __Nível-1__, espelhos de espelhos __Nível-1__ são __Nível-2__, etc. Sites oficiais são incentivados a ter um nível baixo, mas quanto mais baixo o nível, maiores os requisitos como descrito em <<mirror-requirements>>. O acesso a espelhos de baixo nível pode ser restrito e o acesso a sites principais é definitivamente restrito. A hierarquia de __nível__ não é refletida pelo DNS e geralmente não é documentada em nenhum lugar, exceto para os sites principais. No entanto, espelhos oficiais com números baixos como 1-4, geralmente são __Nível-1__ (isso é apenas uma dica aproximada e não há regra).

source: Ok, but Where Should I get the Stuff Now?
es: Ok, pero, ¿de dónde debo descargar los archivos?
pt_br: Ok, mas de onde devo baixar os arquivos agora?
ru: Так откуда же мне синхронизироваться?

source: Under no circumstances should you mirror from `ftp.FreeBSD.org`. The short answer is: from the site that is closest to you in Internet terms, or gives you the fastest access.
es: Bajo ninguna circunstancia deberías replicar desde `ftp.FreeBSD.org`. La respuesta corta es: desde el sitio que está más próximo a ti en términos de Internet, o el que te proporciona el acceso más rápido.
pt_br: Em nenhuma circunstância você deve espelhar a partir de `ftp.FreeBSD.org`. A resposta curta é: a partir do site que estiver mais próximo de você em termos de Internet ou que oferecer o acesso mais rápido.
ru: Главное - НЕ с `ftp.FreeBSD.org`. Короткий ответ: с зеркала, которое расположено недалеко от вас в терминах Интернет, и/или доступ к которому наилучший.

source: I Just Want to Mirror from Somewhere!
es: ¡Solo quiero crear una réplica de algún sitio!
pt_br: Eu só quero espelhar de algum lugar!
ru: Я хочу получить копию зеркала хоть откуда-нибудь!

source: If you have no special intentions or requirements, the statement in <<mirror-where-where>> applies. This means:
es: Si no tienes ninguna intención o requisito especial, se aplica lo que se dice en <<mirror-where-where>>. Esto significa:
pt_br: Se você não tem intenções ou requisitos especiais, a afirmação em <<mirror-where-where>> se aplica. Isso significa:

source: Check for those which provide fastest access (number of hops, round-trip-times) and offer the services you intend to use (like rsync).
es: Comprueba aquellos que proporcionan un acceso rápido (número de saltos, tiempos de ida y vuelta) y que ofrecen servicios que tienes pensado usar (como rsync).
pt_br: Verifique quais sites oferecem o acesso mais rápido (número de saltos, tempos de ida e volta) e oferecem os serviços que você pretende usar (como rsync).
ru: Выберите те из них, с которыми вам работать быстрее всего (меньшее число промежуточных узлов и время отклика), и которые предоставляют нужные вам сервисы (такие как rsync).

source: Contact the administrators of your chosen site stating your request, and asking about their terms and policies.
es: Ponte en contacto con los administradores del sitio elegido, indicando tu solicitud y preguntando acerca de sus términos y políticas.
pt_br: Entre em contato com os administradores do site escolhido, informando sua solicitação e perguntando sobre seus termos e políticas.
ru: Свяжитесь с администраторами выбранного сервера, опишите ваши запросы и уточните их правила.

source: Set up your mirror as described above.
es: Configura tu replica como se describe anteriormente.
pt_br: Configure o seu site espelho conforme descrito acima.
ru: Сконфигурируйте ваше зеркало, как описывалось выше.

source: I am an Official Mirror, What is the Right Site for Me?
pt_br: Sou um site espelho oficial, qual é o site certo para mim?
ru: Я поддерживаю официальное зеркало, какой сайт мне выбрать?

source: In general the description in <<mirror-where-simple>> still applies. Of course you may want to put some weight on the fact that your upstream should be of a low tier. There are some other considerations about _official_ mirrors that are described in <<mirror-official>>.
es: En general la descripción en <<mirror-where-simple>> todavía es válida. Por supuesto que podrías darle importancia al hecho de que el servidor desde el que réplicas debería ser de un tier bajo. Hay otras consideraciones acerca de las réplicas _oficiales_ que se describen en <<mirror-official>>.
pt_br: Em geral, a descrição em <<mirror-where-simple>> ainda se aplica. Claro, você pode querer dar mais importância ao fato de que o site upstream deve ter um nível baixo. Existem algumas outras considerações sobre espelhos _oficiais_ que são descritas em <<mirror-official>>.

source: I Want to Access the Master Sites!
es: ¡Quiero acceder a los sitios maestros!
pt_br: Eu quero acessar os sites principais!
ru: Мне нужен доступ к основным сайтам!

source: If you have good reasons and good prerequisites, you may want and get access to one of the master sites. Access to these sites is generally restricted, and there are special policies for access. If you are already an _official_ mirror, this certainly helps you getting access. In any other case make sure your country really needs another mirror. If it already has three or more, ask the "zone administrator" (mailto:hostmaster@CC.FreeBSD.org[hostmaster@CC.FreeBSD.org]) or {freebsd-hubs} first.
es: Si tienes buenos motivos y prerequisitos podrías necesitar acceso a alguno de los sitios maestros. El acceso a estos sitios está restringido por lo general y hay ciertas políticas de acceso especiales. Si ya eres una réplica _oficial_ eso facilita que obtengas acceso. En cualquier otro caso asegúrate de que tu país realmente necesita otra réplica. Si ya tiene tres o más pregunta primero al "administrador de zona" (mailto:hostmaster@CC.FreeBSD.org[hostmaster@CC.FreeBSD.org]) o {freebsd-hubs}.
pt_br: Se você tiver bons motivos e bons pré-requisitos, poderá querer e obter acesso a um dos sites principais. O acesso a esses sites geralmente é restrito e existem políticas especiais para acesso. Se você já é um espelho _oficial_, certamente isso ajuda a obter acesso. Em qualquer outro caso, certifique-se de que seu país realmente precisa de outro espelho. Se já tiver três ou mais, pergunte ao "administrador de zona" (mailto:hostmaster@CC.FreeBSD.org[hostmaster@CC.FreeBSD.org]) ou na {freebsd-hubs} primeiro.
ru: При наличии достаточных причин вы можете получить доступ к одному из основных сайтов. Доступ к ним ограничен; существуют специальные правила их использования. Наличие у вас статуса _официального_ зеркала, безусловно, является хорошим подспорьем. В противном случае убедитесь, что ваша страна действительно нуждается еще в одном зеркале. Если их уже три или более, сначала свяжитесь с администратором соответствующей зоны DNS (mailto:hostmaster@CC.FreeBSD.org[hostmaster@CC.FreeBSD.org]) или напишите в {freebsd-hubs}.

source: Whoever helped you become, an _official_ should have helped you gain access to an appropriate upstream host, either one of the master sites or a suitable Tier-1 site. If not, you can send email to mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org] to request help with that.
es: Quienquiera que te haya ayudado a convertirte en una replica, un _oficial_ (official) debería de haberte ayudado a obtener acceso a un host upstream adecuado, ya sea uno de los sitios maestros o a un Tier-1 adecuado. De lo contrario, puedes enviar un correo electrónico solicitando ayuda a mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org].
pt_br: Quem o ajudou a se tornar um espelho _oficial_ deve ter lhe ajudado a obter acesso a um host upstream apropriado, seja um dos sites principais ou um site Tier-1 adequado. Se não, você pode enviar um e-mail para mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org] para solicitar ajuda com isso.
ru: Тот, кто помог вам стать _официальным_ зеркалом, должен был помочь вам получить доступ к соответствующему вышестоящему хосту — либо к одному из основных сайтов, либо к подходящему сайту уровня Tier-1. Если этого не произошло, вы можете отправить письмо по адресу mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org], чтобы запросить помощь в этом вопросе.

source: There is one master site for the FTP fileset.
es: Hay un sitio maestro para el conjunto de archivos FTP.
pt_br: Existe um site principal para o conjunto de arquivos FTP.
ru: Существует один основной сайт для синхронизации набора файлов FTP.

source: This is the master site for the FTP fileset.
es: Este es el sitio maestro para el conjunto de archivos FTP.
pt_br: Este é o site principal do conjunto de arquivos FTP.
ru: Это основной сервер для синхронизации FTP набора.

source: `ftp-master.FreeBSD.org` provides rsync access, in addition to FTP. Refer to <<mirror-ftp-rsync>>.
es: `ftp-master.FreeBSD.org` proporciona acceso rsync, además de por FTP. Lee <<mirror-ftp-rsync>>.
pt_br: O `ftp-master.FreeBSD.org` disponibiliza acesso via rsync, além do FTP. Consulte <<mirror-ftp-rsync>> para obter mais informações.

source: Mirrors are also encouraged to allow rsync access for the FTP contents, since they are __Tier-1__-mirrors.
es: Se alienta a las réplicas a ofrecer acceso rsync para el contenido de FTP puesto que son réplicas __Tier-1__.
pt_br: Também é encorajado que os espelhos permitam o acesso ao rsync para o conteúdo FTP, já que eles são espelhos __Tier-1__.
ru: Приветствуется предоставление зеркалами _1 уровня_ доступа к FTP-области по протоколу rsync.

source: Official Mirrors
es: Replicas oficiales
pt_br: Espelhos Oficiais
ru: Официальные зеркала
