Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/hubs/_index.po
Languages: es, pt_br, ru

source: Official mirrors are mirrors that
es: Las réplicas oficiales, son réplicas que
pt_br: Espelhos oficiais são os espelhos que
ru: Официальные зеркала обладают следующим свойствами

source: a) have a `FreeBSD.org` DNS entry (usually a CNAME).
es: a) tienen una entrada DNS tipo `FreeBSD.org` (normalmente un CNAME).
pt_br: a) ter uma entrada DNS `FreeBSD.org` (geralmente um CNAME).
ru: a) имеют запись в домене `FreeBSD.org` (обычно типа CNAME).

source: b) are listed as an official mirror in the FreeBSD documentation (like handbook).
es: b) son listados como una replica oficial en la documentación de FreeBSD (como el handbook).
pt_br: b) são listados como um espelho oficial na documentação do FreeBSD (como no Handbook).
ru: b) присутствуют в списке официальных зеркал в Руководстве по FreeBSD и другой документации.

source: So far to distinguish official mirrors. Official mirrors are not necessarily __Tier-1__-mirrors. However you probably will not find a __Tier-1__-mirror, that is not also official.
es: Hasta aquí cómo se distinguen las réplicas oficiales. Las réplicas oficiales no son necesariamente __Tier-1__. Sin embargo probablemente no encuentres una réplica __Tier-1__ que no sea también oficial.
pt_br: Até agora, para distinguir espelhos oficiais. Espelhos oficiais não necessariamente são espelhos __Tier-1__. No entanto, provavelmente você não encontrará um espelho __Tier-1__ que não seja oficial.
ru: На настоящий момент это все, что отличает их от прочих зеркал. Официальные зеркала не обязательно принадлежат к __Первому уровню__, однако, вряд ли можно найти зеркало __уровня 1__, не являющееся официальным.

source: Special Requirements for Official (tier-1) Mirrors
es: Requisitos específicos para las réplicas oficiales (tier-1)
pt_br: Requisitos especiais para sites espelhos oficiais (Tier-1)
ru: Отдельные требования к официальным зеркалам 1 уровня

source: It is not so easy to state requirements for all official mirrors, since the project is sort of tolerant here. It is more easy to say, what _official tier-1 mirrors_ are required to. All other official mirrors can consider this a big __should__.
es: No es tan sencillo establecer los requisitos para todas las réplicas oficiales, ya que el proyecto es bastante tolerante al respecto. Es más sencillo decir qué se requiere de una _replica oficial tier-1_. El resto de réplicas oficiales deberían de considerar esto como algo que se _debe de cumplir_.
pt_br: Não é tão fácil estabelecer requisitos para todos os espelhos oficiais, já que o projeto é bastante tolerante nesse aspecto. É mais fácil dizer o que é exigido dos _espelhos oficiais de nível 1_. Todos os outros espelhos oficiais devem considerar isso uma grande __recomendação__.
ru: Описать требования для всех официальных зеркал не так просто, поскольку проект FreeBSD достаточно мягок в этом отношении. Несколько проще указать, что требуется от __официальных зеркал уровня 1__. Прочие официальные зеркала должны рассматривать этот список как __настойчивые пожелания__.

source: Tier-1 mirrors are required to:
es: Las réplicas tier-1 están obligadas a:
pt_br: Os sites espelhos Tier-1 precisam:
ru: Зеркала 1 уровня должны:

source: carry the complete fileset
es: disponer del conjunto de archivos completo
pt_br: ter o conjunto completo de arquivos
ru: поддерживать полный список файлов

source: allow access to other mirror sites
es: permitir el acceso a otras réplicas
pt_br: permitir acesso a outros sites espelho
ru: предоставлять доступ для других зеркал

source: provide FTP and rsync access
es: proporcionar acceso FTP y rsync
pt_br: fornecer acesso FTP e rsync
ru: обеспечивать доступ по протоколам ftp и rsync

source: Furthermore, admins should be subscribed to the {freebsd-hubs}. See extref:{handbook}[this link, eresources-mail] for details, how to subscribe.
es: Es más, los administradores deberían suscribirse a {freebsd-hubs}. Visita See extref:{handbook}[este enlace, eresources-mail] para los detalles sobre cómo suscribirse.
pt_br: Além disso, os administradores devem se inscrever no {freebsd-hubs}. Consulte extref:{handbook}[este link, eresources-mail] para obter detalhes sobre como se inscrever.

source: It is _very_ important for a hub administrator, especially Tier-1 hub admins, to check the https://www.FreeBSD.org/releng/[release schedule] for the next FreeBSD release. This is important because it will tell you when the next release is scheduled to come out, and thus giving you time to prepare for the big spike of traffic which follows it.
es: Para un administrador de hub, especialmente de hubs Tier-1, es _muy_ importante comprobar la https://www.FreeBSD.org/releng/[release schedule] para la siguiente release. Es importante porque te dirá cuándo está planificada para salir la nueva versión y por lo tanto te da tiempo para prepararte para el pico de tráfico que le sigue.
pt_br: É _muito_ importante para um administrador de um site espelho, especialmente administradores de espelhos Tier-1, verificar o https://www.FreeBSD.org/releng/[calendário de lançamento] para o próximo release do FreeBSD. Isso é importante porque informará quando o próximo release está programado para sair, dando tempo para se preparar para o grande aumento de tráfego que o segue.
ru: Очень важно для администратора хаба, особенно администраторов хаба уровня Tier-1, проверять https://www.FreeBSD.org/releng/[график выпусков] следующего релиза FreeBSD. Это важно, потому что это позволит вам узнать, когда запланирован выход следующего релиза, и, таким образом, даст вам время подготовиться к большому всплеску трафика, который последует за ним.

source: It is also important that hub administrators try to keep their mirrors as up-to-date as possible (again, even more crucial for Tier-1 mirrors). If Mirror1 does not update for a while, lower tier mirrors will begin to mirror old data from Mirror1 and thus begins a downward spiral... Keep your mirrors up to date!
es: También es importante que los administradores de las réplicas intenten mantenerlas lo más actualizas posible (esto es crucial para las réplicas Tier-1). Si el Mirror1 no se actualiza durante un tiempo, las réplicas de tiers menores comenzarán a replicar los datos antiguos del Mirror1 y, por lo tanto, empezará una espiral descencente... ¡Mantén tus réplicas actualizadas!
pt_br: É importante também que os administradores dos hubs tentem manter seus espelhos atualizados o máximo possível (novamente, ainda mais crucial para os espelhos Tier-1). Se o Mirror1 não atualizar por um tempo, os espelhos de nível inferior começarão a espelhar dados antigos do Mirror1 e, assim, começa uma espiral descendente... Mantenha seus espelhos atualizados!
ru: Кроме того, важно поддерживать актуальность зеркал (в особенности зеркал уровня 1). Если Зеркало1 не синхронизировалось в течение длительного времени, то зеркала следующего уровня будут синхронизироваться по устаревшей информации и т.д. Поддерживайте актуальность ваших зеркал!

source: How to Become Official Then?
es: ¿Entonces, cómo convertirse en una replica oficial?
pt_br: Como se tornar um site espelho oficial?
ru: Как стать официальным зеркалом?

source: Please contact the Cluster Administrators as documented at https://www.FreeBSD.org/administration/#t-clusteradm.
pt_br: Por favor, entre em contato com os Administradores do Cluster conforme documentado em https://www.FreeBSD.org/administration/#t-clusteradm.
ru: Обратитесь к администраторам кластера, как указано в документации по адресу https://www.FreeBSD.org/administration/#t-clusteradm.

source: Some Statistics from Mirror Sites
es: Algunas estadísticas de las réplicas
pt_br: Algumas estatísticas dos sites espelho
ru: Статистика некоторых зеркал

source: Here are links to the stat pages of your favorite mirrors (aka the only ones who feel like providing stats).
es: Aquí dispone de enlaces a las páginas de estadísticas de sus réplicas favoritas (también conocidas como las únicas que desean proporcionarlas).
pt_br: Aqui estão os links para as páginas de estatísticas dos seus sites espelho favoritos (também conhecidos como os únicos que têm a boa vontade de fornecer as estatísticas).
ru: Вот ссылки на страницы статистики ваших любимых зеркал (иначе говоря, единственных, кто предоставляет такую статистику).

source: FTP Site Statistics
es: Estadísticas de los sitios FTP
pt_br: Estatísticas do site FTP
ru: Статистика FTP сайтов

source: ftp.is.FreeBSD.org - mailto:hostmaster@is.FreeBSD.org[hostmaster@is.FreeBSD.org] - http://www.rhnet.is/status/draupnir/draupnir.html[ (Bandwidth)] http://www.rhnet.is/status/ftp/ftp-notendur.html[(FTP processes)] http://www.rhnet.is/status/ftp/http-notendur.html[(HTTP processes)]
pt_br: ftp.is.FreeBSD.org - mailto:hostmaster@is.FreeBSD.org[hostmaster@is.FreeBSD.org] - http://www.rhnet.is/status/draupnir/draupnir.html[ (Largura de banda)] http://www.rhnet.is/status/ftp/ftp-notendur.html[(Processos FTP)] http://www.rhnet.is/status/ftp/http-notendur.html[(Processos HTTP)]

source: ftp2.ru.FreeBSD.org - mailto:mirror@macomnet.ru[mirror@macomnet.ru] - http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html[(Bandwidth)] http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html[(HTTP and FTP users)]
pt_br: ftp2.ru.FreeBSD.org - mailto:mirror@macomnet.ru[mirror@macomnet.ru] - http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html[(Largura de banda)] http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html[(Usuários de HTTP e FTP)]

source: We are not accepting new mirrors at this time.
es: No aceptamos nuevas réplicas en este momento.

source: I am an Official Mirror, What is the Right Rite for Me?
es: Soy una replica oficial, ¿cuál es el sitio correcto para mí?

source: We are not accepting any new mirrors at this time.
es: No estamos aceptando nuevas réplicas en este momento.

source: The best way to mirror the FTP area is rsync. You can install the port package:net/rsync[] and then use rsync to sync with your upstream host. rsync is already mentioned in crossref:hubs[mirror-serv-rsync, Rsync (optional for FTP Fileset)]. Since rsync access is not required, your preferred upstream site may not allow it. You may need to hunt around a little bit to find a site that allows rsync access.
ru: Наиболее эффективным будет синхронизация FTP-области при помощи rsync. Для этого следует установить пакет package:net/rsync[], который был описан в разделе <<mirror-serv-rsync>>. Поскольку доступ по протоколу rsync не является обязательным, выбранный вами сайт может его не поддерживать. Возможно, вам придется немного поискать в сетевой окрестности зеркало, поддерживающее rsync.

source: Due to very high requirements of bandwidth, storage and administration the FreeBSD Project has decided not to allow public mirrors of packages. For sites with lots of machines, it might be advantagous to run a caching HTTP proxy for the man:pkg[8] process. Alternatively specific packages and their dependencies can be fetched by running something like the following:
ru: Из-за очень высоких требований к пропускной способности, хранилищу и администрированию проект FreeBSD принял решение не разрешать публичные зеркала пакетов. Для сайтов с большим количеством машин может быть выгодно запустить кэширующий HTTP-прокси для процесса man:pkg[8]. Или конкретные пакеты и их зависимости можно загрузить, выполнив что-то вроде следующего:

source: Additionally there exists a hierarchy of mirrors, which is described in terms of __tiers__. The master sites are not referred to but can be described as __Tier-0__. Mirrors that mirror from these sites can be considered __Tier-1__, mirrors of __Tier-1__-mirrors, are __Tier-2__, etc. Official sites are encouraged to be of a low __tier__, but the lower the tier the higher the requirements in terms as described in crossref:hubs[mirror-requirements, Requirements for FreeBSD Mirrors]. Also access to low-tier-mirrors may be restricted, and access to master sites is definitely restricted. The __tier__-hierarchy is not reflected by DNS and generally not documented anywhere except for the master sites. However, official mirrors with low numbers like 1-4, are usually _Tier-1_ (this is just a rough hint, and there is no rule).
ru: Кроме того, существует иерархия зеркал в терминах их удаленности от центра, или __слоях__. Основные сайты могут быть описаны как __Зеркала нулевого слоя__. Зеркала, синхронизирующиеся по ним, считаются __слоем 1__, следующие - _слоем 2_ и т.д. Официальные сайты приглашаются на низкие слои, однако следует помнить, что чем меньше номер слоя, тем выше требования к зеркалу, как было описано в <<mirror-requirements>>. Помимо того, доступ к зеркалам 1 слоя может быть ограничен; безусловно ограничен доступ к основным сайтам. Иерархия _слоев_ не отражается в DNS и, вообще говоря, нигде (кроме мастер-сайтов) не документирована. Тем не менее, официальные зеркала с малыми (1-4, как правило) номерами обычно представляют первый слой. (Это грубая оценка, и ни в коем случае не правило).

source: If you have no special intentions or requirements, the statement in crossref:hubs[mirror-where-where, Ok, but Where Should I get the Stuff Now?] applies. This means:
ru: Если у вас нет особых намерений или требований, применимо утверждение в crossref:hubs[mirror-where-where, Так откуда же мне синхронизироваться?]. Это означает:

source: In general the description in crossref:hubs[mirror-where-simple, I Just Want to Mirror from Somewhere!] still applies. Of course you may want to put some weight on the fact that your upstream should be of a low tier. There are some other considerations about _official_ mirrors that are described in crossref:hubs[mirror-official, Official Mirrors].
ru: В основном, правила, описанные в crossref:hubs[mirror-where-simple, Я хочу получить копию зеркала хоть откуда-нибудь!], применимы. Дополнительно можно убедиться, что выбранный сайт принадлежит низкому слою. Другие соображения относительно _официальных_ зеркал описаны в <<mirror-official>>.

source: `ftp-master.FreeBSD.org` provides rsync access, in addition to FTP. Refer to crossref:hubs[mirror-ftp-rsync, Mirroring the FTP Site].
ru: В дополнение к FTP, `ftp-master.FreeBSD.org` поддерживает доступ по rsync. Использование этих протоколов описано в crossref:hubs[mirror-ftp-rsync, Mirroring the FTP Site].

source: Furthermore, admins should be subscribed to the {freebsd-hubs}. See extref:{handbook}eresources[this link, eresources-mail] for details, how to subscribe.
ru: Кроме того, администратор такого зеркала должен быть подписан на {freebsd-hubs}. См. extref:{handbook}eresources[здесь, eresources-mail] для дополнительной информации о подписке.
