Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/hubs/_index.po
Languages: es, pt_br, ru

source: The all in one guide for mirroring the FreeBSD website, FTP servers, and more
es: La guía todo en uno para crear réplicas de FreeBSD para el sitio web, los servidores FTP y más
pt_br: O guia completo para espelhar o site do FreeBSD, servidores FTP e muito mais
ru: Полное руководство по зеркалированию веб-сайта FreeBSD, FTP-серверов и многого другого

source: Mirroring FreeBSD
es: Crear réplicas de FreeBSD
pt_br: Espelhando o FreeBSD
ru: Поддержка зеркал FreeBSD

source: Abstract
es: Resumen
pt_br: Resumo
ru: Аннотация

source: An in-progress article on how to mirror FreeBSD, aimed at hub administrators.
es: Un artículo en progreso sobre cómo crear una replica de FreeBSD, destinado a los administradores de hub.
pt_br: Um artigo em andamento sobre como espelhar o FreeBSD, destinado à administradores de hubs.
ru: Рабочий вариант статьи, описывающей процесс создания и поддержки зеркала FreeBSD и адресованной администраторам зеркал.

source: We are not accepting new community mirrors at this time.
pt_br: Não estamos aceitando novos espelhos da comunidade neste momento.
ru: На текущий момент заявки на подключение новых зеркал не принимаются.

source: Contact Information
es: Información de contacto
pt_br: Informações de contato
ru: Контактная информация

source: The Mirror System Coordinators can be reached through email at mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org]. There is also a {freebsd-hubs}.
es: Se puede contactar con los Coordinadores del Sistema de Réplicas en el email mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org]. También existe {freebsd-hubs}.
pt_br: Os coordenadores do Sistema de Espelhamento podem ser contatados por e-mail através de mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org]. Também existe a {freebsd-hubs}.
ru: Координаторы системы зеркал доступны по электронной почте по адресу mailto:mirror-admin@FreeBSD.org[mirror-admin@FreeBSD.org]. Помимо этого, существует {freebsd-hubs}.

source: Requirements for FreeBSD Mirrors
es: Requisitos para las réplicas de FreeBSD
pt_br: Requisitos para um site espelho do FreeBSD
ru: Требования к зеркалам FreeBSD

source: Disk Space
es: Espacio en disco
pt_br: Espaço em disco
ru: Дисковое пространство

source: Disk space is one of the most important requirements. Depending on the set of releases, architectures, and degree of completeness you want to mirror, a huge amount of disk space may be consumed. Also keep in mind that _official_ mirrors are probably required to be complete. The web pages should always be mirrored completely. Also note that the numbers stated here are reflecting the current state (at {rel120-current}-RELEASE/{rel113-current}-RELEASE). Further development and releases will only increase the required amount. Also make sure to keep some (ca. 10-20%) extra space around just to be sure. Here are some approximate figures:
es: El espacio en disco es uno de los requisitos más importantes. Dependiendo del conjunto de releases, arquitecturas y cómo de completas quieres que sean tus réplicas, se podría consumir una enorme cantidad de espacio en disco. Ten en cuenta también que para las réplicas _oficiales_ se podría requerir que fueran completos. Las páginas web se tienen que duplicar en la réplica de forma completa. También ten en cuenta que los números utilizados aquí reflejan el estado actual (en {rel120-current}-RELEASE/{rel113-current}-RELEASE). Desarrollos posteriores y releases sólo pueden incrementar las cantidades requeridas. Asegúrate también de tener algo (un 10-20%) de espacio extra para estar seguro. Aquí hay algunos números aproximados:
pt_br: O espaço em disco é um dos requisitos mais importantes. Dependendo do conjunto de versões, arquiteturas e grau de completude que você deseja espelhar, uma enorme quantidade de espaço em disco pode ser consumida. Além disso, espelhos _oficiais_ provavelmente precisam ser completos. As páginas da web devem sempre ser espelhadas completamente. Observe também que os números aqui declarados refletem o estado atual (em {rel120-current}-RELEASE/{rel113-current}-RELEASE). O desenvolvimento e os lançamentos futuros só aumentarão a quantidade necessária. Certifique-se também de manter cerca de 10-20% de espaço extra apenas para garantir. Aqui estão alguns números aproximados:
ru: Одним из наиболее важных требований является дисковое пространство. В зависимости от набора релизов, архитектур и степени полноты зеркала вам может потребоваться огромный объем диска. Не лишним будет помнить, что _официальное_ зеркало, скорее всего, должно быть полным. Веб-страницы всегда должны зеркалироваться полностью. Кроме того, учтите, что приводимые оценки объема относятся к состоянию на момент последнего редактирования данной статьи ({rel120-current}-RELEASE/{rel113-current}-RELEASE). Дальнейший процесс разработки и последующие релизы только увеличат требуемый объем. Кроме того, разумно будет зарезервировать некоторое (10-20%) дополнительное пространство спокойствия ради. Вот некоторые оценки объема:

source: Full FTP Distribution: 1.4 TB
es: Distribución FTP completa: 1.4 TB
pt_br: Distribuição FTP completa: 1.4 TB
ru: Полное зеркало FTP: 1.4 TB

source: CTM deltas: 10 GB
es: Deltas de CTM: 10GB
pt_br: Deltas do CTM: 10 GB
ru: Комплект изменений CTM: 10 GB

source: Web pages: 1GB
es: Páginas web: 1GB
pt_br: Páginas Web: 1GB
ru: Веб-страницы: 1 GB

source: The current disk usage of FTP Distribution can be found at link:ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes[ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes].
es: El uso de disco actual de la Distribución FTP se puede encontrar en link:ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes[ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes].
pt_br: O uso atual de disco da distribuição FTP pode ser encontrado em link:ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes[ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes].
ru: Текущее использование диска зеркалом FTP можно посмотреть на link:ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes[ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes].

source: Network Connection/Bandwidth
es: Conexión de red/ancho de banda
pt_br: Conexão de Rede/Largura de Banda
ru: Требования к сетевой связности и пропускной способности

source: Of course, you need to be connected to the Internet. The required bandwidth depends on your intended use of the mirror. If you just want to mirror some parts of FreeBSD for local use at your site/intranet, the demand may be much smaller than if you want to make the files publicly available. If you intend to become an official mirror, the bandwidth required will be even higher. We can only give rough estimates here:
es: Por supuesto, necesitas estar conectado a internet. El ancho de banda requerido depende del uso previsto para la replica. Si solo deseas replicar algunas partes de FreeBSD para uso local en tu sitio/intranet, la demanda puede ser mucho menor que si quieres que los archivos estén disponibles públicamente. Si pretendes convertirte en una replica oficial, el ancho de banda requerido será aún mayor. Aquí solo podemos dar estimaciones aproximadas:
pt_br: Claro, você precisa estar conectado à Internet. A largura de banda necessária depende do uso pretendido do site espelho. Se você quiser espelhar apenas algumas partes do FreeBSD para uso na sua rede local/intranet, a demanda pode ser muito menor do que se você quiser disponibilizar os arquivos publicamente. Se você pretende se tornar um site espelho oficial, a largura de banda necessária será ainda maior. Podemos apenas dar estimativas aproximadas aqui:
ru: Разумеется, у вас должно быть подключение к интернет. Требуемая пропускная способность ваших каналов зависит от предполагаемого профиля использования вашего зеркала. Если вы собираетесь копировать некоторые части FreeBSD для локального использования на вашей машине или в интранете, требования могут быть много мягче, чем для публичного зеркала. Для официального зеркала необходимая пропускная способность увеличивается еще больше. Мы можем дать лишь очень грубые оценки:

source: Local site, no public access: basically no minimum, but < 2 Mbps could make syncing too slow.
es: Sitio local, sin acceso público: básicamente, no hay un mínimo, pero con < 2 Mbps puede que la sincronización sea muy lenta.
pt_br: Site local, sem acesso público: basicamente não há mínimo, mas menos de 2 Mbps pode tornar a sincronização muito lenta.
ru: Зеркало для локального доступа: фактически минимум не определен, но канал шириной менее 2 Mbps может сделать процесс обновления мучительно медленным.

source: Unofficial public site: 34 Mbps is probably a good start.
es: Sitio público no oficial: 34 Mbps es probablemente un buen comienzo.
pt_br: Site público não oficial: 34 Mbps provavelmente é um bom começo.
ru: Неофициальное публичное зеркало: 34 Mbps выглядит неплохо для начала.

source: Official site: > 100 Mbps is recommended, and your host should be connected as close as possible to your border router.
es: Sitio oficial: se recomiendan > 100 Mbps, y tu host debe estar conectado lo más cerca posible de tu border router.
pt_br: Site oficial: é recomendado ter mais de 100 Mbps, e seu host deve estar conectado o mais próximo possível do seu roteador de borda.
ru: Официальное зеркало: рекомендуется канал шириной более 100 Mbps; кроме того, ваша машина должна стоять как можно ближе к граничным маршрутизаторам вашей сети.

source: System Requirements, CPU, RAM
es: Requisitos del sistema, CPU, RAM
pt_br: Requisitos de Sistema, CPU, RAM
ru: Системные требования, процессор и память

source: One thing this depends on the expected number of clients, which is determined by the server's policy. It is also affected by the types of services you want to offer. Plain FTP or HTTP services may not require a huge amount of resources. Watch out if you provide rsync. This can have a huge impact on CPU and memory requirements as it is considered a memory hog. The following are just examples to give you a very rough hint.
es: Esto depende mucho del número de clientes esperado, que está determinado por la política del servidor. El tamaño también se ve afectado por el tipo de servicios que quieres ofrecer. Los servicios FTP o HTTP simples pueden no necesitar una gran cantidad de recursos. Ten cuidado si proporcionas rsync. Esto puede tener un gran impacto en los requisitos de CPU y memoria, ya que este servicio consume una gran cantidad de memoria. Los ejemplos siguientes tienen como objetivo darte una idea bastante aproximada.
pt_br: Uma coisa que isso depende é o número esperado de clientes, que é determinado pela política do servidor. Também é afetado pelos tipos de serviços que você deseja oferecer. Serviços FTP ou HTTP simples podem não requerer uma quantidade enorme de recursos. Tenha cuidado se você fornecer o rsync. Isso pode ter um grande impacto nos requisitos de CPU e memória, pois ele é considerado um devorador de memória. Os dados seguintes são apenas exemplos para dar uma ideia aproximada.
ru: Эти требования в первую очередь определяются максимальным ожидаемым количеством клиентов (устанавливается администратором сервера). Также, на требуемые ресурсы влияет список сервисов, которые вы будете предоставлять. Зеркала FTP и/или HTTP не требуют особенно много ресурсов. Будьте на чеку, если планируете предоставлять rsync. Выбор rsync может иметь огромное влияние на требования к аппаратным ресурсам, поскольку rsync признан "прожорливым" по памяти. Вот некоторые советы по конфигурации аппаратной части сервера.

source: For a moderately visited site that offers rsync, you might consider a current CPU with around 800MHz - 1 GHz, and at least 512MB RAM. This is probably the minimum you want for an _official_ site.
es: Para un sitio que ofrece rsync y que sea visitado con frecuencia moderada, podrías considerar una CPU con unos 800MHz - 1 GHz y al menos 512 MB RAM. Este es probablemente el mínimo que quieres para un sitio _oficial_.
pt_br: Para um site moderadamente visitado que oferece rsync, você pode considerar uma CPU atual com cerca de 800 MHz - 1 GHz e pelo menos 512MB de RAM. Isso provavelmente é o mínimo que você deseja para um site _oficial_.
ru: Для умеренно посещаемого сайта, предоставляющего rsync, можно использовать процессор с частотой 800MHz - 1 GHz и по крайней мере 512MB памяти. Скорее всего, данная конфигурация может считаться минимальной для _официального_ зеркала.

source: For a frequently used site you definitely need more RAM (consider 2GB as a good start) and possibly more CPU, which could also mean that you need to go for a SMP system.
es: Si es un sitio con un número de visitas alto, definitivamente, necesita más RAM (2GB es un buen comienzo) y posiblemente más CPU, esto también significa la necesidad de ir hacia un sistema que disponga de SMP.
pt_br: Para um site com visitação frequente, você definitivamente vai precisar de mais memória RAM (considere 2 GB como um bom ponto de partida) e possivelmente de mais poder de processamento (CPU), o que pode significar que você precisará ir para um sistema multiprocessado (SMP).
ru: Для регулярно посещаемого сайта вам потребуется больше памяти (хорошим стартом будет 2GB) и больше процессорной мощности, что может означать требование многопроцессорной (SMP) платформы.

source: You also want to consider a fast disk subsystem. Operations on the SVN repository require a fast disk subsystem (RAID is highly advised). A SCSI controller that has a cache of its own can also speed up things since most of these services incur a large number of small modifications to the disk.
es: También deberías de considerar un sistema rápido de discos. Las operaciones en el repositorio SVN requieren de un sistema de discos que sea rápido (se recomienda RAID). Un controlador SCSI que disponga de una caché propia también puede acelerar las cosas, ya que la mayoría de estos servicios realizan una gran cantidad de pequeñas modificaciones en el disco.
pt_br: Você também deve considerar um subsistema de disco rápido. As operações no repositório SVN requerem um subsistema de disco rápido (RAID é altamente recomendado). Um controlador SCSI que tenha seu próprio cache também pode acelerar as coisas, uma vez que a maioria desses serviços incorre em um grande número de pequenas modificações no disco.
ru: Кроме того, вам потребуется быстрая дисковая подсистема, в первую очередь, для работы с репозиторием SVN (крайне рекомендуем RAID). Контроллер SCSI, оборудованный собственной памятью, также может ощутимо ускорить процесс, поскольку большая часть сервисов связана с большим количеством дисковых запросов небольшого размера.

source: Services to Offer
es: Servicios a ofrecer
pt_br: Serviços para oferecer
ru: Предоставляемые сервисы

source: Every mirror site is required to have a set of core services available. In addition to these required services, there are a number of optional services that server administrators may choose to offer. This section explains which services you can provide and how to go about implementing them.
es: Se require que cada replica tenga un conjunto de servicios centrales disponibles. Además de estos servicios que son requeridos, hay una serie de servicios opcionales que los administradores del servidor pueden escoger ofrecerlos o no. Esta sección explica qué servicios puedes proporcionar y cómo implementarlos.
pt_br: Cada site espelho deve ter um conjunto de serviços básicos disponíveis. Além desses serviços obrigatórios, há vários serviços opcionais que os administradores de servidor podem escolher oferecer. Esta seção explica quais serviços você pode fornecer e como implementá-los.
ru: Всякое зеркало должно предоставлять набор основных сервисов. Помимо требуемого минимального набора, существуют дополнительные сервисы, которые администратор сервера может пожелать предоставлять. Этот раздел описывает, какие сервисы вы можете предоставлять, и какие действия для этого потребуются от вас.

source: FTP (required for FTP Fileset)
es: FTP (requerido para el conjunto de archivos FTP)
pt_br: FTP (necessário para o conjunto de arquivos do FTP)
ru: FTP (требуется для FTP зеркала)

source: This is one of the most basic services, and it is required for each mirror offering public FTP distributions. FTP access must be anonymous, and no upload/download ratios are allowed (a ridiculous thing anyway). Upload capability is not required (and _must_ never be allowed for the FreeBSD file space). Also the FreeBSD archive should be available under the path [.filename]#/pub/FreeBSD#.
es: Este es uno de los servicios más básicos, y es requerido en cada réplica que ofrezca distribuciones FTP públicas. El acceso a FTP debe ser anónimo, y no se permite ningún control sobre las tasas de subida/descarga (de todas formas, es ridículo). La subida de archivos no es necesaria (y _nunca_ debe permitirse en el área donde se guardan los archivos de FreeBSD). Además, los archivos de FreeBSD deben estar disponibles en la ruta [.filename]#/pub/FreeBSD#.
pt_br: Este é um dos serviços mais básicos e é necessário para cada espelho que oferece distribuições por meio de FTP publico. O acesso FTP deve ser anônimo e não são permitidas proporções de upload/download (algo ridículo de qualquer maneira). A capacidade de upload não é necessária (e _nunca_ deve ser permitida para o espaço de arquivos do FreeBSD). Além disso, os arquivos do FreeBSD devem estar disponíveis sob o caminho [.filename]#/pub/FreeBSD#.
ru: Это один из наиболее базовых сервисов; его предоставление требуется для каждого зеркала, распространяющего файлы FreeBSD по FTP. Доступ по FTP должен быть анонимным, и не должны применяться какие-либо ограничения по соотношению объема передано/принято (что вообще является, на наш взгляд, странным подходом). Закачка (upload) файлов на сервер не требуется (и _должна_ быть запрещена в разделе FreeBSD). Кроме того, архив файлов FreeBSD должен быть доступен с путем [.filename]#/pub/FreeBSD#.

source: There is a lot of software available which can be set up to allow anonymous FTP (in alphabetical order).
es: Existe una gran cantidad de software disponible que se puede configurar para permitir FTP anónimo (en orden alfabético).
pt_br: Existem diversos softwares disponíveis que podem ser configurados para operar como um servidor de FTP anônimo. Por exemplo (em ordem alfabética).
ru: Для предоставления анонимного FTP доступа может быть использован целый ряд программ (перечислены в алфавитном порядке).

source: `/usr/libexec/ftpd`: FreeBSD's own ftpd can be used. Be sure to read man:ftpd[8].
es: `/usr/libexec/ftpd`: Se puede usar el propio ftpd de FreeBSD. Asegúrate de leer man:ftpd[8].
pt_br: `/usr/libexec/ftpd`: O próprio ftpd do FreeBSD pode ser usado. Certifique-se de ler man:ftpd[8].
ru: `/usr/libexec/ftpd`: базовый FTP-даемон FreeBSD. Не забудьте прочитать man:ftpd[8].

source: package:ftp/ncftpd[]: A commercial package, free for educational use.
es: package:ftp/ncftpd[]: Un paquete comercial, gratis para uso educativo.
pt_br: package:ftp/ncftpd[] Um pacote comercial, gratuito para uso educacional.
ru: package:ftp/ncftpd[]: коммерческий пакет, свободен для использования в учебных целях.

source: package:ftp/oftpd[]: An ftpd designed with security as a main focus.
es: package:ftp/oftpd[]: Un ftpd diseñado con la seguridad como principal objetivo.
pt_br: package:ftp/oftpd[]: Um servidor FTP projetado com segurança como foco principal.
ru: package:ftp/oftpd[]: FTP-даемон, написанный в основном с точки зрения защищенности.

source: package:ftp/proftpd[]: A modular and very flexible ftpd.
es: package:ftp/proftpd[]: Un ftpd modular y muy flexible.
pt_br: package:ftp/proftpd[]: Um ftpd modular e muito flexível.
ru: package:ftp/proftpd[]: Модульный и очень гибкий FTP-даемон.

source: package:ftp/pure-ftpd[]: Another ftpd developed with security in mind.
es: package:ftp/pure-ftpd[]: Otro ftpd desarrollado con la seguridad como principal objetivo.
pt_br: package:ftp/pure-ftpd[]: Outro servidor FTP desenvolvido com segurança em mente.
ru: package:ftp/pure-ftpd[]: Еще один FTP-даемон, разработанный с позиций защищенности.

source: package:ftp/twoftpd[]: As above.
es: package:ftp/twoftpd[]: Lo mismo que el anterior.
pt_br: package:ftp/twoftpd[]: Como acima.
ru: package:ftp/twoftpd[]: См. предыдущий пункт.

source: package:ftp/vsftpd[]: The "very secure" ftpd.
es: package:ftp/vsftpd[]: El ftpd "muy seguro" ("very secure").
pt_br: package:ftp/vsftpd[]: O ftpd "muito seguro".
ru: package:ftp/vsftpd[]: "очень защищенный" ("very secure") ftpd.

source: FreeBSD's `ftpd`, `proftpd` and maybe `ncftpd` are among the most commonly used FTPds. The others do not have a large userbase among mirror sites. One thing to consider is that you may need flexibility in limiting how many simultaneous connections are allowed, thus limiting how much network bandwidth and system resources are consumed.
es: `ftpd` de FreeBSD, `proftpd` y quizás `ncftpd` están entre los FTPds más usados. Los otros no tienen una base de usuarios tan grande entre los sitios de réplicas. Algo a considerar es que podrías necesitar flexibilidad para limitar el número de conexiones simultáneas que se permiten, limitando por tanto cuánto ancho de banda y recursos de sistema se consumen.
pt_br: O `ftpd` do FreeBSD, o `proftpd` e talvez o `ncftpd` estão entre os FTPds mais comumente usados. Os outros não têm uma grande base de usuários entre os sites espelho. Uma coisa a considerar é que você pode precisar de flexibilidade para limitar quantas conexões simultâneas são permitidas, limitando assim quanto de largura de banda de rede e recursos do sistema são consumidos.
ru: ftpd, proftpd и, возможно, ncftpd являются наиболее часто встречающимися FTP серверами. Прочие распространены среди существующих зеркал в существенно меньшей степени. Дополнительным поводом для рассмотрения может являться возможность гибко ограничивать количество одновременных соединений, что поможет вам удержать в нужных рамках потребление пропускной способности ваших каналов и машинные ресурсы.

source: Rsync (optional for FTP Fileset)
es: Rsync (opcional para el conjunto de archivos FTP)
pt_br: Rsync (opcional para o conjunto de arquivos do FTP)
ru: Rsync (необязательный сервис для FTP зеркала)
