Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/explaining-bsd/*.po
Languages: es_es, nl_nl, pt_br

source: DragonFlyBSD aims for high performance and scalability under everything from a single-node UP system to a massively clustered system. DragonFlyBSD has several long-range technical goals, but focus lies on providing a SMP-capable infrastructure that is easy to understand, maintain and develop for.
es_es: DragonFlyBSD tiene como meta ofrecer un alto rendimiento y escalabilidad bajo cualquier entorno, desde computadoras de un solo usuario hasta enormes sistemas de clústeres. DragonFlyBSD tiene varios objetivos técnicos a largo plazo, pero el desarrollo se centra en ofrecer una infraestructura habilitada para SMP que sea fácil de entender, mantener y desarrollar.
nl_nl: DragonFlyBSD gaat voor hoge prestaties en schaalbaarheid variërend van een UP-systeem van een enkele computer tot een reusachtig geclusterd systeem. DragonFlyBSD heeft verscheidene technische langetermijndoelen, maar de focus ligt op het bieden van een SMP-capabele infrastructuur dat eenvoudig te begrijpen en te onderhouden is, en waarvoor eenvoudig te ontwikkelen is.
pt_br: O DragonFlyBSD tem como objetivo o alto desempenho e a escalabilidade sob todos os aspectos, desde um sistema de um único nó até um sistema altamente clusterizado. O DragonFlyBSD tem várias metas técnicas de longo prazo, mas o foco está em fornecer uma infraestrutura compatível com SMP que seja fácil de entender, manter e desenvolver.

source: There are also two additional BSD <trademark class="registered">UNIX</trademark> operating systems which are not open source, BSD/OS and Apple's <trademark class="registered">Mac OS</trademark> X:
es_es: También hay dos sistemas operativos BSD <trademark class="registered">UNIX</trademark> adicionales que no son de código abierto, BSD/OS y <trademark class="registered">Mac OS</trademark> X de Apple:
nl_nl: Er zijn ook twee aanvullende BSD <trademark class="registered">UNIX</trademark> besturingssystemen die niet open-source zijn, BSD/OS en <trademark class="registered">Mac OS</trademark> X van Apple:
pt_br: Também existem dois sistemas operacionais BSD <trademark class="registered">UNIX</trademark> que não são de código aberto, o BSD/OS e <trademark class="registered">Mac OS</trademark> X da Apple:

source: BSD/OS was the oldest of the 4.4BSD derivatives. It was not open source, though source code licenses were available at relatively low cost. It resembled FreeBSD in many ways. Two years after the acquisition of BSDi by Wind River Systems, BSD/OS failed to survive as an independent product. Support and source code may still be available from Wind River, but all new development is focused on the VxWorks embedded operating system.
es_es: BSD/OS fue el derivado más antiguo de 4.4BSD. No era de código abierto, aunque las licencias de código fuente estaban disponibles a un precio relativamente bajo. Se parecía a FreeBSD en muchos aspectos. Dos años después de la adquisición de BSDi por Wind River Systems, BSD/OS no logró sobrevivir como un producto independiente. El soporte y el código fuente podrían estar todavía disponibles por parte de Wind River, pero todos los desarrollos nuevos se centran en el sistema operativo embebido VxWorks.
nl_nl: BSD/OS was de oudste van de afgeleiden van 4.4BSD. Het was niet open-source, alhoewel licenties voor de broncode tegen relatief kosten beschikbaar waren. Het leek in vele opzichten op FreeBSD. Twee jaar na de aankoop van BSDi door Wind River Systems slaagde BSD/OS er niet in om als een onafhankelijk product te overleven. Ondersteuning en broncode kunnnen nog steeds beschikbaar zijn van Wind River, maar alle nieuwe ontwikkelingen zijn gericht op het embedded besturingssysteem VxWorks.
pt_br: O BSD/OS foi o mais antigo dos sistemas derivados do 4.4BSD. Não era um sistema de código aberto, embora as licenças do código-fonte estivessem disponíveis a um custo relativamente baixo. Assemelhava-se ao FreeBSD de várias maneiras. Dois anos após a aquisição da BSDi pela Wind River Systems, o BSD/OS não conseguiu sobreviver como um produto independente. O suporte e o código-fonte ainda podem estar disponíveis por parte da Wind River, mas todo desenvolvimento novo está focado no sistema operacional embarcado VxWorks.

source: <link xlink:href="http://www.apple.com/macosx/server/"><trademark class="registered">Mac OS</trademark> X</link> is the latest version of the operating system for <trademark class="registered">Apple</trademark>'s <trademark class="registered">Mac</trademark> line. The BSD core of this operating system, <link xlink:href="http://developer.apple.com/darwin/">Darwin</link>, is available as a fully functional open source operating system for x86 and PPC computers. The Aqua/Quartz graphics system and many other proprietary aspects of <trademark class="registered">Mac OS</trademark> X remain closed-source, however. Several Darwin developers are also FreeBSD committers, and vice-versa.
es_es: <link xlink:href="http://www.apple.com/macosx/server/"><trademark class="registered">Mac OS</trademark> X</link> es la última versión del sistema operativo para la línea <trademark class="registered">Mac</trademark> de <trademark class="registered">Apple</trademark>. El núcleo BSD de este sistema operativo, <link xlink:href="http://developer.apple.com/darwin/">Darwin</link>, está disponible libremente como sistema operativo de código abierto totalmente funcional para arquitecturas x86 y PPC. Sin embargo, el sistema gráfico Aqua/Quartz y otros aspectos muy característicos de <trademark class="registered">Mac OS</trademark> X siguen siendo de código cerrado. Varios desarrolladores de Darwin son también committers de FreeBSD y viceversa.
nl_nl: <link xlink:href="http://www.apple.com/macosx/server/"><trademark class="registered">Mac OS</trademark> X</link> is de nieuwste versie van het besturingssysteem voor de <trademark class="registered">Mac</trademark> lijn van <trademark class="registered">Apple</trademark>. De BSD-kern van dit besturingssysteem, <link xlink:href="http://developer.apple.com/darwin/">Darwin</link> is beschikbaar als een volledig werkend open-source besturingssysteem voor x86- en PPC-computers. Het grafische systeem Aqua/Quartz en vele andere propriëtaire aspecten van <trademark class="registered">Mac OS</trademark> X blijven echter closed-source. Verschillende Darwin-ontwikkelaars zijn ook FreeBSD-committers, en vice-versa.
pt_br: O <link xlink:href="http://www.apple.com/macosx/server/"><trademark class="registered">Mac OS</trademark> X</link> é a versão mais recente do sistema operacional para os equipamentos <trademark class="registered">Mac</trademark> da <trademark class="registered">Apple</trademark>. O núcleo BSD deste sistema operacional, <link xlink:href="http://developer.apple.com/darwin/">Darwin</link>, está disponível como um sistema operacional de código aberto totalmente funcional para computadores x86 e PPC. No entanto, o sistema gráfico Aqua/Quartz e muitos outros aspectos proprietários do <trademark class="registered">Mac OS</trademark> X continuam fechados. Vários desenvolvedores do Darwin também são committers do FreeBSD, e vice-versa.

source: How does the BSD license differ from the GNU Public license?
es_es: ¿En qué se diferencia la licencia BSD de la licencia pública GNU?
nl_nl: Hoe verschilt de BSD-licentie van de publieke GNU-licentie?
pt_br: Como a licença BSD difere da licença GNU Publica?

source: Linux is available under the <link xlink:href="http://www.fsf.org/copyleft/gpl.html">GNU General Public License</link> (GPL), which is designed to eliminate closed source software. In particular, any derivative work of a product released under the GPL must also be supplied with source code if requested. By contrast, the <link xlink:href="http://www.opensource.org/licenses/bsd-license.html">BSD license</link> is less restrictive: binary-only distributions are allowed. This is particularly attractive for embedded applications.
es_es: Linux está disponible bajo la <link xlink:href="http://www.fsf.org/copyleft/gpl.html">GNU General Public License </link>(GPL), que está diseñada para eliminar el software de código cerrado. En particular, cualquier trabajo derivado de un producto publicado bajo la GPL también debe suministrarse con el código fuente si se solicita. Por el contrario, la <link xlink:href="http://www.opensource.org/licenses/bsd-license.html">licencia BSD</link> es menos restrictiva: permite la distribución en forma exclusivamente binaria. Esto es particularmente atractivo para aplicaciones encastradas.
nl_nl: Linux is beschikbaar onder de <link xlink:href="http://www.fsf.org/copyleft/gpl.html">GNU General Public License</link> (GPL), welke ontwikkeld is om closed-source software te elimineren. In het bijzonder moet elk afgeleid werk van een product dat onder de GPL is vrijgegeven ook met de broncode geleverd worden indien dat gevraagd wordt. In tegenstelling hiermee is de <link xlink:href="http://www.opensource.org/licenses/bsd-license.html">BSD-licentie</link> minder beperkend: distributies met alleen binairen zijn toegestaan. Dit is in het bijzonder aantrekkelijk voor embedded applicaties.
pt_br: O Linux está disponível sob a <link xlink:href="http://www.fsf.org/copyleft/gpl.html">Licença Pública Geral GNU</link> (GPL), que é projetada para eliminar o software de código fechado. Em particular, qualquer trabalho derivado de um produto lançado sob a GPL também deve ser fornecido com o código fonte, se solicitado. Por outro lado, a <link xlink:href="http://www.opensource.org/licenses/bsd-license.html">licença BSD</link> é menos restritiva: é permitida a distribuição somente dos binários. O que é particularmente atraente para aplicativos embarcados.

source: What else should I know?
es_es: ¿Qué más debo saber?
nl_nl: Wat moet ik nog meer weten?
pt_br: O que mais eu deveria saber?

source: Since fewer applications are available for BSD than Linux, the BSD developers created a Linux compatibility package, which allows Linux programs to run under BSD. The package includes both kernel modifications, in order to correctly perform Linux system calls, and Linux compatibility files such as the C library. There is no noticeable difference in execution speed between a Linux application running on a Linux machine and a Linux application running on a BSD machine of the same speed.
es_es: Como hay menos aplicaciones disponibles para BSD que para Linux, los desarrolladores de BSD crearon un paquete de compatibilidad con Linux, que permite que los programas de Linux se ejecuten bajo BSD. El paquete incluye modificaciones del kernel para realizar correctamente las llamadas al sistema Linux y archivos de compatibilidad con Linux, como la biblioteca de C. No hay una diferencia notable en la velocidad de ejecución entre una aplicación Linux que se ejecuta en una máquina Linux y una aplicación Linux que se ejecuta en una máquina BSD de la misma velocidad.
nl_nl: Aangezien er minder applicaties beschikbaar zijn voor BSD dan voor Linux, hebben de ontwikkelaars van BSD een Linux-compatibiliteitspakket ontwikkeld, wat het mogelijk maakt om Linux-programma's onder BSD te draaien. Het pakket bevat zowel kernelwijzigingen, om Linux-systeemaanroepen correct uit te voeren, en Linux-compatibiliteitsbestanden zoals de C-bibliotheek. Er is geen merkbaar verschil in uitvoersnelheid tussen een Linux-applicatie die op een Linux-machine draait en een Linux-applicatie die op een BSD-machine die dezelfde snelheid heeft draait.
pt_br: Como menos aplicativos estão disponíveis para o BSD do que para o Linux, os desenvolvedores do BSD criaram um pacote de compatibilidade com o Linux, o qual permite que os programas Linux sejam executados sob o BSD. O pacote inclui tanto as modificações do kernel, necessárias para executar corretamente as chamadas do sistema Linux e quanto os arquivos de compatibilidade do Linux, como a biblioteca C. Não há diferença perceptível na velocidade de execução entre um aplicativo Linux em execução em uma máquina Linux nativa e um aplicativo Linux em execução em uma máquina BSD, contanto que ambas tenham o mesmo hardware.

source: The <quote>all from one supplier</quote> nature of BSD means that upgrades are much easier to handle than is frequently the case with Linux. BSD handles library version upgrades by providing compatibility modules for earlier library versions, so it is possible to run binaries which are several years old with no problems.
es_es: El modelo <quote>todo del mismo proveedor</quote> de BSD implica que las actualizaciones son mucho más sencillas de gestionar de lo que son con frecuencia en Linux. BSD maneja las actualizaciones de versiones de bibliotecas suministrando módulos de compatibilidad para versiones anteriores, de modo que es posible ejecutar binarios con varios años de antigüedad sin problemas.
nl_nl: De <quote>alles van één leverancier</quote>-natuur van BSD dat upgrades veel makkelijker af te handelen zijn dan dat vaak met Linux het geval is. BSD handelt upgrades aan bibliotheekversies af door compatibiliteitsmodulen voor eerdere bibliotheekversies aan te bieden, dus is het mogelijk om binairen die enige jaren oud zijn zonder problemen te draaien.
pt_br: A natureza do BSD de ser um sistema em que tudo é provido por <quote>um único fornecedor</quote> significa que as atualizações são muito mais fáceis de se lidar do que frequentemente ocorre no caso no Linux. O BSD lida com as atualizações das versões das bibliotecas fornecendo módulos de compatibilidade para as versões anteriores, portanto, é possível executar binários bastante antigos sem problemas.

source: Which should I use, BSD or Linux?
es_es: ¿Qué debo usar, BSD o Linux?
nl_nl: Wat zou ik moeten gebruiken, BSD of Linux?
pt_br: Qual devo usar, BSD ou Linux?

source: What does this all mean in practice? Who should use BSD, who should use Linux?
es_es: ¿Qué significa todo esto en la práctica? ¿Quién debería usar BSD, quién debería usar Linux?
nl_nl: Wat betekent dit allemaal in de praktijk? Wie zou BSD moeten gebruiken, en wie Linux?
pt_br: O que tudo isso significa na prática? Quem deve usar o BSD, quem deve usar o Linux?

source: This is a very difficult question to answer. Here are some guidelines:
es_es: Esta es una pregunta muy difícil de responder. Aquí hay algunas pautas:
nl_nl: Dit is een erg moeilijke vraag om te beantwoorden. Hier zijn wat richtlijnen:
pt_br: Esta é uma pergunta muito difícil de responder. Aqui estão algumas diretrizes:

source: <quote>If it ain't broke, don't fix it</quote>: If you already use an open source operating system, and you are happy with it, there is probably no good reason to change.
es_es: <quote>Si no está roto no lo arregles</quote>: Si ya usa un sistema operativo de código abierto y está satisfecho con él, probablemente no haya ninguna buena razón para cambiar.
nl_nl: <quote>If it ain't broke, don't fix it</quote>: als u al een open-source besturingssysteem gebruikt, en u er tevreden over bent, dan is er waarschijnlijk geen goede reden om over te stappen.
pt_br: <quote>Se não está quebrado, não conserte</quote>: Se você já usa um sistema operacional de código aberto e está feliz com ele, provavelmente não existe nenhuma razão para mudar.

source: BSD systems, in particular FreeBSD, can have notably higher performance than Linux. But this is not across the board. In many cases, there is little or no difference in performance. In some cases, Linux may perform better than FreeBSD.
es_es: Los sistemas BSD, especialmente FreeBSD, pueden proporcionar un rendimiento notablemente superior que Linux, pero esto no es una ley inmutable. En muchos casos no hay diferencia de rendimiento o esta es muy pequeña. En algunos casos Linux podría tener un rendimiento mejor que FreeBSD.
nl_nl: BSD-systemen, in het bijzonder FreeBSD, kunnen merkbaar beter presteren dan Linux. Maar dit geldt niet voor alles. In veel gevallen zijn er weinig of geen prestatieverschillen. In sommige gevallen kan Linux beter presteren dan FreeBSD.
pt_br: Os sistemas BSD, em particular o FreeBSD, podem ter um desempenho notavelmente superior ao Linux. Mas isto não é uma verdade absoluta. Em muitos casos, há pouca ou nenhuma diferença no desempenho. E em alguns casos, o Linux pode ter um desempenho melhor que o FreeBSD.

source: In general, BSD systems have a better reputation for reliability, mainly as a result of the more mature code base.
es_es: En general los sistemas BSD gozan de una mejor reputación en cuanto a confiabilidad, principalmente por la mayor madurez de su código base.
nl_nl: In het algemeen hebben BSD-systemen een betere naam qua betrouwbaarheid, voornamelijk als het resultaat van een volwassenere codebase.
pt_br: Em geral, os sistemas BSD têm a reputação de oferecer uma melhor confiabilidade, principalmente como resultado de ter uma base de código mais madura.

source: BSD projects have a better reputation for the quality and completeness of their documentation. The various documentation projects aim to provide actively updated documentation, in many languages, and covering all aspects of the system.
es_es: Los proyectos BSD tienen una mejor reputación por la calidad y la integridad de su documentación. Los diversos proyectos de documentación tienen como objetivo proporcionar documentación actualizada activamente, en muchos idiomas, y que cubra todos los aspectos del sistema.
nl_nl: BSD-projecten hebben een betere naam qua kwaliteit en volledigheid van hun documentatie. De verschillende documentatieprojecten richten zich op het bieden van actief bijgewerkte documentatie, in vele talen, en op het behandelen van alle aspecten van het systeem.
pt_br: Os projetos BSD têm uma reputação melhor pela qualidade e completude da sua documentação. Os vários projetos de documentação visam fornecer uma documentação que é atualizada constantemente, disponibilizada em muitos idiomas, e que cobre todos os aspectos do sistema.

source: The BSD license may be more attractive than the GPL.
es_es: La licencia BSD puede resultar más atractiva que la GPL.
nl_nl: De BSD-licentie kan aantrekkelijker zijn dan de GPL.
pt_br: A licença BSD pode ser mais atraente que a GPL.

source: BSD can execute most Linux binaries, while Linux can not execute BSD binaries. Many BSD implementations can also execute binaries from other <trademark class="registered">UNIX</trademark> like systems. As a result, BSD may present an easier migration route from other systems than Linux would.
es_es: BSD puede ejecutar la mayoría de los binarios de Linux, mientras que Linux no puede ejecutar los binarios de BSD. Muchas implementaciones de BSD también pueden ejecutar binarios desde otros sistemas similares a <trademark class="registered">UNIX</trademark>. Como resultado, BSD puede presentar una ruta de migración más fácil desde otros sistemas que Linux.
nl_nl: BSD kan de meeste Linux-binairen uitvoeren, terwijl Linux geen BSD-binairen kan uitvoeren. Vele implementaties van BSD kunnen ook binairen van andere <trademark class="registered">UNIX</trademark>-achtige systemen uitvoeren. Als gevolg kan BSD een eenvoudigere migratieroute zijn van andere systemen dan dat Linux zou zijn.
pt_br: O BSD pode executar a maioria dos binários do Linux, já o Linux por sua vez não pode executar binários do BSD. Muitas implementações do BSD também podem executar binários de outros sistemas semelhantes ao <trademark class="registered">UNIX</trademark>. Como resultado, pode ser mais fácil migrar de outros sistemas para o BSD do que seria migrar para o Linux.

source: Who provides support, service, and training for BSD?
es_es: ¿Quién proporciona soporte, servicio y formación orientada a BSD?
nl_nl: Wie biedt ondersteuning, diensten, en training voor BSD aan?
pt_br: Quem fornece suporte, serviços e treinamento para o BSD?

source: BSDi / <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link> have been providing support contracts for FreeBSD for nearly a decade.
es_es: BSDi / <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link> ha estado proporcionando contratos de soporte para FreeBSD durante casi una década.
nl_nl: BSDi / <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall Inc.</link> bieden sinds bijna een decennium ondersteuningscontracten aan voor FreeBSD.
pt_br: A BSDi / <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link> fornece contratos de suporte para o FreeBSD já há quase uma década.

source: In addition, each of the projects has a list of consultants for hire: <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">FreeBSD</link>, <link xlink:href="http://www.netbsd.org/gallery/consultants.html">NetBSD</link>, and <link xlink:href="http://www.openbsd.org/support.html">OpenBSD</link>.
es_es: Además, cada uno de los proyectos tiene una lista de consultores para contratar: <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">FreeBSD</link>, <link xlink:href="http://www.netbsd.org/gallery/consultants.html">NetBSD</link> y <link xlink:href="http://www.openbsd.org/support.html">OpenBSD</link>.
nl_nl: Verder heeft elk project een lijst van in te huren consultants: <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">FreeBSD</link>, <link xlink:href="http://www.netbsd.org/gallery/consultants.html">NetBSD</link>, en <link xlink:href="http://www.openbsd.org/support.html">OpenBSD</link>.
pt_br: Além disso, o website de cada um dos projetos possui uma lista de consultores disponíveis para contratação: <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">FreeBSD</link>, <link xlink:href="http://www.netbsd.org/gallery/consultants.html">NetBSD</link>, and <link xlink:href="http://www.openbsd.org/support.html">OpenBSD</link>.

source: $FreeBSD: head/en_US.ISO8859-1/articles/explaining-bsd/article.xml 51926 2018-06-29 07:33:14Z eadler $
es_es: $FreeBSD$

source: In the open source world, the word <quote>Linux</quote> is almost synonymous with <quote>Operating System</quote>, but it is not the only open source <trademark class="registered">UNIX</trademark> operating system.
es_es: En el mundo del código abierto, la palabra <quote>Linux</quote> es casi un sinónimo de <quote>Sistema Operativo</quote>, pero no es el único sistema operativo de código abierto <trademark class="registered">UNIX</trademark>.
pt_br: No mundo do código aberto, a palavra <quote>Linux</quote> é praticamente sinônimo de <quote>Sistema Operacional</quote>, mas ele não é o único sistema operacional <trademark class="registered">UNIX</trademark> de código aberto.

source: In 1992, AT&amp;T sued <link xlink:href="http://www.bsdi.com/">BSDI</link>, the vendor of BSD/386, alleging that the product contained AT&amp;T-copyrighted code. The case was settled out of court in 1994, but the spectre of the litigation continues to haunt people. In March 2000 an article published on the web claimed that the court case had been <quote>recently settled</quote>.
es_es: En 1992 AT&amp;T denunció a <link xlink:href="http://www.bsdi.com/">BSDI</link>, el distribuidor de BSD/386, alegando que el producto contenía código propiedad de AT&amp;T. El caso se resolvió fuera de los tribunales en 1994, pero el espectro del litigio sigue atormentando a las personas. En marzo de 2000, un artículo publicado en la web afirmaba que el caso judicial había sido <quote>resuelto recientemente</quote>.
pt_br: Em 1992 a AT&amp;T processou a <link xlink:href="http://www.bsdi.com/">BSDI</link>, que comercializava o BSD/386, alegando que o produto continha código protegido por direitos autorais da AT&amp;T. O caso foi encerrado fora dos tribunais em 1994, mas o fantasma do litígio continua assombrando. Em março de 2000 um artigo publicado na web afirma que o caso foi <quote>recentemente encerrado</quote>.
