Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/explaining-bsd/*.po
Languages: es_es, nl_nl, pt_br

# _
source: translator-credits
es_es: José Ramón Baz jr_baz@hartu.net José Vicente Carrasco carvay@es.FreeBSD.org Sergio Carlavilla carlavilla@mailbox.org, 2019
nl_nl: vertaling
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Rafael Mentz Aquino, rafael@lk6.com.br, 2018

source: Explaining BSD
es_es: Explicando BSD
nl_nl: Uitleg over BSD
pt_br: Explicando o BSD

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
nl_nl: FreeBSD is een geregistreerd handelsmerk van de FreeBSD Foundation.

source: AMD, AMD Athlon, AMD Opteron, AMD Phenom, AMD Sempron, AMD Turion, Athlon, Élan, Opteron, and PCnet are trademarks of Advanced Micro Devices, Inc.
nl_nl: AMD, AMD Athlon, AMD Opteron, Athlon, Élan, Opteron, en PCnet zijn handelsmerken van Advanced Micro Devices, Inc.

source: Apple, AirPort, FireWire, iMac, iPhone, iPad, Mac, Macintosh, Mac OS, Quicktime, and TrueType are trademarks of Apple Inc., registered in the U.S. and other countries.
nl_nl: Apple, AirPort, FireWire, Mac, Macintosh, Mac OS, Quicktime, en TrueType zijn handelsmerken van Apple Computer, Inc., geregistreerd in de Verenigde Staten en andere landen.

source: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, and Xeon are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries.
nl_nl: Intel, Celeron, EtherExpress, i386, i486, Itanium, Pentium, en Xeon zijn handelsmerken of geregistreerde handelsmerken van Intel Corporation of haar dochterondernemingen in de Verenigde Staten en andere landen.

source: Linux is a registered trademark of Linus Torvalds.
nl_nl: Linux is een geregistreerd handelsmerk van Linus Torvalds.

source: Motif, OSF/1, and UNIX are registered trademarks and IT DialTone and The Open Group are trademarks of The Open Group in the United States and other countries.
nl_nl: Motif, OSF/1, en UNIX zijn geregistreerde handelsmerken en IT DialTone en The Open Group zijn handelsmerken van The Open Group in de Verenigde Staten en andere landen.

source: SPARC, SPARC64, and UltraSPARC are trademarks of SPARC International, Inc in the United States and other countries. SPARC International, Inc owns all of the SPARC trademarks and under licensing agreements allows the proper use of these trademarks by its members.
nl_nl: SPARC, SPARC64, en UltraSPARC zijn handelsmerken van SPARC International, Inc. in de Verenigde Staten en andere landen. SPARC International, Inc. bezit alle handelsmerken van SPARC en staat onder licentie het juiste gebruik van deze handelsmerken toe door zijn leden.

source: Sun, Sun Microsystems, Java, Java Virtual Machine, JDK, JRE, JSP, JVM, Netra, OpenJDK, Solaris, StarOffice, SunOS and VirtualBox are trademarks or registered trademarks of Sun Microsystems, Inc. in the United States and other countries.
nl_nl: Sun, Sun Microsystems, Java, Java Virtual Machine, JDK, JRE, JSP, JVM, Netra, OpenJDK, Solaris, StarOffice, SunOS en VirtualBox zijn handelsmerken of geregistreerde handelsmerken van Sun Microsystems, Inc. in de Verenigde Staten en andere landen.

source: UNIX is a registered trademark of The Open Group in the United States and other countries.
nl_nl: UNIX is een geregistreerd handelsmerk van The Open Group in de Verenigde Staten en andere landen.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
nl_nl: Veel van de termen die door fabrikanten en verkopers worden gebruikt om hun producten te onderscheiden worden geclaimd als handelsmerk. Op de plaatsen waar deze handelsmerken in dit document voorkomen, en het FreeBSD Project op de hoogte was van de claim op het handelsmerk, worden de termen gevolgd door het symbool <quote>™</quote> of het symbool <quote>®</quote>.

source: In the open source world, the word <quote>Linux</quote> is almost synonymous with <quote>Operating System</quote>, but it is not the only open source <trademark class="registered">UNIX</trademark> operating system. According to the <link xlink:href="http://www.leb.net/hzo/ioscount/data/r.9904.txt">Internet Operating System Counter</link>, as of April 1999 31.3% of the world's network connected machines run Linux. 14.6% run BSD <trademark class="registered">UNIX</trademark>. Some of the world's largest web operations, such as <link xlink:href="http://www.yahoo.com/">Yahoo!</link>, run BSD. The world's busiest FTP server of 1999 (now defunct), <link xlink:href="ftp://ftp.cdrom.com/">ftp.cdrom.com</link>, used BSD to transfer 1.4 TB of data a day. Clearly this is not a niche market: BSD is a well-kept secret.
nl_nl: In de open-source wereld is het woord <quote>Linux</quote> bijna een synoniem van <quote>besturingssysteem</quote>, maar het is niet het enige open-source <trademark class="registered">UNIX</trademark> besturingssysteem. Volgens de <link xlink:href="http://www.leb.net/hzo/ioscount/data/r.9904.txt">Internet Operating System Counter</link>, draait sinds april 1999 31.3% van de machines op de wereld die met een netwerk verbonden zijn Linux. 14.6% draait BSD <trademark class="registered">UNIX</trademark>. Sommige van 's werelds grootste webinstallaties, zoals <link xlink:href="http://www.yahoo.com/">Yahoo!</link>, draaien BSD. De drukste FTP-server van de wereld van 1999 (nu buiten werking), <link xlink:href="ftp://ftp.cdrom.com/">ftp.cdrom.com</link>, gebruikte BSD om 1.4 TB aan gegevens per dag over te brengen. Het is duidelijk dat dit geen nichemarkt is: BSD is een goed bewaard geheim.

source: So what is the secret? Why is BSD not better known? This white paper addresses these and other questions.
es_es: ¿Así que cuál es el secreto? ¿Por qué BSD no es más conocido? Este artículo trata sobre esa y otras cuestiones.
nl_nl: Dus wat is het geheim? Waarom is BSD niet bekender? Dit artikel behandelt deze en andere vragen.
pt_br: Então, qual é o segredo? Por que o BSD não é mais conhecido? Este artigo aborda esta e outras questões.

source: Throughout this paper, differences between BSD and Linux will be noted <emphasis>like this</emphasis>.
es_es: A lo largo de este documento, las diferencias entre BSD y Linux se <emphasis>mostrarán en cursiva</emphasis>.
nl_nl: >In dit artikel zullen verschillen tussen BSD en Linux <emphasis>zo</emphasis> worden aangegeven.
pt_br: Ao longo deste artigo as diferenças entre o BSD e o Linux serão destacadas <emphasis>desta forma</emphasis>.

source: What is BSD?
es_es: ¿Qué es BSD?
nl_nl: Wat is BSD?
pt_br: O que é o BSD?

source: BSD stands for <quote>Berkeley Software Distribution</quote>. It is the name of distributions of source code from the University of California, Berkeley, which were originally extensions to AT&amp;T's Research <trademark class="registered">UNIX</trademark> operating system. Several open source operating system projects are based on a release of this source code known as 4.4BSD-Lite. In addition, they comprise a number of packages from other Open Source projects, including notably the GNU project. The overall operating system comprises:
es_es: BSD significa <quote>Berkeley Software Distribution</quote>. Es el nombre de las distribuciones de código fuente de la Universidad de California, Berkeley, que originalmente eran extensiones del sistema operativo <trademark class="registered">UNIX</trademark> de AT&amp;T Research. Varios proyectos de sistemas operativos de código abierto tienen su origen en una distribución de éste código conocida como 4.4BSD-Lite. Además, comprenden una serie de paquetes de otros proyectos de código abierto, incluido especialmente el proyecto GNU. El sistema operativo completo incluye:
nl_nl: BSD is een afkorting van <quote>Berkeley Software Distribution</quote>. Het is de naam van broncodedistributies van de universiteit van California te Berkeley, wat origineel uitbreidingen waren van het besturingssysteem <trademark class="registered">UNIX</trademark> van AT&amp;T Research. Verschillende projecten over open-source besturingssystemen zijn gebaseerd op een uitgave van deze broncode die bekend staat als 4.4BSD-Lite. Ze omvatten ook een aantal pakketten van andere open-source projecten, opmerkelijk genoeg onder andere van het GNU-project. Het besturingssysteem in het geheel omvat:
pt_br: BSD é a sigla para <quote>Berkeley Software Distribution</quote>. É o nome do código fonte distribuído pela Universidade da Califórnia, Berkeley, que era originalmente uma extensão do <trademark class="registered">UNIX</trademark> desenvolvido pela área de pesquisa da AT&amp;T. Diversos projetos de sistemas operacionais de código aberto foram baseados em uma versão deste código, conhecido como 4.4BSD-Lite. Além disso, eles incluem vários pacotes de outros projetos de código aberto, com destaque para os do projeto GNU. O sistema operacional geralmente abrange:

source: The BSD kernel, which handles process scheduling, memory management, symmetric multi-processing (SMP), device drivers, etc.
es_es: El kernel BSD, que se encarga de la programación de procesos, la gestión de la memoria, el multiprocesamiento simétrico (SMP), los controladores de dispositivos, etc.
nl_nl: De BSD-kernel, die proces-scheduling, geheugenbeheer, symmetrische multi-processing (SMP), apparaatstuurprogramma's, etcetera afhandelt.
pt_br: O kernel BSD, que lida com o agendamento de processos, gerenciamento de memória, multi processamento simétrico (symmetric multi-processing ou SMP), drivers de dispositivos, etc.

source: <emphasis>Unlike the Linux kernel, there are several different BSD kernels with differing capabilities.</emphasis>
nl_nl: <emphasis>In tegenstelling tot de Linux-kernel zijn er een aantal verschillende BSD-kernels met verschillende mogelijkheden.</emphasis>

source: The C library, the base API for the system.
es_es: La biblioteca C, la API base del sistema.
nl_nl: De C-bibliotheek, de basis-API voor het systeem.
pt_br: A biblioteca C, a API base do sistema.

source: <emphasis>The BSD C library is based on code from Berkeley, not the GNU project.</emphasis>
es_es: <emphasis>La biblioteca C de BSD está basada en código procedente de Berkeley, no del proyecto GNU.</emphasis>
nl_nl: <emphasis>De C-bibliotheek van BSD is gebaseerd op code van Berkeley, niet van het GNU-project.</emphasis>
pt_br: <emphasis>A biblioteca C do BSD é baseada no código de Berkeley, não no projeto GNU.</emphasis>

source: Utilities such as shells, file utilities, compilers and linkers.
es_es: Utilidades como shells, utilidades de archivos, compiladores y enlazadores.
nl_nl: Gereedschappen zoals shells, bestandsgereedschappen, compilers en linkers.
pt_br: Utilitários como shells, gerenciadores de arquivos, compiladores e linkers (conversores de arquivos compilados em executáveis).

source: <emphasis>Some of the utilities are derived from the GNU project, others are not.</emphasis>
es_es: <emphasis>Algunas de las utilidades derivan del proyecto GNU, otras no.</emphasis>
nl_nl: <emphasis>Sommige gereedschappen zijn afgeleid van het GNU-project, andere niet.</emphasis>
pt_br: <emphasis>Alguns utilitários são derivados do projeto GNU, outros não são.</emphasis>

source: The X Window system, which handles graphical display.
es_es: El sistema X Window, que gestiona el entorno gráfico.
nl_nl: Het X Window-systeem, wat grafisch afbeelden afhandelt.
pt_br: O sistema X Window, que gerencia a interface gráfica.

source: The X Window system used in most versions of BSD is maintained by the <link xlink:href="http://www.X.org/">X.Org project</link>. FreeBSD allows the user to choose from a variety of desktop environments, such as <application>Gnome</application>, <application>KDE</application>, or <application>Xfce</application>; and lightweight window managers like <application>Openbox</application>, <application>Fluxbox</application>, or <application>Awesome</application>.
es_es: El sistema X Window utilizado en la mayoría de las versiones de BSD es mantenido por el <link xlink:href="http://www.X.org/">proyecto X.Org</link>. FreeBSD permite al usuario elegir entre una variedad de entornos de escritorio, como <application>Gnome</application>, <application>KDE</application> o <application>Xfce</application>; y administradores de ventanas ligeros como <application>Openbox</application>, <application>Fluxbox</application> o <application>Awesome</application>.
nl_nl: Het X Window-systeem dat in de meeste versies van BSD wordt gebruikt wordt onderhouden door het <link xlink:href="http://www.X.org/">X.Org project</link>. FreeBSD staat de gebruiker toe om te keizen uit verschillende bureaubladen, zoals <application>GNOME</application>, <application>KDE</application> of <application>Xfce</application>; en lichtgewicht vensterbeheerders zoals <application>Openbox</application>, <application>Fluxbox</application> of <application>Awesome</application>.
pt_br: O sistema X Window usado na maioria das versões do BSD é mantido pelo <link xlink:href="http://www.X.org/">Projeto X.Org</link>. O FreeBSD permite ao usuário escolher a partir de uma variedade de ambientes de desktop, tais como o <application>Gnome</application>, <application>KDE</application>, ou <application>Xfce</application>; e gerenciadores gráficos (gerenciadores de janelas) mais leves, como <application>Openbox</application>, <application>Fluxbox</application>, ou <application>Awesome</application>.

source: Many other programs and utilities.
es_es: Muchos otros programas y utilidades.
nl_nl: Vele andere programma's en gereedschappen.
pt_br: Diversos outros programas e utilitários.

source: What, a real <trademark class="registered">UNIX</trademark>?
es_es: ¿Qué, un verdadero <trademark class="registered">UNIX</trademark>?
nl_nl: Wat, een echte <trademark class="registered">UNIX</trademark>?
pt_br: O que, um verdadeiro <trademark class="registered">UNIX</trademark>?

source: The BSD operating systems are not clones, but open source derivatives of AT&amp;T's Research <trademark class="registered">UNIX</trademark> operating system, which is also the ancestor of the modern <trademark class="registered">UNIX</trademark> System V. This may surprise you. How could that happen when AT&amp;T has never released its code as open source?
es_es: Los sistemas operativos BSD no son clones, sino derivados de código abierto del sistema operativo AT&amp;T's Research <trademark class="registered">UNIX</trademark>, el cual es a su vez ancestro del moderno <trademark class="registered">UNIX</trademark> System V. Esto puede sorprenderle. ¿Cómo puede haber sucedido si AT&amp;T jamás liberó su código?
nl_nl: De BSD-besturingssystemen zijn geen klonen, maar open-source afgeleiden van AT&amp;T's Research <trademark class="registered">UNIX</trademark> besturingssysteem, wat ook de voorouder is van het moderne <trademark class="registered">UNIX</trademark> System V. Dit kan als een verrassing komen. Hoe kon dit gebeuren als AT&amp;T nooit zijn code als open-source heeft uitgegeven?
pt_br: Os sistemas operacionais BSD não são cópias ou clones, mas sim derivações de código aberto do sistema operacional <trademark class="registered">UNIX</trademark> da AT&amp;T, que também é o ancestral do moderno <trademark class="registered">UNIX</trademark> System V. Isto pode surpreendê-lo. Como isto é possível, uma vez que a AT&amp;T nunca liberou seu código como código aberto?

source: It is true that AT&amp;T <trademark class="registered">UNIX</trademark> is not open source, and in a copyright sense BSD is very definitely <emphasis>not</emphasis> <trademark class="registered">UNIX</trademark>, but on the other hand, AT&amp;T has imported sources from other projects, noticeably the Computer Sciences Research Group (CSRG) of the University of California in Berkeley, CA. Starting in 1976, the CSRG started releasing tapes of their software, calling them <emphasis>Berkeley Software Distribution</emphasis> or <emphasis>BSD</emphasis>.
es_es: Cierto es que AT&amp;T <trademark class="registered">UNIX</trademark> no es código abierto y que en sentido estricto del copyright BSD no es <emphasis>en absoluto</emphasis> <trademark class="registered">UNIX</trademark>, pero por otra parte AT&amp;T incluyó código fuente de otros proyectos, teniendo como caso notable el Computer Sciences Research Group (CSRG) de la Universidad de California en Berkeley, CA. A partir de 1976, el CSRG comenzó a lanzar cintas de su software, llamándolas <emphasis>Berkeley Software Distribution</emphasis> o <emphasis>BSD</emphasis>.
nl_nl: Het is waar dat AT&amp;T <trademark class="registered">UNIX</trademark> niet open-source is, en wat betreft copyright is BSD zeer zeker <emphasis>niet</emphasis> <trademark class="registered">UNIX</trademark>, maar van de andere kant heeft AT&amp;T bronnen geïmporteerd van andere projecten, nota bene de Computer Science Research Group (CSRG) van de University of California in Berkeley, CA. In 1976 is de CSRG begonnen met het uitgeven van tapes van hun software, die ze <emphasis>Berkeley Software Distribution</emphasis> of <emphasis>BSD</emphasis> noemden.
pt_br: É verdade que o <trademark class="registered">UNIX</trademark> da AT&amp;T não é um sistema de código aberto e no sentido de licenciamento o BSD definitivamente <emphasis>não é</emphasis> <trademark class="registered">UNIX</trademark>, mas por outro lado a AT&amp;T importou fontes de outros projetos, principalmente do Grupo de Pesquisa de Ciências da Computação (Computer Sciences Research Group ou CSRG) da Universidade da Califórnia em Berkeley, CA. A partir de 1976, o CSRG começou a liberar fitas de seu software, chamando ele de <emphasis>Berkeley Software Distribution</emphasis> ou <emphasis>BSD</emphasis>.

source: Initial BSD releases consisted mainly of user programs, but that changed dramatically when the CSRG landed a contract with the Defense Advanced Research Projects Agency (DARPA) to upgrade the communications protocols on their network, ARPANET. The new protocols were known as the <emphasis>Internet Protocols</emphasis>, later <emphasis>TCP/IP</emphasis> after the most important protocols. The first widely distributed implementation was part of 4.2BSD, in 1982.
es_es: Las versiones iniciales de BSD consistían principalmente en programas de usuario, pero cambió drásticamente cuando el CSRG consiguió un contrato con el Defense Advanced Research Projects Agency (DARPA) para actualizar los protocolos de comunicaciones en su red, ARPANET. Los nuevos protocolos fueron conocidos como <emphasis>Internet Protocols</emphasis>, más adelante <emphasis>TCP/IP</emphasis> y más tarde se covertirían en los protocolos más importantes. La primera implementación ampliamente distribuida fue parte de 4.2BSD, en 1982.
nl_nl: Initiële BSD-uitgaven bestonden grotendeels uit gebruikersprogramma's, maar dat veranderde enorm toen CSRG in een contract belandde met het Defense Advanced Research Projects Agency (DARPA) om de communicatieprotocollen in hun netwerk, ARPANET, te vernieuwen. De nieuwe protocollen stonden bekend als <emphasis>Internet Protocols</emphasis>, later <emphasis>TCP/IP</emphasis> na de belangrijkste protocollen. De eerste wijdverbreide implementatie die gedistribueerd werd was deel van 4.2BSD, in 1982.
pt_br: As primeiras distribuições do BSD consistiam principalmente em programas de usuários mas isso mudou radicalmente quando o CSRG firmou um contrato com a Agência de Pesquisa de Projetos de Defesa Avançados (Defense Advanced Research Projects Agency ou DARPA) para atualizar os protocolos de comunicação de sua rede, a ARPANET. Os novos protocolos ficaram conhecidos como <emphasis>Internet Protocols</emphasis>, posteriormente <emphasis>TCP/IP</emphasis> em virtude dos protocolos mais importantes. A primeira implementação amplamente distribuída foi parte do 4.2BSD, em 1982.

source: In the course of the 1980s, a number of new workstation companies sprang up. Many preferred to license <trademark class="registered">UNIX</trademark> rather than developing operating systems for themselves. In particular, Sun Microsystems licensed <trademark class="registered">UNIX</trademark> and implemented a version of 4.2BSD, which they called <trademark>SunOS</trademark>. When AT&amp;T themselves were allowed to sell <trademark class="registered">UNIX</trademark> commercially, they started with a somewhat bare-bones implementation called System III, to be quickly followed by System V. The System V code base did not include networking, so all implementations included additional software from the BSD, including the TCP/IP software, but also utilities such as the <emphasis>csh</emphasis> shell and the <emphasis>vi</emphasis> editor. Collectively, these enhancements were known as the <emphasis>Berkeley Extensions</emphasis>.
es_es: Durante la década de los 80 comienzan a surgir compañías que ofrecían estaciones de trabajo. Muchas preferían obtener licencias de <trademark class="registered">UNIX</trademark> en lugar de desarrollar sistemas operativos por sí mismas. En particular, Sun Microsystems adquirió una licencia de <trademark class="registered">UNIX</trademark> e implementó una versión de 4.2BSD, que denominaron <trademark>SunOS</trademark>. Cuando la propia AT&amp;T fue autorizada para vender <trademark class="registered">UNIX</trademark> comercialmente, iniciaron una implementación un tanto rudimentaria llamada System III, seguida rápidamente por System V. El código base de System V no incluía el soporte de red, por lo que todas las implementaciones incluían software adicional de BSD, incluido el software TCP/IP, pero también utilidades como el shell <emphasis>csh</emphasis> y el editor <emphasis>vi</emphasis>. En conjunto, estas mejoras se conocían como las <emphasis>Berkeley Extensions</emphasis>.
nl_nl: In de loop van de jaren 80 ontsproten er een aantal nieuwe werkstationbedrijven. Vele verkozen het om <trademark class="registered">UNIX</trademark> te licenseren boven het ontwikkelen van hun eigen besturingssystemen. In het bijzonder licenseerde Sun Microsystems <trademark class="registered">UNIX</trademark> en implementeerde het een versie van 4.2BSD, wat ze <trademark>SunOS</trademark> noemden. Toen AT&amp;T zelf <trademark class="registered">UNIX</trademark> commercieel mocht verkopen, begonnen ze met een ietwat kale basisimplementatie genaamd System III, die snel gevolgd werd door System V. De codebase van System V bevatte geen netwerkcode, dus bevatten alle implementaties aanvullende software van de BSD, waaronder de TCP/IP-software, maar ook gereedschappen zoals de <emphasis>csh</emphasis>-shell en de tekstverwerker <emphasis>vi</emphasis>. Deze uitbreidingen stonden gezamenlijk bekend als de <emphasis>Berkeley Extensions</emphasis>.
pt_br: Durante a década de 80 surgiram muitas empresas produtoras de estações de trabalho. A maioria preferiu licenciar o <trademark class="registered">UNIX</trademark> ao invés de desenvolver seus próprios sistemas operacionais. Em particular, a Sun Microsystems licenciou o <trademark class="registered">UNIX</trademark> e implementou uma versão do 4.2BSD, a qual eles chamaram de <trademark>SunOS</trademark>. Quando a própria AT&amp;T começou a comercializar o <trademark class="registered">UNIX</trademark>, eles começaram com uma implementação de certa forma simples chamada de System III, que logo transformou-se no System V. O código base do System V não incluía comunicação em rede, então todas as implementações incluíram software adicional do BSD, inclusive o software TCP/IP, e também utilitários como o shell <emphasis>csh</emphasis> e o editor <emphasis>vi</emphasis>. Estes aprimoramentos ficaram conhecidos como <emphasis>Berkeley Extensions</emphasis>.
