Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/explaining-bsd/*.po
Languages: es_es, nl_nl, pt_br

source: It is at the individual committer's discretion whether they should obtain authority before committing changes to the source tree. In general, an experienced committer may make changes which are obviously correct without obtaining consensus. For example, a documentation project committer may correct typographical or grammatical errors without review. On the other hand, developers making far-reaching or complicated changes are expected to submit their changes for review before committing them. In extreme cases, a core team member with a function such as Principal Architect may order that changes be removed from the tree, a process known as <firstterm>backing out</firstterm>. All committers receive mail describing each individual commit, so it is not possible to commit secretly.
es_es: Depende del criterio individual de cada committer cuándo pedir autorización antes de hacer cambios en el árbol de fuentes. En general, un committer experimentado puede realizar cambios que obviamente son correctos sin obtener consenso. Por ejemplo, un committer que trabaje en un proyecto de documentación puede corregir errores tipográficos o gramaticales sin necesidad de revisión. Por otra parte, se espera que los desarrolladores que pretendan realizar cambios de gran calado o complicados envíen sus cambios para que sean revisados antes de ser incluidos. En casos extremos un miembro del core team con una función como la del Principal Architect puede ordenar que los cambios sean retirados del árbol, es lo que llamamos <firstterm>backing out</firstterm>. Todos los committers reciben un correo electrónico que describe cada commit, por lo que no es posible hacer un commit en secreto.
nl_nl: Het is aan de discretie van de individuele committer of hij instemming moet krijgen voordat er veranderingen naar de broncodeboom worden gecommit. In het algemeen mag een ervaren committer veranderingen maken waarvan duidelijk is dat ze correct zijn zonder hiervoor consensus te verkrijgen. Een committer van het documentatieproject bijvoorbeeld mag typografische of grammaticale fouten verbeteren zonder dat deze herzien worden. Van de andere kant wordt van ontwikkelaars die verreikende of gecompliceerde veranderingen maken verwacht dat ze hun veranderingen ter herziening insturen voordat ze deze committen. In het uiterste geval kan een lid van het coreteam met een functie als Principal Architect eisen dat de veranderingen uit de boom verwijderd worden, een proces dat bekend staat als <firstterm>backing out</firstterm>. Alle committers ontvangen email die elke individuele commit beschrijft, het is dus niet mogelijk om heimelijk te committen.
pt_br: Fica a critério do bom senso individual de cada committer a decisão se eles devem obter ou não um consenso antes de enviar alterações para o repositório de código fonte. Em geral, um committer experiente pode fazer alterações que sejam inquestionavelmente corretas sem obter consenso. Por exemplo, um committer do projeto de documentação pode corrigir erros tipográficos ou gramaticais sem revisão. Por outro lado, espera-se que os desenvolvedores que realizam mudanças complexas ou muito extensas enviem suas alterações para revisão antes de enviá-las para o repositório de código fonte. Em casos extremos, um membro do Core Team com uma função tal como a de arquiteto principal, pode ordenar que as alterações sejam removidas do repositório, num processo conhecido como <firstterm>backing out</firstterm>. Todos os committers recebem emails que descrevem cada commit individual, portanto não é possível enviar alterações para o repositório de código fonte em segredo.

source: The <firstterm>Core team</firstterm>. FreeBSD and NetBSD each have a core team which manages the project. The core teams developed in the course of the projects, and their role is not always well-defined. It is not necessary to be a developer in order to be a core team member, though it is normal. The rules for the core team vary from one project to the other, but in general they have more say in the direction of the project than non-core team members have.
es_es: El <firstterm>Core team</firstterm>. Tanto FreeBSD como NetBSD disponen de un core team que administra el proyecto. Los core teams dirigen el rumbo de los proyectos pero sus funciones no siempre están claras. No es necesario ser desarrollador para ser un miembro del core team pero suele ser lo habitual. Las normas del core team varían de un proyecto a otro, pero en general tienen más voz en la dirección del proyecto que los miembros del equipo que no son del Core.
nl_nl: Het <firstterm>Coreteam</firstterm>. FreeBSD en NetBSD hebben elk een coreteam dat het project beheert. De coreteams zijn in de loop van de projecten ontstaan, en hun rol is niet altijd eenduidig gedefinieerd. Het is niet nodig om ontwikkelaar te zijn om lid te zijn van het coreteam, hoewel het normaal is. De regels voor het coreteam verschillen per project, maar in het algemeen hebben ze een grotere inspraak in de richting van het project dan niet-leden van het coreteam hebben.
pt_br: O <firstterm>Core Team</firstterm>. O FreeBSD e o NetBSD possuem uma equipe principal (Core team) que gerenciam o projeto. As equipes principais evoluíram ao longo dos projeto e a sua função nem sempre está bem definida. Não é necessário ser um desenvolvedor para ser um membro da equipe principal, embora isto seja normal. As regras para a equipe principal variam de um projeto para o outro, mas no geral elas têm mais voz ativa sobre a direção do projeto do que os demais membros tem.

source: This arrangement differs from Linux in a number of ways:
es_es: Esta gestión difiere de la de Linux en algunos aspectos:
nl_nl: Deze opstelling verschilt in een aantal opzichten van die van Linux:
pt_br: Esse arranjo difere do Linux de várias maneiras:

source: No one person controls the content of the system. In practice, this difference is overrated, since the Principal Architect can require that code be backed out, and even in the Linux project several people are permitted to make changes.
es_es: Ninguna persona controla el contenido del sistema. En la práctica eso es muy relativo, ya que el Principal Architect puede requerir que el código sea retirado, e incluso en el proyecto Linux a ciertas personas les está permitido hacer cambios.
nl_nl: Geen enkel persoon heerst over de inhoud van het systeem. In de praktijk is dit verschil overdreven, aangezien de Principal Architect kan eisen dat code gebacked-out wordt, en zelfs in het Linux-project mogen meerdere mensen veranderingen maken.
pt_br: Ninguém controla o conteúdo do sistema. Na prática, essa diferença é superestimada, uma vez que o arquiteto principal pode exigir que o código seja removido ou substituído, e mesmo no projeto Linux, várias pessoas podem fazer alterações.

source: On the other hand, there <emphasis>is</emphasis> a central repository, a single place where you can find the entire operating system sources, including all older versions.
es_es: Por otro lado, <emphasis>hay</emphasis> un repositorio central, un único lugar donde se pueden encontrar las fuentes de todo el sistema operativo, incluidas todas las versiones anteriores.
nl_nl: Van de andere kant <emphasis>is</emphasis> er een centraal repository, een enkele plaats waar u de gehele broncode van het besturingssysteem kunt vinden, inclusief alle oudere versies.
pt_br: Por outro lado, <emphasis>existe</emphasis> um repositório central, um lugar único no qual você pode encontrar todo o código fonte do sistema operacional, incluindo todas as versões mais antigas.

source: BSD projects maintain the entire <quote>Operating System</quote>, not only the kernel. This distinction is only marginally useful: neither BSD nor Linux is useful without applications. The applications used under BSD are frequently the same as the applications used under Linux.
es_es: Los proyectos BSD mantienen todo el <quote>Sistema Operativo</quote>, no solo el kernel. Esta distinción tiene una utilidad marginal: ni BSD ni Linux son útiles sin aplicaciones. Las aplicaciones utilizadas en BSD son con frecuencia las mismas que las utilizadas en Linux.
nl_nl: BSD-projecten beheren het gehele <quote>Besturingssysteem</quote>, niet alleen de kernel. Dit onderscheid is slechts van beperkt nut: noch BSD noch Linux is nuttig zonder applicaties. De applicaties die onder BSD gebruikt worden zijn vaak dezelfde als de applicaties die onder Linux gebruikt worden.
pt_br: Os projetos BSDs mantêm todo o <quote>Sistema Operacional</quote>, e não apenas o kernel. Essa distinção é apenas marginalmente útil: nem o BSD e nem o Linux são úteis sem aplicativos. Os aplicativos usados no BSD são frequentemente os mesmos aplicativos usados no Linux.

source: As a result of the formalized maintenance of a single CVS source tree, BSD development is clear, and it is possible to access any version of the system by release number or by date. CVS also allows incremental updates to the system: for example, the FreeBSD repository is updated about 100 times a day. Most of these changes are small.
nl_nl: Een gevolg van het formele beheer van een enkele CVS-broncodeboom is dat de BSD-ontwikkeling helder is, en dat het mogelijk is om elke versie van het systeem aan de hand van het uitgavenummer of datum te benaderen. CVS staat ook incrementele wijzigingen aan het systeem toe: het repository van FreeBSD bijvoorbeeld wordt ongeveer 100 keer per dag bijgewerkt. De meeste van deze veranderingen zijn klein.

source: BSD releases
es_es: Versiones de BSD
nl_nl: BSD-uitgaven
pt_br: Releases do BSD

source: FreeBSD, NetBSD and OpenBSD provide the system in three different <quote>releases</quote>. As with Linux, releases are assigned a number such as 1.4.1 or 3.5. In addition, the version number has a suffix indicating its purpose:
es_es: FreeBSD, NetBSD y OpenBSD proporcionan el sistema en tres <quote>versiones</quote> diferentes. Al igual que Linux, a los lanzamientos se les asigna un número como 1.4.1 ó 3.5. Además, el número de versión tiene un sufijo que indica su propósito
nl_nl: FreeBSD, NetBSD, en OpenBSD bieden het systeem in drie verschillende <quote>uitgaven</quote> aan. Net als bij Linux worden aan uitgaven nummers zoals 1.4.1 of 3.5 toegekend. Tevens heeft het versienummer een achtervoegsel die het doel aangeeft:
pt_br: O FreeBSD, o NetBSD e o OpenBSD fornecem o sistema em três diferentes <quote>releases</quote>. Como no Linux, os releases recebem um número como 1.4.1 ou 3.5. Além disso, o número da versão tem um sufixo indicando sua finalidade:

source: The development version of the system is called <firstterm>CURRENT</firstterm>. FreeBSD assigns a number to CURRENT, for example FreeBSD 5.0-CURRENT. NetBSD uses a slightly different naming scheme and appends a single-letter suffix which indicates changes in the internal interfaces, for example NetBSD 1.4.3G. OpenBSD does not assign a number (<quote>OpenBSD-current</quote>). All new development on the system goes into this branch.
es_es: La versión de desarrollo del sistema recibe el nombre de <firstterm>CURRENT</firstterm>. FreeBSD asigna un número a CURRENT, por ejemplo FreeBSD 5.0-CURRENT. NetBSD utiliza un sistema ligeramente diferente y añade un sufijo compuesto por una única letra que indica cambios en las interfaces internas, por ejemplo NetBSD 1.4.3G. OpenBSD no asigna ningún número (<quote>OpenBSD-current</quote>). Todo nuevo desarrollo en el sistema entra en esta rama.
nl_nl: De ontwikkelversie van het systeem wordt <firstterm>CURRENT</firstterm> genoemd. FreeBSD kent een nummer aan CURRENT toe, bijvoorbeeld FreeBSD 5.0-CURRENT. NetBSD hanteert een lichtelijk ander schema voor de naamgeving en voegt een achtervoegsel van een enkele letter toe welke veranderingen aan de interne interfaces aangeeft, bijvoorbeeld NetBSD 1.4.3G. OpenBSD kent geen nummer toe(<quote>OpenBSD-current</quote>). Alle nieuwe ontwikkelingen aan het systeem komen in deze tak terecht.
pt_br: A versão de desenvolvimento do sistema é chamada de <firstterm>CURRENT</firstterm>. O FreeBSD atribui um número a CURRENT, por exemplo, FreeBSD 5.0-CURRENT. O NetBSD usa um esquema de nomenclatura ligeiramente diferente e acrescenta um sufixo de uma única letra que indica mudanças nas interfaces internas, por exemplo, o NetBSD 1.4.3G. O OpenBSD não atribui um número (<quote>OpenBSD-current</quote>). Todo novo desenvolvimento no sistema entra neste branch.

source: At regular intervals, between two and four times a year, the projects bring out a <firstterm>RELEASE</firstterm> version of the system, which is available on CD-ROM and for free download from FTP sites, for example OpenBSD 2.6-RELEASE or NetBSD 1.4-RELEASE. The RELEASE version is intended for end users and is the normal version of the system. NetBSD also provides <emphasis>patch releases</emphasis> with a third digit, for example NetBSD 1.4.2.
es_es: A intervalos regulares, entre dos y cuatro veces al año, los proyectos liberan una versión <firstterm>RELEASE</firstterm> del sistema, que está disponible en CD-ROM y mediante FTP para su descarga gratuita, por ejemplo OpenBSD 2.6-RELEASE o NetBSD 1.4-RELEASE. La versión RELEASE está dirigida al usuario final y es la versión estándar del sistema. NetBSD también dispone de <emphasis>patch releases</emphasis> que incluyen un tercer dígito, como por ejemplo NetBSD 1.4.2.
nl_nl: De projecten brengen met regelmatige tussenpozen, tussen twee en vier keer per jaar, een <firstterm>RELEASE</firstterm>-versie van het systeem uit, welke beschikbaar is op CD-ROM en vrij te downloaden is van FTP-sites, bijvoorbeeld OpenBSD 2.6-RELEASE of NetBSD 1.4-RELEASE. De RELEASE-versie is bedoeld voor eindgebruikers en is de normale versie van het systeem. NetBSD biedt ook <emphasis>patch-uitgaven</emphasis> aan met een derde cijfer, bijvoorbeeld NetBSD 1.4.2.
pt_br: Em intervalos regulares, entre duas e quatro vezes por ano, os projetos lançam uma versão <firstterm>RELEASE</firstterm> do sistema, a qual é disponibilizada por meio de CD-ROMs e por meio de download gratuito em sites FTP, por exemplo, OpenBSD 2.6-RELEASE ou NetBSD 1.4-RELEASE. A versão RELEASE destina-se a usuários finais e é a versão normal do sistema. O NetBSD também fornece <emphasis>versões de correção</emphasis> (Patch Releases) com um terceiro dígito, por exemplo, o NetBSD 1.4.2.

source: As bugs are found in a RELEASE version, they are fixed, and the fixes are added to the CVS tree. In FreeBSD, the resultant version is called the <firstterm>STABLE</firstterm> version, while in NetBSD and OpenBSD it continues to be called the RELEASE version. Smaller new features can also be added to this branch after a period of test in the CURRENT branch.
nl_nl: Wanneer er bugs in een RELEASE-versie worden gevonden, worden ze gerepareeed, en worden de reparaties toegevoegd aan de CVS-boom. In FreeBSD wordt de resulterende versie de <firstterm>STABLE</firstterm>-versie genoemd, terwijl het in NetBSD en OpenBSD de RELEASE-versie blijft heten. Kleinere nieuwe eigenschappen kunnen ook aan deze tak worden toegevoegd na een testperiode in de CURRENT-tak.

source: <emphasis>By contrast, Linux maintains two separate code trees: the stable version and the development version. Stable versions have an even minor version number, such as 2.0, 2.2 or 2.4. Development versions have an odd minor version number, such as 2.1, 2.3 or 2.5. In each case, the number is followed by a further number designating the exact release. In addition, each vendor adds their own userland programs and utilities, so the name of the distribution is also important. Each distribution vendor also assigns version numbers to the distribution, so a complete description might be something like <quote>TurboLinux 6.0 with kernel 2.2.14</quote></emphasis>
es_es: <emphasis>Linux, en cambio, mantiene dos árboles de código separados: la versión estable y la versión de desarrollo. Las versiones estables añaden un número par de versión, como 2.0, 2.2 ó 2.4. Las versiones de desarrollo añaden un número impar, como en 2.1, 2.3 ó 2.5. En ambos casos a ese número se le añade otro más que indica la versión exacta. Además, cada proveedor agrega sus propios programas de usuario y utilidades, por lo que el nombre de la distribución también es importante. Cada distribuidor además asigna números de versión a la distribución, así pues la descripción completa podría ser algo como <quote>TurboLinux 6.0 with kernel 2.2.14</quote></emphasis>
nl_nl: <emphasis>In contrast hiermee onderhoudt Linux twee gescheiden codebomen: de stabiele versie en de ontwikkelversie. Stabiele versies hebben een even klein versienummer, zoals 2.0, 2.2, of 2.4. Ontwikkelversies hebben een oneven klein versienummer, zoals 2.1, 2.3, of 2.5. In alle gevallen wordt het nummer gevolgd door een nog een nummer dat de exacte uitgave aangeeft. Verder voegt elke verkoper zijn eigen gebruikersprogramma's en gereedschappen toe, dus is de naam van de distributie ook belangrijk. Elke verkoper van distributies kent ook versienummers aan de distributie toe, dus kan een volledige omschrijving iets zijn als <quote>TurboLinux 6.0 met kernel 2.2.14</quote> zijn.</emphasis>
pt_br: <emphasis>Por outro lado, o Linux mantém duas árvores de código separadas: a versão estável e a versão de desenvolvimento. Versões estáveis têm um número de versão menor par, como por exemplo 2.0, 2.2 ou 2.4. Versões de desenvolvimento têm um número de versão menor ímpar, como por exemplo 2.1, 2.3 ou 2.5. Em cada caso, o número é seguido por um outro número que designa a release exata. Além disso, cada fornecedor adiciona seus próprios programas e utilitários de área de usuário, portanto, o nome da distribuição também é importante. Cada fornecedor de distribuição também atribui números de versão à distribuição, portanto, uma descrição completa seria algo como <quote>TurboLinux 6.0 com kernel 2.2.14 </quote>.</emphasis>

source: What versions of BSD are available?
es_es: ¿Qué versiones de BSD están disponibles?
nl_nl: Welke versies van BSD zijn beschikbaar?
pt_br: Quais versões do BSD estão disponíveis?

source: In contrast to the numerous Linux distributions, there are only four major open source BSDs. Each BSD project maintains its own source tree and its own kernel. In practice, though, there appear to be fewer divergences between the userland code of the projects than there is in Linux.
es_es: A diferencia de las numerosas distribuciones de Linux, solo hay cuatro BSDs principales de código abierto. Cada proyecto BSD mantiene su propio árbol de fuentes y su propio kernel. En la práctica, sin embargo, parece haber menos diferencias entre el código de usuario de los proyectos que en Linux.
nl_nl: In tegenstelling tot de vele Linux-distributies, zijn er slechts vier grote open-source BSDs. Elk BSD-project beheert zijn eigen broncodeboom en zijn eigen kernel. In de praktijk schijnt er echter minder divergentie te zijn tussen de gebruikerscode van de projecten dan dat er in Linux is.
pt_br: Em contraste com as numerosas distribuições do Linux, existem apenas quatro grandes distribuições BSD de código aberto. Cada projeto BSD mantém seu próprio repositório de código fonte e o seu próprio kernel. Porém na prática, parece haver menos divergências do código entre os projetos BSD do que no Linux.

source: It is difficult to categorize the goals of each project: the differences are very subjective. Basically,
es_es: Es difícil categorizar los objetivos de cada proyecto: las diferencias son muy subjetivas. Básicamente,
nl_nl: Het is moeilijk om de doelen van elk project te categoriseren: de verschillen zijn erg subjectief. Het volgende geldt ongeveer:
pt_br: É difícil categorizar os objetivos de cada projeto: as diferenças são muito subjetivas. Basicamente,

source: FreeBSD aims for high performance and ease of use by end users, and is a favourite of web content providers. It runs on a <link xlink:href="@@URL_RELPREFIX@@/platforms/">number of platforms</link> and has significantly more users than the other projects.
es_es: FreeBSD tiene como meta ofrecer un alto rendimiento y facilidad de uso al usuario final, y es uno de los favoritos de los proveedores de contenido web. Se ejecuta en <link xlink:href="@@URL_RELPREFIX@@/platforms/">varias plataformas</link> y tiene significativamente más usuarios que los otros proyectos.
nl_nl: FreeBSD richt zich op hoge prestaties en gebruikersgemak voor eindgebruikers, en is een favoriet van aanbieders van webinhoud. Het draait op een <link xlink:href="@@URL_RELPREFIX@@/platforms/">aantal platformen</link> en heeft aanzienlijk meer gebruikers dan de andere projecten.
pt_br: O FreeBSD visa o alto desempenho e a facilidade de uso pelos usuários finais, e é um dos favoritos dos provedores de conteúdo da web. Ele pode ser executado em <link xlink:href="@@URL_RELPREFIX@@/platforms/">diversas plataformas</link> e tem significativamente mais usuários do que os outros projetos.

source: NetBSD aims for maximum portability: <quote>of course it runs NetBSD</quote>. It runs on machines from palmtops to large servers, and has even been used on NASA space missions. It is a particularly good choice for running on old non-<trademark class="registered">Intel</trademark> hardware.
es_es: NetBSD tiene como meta la máxima portabilidad: <quote>of course it runs NetBSD</quote>. Se ejecuta en máquinas que abarcan desde PDAs hasta grandes servidores, e incluso se ha utilizado en misiones espaciales de la NASA. Es una opción particularmente buena para ejecutar en hardware antiguo que no sea <trademark class="registered">Intel</trademark>.
nl_nl: NetBSD gaat voor maximale portabiliteit: <quote>of course it runs NetBSD</quote>. Het draait op machines variërend van palmtops tot grote servers, en het is zelfs gebruikt in ruimtemissies van NASA. Het is een bijzonder goede keuze om op oude niet-<trademark class="registered">Intel</trademark> hardware te draaien.
pt_br: O NetBSD visa a máxima portabilidade: <quote>é claro que roda o NetBSD</quote>. Ele pode ser executado em diversas plataformas de hardware, de palmtops até grandes servidores, e até mesmo já foi usado em missões espaciais da NASA. É uma escolha particularmente boa para rodar em hardware antigo que não seja <trademark class="registered">Intel</trademark>.

source: OpenBSD aims for security and code purity: it uses a combination of the open source concept and rigorous code reviews to create a system which is demonstrably correct, making it the choice of security-conscious organizations such as banks, stock exchanges and US Government departments. Like NetBSD, it runs on a number of platforms.
es_es: OpenBSD tiene como meta la seguridad y la integridad del código: combina del concepto de código abierto y una revisión rigurosa del código que dan como fruto un sistema muy correcto, elegido por instituciones preocupadas por la seguridad como bancos, bolsas de valores y departamentos gubernamentales de los EEUU. Al igual que NetBSD funciona en gran variedad de plataformas.
nl_nl: OpenBSD gaat voor beveiliging en code-puurheid: het gebruikt een combinatie van het open-source concept en rigoureuze codeherzieningen om een systeem te maken dat aantoonbaar correct is, waardoor het de keuze is van beveiligingsbewuste organisaties zoals banken, beurzen, en afdelingen van de Amerikaanse overheid. Net als NetBSD draait het op een aantal platformen.
pt_br: O OpenBSD visa a segurança e a pureza de código: ele usa uma combinação do conceito de código aberto ao de revisões rigorosas de código para criar um sistema que seja comprovadamente correto, tornando-o a escolha preferida de organizações preocupadas com segurança, tais como bancos, bolsas de valores e departamentos do governo dos EUA. Tal como o NetBSD, ele pode ser executado em várias plataformas.
