Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/explaining-bsd/*.po
Languages: es_es, nl_nl, pt_br

source: The BSD tapes contained AT&amp;T source code and thus required a <trademark class="registered">UNIX</trademark> source license. By 1990, the CSRG's funding was running out, and it faced closure. Some members of the group decided to release the BSD code, which was Open Source, without the AT&amp;T proprietary code. This finally happened with the <emphasis>Networking Tape 2</emphasis>, usually known as <emphasis>Net/2</emphasis>. Net/2 was not a complete operating system: about 20% of the kernel code was missing. One of the CSRG members, William F. Jolitz, wrote the remaining code and released it in early 1992 as <emphasis>386BSD</emphasis>. At the same time, another group of ex-CSRG members formed a commercial company called <link xlink:href="http://www.bsdi.com/">Berkeley Software Design Inc.</link> and released a beta version of an operating system called <link xlink:href="http://www.bsdi.com/">BSD/386</link>, which was based on the same sources. The name of the operating system was later changed to BSD/OS.
es_es: Las cintas BSD contenían código fuente de AT&amp;T y en consecuencia requerían una licencia de código <trademark class="registered">UNIX</trademark>. Hacia 1990, la financiación del CSRG se estaba agotando y se enfrentaba al cierre. Algunos miembros del grupo decidieron liberar el código BSD, que era Código Abierto, sin el código propiedad de AT&amp;T. Finalmente esto sucede con la <emphasis>Networking Tape 2</emphasis>, más conocida como <emphasis>Net/2</emphasis>. Net/2 no era un sistema operativo completo: faltaba aproximadamente un 20% del código del kernel. Uno de los miembros del CSRG, William F. Jolitz, escribió el código restante y lo distribuyó a principios de 1992 como <emphasis>386BSD</emphasis>. Al mismo tiempo, otro grupo de antiguos miembros del CSRG fundaron una empresa llamada <link xlink:href="http://www.bsdi.com/">Berkeley Software Design Inc.</link> y distribuyó una versión beta de un sistema operativo llamado <link xlink:href="http://www.bsdi.com/">BSD/386</link>, que se basó en las mismas fuentes. El sistema operativo pasó a denominarse BSD/OS.
nl_nl: De BSD-tapes bevatten de broncode van AT&amp;T en hadden dus een <trademark class="registered">UNIX</trademark> bronlicentie nodig. Tegen 1990 raakten de fondsen van de CSRG uitgeput, en er dreigde sluiting. Sommige leden van de groep besloten om de BSD-code uit te geven, welke Open Source was, zonder de propriëtaire code van AT&amp;T. Dit gebeurde eindelijk met de <emphasis>Networking Tape 2</emphasis>, gewoonlijk bekend als <emphasis>Net/2</emphasis>. Net/2 was geen compleet besturingssysteem: ongeveer 20% van de kernelcode ontbrak. Een van de leden van de CSRG, William F. Jolitz, schreef de overblijvende code en gaf het in het begin van 1992 uit als <emphasis>386BSD</emphasis>. In diezelfde tijd begon een andere groep van ex-CSRG-leden een commercieel bedrijf genaamd <link xlink:href="http://www.bsdi.com/">Berkeley Software Design Inc.</link> en gaf een betaversie van een besturingssysteem genaamd <link xlink:href="http://www.bsdi.com/">BSD/386</link> uit, welke op dezelfde bronnen was gebaseerd. De naam van het besturingssysteem werd later veranderd in BSD/OS.
pt_br: As fitas do BSD continham código fonte da AT&amp;T e portanto necessitavam da licença dos fontes do <trademark class="registered">UNIX</trademark>. Por volta de 1990, os recursos financeiros do CSRG's estavam acabando, e ele foi encerrado. Alguns membros do grupo decidiram liberar o código do BSD, que era código aberto, sem o código proprietário da AT&amp;T. Isso finalmente aconteceu com a fita <emphasis>Networking Tape 2</emphasis>, também conhecida como <emphasis>Net/2</emphasis>. O Net/2 não era um sistema operacional completo: faltava cerca de 20% do código fonte do kernel. Um dos membros do CSRG, William F. Jolitz, escreveu o código que faltava e o liberou no início de 1992 sob o nome de <emphasis>386BSD</emphasis>. Ao mesmo tempo, um outro grupo de ex integrantes do CSRG formaram uma empresa comercial chamada <link xlink:href="http://www.bsdi.com/">Berkeley Software Design Inc.</link> e liberaram uma versão beta de um sistema operacional chamado <link xlink:href="http://www.bsdi.com/">BSD/386</link>, o qual era baseado nos mesmos fontes. Mais tarde o nome deste sistema operacional foi alterado para BSD/OS.

source: 386BSD never became a stable operating system. Instead, two other projects split off from it in 1993: <link xlink:href="http://www.NetBSD.org/">NetBSD</link> and <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD</link>. The two projects originally diverged due to differences in patience waiting for improvements to 386BSD: the NetBSD people started early in the year, and the first version of FreeBSD was not ready until the end of the year. In the meantime, the code base had diverged sufficiently to make it difficult to merge. In addition, the projects had different aims, as we will see below. In 1996, <link xlink:href="http://www.OpenBSD.org/">OpenBSD</link> split off from NetBSD, and in 2003, <link xlink:href="http://www.dragonflybsd.org/">DragonFlyBSD</link> split off from FreeBSD.
es_es: 386BSD jamás llegó a ser un sistema operativo estable. En cambio, otros dos proyectos se separaron de él en 1993: <link xlink:href="http://www.NetBSD.org/">NetBSD</link> y <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD</link>. Ambos proyectos se forman gracias a la falta de paciencia que origina la espera de mejoras en 386BSD: La gente de NetBSD comenzó a principios de año, y la primera versión de FreeBSD no estuvo lista hasta final de año. En ese proceso el código base tomó caminos diferentes hasta tal punto que se hizo difícil de fusionar. Además, los proyectos tenían diferentes objetivos, como veremos más adelante. En 1996, <link xlink:href="http://www.OpenBSD.org/">OpenBSD</link> se separó de NetBSD, y en 2003, <link xlink:href="http://www.dragonflybsd.org/">DragonFlyBSD</link> se separó de FreeBSD.
nl_nl: 386BSD werd nooit een stabiel besturingssysteem. In plaats daarvan splitsten er twee andere projecten van af in 1993: <link xlink:href="http;//www.NetBSD.org/">NetBSD</link> en <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD</link>. De twee projecten groeiden oorspronkelijk uit elkaar wegens verschillen in de hoeveelheid geduld om op verbeteringen aan 386BSD te wachten: de mensen van NetBSD begonnen in het begin van het jaar, en de eerste versie van FreeBSD was niet klaar voor het einde van het jaar. In de tussentijd waren de codebases genoeg uit elkaar gegroeid om samenvoegen ervan moeilijk te maken. Tevens hadden de projecten verschillende doelen, wat we hieronder zullen zien. In 1996 splitste <link xlink:href="http://www.OpenBSD.org/">OpenBSD</link> zich af van NetBSD, en in 2003 splitste <link xlink:href="http://www.dragonflybsd.org/">DragonFlyBSD</link> zich af van FreeBSD.
pt_br: O 386BSD nunca chegou a ser um sistema operacional estável. Ao invés disso, dois outros projetos surgiram a partir dele em 1993: <link xlink:href="http://www.NetBSD.org/">NetBSD</link> e <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD</link>. Este dois projetos divergiam originalmente na questão da espera pelas melhorias no 386BSD: o pessoal do NetBSD iniciou no começo daquele ano, e a primeira versão do FreeBSD não ficou pronta antes do final do ano. Neste meio tempo o código base ficou diferente um do outro o suficiente para tornar difícil sua fusão. Além disso, os projetos tinham objetivos diferentes, como veremos adiante. Em 1996, o <link xlink:href="http://www.OpenBSD.org/">OpenBSD</link> surgiu a partir do NetBSD, e em 2003, o <link xlink:href="http://www.dragonflybsd.org/">DragonFlyBSD</link> surgiu a partir do FreeBSD.

source: Why is BSD not better known?
es_es: ¿Por qué BSD no es más conocido?
nl_nl: Waarom is BSD niet bekender?
pt_br: Por que o BSD não é mais conhecido?

source: For a number of reasons, BSD is relatively unknown:
es_es: Por varias razones, BSD es relativamente desconocido:
nl_nl: Om een aantal redenen is BSD relatief onbekend:
pt_br: Por uma série de razões, o BSD é relativamente desconhecido:

source: The BSD developers are often more interested in polishing their code than marketing it.
es_es: Los desarrolladores de BSD a menudo están más interesados en mejorar su código que en comercializarlo.
nl_nl: De BSD-ontwikkelaars zijn vaak meer geïnteresseerd in het verbeteren van hun code dan het aan de man brengen.
pt_br: Os desenvolvedores do BSD estão mais interessados em aprimorar o seu código do que em divulgá-lo.

source: Much of Linux's popularity is due to factors external to the Linux projects, such as the press, and to companies formed to provide Linux services. Until recently, the open source BSDs had no such proponents.
es_es: Gran parte de la popularidad de Linux se debe a factores externos a los proyectos de Linux, como la prensa y las empresas formadas para proporcionar servicios de Linux. Hasta hace poco, los BSD de código abierto no tenían tales partidarios.
nl_nl: Veel van de populariteit van Linux komt door factoren buiten de Linux-projecten, zoals de pers, en door bedrijven die zijn opgericht om Linux-diensten aan te bieden. Tot voor kort hadden de open-source BSDs zulke voorstanders niet.
pt_br: Grande parte da popularidade do Linux se deve a fatores externos ao projeto Linux, como a mídia e empresas que foram criadas para prover serviços Linux. Até pouco tempo atrás os BSD de código aberto não tinham este tipo de proposta.

source: BSD developers tend to be more experienced than Linux developers, and have less interest in making the system easy to use. Newcomers tend to feel more comfortable with Linux.
nl_nl: BSD-ontwikkelaars zijn vaak meer ervaren dan Linux-ontwikkelaars, en hebben minder interesse in het systeem gemakkelijk in gebruik te maken. Nieuwelingen voelen zich vaak meer op hun gemak met Linux.

source: In 1992, AT&amp;T sued <link xlink:href="http://www.bsdi.com/">BSDI</link>, the vendor of BSD/386, alleging that the product contained AT&amp;T-copyrighted code. The case was settled out of court in 1994, but the spectre of the litigation continues to haunt people. As recently as March 2000 an article published on the web claimed that the court case had been <quote>recently settled</quote>.
nl_nl: In 1992 klaagde AT&amp;T <link xlink:href="http://www.bsdi.com/">BSDI</link>, de verkoper van BSD/386, aan op verdenking dat het product code bevatte waarover AT&amp;T copyright had. De zaak werd buiten de rechtbank om in 1994 beslist, maar het spook van de rechtszaak blijft mensen achtervolgen. In een recent artikel uit maart 2000 dat op het web werd gepubliceerd claimde dat de zaak <quote>recentelijk beslist</quote> was.

source: One detail that the lawsuit did clarify is the naming: in the 1980s, BSD was known as <quote>BSD <trademark class="registered">UNIX</trademark></quote>. With the elimination of the last vestige of AT&amp;T code from BSD, it also lost the right to the name <trademark class="registered">UNIX</trademark>. Thus you will see references in book titles to <quote>the 4.3BSD <trademark class="registered">UNIX</trademark> operating system</quote> and <quote>the 4.4BSD operating system</quote>.
es_es: Un detalle que el proceso judicial aclaró fue el de la nomenclatura: en la década de los 80, BSD era conocido como <quote>BSD <trademark class="registered">UNIX</trademark></quote>. Con la eliminación del último vestigio del código AT&amp;T de BSD, también perdió el derecho a llamarse <trademark class="registered">UNIX</trademark>. Por lo tanto, es posible encontrar títulos de libros referentes a <quote>the 4.3BSD <trademark class="registered">UNIX</trademark> operating system</quote> y <quote>the 4.4BSD operating system</quote>.
nl_nl: Eén detail dat de rechtszaak ophelderde is de naamgeving: in de jaren 80 stond BSD bekend als <quote>BSD <trademark class="registered">UNIX</trademark></quote>. Met het nemen van de laatste vestiging van AT&amp;T-code van BSD, verloor het ook het recht op de naam <trademark class="registered">UNIX</trademark>. U zult dus verwijzingen in boektitels zien naar <quote>het besturingssysteem 4.3BSD <trademark class="registered">UNIX</trademark></quote> en <quote>het besturingssysteem 4.4BSD</quote>.
pt_br: Um detalhe que o processo civil não deixa claro refere-se ao nome: nos anos 80 o BSD era conhecido como <quote>BSD<trademark class="registered">UNIX</trademark></quote>. Com a eliminação dos últimos vestígios do código da AT&amp;T do BSD, ele também perdeu o direito ao nome <trademark class="registered">UNIX</trademark>. Desta forma você verá referências em livros para o <quote>sistema operacional 4.3BSD <trademark class="registered">UNIX</trademark></quote> e o <quote>sistema operacional 4.4BSD</quote>.

source: There is a perception that the BSD projects are fragmented and belligerent. The <link xlink:href="http://interactive.wsj.com/bin/login?Tag=/&amp;URI=/archive/retrieve.cgi%253Fid%253DSB952470579348918651.djm&amp;">Wall Street Journal</link> spoke of <quote>balkanization</quote> of the BSD projects. Like the law suit, this perception bases mainly on ancient history.
nl_nl: De indruk heerst dat de BSD-projecten gefragmenteerd en oorlogvoerend zijn. De <link xlink:href="http://interactive.wsj.com/bin/login?Tag=/&amp;URI=/archive/retrieve.cgi%253Fid%253DSB952470579348918651.djm&amp;">Wall Street Journal</link> sprak van <quote>balkanizatie</quote> van de BSD-projecten. Net als de rechtszaak is dit beeld voornamelijk op een oude geschiedenis gebaseerd.

source: Comparing BSD and Linux
es_es: Comparando BSD y Linux
nl_nl: BSD en Linux vergelijken
pt_br: Comparando BSD e Linux

source: So what is really the difference between, say, Debian Linux and FreeBSD? For the average user, the difference is surprisingly small: Both are <trademark class="registered">UNIX</trademark> like operating systems. Both are developed by non-commercial projects (this does not apply to many other Linux distributions, of course). In the following section, we will look at BSD and compare it to Linux. The description applies most closely to FreeBSD, which accounts for an estimated 80% of the BSD installations, but the differences from NetBSD, OpenBSD and DragonFlyBSD are small.
es_es: Entonces, ¿cuál es realmente la diferencia entre, digamos, Debian Linux y FreeBSD? Para el usuario promedio, la diferencia es sorprendentemente pequeña: Ambos son sistemas operativos tipo <trademark class="registered">UNIX</trademark>. Ambos están desarrollados por proyectos no comerciales (esto no se aplica a muchas otras distribuciones de Linux, por supuesto). En la siguiente sección, veremos BSD y lo compararemos con Linux. La descripción se ajusta más a FreeBSD, que representa aproximadamente el 80% de las instalaciones de BSD, pero las diferencias entre NetBSD, OpenBSD y DragonFlyBSD son pequeñas.
nl_nl: Wat is nou echt het verschil tussen bijvoorbeeld Debian Linux en FreeBSD? Voor de gemiddelde gebruiker is het verschil verrassend klein: beiden zijn <trademark class="registered">UNIX</trademark>-achtige besturingssystemen. Beiden worden ontwikkeld door niet-commerciële projecten (dit geldt uiteraard niet voor vele andere distributies van Linux). In de volgende sectie wordt BSD bekeken en vergeleken met Linux. De beschrijving is het beste van toepassing op FreeBSD, dat een geschatte 80% van alle BSD-installaties voor rekening neemt, maar de verschillen van NetBSD, OpenBSD, en DragonFlyBSD zijn klein.
pt_br: Então, qual é realmente a diferença entre, digamos, o Debian Linux e o FreeBSD? Para a maioria dos usuários, a diferença é surpreendentemente pequena: Ambos são sistemas operacionais estilo <trademark class="registered">UNIX</trademark>. Ambos são desenvolvidos por projetos não comerciais (isto não se aplica a diversas outras distribuições Linux, é claro). Nas próximas sessões vamos olhar para o BSD e compará-lo ao Linux. As descrições se aplicam principalmente ao FreeBSD, que representa aproximadamente 80% das instalações de BSD, mas as diferenças do NetBSD, OpenBSD e Dragon FlyBSD são pequenas.

source: Who owns BSD?
es_es: ¿Quién es dueño de BSD?
nl_nl: Wie bezit BSD?
pt_br: Quem é o dono do BSD?

source: No one person or corporation owns BSD. It is created and distributed by a community of highly technical and committed contributors all over the world. Some of the components of BSD are Open Source projects in their own right and managed by different project maintainers.
es_es: Ninguna persona o empresa es dueña de BSD. Es creado y distribuido por una comunidad de colaboradores altamente cualificados y comprometidos a lo largo y ancho del mundo. Algunos de los componentes de BSD son proyectos de código abierto con sus propios derechos que se administran y mantienen por separado.
nl_nl: Geen enkel persoon of bedrijf bezit BSD. Het wordt tontwikkeld en verspreid door een gemeenschap van zeer technische en toegewijde wereldwijde contribuanten. Sommige onderdelen van BSD zijn open-source projecten op zichzelf en worden beheerd door verschillende projectbeheerders.
pt_br: Nenhuma pessoa ou empresa é proprietária do BSD. Ele é criado e distribuído por uma comunidade de colaboradores altamente técnica e comprometida espalhada ao redor do mundo. Alguns dos componentes do BSD são projetos de código aberto com seus próprios licenciamentos e gerenciados por diferentes mantenedores.

source: How is BSD developed and updated?
es_es: ¿Cómo se desarrolla y actualiza BSD?
nl_nl: Hoe wordt BSD ontwikkeld en bijgewerkt?
pt_br: Como o BSD é desenvolvido e atualizado?

source: The BSD kernels are developed and updated following the Open Source development model. Each project maintains a publicly accessible <emphasis>source tree</emphasis> under the <link xlink:href="http://www.cvshome.org/">Concurrent Versions System</link> (CVS), which contains all source files for the project, including documentation and other incidental files. CVS allows users to <quote>check out</quote> (in other words, to extract a copy of) any desired version of the system.
nl_nl: De BSD-kernels worden ontwikkeld en bijgewerkt volgens het Open Source ontwikkelmodel. Elk project beheerst een publiek toegankelijke <emphasis>broncodeboom</emphasis> onder het <link xlink:href="http://www.cvshome.org/">Concurrent Versions System</link> (CVS), wat alle bronbestanden voor het project bevat, inclusief documentatie en andere toevallige bestanden. CVS stelt gebruikers in staat om een <quote>check out</quote> te doen (met andere woorden, om een kopie te maken) van elke gewenste versie van het systeem.

source: A large number of developers worldwide contribute to improvements to BSD. They are divided into three kinds:
es_es: Un gran número de desarrolladores de todo el mundo contribuyen a mejorar BSD. Se dividen en tres tipos:
nl_nl: Een grote groep van wereldwijde ontwikkelaars dragen bij aan verbeteringen aan BSD. Ze zijn verdeeld in drie soorten:
pt_br: Um grande número de desenvolvedores por todo o mundo contribuem com melhorias ao BSD. Eles estão divididos em três categorias:

source: <firstterm>Contributors</firstterm> write code or documentation. They are not permitted to commit (add code) directly to the source tree. In order for their code to be included in the system, it must be reviewed and checked in by a registered developer, known as a <emphasis>committer</emphasis>.
es_es: Los <firstterm>Contributors</firstterm> escriben código o documentación. No se les permite hacer commit (añadir código) directamente al árbol de fuentes. Para que su código sea incluido en el sistema debe ser revisado y probado por un desarrollador registrado, conocido como <emphasis>committer</emphasis>.
nl_nl: <firstterm>Contributors</firstterm> schrijven code of documentatie. Ze hebben geen toestemming om direct naar de broncodeboom te committen (code toe te voegen). Om hun code aan het systeem toe te voegen, moet het herzien en ingecheckt worden door een geregistreerde ontwikkelaar, die een <emphasis>committer</emphasis> wordt genoemd.
pt_br: <firstterm>Contributors</firstterm> escrevem código ou documentação. Eles não têm permissão para adicionar código diretamente ao repositório principal de código fonte. Para que seu código seja incluído no sistema, ele deve ser revisado e verificado por um desenvolvedor registrado, conhecido como <emphasis>committer</emphasis>.

source: <firstterm>Committers</firstterm> are developers with write access to the source tree. In order to become a committer, an individual must show ability in the area in which they are active.
es_es: Los <firstterm>Committers</firstterm> son desarrolladores que disponen de acceso de escritura en el árbol de fuentes. Para convertirse en committer es necesario demostrar habilidad en el área en la cual él o ella trabaja.
nl_nl: <firstterm>Committers</firstterm> zijn ontwikkelaars met schrijftoegang tot de broncodeboom. Om committer te worden, moet een individu kennis en kunde laten zien in het gebied waarin hij actief is.
pt_br: <firstterm>Committers</firstterm> são desenvolvedores com acesso de gravação no repositório principal de código fonte. Para se tornar um committer, um indivíduo deve mostrar habilidade na área em que está ativo.
