Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/new-users/*.po
Languages: pt_br

source: To configure your system, you need to edit text files. Most of them will be in the <filename>/etc</filename> directory; and you will need to <command>su</command> to <systemitem class="username">root</systemitem> to be able to change them. You can use the easy <command>ee</command>, but in the long run the text editor <command>vi</command> is worth learning. There is an excellent tutorial on vi in <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, if you have the system sources installed.
pt_br: Para configurar o seu sistema, você precisará editar arquivos de texto. A maioria deles estará no diretório <filename>/etc</filename>; e você precisará utilizar o comando <command>su</command> para acessar o usuário <systemitem class="username">root</systemitem> do sistema e assim poder alterá-los. Você pode utilizar um editor de texto simples, como o <command>ee</command>, mas a longo prazo, é recomendado aprender a utilizar o editor de texto <command>vi</command>. Existe um excelente tutorial do editor de texto vi disponível em <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, se você tiver o código fonte do sistema instalado.

source: Before you edit a file, you should probably back it up. Suppose you want to edit <filename>/etc/rc.conf</filename>. You could just use <command>cd /etc</command> to get to the <filename>/etc</filename> directory and do:
pt_br: Antes de editar um arquivo, é recomendado criar um backup do mesmo. Suponha que você queira editar o <filename>/etc/rc.conf</filename>. Você poderia usar apenas <command>cd /etc</command> para acessar o diretório <filename>/etc</filename> e usar o seguinte comando:

source: This would copy <filename>rc.conf</filename> to <filename>rc.conf.orig</filename>, and you could later copy <filename>rc.conf.orig</filename> to <filename>rc.conf</filename> to recover the original. But even better would be moving (renaming) and then copying back:
pt_br: Isso iria copiar <filename>rc.conf</filename> para <filename>rc.conf.orig</filename>, e após isso você poderia copiar <filename>rc.conf.orig</filename> para <filename>rc.conf</filename> para recuperar o original. Mas melhor ainda seria mover (renomear) e depois copiar de volta:

source: to put things back the way they were.
pt_br: para colocar as coisas de volta da maneira que estavam.

source: To edit a file, type
pt_br: Para editar um arquivo, digite

source: Move through the text with the arrow keys. <keycap>Esc</keycap> (the escape key) puts <command>vi</command> in command mode. Here are some commands:
pt_br: Movimente-se através do texto com as teclas direcionais. <keycap>Esc</keycap> (a tecla de escape) coloca o editor <command>vi</command> em modo de comando. Aqui estão alguns comandos:

source: delete letter the cursor is on
pt_br: deleta a letra localizada onde o cursor está

source: delete the entire line (even if it wraps on the screen)
pt_br: Apaga a linha inteira (mesmo se ela não estiver por inteiro aparecendo na tela)

source: insert text at the cursor
pt_br: Insere um texto na posição do cursor

source: insert text after the cursor
pt_br: Insere um texto após a posição do cursor

source: Once you type <command>i</command> or <command>a</command>, you can enter text. <command>Esc</command> puts you back in command mode where you can type
pt_br: Uma vez que você digitou <command>i</command> ou <command>a</command>, você pode entrar com o texto. Se você pressionar <command>Esc</command> você colocará novamente o editor em modo de comando, e lá será onde você irá digitar

source: to write your changes to disk and continue editing
pt_br: para escrever suas alterações no disco e continuar editando

source: to write and quit
pt_br: para gravar e sair

source: to quit without saving changes
pt_br: para sair do arquivo sem salvar as alterações

source: <command>/<replaceable>text</replaceable></command>
pt_br: <command>/<replaceable>texto</replaceable></command>

source: to move the cursor to <replaceable>text</replaceable>; <command>/</command><keycap>Enter</keycap> (the enter key) to find the next instance of <replaceable>text</replaceable>.
pt_br: para mover o cursor para a primeira ocorrência da palavra <replaceable>texto</replaceable>; <command>/</command><keycap>Enter</keycap> (a tecla Enter) para encontrar a próxima ocorrência da palavra <replaceable>texto</replaceable>.

source: to go to the end of the file
pt_br: para ir para o final do arquivo

source: to go to line <replaceable>n</replaceable> in the file, where <replaceable>n</replaceable> is a number
pt_br: para ir para a linha <replaceable>n</replaceable> dentro do arquivo em edição, onde <replaceable>n</replaceable> é um número

source: to redraw the screen
pt_br: para recarregar a tela

source: go back and forward a screen, as they do with <command>more</command> and <command>view</command>.
pt_br: retrocede e avança uma tela, como fazem com <command>more</command> e <command>view</command>.

source: Now you can <command>cd</command> to <filename>/etc</filename>, <command>su</command> to <systemitem class="username">root</systemitem>, use <command>vi</command> to edit the file <filename>/etc/group</filename>, and add a user to <systemitem class="groupname">wheel</systemitem> so the user has root privileges. Just add a comma and the user's login name to the end of the first line in the file, press <keycap>Esc</keycap>, and use <command>:wq</command> to write the file to disk and quit. Instantly effective. (You did not put a space after the comma, did you?)
pt_br: Agora você pode usar o comando <command>cd</command> para ir para o <filename>/etc</filename>, use o comando <command>su</command> para logar como <systemitem class="username">root</systemitem>, use o <command>vi</command> para editar o arquivo <filename>/etc/group</filename>, e adicione um usuário ao grupo <systemitem class="groupname">wheel</systemitem>, assim, o usuário terá privilégios de root. Basta adicionar uma vírgula e o nome do login do usuário ao final da primeira linha do arquivo, pressione <keycap>Esc</keycap>, e use <command>:wq</command> para salvar as alterações no disco e sair. Instantaneamente eficaz. (Você não colocou um espaço após a vírgula, colocou?)

source: Other Useful Commands
pt_br: Outros comandos úteis

source: shows file space and mounted systems.
pt_br: mostra o espaço dos sistemas de arquivos que estão montados.

source: shows processes running. <command>ps ax</command> is a narrower form.
pt_br: mostra os processos em execução. O <command>ps ax</command> é uma forma mais básica do comando.

source: remove <replaceable>filename</replaceable>.
pt_br: deleta o arquivo <replaceable>filename</replaceable>.

source: removes a directory <replaceable>dir</replaceable> and all subdirectories—careful!
pt_br: remove o diretório <replaceable>dir</replaceable> e todos os subdiretórios — use com cuidado!

source: lists files in the current directory and all subdirectories; I used a variant, <command>ls -AFR &gt; where.txt</command>, to get a list of all the files in <filename>/</filename> and (separately) <filename>/usr</filename> before I found better ways to find files.
pt_br: lista os arquivos no diretório atual e em todos os subdiretórios; Eu usei uma variante, <command>ls -AFR &gt; where.txt</command>, para obter uma lista de todos os arquivos no diretório <filename>/</filename> e <filename>/usr</filename> (separadamente) antes de encontrar melhores maneiras de encontrar arquivos.

source: to change user's password (or <systemitem class="username">root</systemitem>'s password)
pt_br: para mudar a senha do usuário (ou a senha do usuário <systemitem class="username">root</systemitem>).

source: manual page on the <trademark class="registered">UNIX</trademark> filesystem
pt_br: exibe as páginas do manual para o sistema de arquivos <trademark class="registered">UNIX</trademark> e sua estrutura hierárquica.

source: Use <command>find</command> to locate <filename>filename</filename> in <filename>/usr</filename> or any of its subdirectories with
pt_br: Use o comando <command>find</command> para localizar <filename>filename</filename> no diretório <filename>/usr</filename> e nos seus subdiretórios:

source: You can use <literal>*</literal> as a wildcard in <parameter>"<replaceable>filename</replaceable>"</parameter> (which should be in quotes). If you tell <command>find</command> to search in <filename>/</filename> instead of <filename>/usr</filename> it will look for the file(s) on all mounted filesystems, including the CDROM and the DOS partition.
pt_br: Você pode usar <literal>*</literal> como um caractere curinga em <parameter>"<replaceable>filename</replaceable>"</parameter> (que deve estar entre aspas). Se você utilizar o comando <command>find</command> para procurar no <filename>/</filename> em vez de <filename>/usr</filename> ele procurará o(s) arquivo(s) em todos os sistemas de arquivos montados, incluindo o CDROM e a partição DOS.

source: An excellent book that explains <trademark class="registered">UNIX</trademark> commands and utilities is Abrahams &amp; Larson, <citetitle>Unix for the Impatient</citetitle> (2nd ed., Addison-Wesley, 1996). There is also a lot of <trademark class="registered">UNIX</trademark> information on the Internet.
pt_br: Um excelente livro que explica os comandos e demais utilitários do <trademark class="registered">UNIX</trademark> é o Abrahams &amp; Larson, <citetitle>Unix for the Impatient</citetitle> (Addison-Wesley, 1996, segunda edição). Há também toneladas de informações na internet sobre o <trademark class="registered">UNIX</trademark>.

source: Next Steps
pt_br: Próximos Passos

source: If you find the handbook too sophisticated (what with <command>lndir</command> and all) on installing ports from the CDROM, here is what usually works:
pt_br: Se você achar o handbook muito sofisticado (com isso do <command>lndir</command> e tudo mais) ao instalar os ports do CDROM, veja a seguir o que geralmente funciona:

source: Find the port you want, say <command>kermit</command>. There will be a directory for it on the CDROM. Copy the subdirectory to <filename>/usr/local</filename> (a good place for software you add that should be available to all users) with:
pt_br: Encontre o port que você deseja, digamos o <command>kermit</command>. Haverá um diretório para ele no CDROM. Copie o subdiretório para <filename>/usr/local</filename> (este é um bom lugar para softwares que você adicione no sistema e que devem estar disponíveis para todos os usuários) com:

source: This should result in a <filename>/usr/local/kermit</filename> subdirectory that has all the files that the <command>kermit</command> subdirectory on the CDROM has.
pt_br: Isto deve resultar em um subdiretório <filename>/usr/local/kermit</filename> que possui todos os arquivos que o subdiretório <command>kermit</command> no CDROM possui.

source: Next, create the directory <filename>/usr/ports/distfiles</filename> if it does not already exist using <command>mkdir</command>. Now check <filename>/cdrom/ports/distfiles</filename> for a file with a name that indicates it is the port you want. Copy that file to <filename>/usr/ports/distfiles</filename>; in recent versions you can skip this step, as FreeBSD will do it for you. In the case of <command>kermit</command>, there is no distfile.
pt_br: Em seguida, crie o diretório <filename>/usr/ports/distfiles</filename> se ele ainda não existir usando o comando <command>mkdir</command>. Agora verifique em <filename>/cdrom/ports/distfiles</filename> um arquivo com um nome que indique o port que você deseja. Copie esse arquivo para <filename>/usr/ports/distfiles</filename>; você pode pular esse passo em versões recentes, pois o FreeBSD fará isso para você. No caso do <command>kermit</command>, não existe um distfile.

source: Then <command>cd</command> to the subdirectory of <filename>/usr/local/kermit</filename> that has the file <filename>Makefile</filename>. Type
pt_br: Em seguida, use o comando <command>cd</command> para ir para o subdiretório <filename>/usr/local/kermit</filename> que contém o arquivo <filename>Makefile</filename>. Digite

source: During this process the port will FTP to get any compressed files it needs that it did not find on the CDROM or in <filename>/usr/ports/distfiles</filename>. If you do not have your network running yet and there was no file for the port in <filename>/cdrom/ports/distfiles</filename>, you will have to get the distfile using another machine and copy it to <filename>/usr/ports/distfiles</filename>. Read <filename>Makefile</filename> (with <command>cat</command> or <command>more</command> or <command>view</command>) to find out where to go (the master distribution site) to get the file and what its name is. (Use binary file transfers!) Then go back to <filename>/usr/local/kermit</filename>, find the directory with <filename>Makefile</filename>, and type <command>make all install</command>.
pt_br: Durante este processo, o port irá usar o FTP para obter os arquivos compactados de que precisa e que ele não encontrou no CDROM ou no <filename>/usr/ports/distfiles</filename>. Se a sua rede ainda não está configurada e não havia nenhum arquivo para o port em <filename>/cdrom/ports/distfiles</filename>, você terá que pegar o distfile usando outra máquina e copiá-lo manualmente para <filename>/usr/ports/distfiles</filename>. Leia o <filename>Makefile</filename> (com <command>cat</command> ou <command>more</command> ou <command>view</command>) para descobrir onde ir (o principal site de distribuição) para obter o arquivo e o nome dele. (Use transferências binárias de arquivos!) Em seguida volte para o diretório <filename>/usr/local/kermit</filename>, encontre o diretório com <filename>Makefile</filename>, e digite <command>make all install</command>.

source: Your Working Environment
pt_br: Seu ambiente de trabalho

source: Your shell is the most important part of your working environment. The shell is what interprets the commands you type on the command line, and thus communicates with the rest of the operating system. You can also write shell scripts a series of commands to be run without intervention.
pt_br: Seu shell é a parte mais importante do seu ambiente de trabalho. O shell é o que interpreta os comandos que você digita na linha de comando e, assim, se comunica com o restante do sistema operacional. Você também pode escrever scripts de shell, que consiste em uma série de comandos para serem executados sem intervenção.

source: Two shells come installed with FreeBSD: <command>csh</command> and <command>sh</command>. <command>csh</command> is good for command-line work, but scripts should be written with <command>sh</command> (or <command>bash</command>). You can find out what shell you have by typing <command>echo $SHELL</command>.
pt_br: Dois shells vem instalados com o FreeBSD: <command>csh</command> e <command>sh</command>. <command>csh</command> é bom para trabalhos na linha de comando, mas scripts devem ser escritos com o <command>sh</command> (ou <command>bash</command>). Você pode descobrir qual shell você utiliza executando o comando <command>echo $SHELL</command>.

source: Here are the three steps for installing a new shell:
pt_br: Aqui estão os dois passos para instalar um novo shell:

source: Install the shell as a port or a package, just as you would any other port or package.
pt_br: Instale o shell como um port ou um pacote, como faria com qualquer outro port ou pacote.

source: Now that you have installed <command>tcsh</command>, you can adjust your prompt. You can find the details in the manual page for <command>tcsh</command>, but here is a line to put in your <filename>.tcshrc</filename> that will tell you how many commands you have typed, what time it is, and what directory you are in. It also produces a <literal>&gt;</literal> if you are an ordinary user and a <literal>#</literal> if you are <systemitem class="username">root</systemitem>, but tsch will do that in any case:
pt_br: Agora que você instalou o <command>tcsh</command>, você pode ajustar o seu prompt. Você pode encontrar os detalhes na página de manual do <command>tcsh</command>, mas aqui está uma linha para colocar em seu <filename>.tcshrc</filename> que informará quantos comandos você digitou, qual o horário atual, e em qual diretório você está. Ele também produz um <literal>&gt;</literal> se você for um usuário comum e <literal>#</literal>se você for <systemitem class="username">root</systemitem>,mas o tcsh fará isso em qualquer caso:

source: This should go in the same place as the existing set prompt line if there is one, or under "if($?prompt) then" if not. Comment out the old line; you can always switch back to it if you prefer it. Do not forget the spaces and quotes. You can get the <filename>.tcshrc</filename> reread by typing <command>source .tcshrc</command>.
pt_br: Isso deve ir no mesmo lugar em que está a linha de prompt atual caso exista uma, ou logo abaixo de "if($?prompt) then" caso ela não exista. Comente a linha antiga; você sempre pode voltar a ela se preferir. Não esqueça os espaços e as aspas. Você pode forçar a releitura do <filename>.tcshrc</filename> digitando <command>source .tcshrc</command>.

source: Other
pt_br: Outros

source: As <systemitem class="username">root</systemitem>, you can unmount the CDROM with <command>/sbin/umount /cdrom</command>, take it out of the drive, insert another one, and mount it with <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command> assuming <hardware>cd0a</hardware> is the device name for your CDROM drive. The most recent versions of FreeBSD let you mount the CDROM with just <command>/sbin/mount /cdrom</command>.
pt_br: Como <systemitem class="username">root</systemitem>, você pode desmontar o CDROM com o comando <command>/sbin/umount /cdrom</command>, retire-o da unidade, insira outro e monte-o com <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command> considerando que <hardware>cd0a</hardware> é o nome do dispositivo da sua unidade de CDROM. As versões mais recentes do FreeBSD permitem montar o CDROM apenas com o comando <command>/sbin/mount /cdrom</command>.

source: Comments Welcome
pt_br: Comentários são bem-vindos

source: If you use this guide I would be interested in knowing where it was unclear and what was left out that you think should be included, and if it was helpful. My thanks to Eugene W. Stark, professor of computer science at SUNY-Stony Brook, and John Fieber for helpful comments.
pt_br: Caso você venha a usar este guia, eu estaria interessada em saber onde ele pode não ter ficado claro e o que foi deixado de fora que você acha que deveria ser incluído, e se ele foi útil para você. Meus agradecimentos a Eugene W. Stark, professor de ciência da computação na SUNY-Stony Brook, e também ao John Fieber pelos comentários úteis.
