<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/releases/snapshots.sgml,v 1.2 2004/01/06 17:31:44 stephane Exp $">
<!ENTITY title "Parution d'instantan&eacute;s de FreeBSD">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.16

  Version francaise : Regis GRAF
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
&header;

<h2>Que sont les instantan&eacute;s ?</h2>


    <p>Dans un souci constant d'am&eacute;liorer le
      processus de parution de version <em>AVANT</em> qu'une version 
      ne paraisse avec des probl&egrave;mes &agrave; s'arracher les cheveux,
      nous publions maintenant de mani&egrave;re p&eacute;riodique des versions 
      de <em>test</em> interm&eacute;diaires appel&eacute;es instantan&eacute;s (snapshots).
      Ces instantan&eacute;s sont tr&egrave;s semblables &agrave; des versions compl&egrave;tes,
      &agrave; ceci pr&egrave;s qu'il sont en quelque sorte plus minimaux. En 
      particulier, avant de r&eacute;cup&eacute;rer et d'installer un nouvel
      instantan&eacute;, soyez conscient que :

    <ul>

	<li>Par exemple, nous ne produirons pas de nouvelle distribution de
        XFree86 et nous ne nous pr&eacute;occupons pas trop du r&eacute;pertoire
        des outils, &agrave; moins que l'un ou l'autre ne soit affect&eacute; par
        les modifications &agrave; tester.

      <li>Le num&eacute;ro de version majeur de la disribution principale ne sera pas
        chang&eacute; pour chaque instantan&eacute;. Il sera <em>seulement</em>
        modifi&eacute; sur les disquettes de d&eacute;marrage pour que vous sachiez quand
        l'instantan&eacute; a &eacute;t&eacute; fait. Ce ne sont <em>pas</em> de nouvelles versions,
        ce sont des <em>instantan&eacute;s</em>, et il est important que cette
        distinction soit pr&eacute;serv&eacute;e. Les utilisateurs pouvant, et bien s&ucirc;r, faisant 
        r&eacute;f&eacute;rence aux instantan&eacute;s par leur date dans les courriers &eacute;lectroniques ou 
        les forums, nous ne voulons simplement pas qu'ils puissent penser que No&euml;l 
        est venu t&ocirc;t et que la prochaine version est d&eacute;j&agrave; sortie !


      <li>Enfin, nous ne mettrons pas n&eacute;cessairement &agrave; jour la documentation.
        Si un README se r&eacute;f&egrave;re toujours &agrave; une version pr&eacute;c&eacute;dente, et bien,
        c'est quand m&ecirc;me moins important que corriger les vrais bugs et
        tester les nouvelles fonctionalit&eacute;s. Les remarques concernant ce
        genre de chose seront simplement ignor&eacute;es. Encore une fois, ce sont 
        des <em>instantan&eacute;s</em>, pas des nouvelles versions!
    </ul>

    <p>Vos r&eacute;actions sur ces instantan&eacute;s sont, bien sur, plus que bienvenue.
      Ils ne sont pas seulement profitables pour nous - ceux qui comptent sur
      FreeBSD pour des applications critiques seront heureux d'avoir
      la chance de pouvoir b&eacute;n&eacute;ficier d'un syst&egrave;me mis &agrave; jour d'une fa&ccedil;on organis&eacute;e.
      Vous pouvez aussi utiliser ces instantan&eacute;s comme preuve tangible que vos
      commentaires sont pris en compte et que vous n'aurez (si tout va bien)
      aucune mauvaise surprise dans la prochaine version. D'un autre c&ocirc;t&eacute;, 
      si vous nous envoyez des messages d'insultes sur la nouvelle version 
      et qu'il apparait que vous n'avez jamais essay&eacute; les instantan&eacute;s, et bien,
      c'est &agrave; double tranchant. 

    <h2>O&ugrave; trouver les instantan&eacute;s</h2>

    <p>Les instantan&eacute;s de <a href="&enbase;/doc/en_US.ISO8859-1/books/handbook/current-stable.html#CURRENT">FreeBSD-CURRENT</a>
        sont disponibles par FTP anonyme &agrave;
        <a href="ftp://current.FreeBSD.org/pub/FreeBSD/">
        ftp://current.FreeBSD.org/pub/FreeBSD/</a>.
	Les versions instantan&eacute;es sont dans un r&eacute;pertoire dont le nom suit 
        le format <b>REL-AAMMJJ-SNAP</b> o&ugrave; `<b>REL</b>' est le num&eacute;ro de
        version, `<b>AA</b>' est l'ann&eacute;e, `<b>MM</b>' est
	le mois, et `<b>JJ</b>' est le jour o&ugrave; l'instantan&eacute; a &eacute;t&eacute; publi&eacute;.
        Chaque r&eacute;pertoire d'instantan&eacute; contient un fichier
	`<b>README</b>' qui d&eacute;crit les changement pour l'instantan&eacute; concern&eacute;.
        </p>

    <p>Suite &agrave; plusieurs demandes, les instantan&eacute;s sont maintenant aussi disponible
        pour la branche
        <a href="&enbase;/doc/en_US.ISO8859-1/books/handbook/current-stable.html#STABLE">FreeBSD-STABLE</a> par FTP anonyme &agrave;
	<a href="ftp://releng4.FreeBSD.org/pub/FreeBSD/">
	ftp://releng4.FreeBSD.org/pub/FreeBSD/</a>.
	Les versions instantan&eacute;s sont dans des r&eacute;pertoires appel&eacute;s suivant 
        la m&ecirc;me m&eacute;thode que pour les instantan&eacute;s -current,
        mais qui se terminent par le mot-cl&eacute; RELENG au lieu de SNAP.

<P></p><a href="index.html">Release Home</a>
&footer;
</body>
</html>
