<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->   

<!DOCTYPE ARTICLE PUBLIC "-//FreeBSD//DTD DocBook V3.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors SYSTEM "../../../en_US.ISO_8859-1/books/handbook/authors.ent"> %authors;
<!ENTITY % mailing-lists SYSTEM "../../books/handbook/mailing-lists.ent"> %mailing-lists;
 <!ENTITY rel.current CDATA "3.2">
]>

<article lang="fr">
  <artheader>
    <title>Formatage des supports pour FreeBSD 2.2-RELEASE</title>
    <subtitle>Un guide</subtitle>
    <authorgroup>
      <author>
        <firstname>Doug</firstname>
        <surname>White</surname>
      </author>
    </authorgroup>
    &artheader.copyright;
    <abstract>
      <para><email>dwhite@resnet.uoregon.edu</email></para>
      <para>Mars 1997</para>
      <para>Ce document d&eacute;crit comment d&eacute;couper, partitionner et formater les
        disques durs et autres supports similaires pour les utiliser avec
        FreeBSD. Les exemples propos&eacute;s ont &eacute;t&eacute; test&eacute;s avec FreeBSD 2.2-GAMMA et
        devraient &ecirc;tre applicables &agrave; d'autres versions.</para>
      &abstract.license;
      &abstract.disclaimer;
      &trans.a.haby;
    </abstract>
  </artheader>
  <sect1>
    <title>Introduction et d&eacute;finitions</title>
      <sect2>
        <title>R&eacute;sum&eacute;</title>
        <para>R&eacute;ussir &agrave; ajouter des disques &agrave; un syst&egrave;me existant est la
          marque d'un administrateur syst&egrave;me exp&eacute;riment&eacute;. D&eacute;couper, partitionner
          et ajouter des disques requiert de combiner avec soin commande
          ad&eacute;quate et syntaxe de nommage. Une frappe malheureuse et un disque
          entier peut dispara&icirc;tre en quelques secondes. Ce document est une 
          tentative pour simplifier le processus et &eacute;viter les accidents. 
          Heureusement, les outils existants (tout particuli&egrave;rement 
          <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>)
          ont notablement am&eacute;lior&eacute; ce processus dans les derni&egrave;res versions de
          FreeBSD.</para>
      <para>Il y a deux possibilit&eacute;s de formatage d'un disque:</para>
      <itemizedlist>
        <listitem>
          <para><emphasis>mode compatible</emphasis>: Configurer un disque
            pour qu'il ait une table des 
            tranches&nbsp;-&nbsp;&ldquo;<foreignphrase>slices</foreignphrase>&rdquo;&nbsp;-&nbsp;utilisable
            avec d'autres syst&egrave;mes d'exploitation.</para>
        </listitem>
        <listitem>
          <para><emphasis>mode dangeureusement d&eacute;di&eacute;</emphasis>: Formater un 
            disque sans table des 
            tranches&nbsp;-&nbsp;&ldquo;<foreignphrase>slices</foreignphrase>&rdquo;.
            Cela facilite l'ajout de disques, mais des syst&egrave;mes d'exploitation
            autres que FreeBSD risquent de ne pas reconna&icirc;tre de tels
            disques.</para>
        </listitem>
      </itemizedlist>
      <para>Dans la plupart des cas, le mode d&eacute;di&eacute; est le plus facile &agrave; mettre
        en oeuvre et &agrave; utiliser sur des syst&egrave;mes existants, auquel cas le 
        nouveau disque est en g&eacute;n&eacute;ral enti&egrave;rement d&eacute;di&eacute; &agrave; FreeBSD. Cependant,
        le mode compatible garantit le maximum d'interop&eacute;rabilit&eacute; avec des
        installations ult&eacute;rieures, au prix d'une plus grande complexit&eacute;.</para>
      <para>En plus du choix du mode, il existe deux m&eacute;thodes pour d&eacute;couper le
        disque. La premi&egrave;re est d'utiliser l'outil 
        <citerefentry><refentrytitle>/stand/sysinstall</refentrytitle></citerefentry> 
        d'installation du syst&egrave;me. A partir de la version 2.1.7-RELEASE de 
        FreeBSD, 
        <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry> 
        contient du code qui facilite la
        configuration de disques en cours d'op&eacute;ration normale du syst&egrave;me,
        donnant essentiellement acc&egrave;s aux &eacute;diteurs de labels et de partitions,
        et comportant un fonctionnalit&eacute; d'&eacute;criture qui ne met &agrave; jour que le
        disque s&eacute;lectionn&eacute; sans toucher aux autres disques. La seconde m&eacute;thode
        consiste &agrave; employer les utilitaires, &agrave; la main, depuis la ligne de
        commande, en session sous le compte super-utilisateur
        <username>root</username>. Pour le mode dangeureusement d&eacute;di&eacute;, il n'y
        a que trois ou quatre commandes concern&eacute;es, alors que 
        <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry> 
        demande quelques manipulations.</para>
    </sect2>
    <sect2>
      <title>D&eacute;finitions</title>
      <para>La gestion de disques Unix a, au fil des si&egrave;cles, invent&eacute; de
        nombreuses nouvelles d&eacute;finitions pour d'anciens mots. Le glossaire
        ci-dessous donne les d&eacute;finitions des expressions utilis&eacute;es dans
        ce document et (esp&eacute;rons-le) pour ce qui concerne FreeBSD en 
        g&eacute;n&eacute;ral.</para>
      <itemizedlist>
        <listitem>
          <para><emphasis>mode compatible</emphasis>: Configurer un disque
            pour qu'il ait une table des 
            tranches&nbsp;-&nbsp;&ldquo;<foreignphrase>slices</foreignphrase>&rdquo;&nbsp;-&nbsp;utilisable
            avec d'autres syst&egrave;mes d'exploitation. C'est le contraire du mode
            dangeureusement d&eacute;di&eacute;.</para>
        </listitem>
        <listitem>
          <para><emphasis>mode dangeureusement d&eacute;di&eacute;</emphasis>: Formater un 
            disque sans table des 
            tranches&nbsp;-&nbsp;&ldquo;<foreignphrase>slices</foreignphrase>&rdquo;.
            Cela facilite l'ajout de disques, mais des syst&egrave;mes d'exploitation
            autres que FreeBSD risquent de ne pas reconna&icirc;tre de tels
            disques. C'est le contraire du mode compatible.</para>
        </listitem>
        <listitem>
          <para>disque: un disque circulaire recouvert d'un mat&eacute;riau magn&eacute;tique
            ou &eacute;quivalent, qui tourne, m&ucirc; par un moteur, devant une t&ecirc;te de
            lecture. Les donn&eacute;es sont enregistr&eacute;es sur le disque en modifiant
            la magn&eacute;tisation du support, et peuvent &ecirc;tre ensuite relues. Les
            disques durs, CD-ROMs, disques magn&eacute;to-optiques et supports 
            amovibles Zip ou Jaz, sont des exemples de disques.</para>
        </listitem>
        <listitem>
          <para>tranche&nbsp;-&nbsp;&ldquo;<foreignphrase>slice</foreignphrase>&rdquo;: 
            une subdivision du disque. Il peut y avoir jusqu'&agrave; quatre tranches
            sur un disque d'apr&egrave;s le standard PC. Les tranches sont constitu&eacute;es
            de secteurs adjacents. Les tranches sont d&eacute;crites par une 
            &ldquo;table des tranches&rdquo; utilis&eacute;e par le BIOS du syst&egrave;me 
            pour localiser les partitions d&eacute;marrables. La table des tranches 
            est habituellement appel&eacute;e &ldquo;table des partitions&rdquo; en
            langage DOS. Les tranches sont g&eacute;r&eacute;es par l'utilitaire 
            <citerefentry><refentrytitle>fdisk</refentrytitle></citerefentry>.</para>
        </listitem>
        <listitem>
          <para>partition: une subdivision de la 
            tranche&nbsp;-&nbsp;&ldquo;<foreignphrase>slice</foreignphrase>&rdquo;.         
            Habituellement utilis&eacute;e pour d&eacute;signer les divisions de la tranche
            FreeBSD du disque. Chaque syst&egrave;me de fichiers et espace de
            pagination r&eacute;side sur une partition. Les partitions sont g&eacute;r&eacute;es par 
            l'utilitaire
            <citerefentry><refentrytitle>disklabel</refentrytitle></citerefentry>.</para>
        </listitem>
        <listitem>
          <para>secteur: la plus petite subdivision d'un disque. Un secteur
            contient habituellement 512 octets de donn&eacute;es.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2>
      <title>Avertissements et pi&egrave;ges &agrave; &eacute;viter</title>
      <para>Installer des disques n'est pas quelque chose &agrave; prendre &agrave; la 
        l&eacute;g&egrave;re. Il est tout &agrave; fait possible de d&eacute;truire le contenu d'autres
        disques de votre syst&egrave;me si vous ne prenez pas les pr&eacute;cautions
        n&eacute;cessaires.</para>
      <para><emphasis>V&eacute;rifiez avec soin ce que vous faites</emphasis>. Il est  
        tr&egrave;s facile d'effacer le mauvais disque quand vous utilisez ces 
        commandes. En cas de doute, consultez les messages de d&eacute;marrage du
        noyau pour conna&icirc;tre le nom exact du p&eacute;riph&eacute;rique.</para>
      <para>Inutile de pr&eacute;ciser que nous ne serions en rien responsable des
        d&eacute;gats que vous causeriez &agrave; vos donn&eacute;es ou &agrave; votre mat&eacute;riel. Vous
        travaillez &agrave; vos risques et p&eacute;rils.</para>
    </sect2>
    <sect2>
      <title>Zip, Jaz et autres disques amovibles</title>
      <para>Les disques amovibles peuvent &ecirc;tre format&eacute;s de la m&ecirc;me fa&ccedil;on que les
        disques durs ordinaires. Il est indispensable que le lecteur soit 
        connect&eacute; et qu'il y ait un disque dedans au d&eacute;marrage du syst&egrave;me, pour
        que le noyau puisse d&eacute;terminer la g&eacute;om&eacute;trie du disque. Consultez les
        r&eacute;sultats de 
        <citerefentry><refentrytitle>dmesg</refentrytitle></citerefentry> 
        et v&eacute;rifiez que le disque et sa taille y figurent. Si le noyau &eacute;met le 
        message:</para>
      <programlisting>
Can't get the size
      </programlisting>
      <para>c'est que le disque n'&eacute;tait pas dans le lecteur. Dans ce cas, vous
        devrez red&eacute;marrer la machine avant de formater des disques.</para>
    </sect2>
  </sect1>
  <sect1>
    <title>Formater des disques en mode d&eacute;di&eacute;</title>
    <sect2>
      <title>Introduction</title>
      <para>Cette section explique en d&eacute;tail comment configurer des disques
        enti&egrave;rement d&eacute;di&eacute;s &agrave; FreeBSD. N'oubliez pas que des disques en mode
        d&eacute;di&eacute; ne peuvent pas &ecirc;tre utilis&eacute;s par l'architecture PC pour d&eacute;marrer
        le syst&egrave;me.</para>
    </sect2>
    <sect2>
      <title>Formater des disques en mode d&eacute;di&eacute; avec Sysinstall</title>
      <para><filename>/stand/sysinstall</filename>, l'utilitaire 
        d'installation du syst&egrave;me, a &eacute;t&eacute; am&eacute;lior&eacute; dans les versions r&eacute;centes
        pour rendre le processus de d&eacute;coupage propre des disques moins
        p&eacute;nible. Les &eacute;diteurs 
        <citerefentry><refentrytitle>fdisk</refentrytitle></citerefentry> et 
        <citerefentry><refentrytitle>disklabel</refentrytitle></citerefentry> 
        inclus dans 
        <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
        sont des outils interactifs qui
        dissipent une bonne partie de la confusion li&eacute;e aux op&eacute;rations de
        d&eacute;coupage de disques en &ldquo;tranches&rdquo;. Avec FreeBSD 2.1.7 et
        ult&eacute;rieur, c'est probablement la m&eacute;thode la plus simple pour le
        faire.</para>
      <orderedlist>
        <listitem>
          <para>Lancez 
            <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
            en tant que super-utilisateur <username>root</username> en 
            tapant:</para>
          <informalexample>
<screen>&prompt.root; <userinput>/stand/sysinstall</userinput></screen>
          </informalexample>
          <para>sur la ligne de commande.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Index</option>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Partition</option>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez le disque &agrave; configurer avec les touches Fl&egrave;ches et
            la barre d'espacement.</para>
        </listitem>
        <listitem>
          <para>Si vous utilisez tout le disque pour FreeBSD, s&eacute;lectionnez
            <option>A</option>.</para>
        </listitem>
        <listitem>
          <para>A la question:</para>
          <programlisting>
Do you want to do this with a true partition entry so as to remain
cooperative with any future possible operating systems on the
drive(s)?

[Voulez-vous cr&eacute;er une vraie entr&eacute;e de partition pour rester
compatible avec d'&eacute;ventuels futurs syst&egrave;mes d'exploitation
sur le(s) disque(s)?]
          </programlisting>
          <para>r&eacute;pondez <option>No</option> (Non).</para>
        </listitem>
        <listitem>
          <para>Quand on vous demande si vous voulez continuer, r&eacute;pondez
            <option>Yes</option> (Oui).</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Write</option> (Ecrire).</para>
        </listitem>
        <listitem>
          <para>A l'avertissement &agrave; propos de l'&eacute;criture sur des syst&egrave;mes
            d&eacute;j&agrave; install&eacute;s, r&eacute;pondez <option>Yes</option> (Oui).</para>
        </listitem>
        <listitem>
          <para><option>Quit</option>tez l'&eacute;diteur
            <citerefentry><refentrytitle>fdisk</refentrytitle></citerefentry>
            et revenez au menu d'<option>Index</option> avec 
            <keycap>Echap</keycap>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Label</option> dans le menu 
            d'<option>Index</option>.</para>
        </listitem>
        <listitem>
          <para>Libellez le disque comme vous le souhaitez. Si vous ne voulez
            qu'une seule partition, tapez <keycap>C</keycap> pour cr&eacute;er une
            partition, validez la taille propos&eacute;e par d&eacute;faut, prenez comme
            type de partition <option>Filesystem</option> (syst&egrave;me de fichiers)
            et indiquez un point de montage (qui dans ce cas ne sert &agrave; 
            rien).</para>
        </listitem>
        <listitem>
          <para>Tapez <keycap>W</keycap> une fois que vous avez termin&eacute;. Le
            syst&egrave;me de fichiers sera initialis&eacute; avec
            <citerefentry><refentrytitle>newfs</refentrytitle></citerefentry>
            sans que vous n'ayez autre chose &agrave; faire, &agrave; moins que vous ne
            fassiez un autre choix (pour les nouvelles partitions, il faut
            initialiser le syst&egrave;me de fichiers!). Vous aurez un message 
            d'erreur:</para>
          <programlisting>
Error mounting /mnt/dev/wd2s1e on /mnt/blah : No such file or directory
          </programlisting>
          <para>Ne vous en occupez pas.</para>
        </listitem>
        <listitem>
          <para>Quittez le programme, en utilisant &agrave; plusieurs reprises la 
            touche <keycap>Echap</keycap>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2>
      <title>Formater des disques en mode d&eacute;di&eacute; depuis la ligne de 
        commande</title>
      <para>Ex&eacute;cutez les commandes suivantes, en substituant &agrave;
        <devicename>wd2</devicename> le nom de votre disque. Les lignes
        qui commencent par <literal>#</literal> sont des commentaires.</para>
      <informalexample>
<screen><userinput>dd if=/dev/zero of=/dev/rwd2 count=2</userinput>
<userinput>disklabel /dev/rwd2 | disklabel -B -R -r wd2 /dev/stdin</userinput>
# Nous ne voulons qu'une partition, utiliser la tranche 'c' devrait aller:
<userinput>newfs /dev/rwd2c</userinput></screen>
      </informalexample>
      <para>Si vous avez besoin de modifier le label du disque pour cr&eacute;er
        plusieurs partitions (pour la pagination par exemple), utilisez la
        s&eacute;quence suivante:</para>
      <informalexample>
<screen><userinput>dd if=/dev/zero of=/dev/rwd2 count=2</userinput>
<userinput>disklabel /dev/r$d > /tmp/label</userinput>
# Modifiez le label du disque pour ajouter des partitions:
<userinput>vi /tmp/label</userinput>
<userinput>disklabel -B -R -r wd2 /tmp/label</userinput>
# Cr&eacute;ez les syst&egrave;mes de fichiers sur les partitions avec newfs selon les besoins</screen>
      </informalexample>
      <para>Votre disque est maintenant pr&ecirc;t &agrave; &ecirc;tre utilis&eacute;.</para>
    </sect2>
  </sect1>
  <sect1>
    <title>Formater des disques en mode compatible</title>
    <sect2>  
      <title>Introduction</title>
      <para>Travailler depuis la ligne de commande est la mani&egrave;re la plus facile
        de formater des disques d&eacute;di&eacute;s, et la pire pour formater des disques
        compatibles. L'utilitaire en ligne de commande
        <citerefentry><refentrytitle>fdisk</refentrytitle></citerefentry> 
        demande une bonne connaissance des math&eacute;matiques et une compr&eacute;hension en
        profondeur de la structure de la table des &ldquo;tranches&rdquo;, qui
        d&eacute;passent ce dont la plupart des gens souhaitent se pr&eacute;occuper. Utilisez
        <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
        comme d&eacute;crit dans ce qui suit.</para>
    </sect2>  
    <sect2>  
      <title>Formater des disques en mode compatible avec Sysinstall</title>
      <orderedlist>
        <listitem>
          <para>Lancez 
            <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
            en tant que super-utilisateur <username>root</username> en 
            tapant:</para>
          <informalexample>
<screen>&prompt.root; <userinput>/stand/sysinstall</userinput></screen>
          </informalexample>
          <para>sur la ligne de commande.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Index</option>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Partition</option>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez le disque &agrave; configurer avec les touches Fl&egrave;ches et
            la barre d'espacement.</para>
        </listitem>
        <listitem>
          <para>Si vous utilisez tout le disque pour FreeBSD, s&eacute;lectionnez
            <option>A</option>.</para>
        </listitem>
        <listitem>
          <para>A la question:</para>
          <programlisting>
Do you want to do this with a true partition entry so as to remain
cooperative with any future possible operating systems on the
drive(s)?

[Voulez-vous cr&eacute;er une vraie entr&eacute;e de partition pour rester
compatible avec d'&eacute;ventuels futurs syst&egrave;mes d'exploitation
sur le(s) disque(s)?]
          </programlisting>
          <para>r&eacute;pondez <option>Yes</option> (Oui).</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Write</option> (Ecrire).</para>
        </listitem>
        <listitem>
          <para><option>Quit</option>tez l'&eacute;diteur
          <citerefentry><refentrytitle>fdisk</refentrytitle></citerefentry>.</para>
        </listitem>
        <listitem>
          <para>A la question &agrave; propos du gestionnaire de d&eacute;marrage, r&eacute;pondez
            encore <option>None</option> (aucun).</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <option>Label</option> dans le menu 
            d'<option>Index</option>.</para>
        </listitem>
        <listitem>
          <para>Libellez le disque comme vous le souhaitez. Si vous ne voulez
            qu'une seule partition, validez la taille propos&eacute;e par 
            d&eacute;faut, prenez comme type de partition <option>Filesystem</option>
            (syst&egrave;me de fichiers) et indiquez un point de montage (qui dans ce 
            cas ne sert &agrave; rien).</para>
        </listitem>
        <listitem>
          <para>Le syst&egrave;me de fichiers sera initialis&eacute; avec
            <citerefentry><refentrytitle>newfs</refentrytitle></citerefentry>
            sans que vous n'ayez autre chose &agrave; faire, &agrave; moins que vous ne
            fassiez un autre choix (pour les nouvelles partitions, il faut
            initialiser le syst&egrave;me de fichiers!). Vous aurez un message 
            d'erreur:</para>
          <programlisting>
Error mounting /mnt/dev/wd2s1e on /mnt/blah : No such file or directory
          </programlisting>
          <para>Ne vous en occupez pas.</para>
        </listitem>
        <listitem>
          <para>Quittez le programme, en utilisant &agrave; plusieurs reprises la 
            touche <keycap>Echap</keycap>.</para>
        </listitem>
      </orderedlist>
      <para>Votre nouveau disque est pr&ecirc;t &agrave; &ecirc;tre utilis&eacute;.</para>
    </sect2>
  </sect1>
  <sect1>
    <title>Autres op&eacute;rations sur les disques</title>
    <sect2>
      <title>Ajout d'espace de pagination</title>
      <para>Au fur et &agrave; mesure que le syst&egrave;me grossit, ses besoins d'espace de
        pagination peuvent aussi augmenter. Alors qu'il est tr&egrave;s difficile 
        d'ajouter de l'espace de pagination &agrave; des disques en service, un nouveau
        disque peut &ecirc;tre partitionn&eacute; pour mettre en oeuvre de l'espace de
        pagination suppl&eacute;mentaire.</para>
      <para>Pour ajouter de l'espace de pagination au moment de l'installation 
        d'un nouveau disque:</para>
      <orderedlist>
        <listitem>
          <para>Au moment de partitionner le disque, &eacute;ditez son label et
            allouer la quantit&eacute; d'espace de pagination voulue en ajoutant une
            partition 'b' et en affectant le reste &agrave; une autre partition,
            telle que 'a' ou 'e'. La taille est &agrave; donner en blocs de 512
            octets.</para>
        </listitem>
        <listitem>
          <para>Au moment de cr&eacute;er les syst&egrave;mes de fichiers avec
            <citerefentry><refentrytitle>newfs</refentrytitle></citerefentry>,
            ne formatez pas la partition 'c'. Formatez &agrave; la place la partition
            qui n'est pas r&eacute;serv&eacute;e &agrave; la pagination.</para>
        </listitem>
        <listitem>
          <para>Ajoutez la ligne qui suit &agrave; 
            <filename>/etc/fstab</filename>:</para>
          <programlisting>
/dev/wd0b                       none            swap    sw 0 0
          </programlisting>
          <para>En remplacant <filename>/dev/wd0b</filename> par le nom du 
            nouvel espace de pagination.</para>
        </listitem>
        <listitem>
          <para>Pour que l'espace de pagination soit imm&eacute;diatement utilisable,
            utilisez la commande
            <citerefentry><refentrytitle>newfs</refentrytitle></citerefentry>:</para>
          <informalexample>
<screen>&prompt.user; <userinput>swapon /dev/sd0b</userinput>
swapon:  added /dev/sd0b as swap space</screen>
          </informalexample>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2>
      <title>Copier le contenu d'un disque sur un autre</title>
      <para>Propos&eacute; par: Renauld Waldura 
        <email>renaud@softway.com</email>.</para>
      <para>Pour d&eacute;placer le contenu d'un disque sur un nouveau, faites:</para>
      <informalexample>
<screen>&prompt.root; <userinput>mount /dev/wd2 /mnt</userinput>
&prompt.root; <userinput>pax -r -w -p e /usr/home /mnt</userinput>
&prompt.root; <userinput>umount /mnt</userinput>
&prompt.root; <userinput>rm -rf /usr/home/*</userinput>
&prompt.root; <userinput>mount /dev/wd2 /usr/home</userinput></screen>
      </informalexample>
    </sect2>
    <sect2>
      <title>Cr&eacute;er des disques &agrave; &eacute;critures r&eacute;parties avec 
        <devicename>ccd</devicename></title>
      <para>Commandes transmises par: Stan Brown 
        <email>stanb@awod.com</email>.</para>
      <para>Le pilote de disques 
        concat&eacute;n&eacute;s&nbsp;-&nbsp;&ldquo;<foreignphrase>Concatenated Disk 
        Driver</foreignphrase>&rdquo;, ou CCD&nbsp;-&nbsp;vous permet
        d'utiliser plusieurs disques comme s'il s'agissait d'un seul. Les
        &eacute;critures r&eacute;parties peuvent augmenter les performances disque en
        distribuant les lectures et les &eacute;critures sur plusieurs disques.
        Voyez les pages de manuel de
        <citerefentry><refentrytitle>ccd</refentrytitle>
        <manvolnum>4</manvolnum></citerefentry> et
        <citerefentry><refentrytitle>ccdconfig</refentrytitle>
        <manvolnum>4</manvolnum></citerefentry> ou la
        <ulink url="http://stampede.cs.berkeley.edu/ccd/">page de 
        CCD</ulink>, pour plus d'informations.</para>
      <para>Pour cr&eacute;er un nouveau CCD, ex&eacute;cutez les commandes ci-dessous.
        Elles d&eacute;crivent comment concat&eacute;ner trois disques; ajoutez ou
        supprimez des p&eacute;riph&eacute;riques selon vos besoins. Rappelez-vous
        que les disques sur lequels se fera la r&eacute;partition doivent &ecirc;tre
        <emphasis>identiques</emphasis>.</para>
      <para>Avant d'ex&eacute;cuter ces commandes, v&eacute;rifiez que vous avez bien 
        ajout&eacute; la ligne:</para>
      <programlisting>
pseudo-device ccd 4 
      </programlisting>
      <para>&agrave; la configuration de votre noyau.</para>
      <informalexample>
<screen>&prompt.root; <userinput>cd /dev ; sh MAKDEV ccd0</userinput></screen>
      </informalexample>
      <informalexample>
<screen>&prompt.root; <userinput>disklabel -r -w sd0 auto</userinput>
&prompt.root; <userinput>disklabel -r -w sd1 auto</userinput>
&prompt.root; <userinput>disklabel -r -w sd2 auto</userinput></screen>
      </informalexample>
      <informalexample>
<screen>&prompt.root; <userinput>disklabel -e sd0c</userinput> # changer le type en 4.2BSD
&prompt.root; <userinput>disklabel -e sd1c</userinput> # changer le type en 4.2BSD
&prompt.root; <userinput>disklabel -e sd2c</userinput> # changer le type en 4.2BSD</screen>
      </informalexample>
      <informalexample>
<screen>&prompt.root; <userinput>ccdconfig ccd0 32 0 /dev/sd0c /dev/sd1c /dev/sd2c</userinput></screen>
      </informalexample>
      <informalexample>
<screen>&prompt.root; <userinput>newfs /dev/rccd0c</userinput></screen>
      </informalexample>
      <para>Vous pouvez maintenant monter et utiliser votre CCD en le
        r&eacute;f&eacute;ren&ccedil;ant comme p&eacute;riph&eacute;rique 
        <filename>/dev/ccd0c</filename>.</para>
    </sect2>
  </sect1>
  <sect1>
    <title>Remerciements</title>
    <para>L'auteur aimerait remercier les personnes suivantes pour leur
      contribution &agrave; ce projet:</para>
    <itemizedlist>
      <listitem>
        <para>Darryl Okahata <email>darrylo@hpnmhjw.sr.hp.com</email>,
          pour sa documentation simple sur la configuration de
          disques en mode d&eacute;di&eacute;, que j'ai utilis&eacute;e &agrave; plusieurs reprises
          sur la &a.questions;.</para>
      </listitem>
      <listitem>
        <para>&a.jkh; pour avoir rendu 
          <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
          utile &agrave; ce type de t&acirc;ches.</para>
      </listitem>
      <listitem>
        <para>John Fieber <email>jfieber@indiana.edu</email> pour avoir
          mis au point la documentation et les exemples d'utilisation de
          la <foreignphrase>DTD Docbook</foreignphrase> utilis&eacute;e
          pour mettre en forme ce document.</para>
      </listitem>
      <listitem>
        <para>&a.grog; pour avoir contr&ocirc;l&eacute; mon travail et mentionn&eacute; les
          inexactitudes, ainsi que pour son concours sur divers points.</para>
      </listitem>
    </itemizedlist>
  </sect1>
</article>
