Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-questions/_index.po
Languages: pt_br, ru

source: Put your response in the correct place (after the text to which it replies). It is very difficult to read a thread of responses where each reply comes before the text to which it replies.
pt_br: Coloque sua resposta no lugar correto (após o texto ao qual ela se refere). É muito difícil ler um encadeamento de respostas em que cada resposta vem antes do texto ao qual ela se refere.
ru: Поместите ваш ответ в правильном месте (после текста, на который вы отвечаете). Очень трудно читать набор ответов, когда каждый из них следует перед текстом, к которому относится.

source: Most mailers change the subject line on a reply by prepending a text such as "Re: ". If your mailer does not do it automatically, you should do it manually.
pt_br: A maioria dos programas de email altera a linha de assunto em uma resposta adicionando um texto como "Re: ". Se o seu programa de email não fizer isso automaticamente, você deve fazê-lo manualmente.
ru: Большинство почтовых программ меняют строку темы письма в ответе, предваряя ее текстом типа "Re: ". Если ваша почтовая программа не делает это автоматически, вы должны делать это вручную.

source: If the submitter did not abide by format conventions (lines too long, inappropriate subject line) _please_ fix it. In the case of an incorrect subject line (such as "HELP!!??"), change the subject line to (say) "Re: Difficulties with sync PPP (was: HELP!!??)". That way other people trying to follow the thread will have less difficulty following it.
pt_br: Se o autor da pergunta não seguir as convenções de formato (linhas muito longas, assunto inapropriado), _por favor_ corrija-o. No caso de uma linha de assunto incorreta (como "AJUDA!!??"), altere a linha de assunto para (por exemplo) "Re: Dificuldades com PPP de sincronização (era: AJUDA!!??)". Dessa forma, outras pessoas que tentam seguir a discussão terão menos dificuldade em acompanhá-la.
ru: Если спрашивающий не следует соглашениям по форматированию текста (слишком длинные строки, неподходящая строка темы), __пожалуйста__, исправьте эти ошибки. В случае некорректной строки темы письма (типа "HELP!!??") измените её, например, так: "Re: Difficulties with sync PPP (was: HELP!!??)". В таком случае у других людей, пытающихся отследить обсуждение, будет меньше проблем.

source: In such cases, it is appropriate to say what you did and why you did it, but try not to be rude. If you find you can not answer without being rude, do not answer.
pt_br: Nesses casos, é apropriado dizer o que você fez e por que fez, mas tente não ser rude. Se você descobrir que não consegue responder sem ser rude, não responda.
ru: В таких случаях хорошо сказать, что вы сделали и почему, но постарайтесь не грубить. Если вы чувствуете, что не можете ответить, не скатываясь на грубость, воздержитесь от ответа вообще.

source: If you just want to reply to a message because of its bad format, just reply to the submitter, not to the list. You can just send him this message in reply, if you like.
pt_br: Se você quiser apenas responder a uma mensagem por causa do seu formato ruim, apenas responda ao autor da mensagem, não para a lista. Você pode simplesmente enviar esta mensagem para ele em resposta, se desejar.
ru: Если вы хотите ответить на сообщение лишь потому, что оно плохо оформлено, ответьте только автору, но не в список. Если хотите, то в ответ можете просто послать ему эту статью.

source: Browse and/or search the archives for the mailing list, to see if your question or a similar one has been asked (and possibly answered) on the list. You can browse and/or search the mailing list archives at https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] and https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists] respectively.
ru: Просмотрите и/или выполните поиск по архивам списка рассылки, чтобы узнать, задавался ли ваш вопрос или подобный ему в списке (и возможно, был на него ответ). Вы можете просматривать и/или искать архивы списка рассылки по адресам https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] и https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists] соответственно.
