Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-questions/_index.po
Languages: pt_br, ru

source: How to get Best Results from the FreeBSD-questions Mailing List
pt_br: Como obter os melhores resultados da lista de discussão FreeBSD-questions
ru: Как работать со списком рассылки FreeBSD-questions c максимальной отдачей

source: Abstract
pt_br: Resumo
ru: Аннотация

source: This document provides useful information for people looking to prepare an e-mail to the FreeBSD-questions mailing list. Advice and hints are given that will maximize the chance that the reader will receive useful replies.
pt_br: Este documento fornece informações úteis para pessoas que procuram preparar um e-mail para a lista de discussão FreeBSD-questions. São fornecidos conselhos e dicas que maximizarão a chance de o leitor receber respostas úteis.
ru: В этом документе содержится информация, которая будет полезна тем, кто собирается отправить письмо в список рассылки FreeBSD-questions. Даются советы и рекомендации, которые максимально увеличат шанс на получение полезных ответов.

source: This document is regularly posted to the FreeBSD-questions mailing list.
pt_br: Este documento é regularmente postado na lista de discussão FreeBSD-questions.
ru: Этот документ регулярно публикуется в списке рассылки FreeBSD-questions.

source: Introduction
pt_br: Introdução
ru: Введение

source: `FreeBSD-questions` is a mailing list maintained by the FreeBSD project to help people who have questions about the normal use of FreeBSD. Another group, `FreeBSD-hackers`, discusses more advanced questions such as future development work.
pt_br: A `FreeBSD-questions` é uma lista de discussão mantida pelo projeto FreeBSD para ajudar pessoas que têm dúvidas sobre o uso normal do FreeBSD. Outro grupo, `FreeBSD-hackers`, discute questões mais avançadas, como trabalho futuro de desenvolvimento.
ru: `FreeBSD-questions` является списком рассылки, который поддерживается проектом FreeBSD для оказания помощи тем, у кого возникли вопросы по поводу использования FreeBSD в повседневной работе. В другом списке рассылки, `FreeBSD-hackers`, обсуждаются более сложные вопросы, такие, как направление будущей работы над системой.

source: The term "hacker" has nothing to do with breaking into other people's computers. The correct term for the latter activity is "cracker", but the popular press has not found out yet. The FreeBSD hackers disapprove strongly of cracking security, and have nothing to do with it. For a longer description of hackers, see Eric Raymond's http://www.catb.org/~esr/faqs/hacker-howto.html[How To Become A Hacker]
pt_br: O termo "hacker" não tem nada a ver com invadir computadores de outras pessoas. O termo correto para essa atividade é "cracker", mas a imprensa popular ainda não descobriu isso. Os hackers do FreeBSD desaprovam fortemente a quebra de segurança e não têm nada a ver com isso. Para uma descrição mais longa de hackers, consulte o http://www.catb.org/~esr/faqs/hacker-howto.html[How To Become A Hacker] de Eric Raymond
ru: Термин "хакер" не имеет ничего общего с проникновением на компьютеры других людей. Правильным термином для обозначения такой деятельности является "кракер", однако популярная пресса этого еще не поняла. Хакеры FreeBSD нарушением защиты не занимаются. Более полное описание хакеров находится в руководстве Эрика Рэймонда (Eric Raymond) http://www.catb.org/~esr/faqs/hacker-howto.html[Как стать хакером]

source: This is a regular posting aimed to help both those seeking advice from FreeBSD-questions (the "newcomers"), and also those who answer the questions (the "hackers").
pt_br: Este é uma mensagem regular destinada a ajudar tanto aqueles que buscam conselhos da FreeBSD-questions (os "novatos"), quanto aqueles que respondem às perguntas (os "hackers").
ru: Данный регулярно рассылаемый документ предназначен для помощи как тем, кто ищет ответов на вопросы во FreeBSD-questions ("новички"), так и тем, кто на эти вопросы отвечает ("хакеры").

source: Inevitably there is some friction, which stems from the different viewpoints of the two groups. The newcomers accuse the hackers of being arrogant, stuck-up, and unhelpful, while the hackers accuse the newcomers of being stupid, unable to read plain English, and expecting everything to be handed to them on a silver platter. Of course, there is an element of truth in both these claims, but for the most part these viewpoints come from a sense of frustration.
pt_br: Inevitavelmente sempre existe algum atrito, o qual deriva dos diferentes pontos de vista dos dois grupos. Os novatos acusam os hackers de serem arrogantes, orgulhosos e não ajudarem, enquanto os hackers acusam os novatos de serem burros, incapazes de lerem textos em simples Português, e esperarem que tudo seja dado a eles em uma bandeja de prata. Claro que há algum elemento de verdade em cada um dos discursos, mas normalmente estes pontos de vista são frutos de algum tipo de frustração.
ru: Несомненно, здесь существуют некоторые трения, которые проистекают из-за разных точек зрения этих двух групп. Новички обвиняют хакеров в высокомерии, заносчивости и несостоятельности в оказании помощи, когда как хакеры обвиняют начинающих в том, что последние глупы, не умеют читать по-английски и ждут, что им все будет преподнесено на блюдечке с голубой каемочкой. Конечно, есть элемент правды в обоих этих утверждениях, однако по большей части такие мнения появляются из-за чувства разочарования.

source: In this document, I would like to do something to relieve this frustration and help everybody get better results from FreeBSD-questions. In the following section, I recommend how to submit a question; after that, we will look at how to answer one.
pt_br: Nesse documento, eu desejo fazer algo para aliviar essa frustração e ajudar todos a obterem melhores resultados da FreeBSD-questions. Na próxima seção, eu recomendo como enviar uma pergunta; depois disso, veremos como responder a uma.
ru: В этом документе я постараюсь уменьшить это разочарование и помочь всем получить более хорошие результаты от FreeBSD-questions. В следующем разделе я дам рекомендации по посылке вопросов; после этого мы посмотрим, как нужно на них отвечать.

source: How to Subscribe to FreeBSD-questions
pt_br: Como se Inscrever na FreeBSD-questions
ru: Как подписаться на FreeBSD-questions

source: FreeBSD-questions is a mailing list, so you need mail access. Point your WWW browser to the {freebsd-questions}. In the section titled "Subscribe or unsubscribe online" fill in the "Your email address" field and hit "Subscribe". Or send an email to freebsd-questions+subscribe@freebsd.org.
pt_br: A FreeBSD-questions é uma lista de discussão, portanto, você precisa de acesso a uma conta de e-mail. Aponte seu navegador WWW para {freebsd-questions}. Na seção intitulada "Inscreva-se ou cancele a inscrição on-line", preencha o campo "Seu endereço de e-mail" e clique em "Inscrever-se". Ou envie um e-mail para freebsd-questions+subscribe@freebsd.org.
ru: FreeBSD-questions является списком рассылки, распространяемым по электронной почте, поэтому вам нужен доступ к системе электронной почты. Зайдите через ваш WWW браузер на {freebsd-questions}. В разделе "Подписка на freebsd-questions" (Subscribing to freebsd-questions) заполните поле "Ваш адрес электронной почты" (Your email address); другие поля являются опциональными.

source: You will receive a confirmation message from mlmmj; follow the included instructions to complete your subscription.
pt_br: Você receberá uma mensagem de confirmação do mlmmj; siga as instruções incluídas para concluir sua inscrição.
ru: Вы получите подтверждающее сообщение от mlmmj; следуйте приложенным инструкциям для завершения подписки.

source: How to Unsubscribe from FreeBSD-questions
pt_br: Como sair da lista FreeBSD-questions
ru: Как отписаться от FreeBSD-questions

source: Point your WWW browser to the {freebsd-questions}. In the section titled "Subscribe or unsubscribe online" fill in the "Your email address" field and hit "Unsubscribe". Or send an email to freebsd-questions+unsubscribe@freebsd.org.
pt_br: Aponte seu navegador WWW para {freebsd-questions}. Na seção intitulada "Inscreva-se ou cancele a inscrição on-line", preencha o campo "Seu endereço de e-mail" e clique em "Cancelar inscrição". Ou envie um e-mail para freebsd-questions+unsubscribe@freebsd.org.
ru: Направьте ваш браузер на {freebsd-questions}. В разделе "Subscribe or unsubscribe online" заполните поле "Your email address" и нажмите "Unsubscribe". Или отправьте письмо на freebsd-questions+unsubscribe@freebsd.org.

source: A confirmation message will be sent to you from mlmmj; follow the included instructions to finish unsubscribing.
pt_br: Uma mensagem de confirmação será enviada a você pelo mlmmj; siga as instruções incluídas para concluir o cancelamento da inscrição.
ru: Сообщение с подтверждением будет отправлено вам от mlmmj; следуйте приложенным инструкциям, чтобы завершить отмену подписки.

source: Should I ask `-questions` or `-hackers`?
pt_br: Devo enviar minha pergunta para a lista `-questions` ou `-hackers`?
ru: Нужно задавать вопросы в `-questions` или `-hackers`?

source: Two mailing lists handle general questions about FreeBSD, `FreeBSD-questions` and `FreeBSD-hackers`. In some cases, it is not really clear which group you should ask. The following criteria should help for 99% of all questions, however:
pt_br: Duas listas de discussão abordam questões gerais sobre o FreeBSD, `FreeBSD-questions` e `FreeBSD-hackers`. Em alguns casos, não é realmente claro para qual lista você deve enviar sua pergunta. Entretanto, os seguintes critérios devem ajudar em 99% de todas as perguntas:
ru: Общим вопросам по FreeBSD посвящены два списка рассылки, `FreeBSD-questions` и `FreeBSD-hackers`. В некоторых случаях на самом деле не ясно, в каком списке нужно задавать вопрос. Следующий критерий, однако, должен помочь в 98% всех случаев:

source: If the question is of a general nature, ask `FreeBSD-questions`. Examples might be questions about installing FreeBSD or the use of a particular UNIX(R) utility.
pt_br: Se a pergunta for de natureza geral, pergunte na lista de discussão `FreeBSD-questions`. Exemplos podem ser perguntas sobre a instalação do FreeBSD ou o uso de uma determinada ferramenta UNIX(R).
ru: Если вопрос является общим, спрашивайте во `FreeBSD-questions`. Примерами могут служить вопросы по установке FreeBSD или использованию конкретных утилит UNIX(R).

source: If you think the question relates to a bug, but you are not sure, or you do not know how to look for it, send the message to `FreeBSD-questions`.
pt_br: Se você acha que a pergunta se relaciona a um bug, mas não tem certeza ou não sabe como procurá-lo, envie a mensagem para `FreeBSD-questions`.
ru: Если вы думаете, что вопрос относится к ошибке, но вы не уверены или не знаете, как ее исправить, пошлите сообщение во `FreeBSD-questions`.

source: If the question relates to a bug, and you are _sure_ that it is a bug (for example, you can pinpoint the place in the code where it happens, and you maybe have a fix), then send the message to `FreeBSD-hackers`.
pt_br: Se a pergunta se relacionar a um bug, e você _tiver certeza_ de que é um bug (por exemplo, você pode apontar o local no código onde ocorre e talvez tenha uma solução), envie a mensagem para `FreeBSD-hackers`.
ru: Если вопрос относится к ошибке и вы __уверены__, что это ошибка (например, вы можете указать место в коде, где она происходит, и, может быть, у вас есть для нее исправление), то пошлите сообщение в список рассылки `FreeBSD-hackers`.

source: If the question relates to enhancements to FreeBSD, and you can make suggestions about how to implement them, then send the message to `FreeBSD-hackers`.
pt_br: Se a pergunta se relaciona a melhorias no FreeBSD, e você pode fazer sugestões sobre como implementá-las, envie a mensagem para `FreeBSD-hackers`.
ru: Если вопрос относится к усовершенствованию FreeBSD, и вы можете дать предложения по ее реализации, то посылайте сообщение во `FreeBSD-hackers`.

source: There are also a number of other extref:{handbook}[specialized mailing lists, eresources-mail], which caters to more specific interests. The criteria above still apply, and it is in your interest to stick to them, since you are more likely to get good results that way.
pt_br: Existem também várias outras listas de discussão extref:{handbook}[especializadas, eresources-mail], que atendem a interesses mais específicos. Os critérios acima ainda se aplicam, e é do seu interesse segui-los, já que é mais provável que você obtenha bons resultados dessa maneira.
ru: Имеется также некоторое количество других extref:{handbook}eresources[специализированных списков рассылки, eresources-mail]. Здесь также подходит указанный выше критерий, и в ваших интересах следовать ему, потому что именно так можно получить результат.

source: Before Submitting a Question
pt_br: Antes de Enviar uma Pergunta
ru: Перед посылкой вопроса

source: You can (and should) do some things yourself before asking a question on one of the mailing lists:
pt_br: Antes de fazer uma pergunta em uma das listas de discussão, você pode (e deve) fazer algumas coisas por conta própria:
ru: Вы можете (и должны) что-нибудь сделать сами перед тем, как задать вопрос в одном из списков рассылки:

source: Try solving the problem on your own. If you post a question which shows that you have tried to solve the problem, your question will generally attract more positive attention from people reading it. Trying to solve the problem yourself will also enhance your understanding of FreeBSD, and will eventually let you use your knowledge to help others by answering questions posted to the mailing lists.
pt_br: Tente resolver o problema por conta própria. Se você postar uma pergunta que mostre que você tentou resolver o problema, sua pergunta geralmente atrairá mais atenção positiva das pessoas que a lerem. Tentar resolver o problema por si só também aumentará sua compreensão do FreeBSD e eventualmente permitirá que você use seu conhecimento para ajudar os outros, respondendo perguntas postadas nas listas de discussão.
ru: Попытайтесь решить проблему самостоятельно. Если вы пошлёте вопрос, который покажет, что вы пытались решить проблему, ваш вопрос, как правило, привлечёт более положительное внимание со стороны людей, читающих его. Попытка решить проблему самостоятельно также увеличит уровень вашего понимания FreeBSD, и в конечном счёте позволит вам использовать ваши знания для помощи другим, отвечая на вопросы, посылаемые в списки рассылки.

source: Read the manual pages, and the FreeBSD documentation (either installed in [.filename]#/usr/doc# or accessible via WWW at http://www.FreeBSD.org[http://www.FreeBSD.org]), especially the extref:{handbook}[handbook] and the extref:{faq}[FAQ].
pt_br: Leia as páginas do manual e a documentação do FreeBSD (instaladas em [.filename]#/usr/doc# ou acessíveis via WWW em http://www.FreeBSD.org[http://www.FreeBSD.org]), especialmente o extref:{handbook}[Handbook] e o extref:{faq}[FAQ].
ru: Прочтите страницы справочника и документацию FreeBSD (установлена в [.filename]#/usr/doc# или доступна через WWW на http://www.FreeBSD.org[http://www.FreeBSD.org]), особенно extref:{handbook}[Руководство пользователя] и extref:{faq}[FAQ].

source: Browse and/or search the archives for the mailing list, to see if your question or a similar one has been asked (and possibly answered) on the list. You can browse and/or search the mailing list archives at https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] and https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists] respectively. This can be done at other WWW sites as well, for example at http://marc.theaimsgroup.com[http://marc.theaimsgroup.com].
pt_br: Pesquise nos arquivos da lista de discussão para ver se sua pergunta ou uma semelhante já foi feita (e possivelmente respondida) na lista. Você pode navegar e/ou pesquisar os arquivos da lista de discussão em https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] e https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists], respectivamente. Isso também pode ser feito em outros sites da WWW, por exemplo, em http://marc.theaimsgroup.com[http://marc.theaimsgroup.com].

source: Use a search engine such as http://www.google.com[Google] or http://www.yahoo.com[Yahoo] to find answers to your question.
pt_br: Use um mecanismo de pesquisa, como o http://www.google.com[Google] ou http://www.yahoo.com[Yahoo], para encontrar respostas para sua pergunta.
ru: Используйте поисковик, например, http://www.google.com[Google] или http://www.yahoo.com[Yahoo] для поиска ответов на ваш вопрос. Google имеет даже http://www.google.com/bsd[BSD ориентированный поисковой интерфейс].

source: How to Submit a Question
pt_br: Como Enviar uma Pergunta
ru: Как посылать вопрос

source: When submitting a question to FreeBSD-questions, consider the following points:
pt_br: Quando for enviar uma pergunta para a lista FreeBSD-questions, considere as seguintes diretivas:
ru: При посылке сообщения в список рассылки FreeBSD-questions, имейте в виду следующее:

source: Remember that nobody gets paid for answering a FreeBSD question. They do it of their own free will. You can influence this free will positively by submitting a well-formulated question supplying as much relevant information as possible. You can influence this free will negatively by submitting an incomplete, illegible, or rude question. It is perfectly possible to send a message to FreeBSD-questions and not get an answer even if you follow these rules. It is much more possible to not get an answer if you do not. In the rest of this document, we will look at how to get the most out of your question to FreeBSD-questions.
pt_br: Lembre-se de que ninguém recebe remuneração para responder a uma pergunta sobre o FreeBSD. Eles fazem isso por vontade própria. Você pode influenciar positivamente essa vontade enviando uma pergunta bem formulada, fornecendo o máximo de informações relevantes possível. Você pode influenciar negativamente essa vontade enviando uma pergunta incompleta, ilegível ou rude. É perfeitamente possível enviar uma mensagem para a FreeBSD-questions e não obter uma resposta, mesmo se você seguir essas regras. É muito mais possível não obter uma resposta se você não seguir. No restante deste documento, veremos como obter o máximo da sua pergunta para o FreeBSD-questions.
ru: Помните, что за ответы на вопросы о FreeBSD никто денег не получает. Все делают это в свободное время. Вы можете привлечь внимание, послав четко сформулированный вопрос, содержащий как можно больше относящейся к делу информации. Вы можете не получить внимания, послав неполный, непонятный или примитивный вопрос. В действительности можно посылать сообщение в список рассылки FreeBSD-questions и не получить ответа, даже если вы следуете этим правилам. Еще более вероятно не получить ответа, если вы им не следуете. В оставшейся части документа мы рассмотрим, как получить максимум от вопроса во FreeBSD-questions.

source: Not everybody who answers FreeBSD questions reads every message: they look at the subject line and decide whether it interests them. Clearly, it is in your interest to specify a subject. "FreeBSD problem" or "Help" are not enough. If you provide no subject at all, many people will not bother reading it. If your subject is not specific enough, the people who can answer it may not read it.
pt_br: Nem todo mundo que responde as perguntas sobre o FreeBSD lê todas as mensagens: eles olham para o assunto e decidem se isso lhes interessa. Claramente, é do seu interesse especificar um assunto. Assuntos como "Problema do FreeBSD" ou "Ajuda" não são suficientes. Se você não fornecer nenhum assunto, muitas pessoas não se incomodarão em lê-lo. Se o seu assunto não for específico o suficiente, as pessoas que podem responder sua pergunta podem não ler sua mensagem.
ru: Не всякий человек, могущий ответить на вопрос о FreeBSD, читает все сообщения: обычно читается строка с темой письма и решается, представляет ли сообщение интерес. То есть в ваших интересах указать тему письма. "FreeBSD problem" или "Help" недостаточно. Если вы не укажете тему вообще, то многие даже не потрудятся прочесть сообщение. Если тема сообщения недостаточно конкретна, то люди, которые могут ответить, могут его не прочесть.

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. We appreciate that a lot of people do not speak English as their first language, and we try to make allowances for that, but it is really painful to try to read a message written full of typos or without any line breaks.
pt_br: Formate a sua mensagem para que ela fique legível e, POR FAVOR, NÃO GRITE !!!!! Nós apreciamos que muitas pessoas não falam inglês como sua primeira língua, e tentamos fazer concessões para isso, mas é realmente doloroso tentar ler uma mensagem escrita com erros de digitação ou sem quebras de linha.
ru: Оформляйте ваше сообщение так, чтобы оно было читабельно, и ПОЖАЛУЙСТА, НЕ КРИЧИТЕ!!!!!. Мы понимаем, что для многих английский не является родным языком, и не исключаем этого, однако действительно очень трудно и мучительно читать сообщение, полное опечаток или в котором отсутствуют разделители строк.

source: Do not underestimate the effect that a poorly formatted mail message has, not just on the FreeBSD-questions mailing list. Your mail message is all people see of you, and if it is poorly formatted, one line per paragraph, badly spelt, or full of errors, it will give people a poor impression of you.
pt_br: Não subestime o efeito que uma mensagem de correio mal formatada tem, não apenas na lista de discussão FreeBSD-questions. Sua mensagem de e-mail é tudo o que todas as pessoas vêem de você, e se estiver mal formatada, uma linha por parágrafo, mal grafada ou cheia de erros, isso dará às pessoas uma má impressão sobre você.
ru: Не упускайте из виду эффект, который производит плохо отформатированное письмо, причем не только в списке рассылки FreeBSD-questions. По вашему почтовому сообщению люди составляют мнение о вас, и если сообщение плохо отформатировано, содержит по одной строке на абзац, неправильно разделено или полно ошибок, то о вас сложится плохое впечатление.

source: A lot of badly formatted messages come from http://www.lemis.com/email.html[bad mailers or badly configured mailers]. The following mailers are known to send out badly formatted messages without you finding out about them:
pt_br: Muitas mensagens mal formatadas são provenientes de http://www.lemis.com/email.html[programas de e-mail mal configurados ou com configurações ruins]. Os seguintes programas de e-mail são conhecidos por enviar mensagens mal formatadas sem que você saiba:
ru: Множество плохо форматированных сообщений возникает из-за http://www.lemis.com/email.html[неправильно работающих или плохо настроенных почтовых программ]. Известно, что следующие почтовые программы могут посылать неправильно отформатированные сообщения без вашего ведома об этом:

source: Try not to use MIME: a lot of people use mailers which do not get on very well with MIME.
pt_br: Tente não usar MIME: muitas pessoas usam clientes de e-mail que não lidam bem com MIME.
ru: Постарайтесь не использовать MIME: многие используют программы, которые не очень хорошо работают с MIME.
