Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-questions/_index.po
Languages: pt_br, ru

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people you are trying to reach get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume they missed it and not bother to look.
pt_br: Verifique se seu horário e fuso horário estão definidos corretamente. Isso pode parecer um pouco bobo, já que sua mensagem ainda será distribuída, mas muitas das pessoas que você está tentando alcançar recebem várias centenas de mensagens por dia. Eles frequentemente classificam as mensagens recebidas por assunto e por data, e se a sua mensagem não vem antes da primeira resposta, eles podem assumir que eles a perderam e não se darão ao trabalho de procurar.
ru: Проверьте правильность настроек времени и временной зоны. Это может выглядеть немножко глупо, потому что ваши сообщения все равно будут доставляться, однако многие люди получают несколько сотен сообщений в день. Зачастую они сортируют входящие сообщения по теме и дате, и если ваше сообщение не будет предшествовать первому ответу, то они могут предположить, что оно потерялось и даже не взглянут на него.

source: Do not include unrelated questions in the same message. Firstly, a long message tends to scare people off, and secondly, it is more difficult to get all the people who can answer all the questions to read the message.
pt_br: Não inclua perguntas não relacionadas na mesma mensagem. Em primeiro lugar, uma mensagem longa tende a assustar as pessoas e, em segundo lugar, é mais difícil conseguir que todas as pessoas que podem responder a todas as perguntas leiam a mensagem.
ru: Не включайте не связанные друг с другом вопросы в одно и то же письмо. Во-первых, длинное сообщение отпугивает людей, а во-вторых, труднее найти людей, которые могут ответить на все вопросы, и прочитали такое сообщение.

source: Specify as much information as possible. This is a difficult area, and we need to expand on what information you need to submit, but here is a start:
pt_br: Especifique o máximo de informação possível. Essa é uma área difícil, precisamos expandir e detalhar melhor quais informações você precisa enviar, mas aqui está um começo:
ru: Сообщите максимальное количество информации. Это трудно, и нужно пояснить, какую информацию нужно сообщать, а поначалу:

source: In nearly every case, it is important to know the version of FreeBSD you are running. This is particularly the case for FreeBSD-CURRENT, where you should also specify the date of the sources, though of course you should not be sending questions about -CURRENT to FreeBSD-questions.
pt_br: Em quase todos os casos, é importante saber a versão do FreeBSD que você está executando. Isso é particularmente importante para o FreeBSD-CURRENT, onde você também deve especificar a data das fontes, embora, é claro, você não deva enviar perguntas sobre o -CURRENT para o FreeBSD-questions.
ru: Практически в любом случае важно знать версию FreeBSD, с которой вы работаете. Особенно, в частности, в случае FreeBSD-CURRENT вы должны также указать дату исходных текстов, хотя, конечно, вам не нужно посылать сообщения о -CURRENT в список рассылки FreeBSD-questions.

source: With any problem which _could_ be hardware related, tell us about your hardware. In case of doubt, assume it is possible that it is hardware. What kind of CPU are you using? How fast? What motherboard? How much memory? What peripherals?
pt_br: Com qualquer problema que _pode_ estar relacionado ao hardware, informe-nos sobre seu hardware. Em caso de dúvida, assuma que é possível que seja um problema de hardware. Que tipo de CPU você está usando? Quão rápida? Qual placa-mãe? Quanta memória? Quais periféricos?
ru: В случае любой проблемы, которая _может_ быть связана с работой оборудования, расскажите о вашем аппаратном обеспечении. В случае сомнений предположите, что это, возможно, вина оборудования. Какой тип процессора используется? Насколько он быстр? Какая материнская плата? Сколько установлено памяти? Какое периферийное оборудование?

source: There is a judgement call here, of course, but the output of the man:dmesg[8] command can frequently be very useful, since it tells not just what hardware you are running, but what version of FreeBSD as well.
pt_br: Há um julgamento envolvido aqui, é claro, mas a saída do comando man:dmesg[8] frequentemente pode ser muito útil, pois não apenas informa qual hardware você está usando, mas também qual versão do FreeBSD.
ru: Здесь вам стоит подумать и принять решение, конечно, но вывод команды man:dmesg[8] зачастую может оказаться очень полезным, так как он говорит не только об оборудовании, с которым вы работаете, но также и о версии FreeBSD.

source: If you get error messages, do not say "I get error messages", say (for example) "I get the error message 'No route to host'".
pt_br: Se você receber mensagens de erro, não diga "Eu recebo mensagens de erro", diga (por exemplo) "Eu recebo a mensagem de erro 'No route to host'".
ru: Если выдаются сообщения об ошибках, недостаточно написать "I get error messages", напишите (например) "I get the error message 'No route to host'".

source: If your system panics, do not say "My system panicked", say (for example) "my system panicked with the message 'free vnode isn't'".
pt_br: Se o seu sistema "panica", não diga "Meu sistema "panica", diga (por exemplo) "Meu sistema "panica" com a mensagem 'free vnode isn't'".
ru: Если ваша система завершает работу аварийно, не пишите "My system panicked", напишите (к примеру) "my system panicked with the message 'free vnode isn't'".

source: If you have difficulty installing FreeBSD, please tell us what hardware you have. In particular, it is important to know the IRQs and I/O addresses of the boards installed in your machine.
pt_br: Se você tiver dificuldade para instalar o FreeBSD, informe-nos sobre o seu hardware. É especialmente importante saber os IRQs e os endereços I/O das placas instaladas em sua máquina.
ru: Если у вас возникли трудности при установке FreeBSD, пожалуйста, опишите ваше оборудование. В частности, важно знать адреса ввода/вывода и IRQ адаптеров, установленных в вашей машине.

source: If you have difficulty getting PPP to run, describe the configuration. Which version of PPP do you use? What kind of authentication do you have? Do you have a static or dynamic IP address? What kind of messages do you get in the log file?
pt_br: Caso você esteja com dificuldades para executar o PPP, descreva a configuração utilizada. Qual versão do PPP está sendo utilizada? Que tipo de autenticação está sendo utilizada? O endereço IP é estático ou dinâmico? Que tipo de mensagens aparecem no arquivo de log?
ru: Если у вас возникли трудности в настройке PPP, опишите настройку. Какую версию PPP вы используете? Какой тип аутентификации? У вас используется статическое или динамическое выделение адресов IP? Какие сообщения вы получили в файле протокола?

source: A lot of the information you need to supply is the output of programs, such as man:dmesg[8], or console messages, which usually appear in [.filename]#/var/log/messages#. Do not try to copy this information by typing it in again; it is a real pain, and you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like man:dmesg[8], redirect the output to a file and include that. For example,
pt_br: Muitas das informações que você precisa fornecer são a saída de programas, como o man:dmesg[8], ou mensagens de console, que geralmente aparecem no arquivo [.filename]#/var/log/messages#. Não tente copiar essa informação digitando-a novamente; isso é realmente difícil e você provavelmente cometerá um erro. Para enviar o conteúdo do arquivo de log, faça uma cópia do arquivo e use um editor para selecionar apenas as informações relevantes, ou copie e cole na sua mensagem. Para a saída de programas como o man:dmesg[8], redirecione a saída para um arquivo e inclua esse arquivo. Por exemplo,
ru: Основной объем информации, который вы должны дать, представляет собой вывод программ, таких, как man:dmesg[8], или консольные сообщения, которые обычно появляются в файле [.filename]#/var/log/messages#. Не пытайтесь скопировать эту информацию, набрав ее снова; это действительно трудно, и здесь легко сделать ошибку. Чтобы послать содержимое файлов протоколов, сделайте копию файла и воспользуйтесь редактором для того, чтобы обрезать информацию, оставив только относящуюся к делу, либо скопируйте и вставьте текст в ваше сообщение. В случае вывода программ, таких, как man:dmesg[8], перенаправьте вывод в файл и включите его в письмо. Например,

source: This redirects the information to the file [.filename]#/tmp/dmesg.out#.
pt_br: Isto redireciona a informação para o arquivo [.filename]#/tmp/dmesg.out#.
ru: Эта команда перенаправляет информацию в файл [.filename]#/tmp/dmesg.out#.

source: If you do all this, and you still do not get an answer, there could be other reasons. For example, the problem is so complicated that nobody knows the answer, or the person who does know the answer was offline. If you do not get an answer after, say, a week, it might help to re-send the message. If you do not get an answer to your second message, though, you are probably not going to get one from this forum. Resending the same message again and again will only make you unpopular.
pt_br: Se você fizer tudo isso e ainda assim não receber uma resposta, pode haver outras razões. Por exemplo, o problema pode ser tão complicado que ninguém sabe a resposta, ou a pessoa que sabe a resposta estava offline. Se você não receber uma resposta após, digamos, uma semana, pode ser útil reenviar a mensagem. No entanto, se você não receber uma resposta para sua segunda mensagem, provavelmente não receberá uma resposta neste fórum. Reenviar a mesma mensagem várias vezes só fará com que você fique impopular.
ru: Если вы все это сделали, и все же не можете получить ответа, этому могут быть другие причины. Например, проблема столь сложна, что никто не знает ответа, или тот, кто знает, отсутствовал. Если вы не получили ответа, скажем, в течении недели, может помочь повторная посылка сообщения. Если вы не получили ответа на свое второе послание, скорее всего, вы вовсе не получите его из этого списка рассылки. Повторная посылка того же самого сообщения снова и снова только повредит вашей репутации.

source: To summarize, let's assume you know the answer to the following question (yes, it is the same one in each case). You choose which of these two questions you would be more prepared to answer:
pt_br: Para resumir, vamos supor que você saiba a resposta para a seguinte pergunta (sim, é a mesma em cada caso). Você escolhe qual dessas duas perguntas você estaria mais preparado para responder:
ru: Подводя итог, давайте предположим, что вы знаете ответ на следующий вопрос (да, это один и тот же вопрос). Выберите, на какой вопрос вы в большей степени готовы ответить:

source: Message 1
pt_br: Mensagem 1
ru: Сообщение 1

source: Subject: HELP!!?!?? I just can't get hits damn silly FereBSD system to workd, and Im really good at this tsuff, but I have never seen anythign sho difficult to install, it jst wont work whatever I try so why don't you guys tell me what I doing wrong.
pt_br: Assunto: AJUDA!!?!?? Eu simplesmente não consigo fazer esse maldito sistema FreeBSD funcionar, e eu sou realmente bom nisso, mas nunca vi nada tão difícil de instalar, não importa o que eu tente, simplesmente não funciona. Por que vocês não me dizem o que estou fazendo de errado?

source: Message 2
pt_br: Mensagem 2
ru: Сообщение 2

source: Subject: Problems installing FreeBSD
pt_br: Assunto: Problemas na instalação do FreeBSD

source: I've just got the FreeBSD 2.1.5 CDROM from Walnut Creek, and I'm having a lot of difficulty installing it. I have a 66 MHz 486 with 16 MB of memory and an Adaptec 1540A SCSI board, a 1.2GB Quantum Fireball disk and a Toshiba 3501XA CDROM drive. The installation works just fine, but when I try to reboot the system, I get the message Missing Operating System.
pt_br: Acabei de receber o CD-ROM do FreeBSD 2.1.5 da Walnut Creek e estou tendo muita dificuldade para instalá-lo. Tenho um 486 de 66 MHz com 16 MB de memória e uma placa SCSI Adaptec 1540A, um disco Quantum Fireball de 1,2 GB e uma unidade de CD-ROM Toshiba 3501XA. A instalação funciona muito bem, mas quando tento reiniciar o sistema, recebo a mensagem "Sistema Operacional Ausente".

source: How to Follow up to a Question
pt_br: Como fazer o acompanhamento de uma pergunta
ru: Как дополнить вопрос

source: Often you will want to send in additional information to a question you have already sent. The best way to do this is to reply to your original message. This has three advantages:
pt_br: Muitas vezes, você desejará enviar informações adicionais para uma pergunta que já enviou. A melhor maneira de fazer isso é responder à sua mensagem original. Isso tem três vantagens:
ru: Часто вам бывает нужно дать дополнительную информацию к вопросу, который вы уже отослали. Лучшим способом сделать это является ответ на первоначальное сообщение. Здесь есть три момента:

source: You include the original message text, so people will know what you are talking about. Do not forget to trim unnecessary text out, though.
pt_br: Você inclui o texto da mensagem original, assim as pessoas saberão do que você está falando. Não esqueça de retirar texto desnecessário.
ru: Вы включаете текст исходного сообщения, чтобы люди знали, о чем вы говорите. Однако не забудьте удалить ненужный текст.

source: The text in the subject line stays the same (you did remember to put one in, did you not?). Many mailers will sort messages by subject. This helps group messages together.
pt_br: O texto no campo do assunto permanece o mesmo (você lembrou de colocar o assunto, não foi?). Muitos aplicativos ordenarão as mensagens pelo assunto. Isto ajuda o agrupamento de mensagens.
ru: Текст в строке с темой письма остается тем же самым (вы не забыли его указать, не правда ли?). Многие почтовые программы сортируют сообщения по теме письма. Это поможет при группировке сообщений.

source: The message reference numbers in the header will refer to the previous message. Some mailers, such as http://www.mutt.org/[mutt], can _thread_ messages, showing the exact relationships between the messages.
pt_br: Os números de referência da mensagem no cabeçalho se referirão à mensagem anterior. Alguns programas de e-mail, como o http://www.mutt.org/[mutt], podem _agrupar_ as mensagens, mostrando as relações exatas entre as mensagens.
ru: Ссылочные номера сообщений в заголовке будут указывать на предыдущее сообщение. Некоторые почтовые программы, такие, как http://www.mutt.org/[mutt], могут _упорядочивать_ сообщения, показывая точную связь между ними.

source: How to Answer a Question
pt_br: Como Responder uma Pergunta
ru: Как отвечать на вопрос

source: Before you answer a question to FreeBSD-questions, consider:
pt_br: Antes de responder uma pergunta na FreeBSD-questions, considere:
ru: Перед тем, как отвечать на вопрос в списке рассылки FreeBSD-questions, имейте в виду:

source: A lot of the points on submitting questions also apply to answering questions. Read them.
pt_br: Muitas das diretivas usadas quando se está para escrever uma questão também são válidas para respondê-las. Leia-as.
ru: Многие замечания, касающиеся посылки вопросов, относятся и к ответам на них. Прочтите эти замечания.

source: Has somebody already answered the question? The easiest way to check this is to sort your incoming mail by subject: then (hopefully) you will see the question followed by any answers, all together.
pt_br: Alguém já respondeu à pergunta? A maneira mais fácil de conferir isto é ordenando as mensagens recebidas pelo assunto: então (esperançosamente) você verá a pergunta seguida pelas respectivas respostas, todas juntas.
ru: Ответил ли кто-либо на вопрос? Самым простым способом проверить это является сортировка входящей почты по темам писем: тогда (надеемся) вы увидите вопрос с последующими ответами все вместе.

source: If somebody has already answered it, it does not automatically mean that you should not send another answer. But it makes sense to read all the other answers first.
pt_br: Se alguém já respondeu, isso não significa automaticamente que você não deve enviar outra resposta. Mas faz sentido ler todas as outras respostas primeiro.
ru: Если кто-то уже ответил на вопрос, это вовсе не значит, что вы не должны посылать свой ответ. Но сначала имеет смысл прочитать все другие ответы.

source: Do you have something to contribute beyond what has already been said? In general, "Yeah, me too" answers do not help much, although there are exceptions, like when somebody is describing a problem they are having, and they do not know whether it is their fault or whether there is something wrong with the hardware or software. If you do send a "me too" answer, you should also include any further relevant information.
pt_br: Você tem algo a acrescentar além do que já foi dito? Em geral, respostas como "Sim, eu também" não ajudam muito, embora existam exceções, como quando alguém está descrevendo um problema que está tendo e não sabe se é culpa dele ou se há algo de errado com o hardware ou software. Se você enviar uma resposta do tipo "eu também", lembre-se de incluir qualquer informação adicional relevante.
ru: Есть ли у вас что добавить сверх того, что уже было сказано? В общем случае ответы "Yeah, me too" сильно не помогут, хотя есть и исключения, например, когда кто-нибудь описывает свою проблему и не знает, его ли это ошибка, или что-то не так с аппаратным или программным обеспечением. Если вы посылаете сообщение "me too", включите также относящуюся к делу информацию.

source: Are you sure you understand the question? Very frequently, the person who asks the question is confused or does not express themselves very well. Even with the best understanding of the system, it is easy to send a reply which does not answer the question. This does not help: you will leave the person who submitted the question more frustrated or confused than ever. If nobody else answers, and you are not too sure either, you can always ask for more information.
pt_br: Você tem certeza de que entendeu a pergunta? Com muita frequência, a pessoa que faz a pergunta está confusa ou não se expressa muito bem. Mesmo com o melhor entendimento do sistema, é fácil enviar uma resposta que não responda à pergunta. Isso não ajuda: você deixará a pessoa que fez a pergunta mais frustrada ou confusa do que nunca. Se ninguém mais responder e você também não tiver certeza, sempre pode pedir mais informações.
ru: Уверены ли вы, что поняли вопрос? Очень часто тот, кто задает вопрос, путается или не может все хорошо описать. Даже при самом полном понимании системы легко послать ответ, который не отвечает на вопрос. К сожалению, так вы никому не поможете, только ещё больше запутаете и разочаруете спрашивающего. Если никто больше не отвечает, или вы не очень уверены, то всегда можете запросить более подробную информацию.

source: Are you sure your answer is correct? If not, wait a day or so. If nobody else comes up with a better answer, you can still reply and say, for example, "I do not know if this is correct, but since nobody else has replied, why don't you try replacing your ATAPI CDROM with a frog?".
pt_br: Você tem certeza de que sua resposta está correta? Se não tiver certeza, espere um dia ou mais. Se ninguém mais apresentar uma resposta melhor, você ainda pode responder e dizer, por exemplo, "Não tenho certeza se isso está correto, mas como ninguém mais respondeu, por que você não tenta substituir seu CD-ROM ATAPI por um sapo?".
ru: Уверены ли вы, что ваш ответ корректен? Если нет, то подождите пару дней. Если никого больше не появится с лучшим ответом, чем ваш, то вы можете ответить и сказать, например, "I don't know if this is correct, but since nobody else has replied, why don't you try replacing your ATAPI CDROM with a frog?".

source: Unless there is a good reason to do otherwise, reply to the sender and to FreeBSD-questions. Many people on the FreeBSD-questions are "lurkers": they learn by reading messages sent and replied to by others. If you take a message which is of general interest off the list, you are depriving these people of their information. Be careful with group replies; lots of people send messages with hundreds of CCs. If this is the case, be sure to trim the Cc: lines appropriately.
pt_br: A menos que haja uma boa razão para fazer o contrário, responda ao remetente e à FreeBSD-questions. Muitas pessoas em FreeBSD-questions são "espectadores": elas aprendem lendo as mensagens enviadas e respondidas por outros. Se você tirar uma mensagem de interesse geral da lista, estará privando essas pessoas de suas informações. Tenha cuidado com as respostas em grupo; muitas pessoas enviam mensagens com centenas de CCs. Se esse for o caso, certifique-se de cortar as linhas de Cc: apropriadamente.
ru: Если нет причин поступить как-то иначе, то ответьте отправителю и в список рассылки FreeBSD-questions. Многие подписчики FreeBSD-questions "таятся": они учатся на чтении сообщений, посланных и отвеченных другими. Если вы пошлете сообщение, представляющее интерес для всех, минуя список рассылки, то лишите этих людей их информации. Будьте внимательны при ответе всем; многие посылают сообщения с сотнями CC-адресатов. В таких случаях удалите лишние строки Cc:.

source: Include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
pt_br: Inclua o texto relevante da mensagem original. Corte-o ao mínimo, mas não exagere. Deve ainda ser possível para alguém que não leu a mensagem original entender sobre o que você está falando.
ru: Из исходного сообщения включите текст, который относится к делу. Избегайте излишнего цитирования, но не переусердствуйте. Тот, кто не читал первоначального сообщения, должен понять, о чём же идёт речь.

source: Use some technique to identify which text came from the original message, and which text you add. I personally find that prepending "`>`" to the original message works best. Leaving white space after the "`> ;`" and leave empty lines between your text and the original text both make the result more readable.
pt_br: Use alguma técnica para identificar qual texto veio da mensagem original e qual texto você adicionou. Pessoalmente, acho que adicionar um "`>`" na frente da mensagem original funciona melhor. Deixar um espaço em branco depois do "`> ;`" e deixar linhas vazias entre seu texto e o texto original torna o resultado mais legível.
ru: Используйте приемы выделения текста, который взят из исходного сообщения и текста, который добавили вы. Лично я нахожу, что для первоначального текста лучше всего работает вставка символа "`>`". Вставка пробела после "`>`" и пустых строк между вашим и первоначальным текстами сделает результат более читабельным.
