
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title 'Recursos para Principiantes'>
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<html>
    &header;
    
    <p>Los siguientes recursos son algunos de los que los principiantes
	en FreeBSD han encontrado de m&aacute;s ayuda cuando estaban aprendiendo
	a usar el FreeBSD.
	Por favor, enviad correcciones o a&ntilde;adidos a
      <a href="mailto:freebsd-newbies@freebsd.org">FreeBSD-Newbies@FreeBSD.org</a>.</p>
    <ul>
      <li><a href="#web-site">Usando la web de FreeBSD</a></li>
      <li><a href="#fbsd">Aprendiendo FreeBSD</a></li>
      <li><a href="#unix">Aprendiendo UNIX</a></li>
      <li><a href="#xwin">Aprendiendo el sistema de X Window</a></li>
      <li><a href="#people">Ayudando a otra gente</a></li>
    </ul>


    <h2><a name="web-site">Usando la web de FreeBSD</a></h2>
    
    <p>Este sitio web es el principal recurso con la informaci&oacute;n
	actualizada sobre FreeBSD. Los principiantes han encontrado las siguientes p&aacute;ginas
	de particular ayuda:</p>	

    <ul>
      <li><p><a href="../search/search.html">Busca</a> en el manual y la FAQ, o en el
          sitio web entero, o en los ficheros de las listas de correo de preguntas del FreeBSD.</p></li>
 
      <li><p><a href="../docs.html">La p&aacute;gina de Documentaci&oacute;n</a> tiene enlaces
	  al Manual y la FAQ, tutoriales, iformaci&oacute;n acerca de las contribuciones al
 	  Proyecto de Documentaci&oacute;n, documentos en otros lenguajes aparte de ingl&eacute;s,
 	  y mucho m&aacute;s.</p></li>
      
	<li><p><a href="../support.html">La p&aacute;gina de Soporte</a> es rica en
	  informaci&oacute;n sobre el FreeBSD, incluyendo listas de correo, grupos
	  de usuarios, s&iacute;tios web y FTP, informaci&oacute;n sobre versiones y enlaces
	  a algunos recursos de informaci&oacute;n sobre UNIX.</p></li>  		 		

    </ul>

    <h2><a name="fbsd">Aprendiendo FreeBSD</a></H2>

    <ul>

	<li><p>Si todav&iacute;a no la has instalado, busca la
	    &a.latest.ann;&uacute;ltima distribuci&oacute;n principal</a>.
	    (Mira en el Manual por qu&eacute; <strong>no</strong> deber&iacute;as
	    verte tentado a instalar cualquiera de las otras ramas.) Antes de empezar,
          lee atentamente las <a href="../../handbook/install.html"> instrucciones de instalaci&oacute;n</a>,
 	    as&iacute; como cada uno de los ficheros *.TXT en el directorio FTP o en el
	    CD de instalaci&oacute;n. Est&aacute;n all&iacute; porque contienen informaci&oacute;n
	    que necesitar&aacute;s. Recoge tambi&eacute;n la &uacute;ltima 	 	
	    <a href="../releases/index.html">fe de erratas</a>
	    desde la web, en el caso que haya sido actualizada.</p>	

	    <p>Si te decides a descargar FreeBSD, revisa cu&aacute;l de estas detallada e ilustradas
	    <a href="http://www.lemis.com/handbook/what-to-download.html">instrucciones de descarga</a>
	    para una distribuci&oacute;n previa est&aacute;n todav&iacute;a disponibles antes de empezar.
	    Esto deber&iacute;a hacer el proceso entero m&aacute;s claro.</p></li>
		
      <li><p>Varios <a href="../../tutorials/">tutoriales</a> est&aacute;n disponibles.
         El m&aacute;s popular <a href="../../tutorials/newuser/newuser.html">Para la
	 gente nueva en FreeBSD y Unix</a> es popular entre los muy principiantes.
         No necesitas saber mucho para disfrutar de &eacute;ste. Tambi&eacute;n est&aacute;
	 disponible en <a href="http://andrsn.standford.edu/FreeBSD/newuser.html">el s&iacute;tio 
	 web del autor</a> y puede ser descargado en <a href="ftp://andrsn.stanford.edu/pub">
	 formato RTF o postcript</a> para imprimirlo.</p></li>

	<li><p>La primera cosa que mucha gente necesita configurar es el ppp, y hay mucha
	 documentaci&oacute;n de ayuda. Puedes empezar como m&iacute;nimo con aquellas
	 partes de la <a href="../../tutorials/ppp/ppp.html">Gu&iacute;a a fondo de PPP</a>
	 que sean relevantes para tus necesidades, y explorar la <a href="http://www.awfulhak.org/ppp.html"
	 >p&aacute;gina del ppp</a> para enlaces y otra informaci&oacute;n valiosa y 
         las &uacute;ltimas actualizaciones.</p></li>

	<li><p><a name="cfbsd" href="http://www.cdrom.com/titles/freebsd/bsdbook2.phtml">FreeBSD
	 al completo</a> por Greg Lehey, publicado por Walnut Creek CDROM. Este libro asume
	 una m&iacute;nima experiencia en UNIX y lleva al principiante paso a paso a trav&eacute;s
	 de cada apartado desde la instalaci&oacute;n hasta todo aquello que necesitas saber
	 para configurar y ejecutar un sistema en FreeBSD. Tambi&eacute;n llegas a entender
         qu&eacute; est&aacute;s haciendo y porqu&eacute;.</p></li>
      
	<li><p>El <a href="../../handbook/"> Manual de FreeBSD</a> y 
	 <a href="../FAQ/FAQ.html">Preguntas Frecuentes - Frequently Asked Questions (FAQ)</a>
	 son los principales documentos para FreeBSD. De lectura obligada, contienen mucho
         material para principiantes as&iacute; como algun tema bastante avanzado. No te preocupes
	 si no puedes entender alguna de las secciones avanzadas. El manual contiene las
	 instrucciones de instalaci&oacute;n y ademas provee listas de libros y recursos en
	 linea, y la FAQ contiene una gu&iacute;a de problemas.</p></li>
      
	<li><p>Ap&uacute;ntate a la lista de correo FreeBSD-Questions para ver aquellas
	 preguntas que te preocupa demasiado hacer y sus respuestas. Subscr&iacute;bete enviando
	 un correo a <a href="mailto:majordomo@freebsd.org">majordomo@freebsd.org</a>
	 poniendo "subscribe freebsd-questions" en el cuerpo del mensaje (el asunto
	 no importa). Puedes revisar viejas preguntas y respuestas v&iacute;a la p&aacute;gina
         de <a href="../search/search.html#mailinglists">busqueda</a>. Si quieres subscribirte a
	 la lista de correo en castellano puedes hacerlo enviando correo a <a href="mailto:majordomo@es.freebsd.org"
	 >majordomo@es.freebsd.org</a> poniendo "subscribe freebsd" en el cuerpo del mensaje.</p></li>
    
      <li><p>El principal grupo de discusi&oacute;n de FreeBSD es <a
	    href="news:comp.unix.bsd.freebsd.misc">comp.unix.bsd.freebsd.misc</a>.
	quiz&aacute quieras echarle un ojo a <a href="news:comp.unix.bsd.freebsd.announce">comp.unix.bsd.freebsd.announce</a> tambi&eacute;n.</p></li>

     
	<li><p><strong>Las p&aacute;ginas del manual</strong> son una buena referencia pero
	 no siempre son la mejor introducci&oacute;n para un novel. Cuanto m&aacute;s trabajes
         con ellas m&aacute;s familiares llegan a ser. Algunas est&aacute;n muy
         bien para principiantes, o sea que &eacute;chales un vistazo siempre. La p&aacute;gina de manual
         del ppp, por ejemplo es m&aacute;s un tutorial.</p></li> 
    </ul>

    <h2><a name="unix">Aprendiendo UNIX</a></h2>

    <p>Muchos de los problemas que tenemos como principiantes se originan
	en nuestra falta de familiaridad con los comandos del UNIX necesarios
	para solventar nuestros problemas en FreeBSD.
	Sin una formaci&oacute;n en UNIX te ver&aacute;s enfrentado a aprender
	dos cosas a la vez. Afortunadamente, hay un monton de recursos
	destinados a hacer esto mas f&aacute;cil.</p> 	

    <ul>
	<li><p>Hay muchos libros f&aacute;ciles, como las gu&iacute;as para "Dummies",
	 en cualquier librer&iacute;a importante. Si quieres algo realmente f&aacute;cil,
         &eacute;chale una mirada a lo que hay disponible y elige algo que parezca hablar
	 en tu mismo idioma. Muy pronto querr&aacute;s pasar a un libro que te 
	 procure m&aacute;s cobertura.</p></li>
      
	<li><p>Un libro mencionado frecuentemente por los principiantes es <a name="ufti">
	 <em>UNIX para impacientes</em></a> escrito por Paul W. Abrahams y Bruce R. Larson,
	 publicado por Addison-Wesley. Su intenci&oacute;n es tanto un libro para aprender
	 UNIX como una referencia, e incluye una introducci&oacute;n a los conceptos del 
	 UNIX y un cap&iacute;tulo muy pr&aacute;ctico acerca del uso del sistema X Window.</p></li>
      
	<li><p>Otro libro popular es <em>UNIX Power Tools</em> escrito por Jerry Peek,
 	 Tim O'Reilly y Mike Loukides, publicado por O'Reilly y Asociados. Est&aacute;
	 organizado como una serie de art&iacute;culos cortos, cada uno de los cuales
	 resuelve un problema, y estos art&iacute;culos contienen referencias cruzadas
         a otros con material relacionado. Aunque no est&aacute;n dirigidos
	 especificamente a principiantes, el diseño los hace ideales para un principiante
	 con una duda candente o escasos minutos para consultar. Hay material elemental
	 cerca del principio del libro, pero hay pocos art&iacute;culos f&aacute;ciles
	 en su conjunto.</p></li> 
      
        <li><p>La <a href="http://www-wks.acs.ohio-state.edu/unix_course/unix.html">
	 introducci&oacute;n al UNIX</a> est&aacute; disponible en HTML y formatos
	 postscript y Acrobat PDF desde la Universidad del Estado de Ohio.</p></li> 
      
	<li><p><a href="http://www.ucs.ed.ac.uk/~unixhelp/servers.html">Ayuda de
	 UNIX para Usuarios</a> es otra gu&iacute;a introductoria que est&aacute;
	 disponible en HTML en un sitio mirror cerca de ti, o que puedes instalar
         en tu propio sistema.</p></li>
      
        <li><p>Las preguntas sobre UNIX son tratadas en el grupo de discusi&oacute;n <a
	 href="news:comp.unix.questions">comp.unix.questions</a> y en el asociado
	 <a href="http://www.cis.ohio-state.edu/hypertext/faq/usenet/unix-faq/faq/top.html">
	 Preguntas Frecuentes(FAQ)</a>. Puedes conseguir tambi&eacute;n una copia de la 
	 <a href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/faq/">FAQ</a>
	 del s&iacute;tio FTP RMIT. Los principiantes probablemente estar&aacute;n m&aacute;s
	 interesados inicialmente en las secciones 1 y 2</p></li>
      
	<li><p>Otro interesante grupo de discusi&oacute;n es <a
	 href="news:comp.unix.user-friendly">comp.unix.user-friendly</a>
	 que tambi&eacute;n tiene una <a
	 href="http://www.camelcity.com/~noel/usenet/cuuf-FAQ.htm">FAQ</a>.
	 A pesar de que este grupo es para discutir la sencillez operativa cara al 
	 usuario, puede contener alguna buena informaci&oacute;n para los principiantes.
	 La <a href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/user-friendly">FAQ</a> 
	tambi&eacute;n est&aacute; disponible v&iacute;a FTP.</p></li>

	<li><p>Muchas otras p&aacute;ginas web contienen listas de turoriales de UNIX y
	 material de referencia. Uno de los mejores s&iacute;tios para empezar a mirar
	 es la p&aacute;gina de UNIX en <a
	    href="http://www.yahoo.com/Computers_and_Internet/Software/Operating_Systems/Unix/">Yahoo!</a>.</p></li>
      
    </ul>

    <h2><a name="xwin">Aprendiendo el sistema X Window</a></h2>

    <p>El sistema X Window es usado por un n&uacute;mero de sistemas operativos
	inclu&iacute;do FreeBSD. La documentaci&oacute;n para X se puede encontrar
	en <a href="http://www.xfree86.org/">The XFree86 Project, Inc.</a>,
	incluyendo la
	<a href="http://www.xfree86.org/FAQ/index.html">XFree86 FAQ</a>.
	Ten cuidado, mucha de esta documentaci&oacute;n es probablemente
	material de referencia dif&iacute;cil de digerir para los recien
	llegados.</p>

    <ul>
    <li><p>Para informaci&oacute;n b&aacute;sica acerca de instalar, configurar y usar
	el sistema X Window, dos de los libros mencionados arriba contienen secciones
	tratando X al nivel de principiante:
      <a href="#cfbsd">FreeBSD al completo</a> y
      <a href="#ufti">UNIX para impacientes</a>.</p></li>

    <li><p>Hay una secci&oacute;n f&aacute;cil e informativa en
      <a href="http://linuxwww.db.erau.edu/LUG/node41.html">usando
      el sistema X Window</a> en la
      <a href="ftp://sunsite.unc.edu/pub/Linux/docs/LDP/users-guide">Gu&iacute;a del usuario</a> de Linux.
	Tambie&eacute;n se puede encontrar material interesante en cualquier parte de ese documento,
	pero recuerda que Linux no funciona siempre exactamente igual que FreeBSD.</p></li>

    <li><p>Antes de tener funcionando el X de la manera que te gusta, necesitar&aacute;s
	escoger un manejador de ventanas.
        Visita la p&aacute;gina <a href="http://www.PLiG.org/xwinman/">Manejadores de Ventanas para X</a>
	y sigue el enlace desde la introducci&oacute;n para enterarte sobre los manejadores
	de ventanas, vu&eacute;lvete entonces y lee "The Basics". Regresa y compara 
	los diferentes tipos que hay disponibles.(Bonus: Aqu&iacute; tambien hay otra
	gu&iacute;a de UNIX.)
	La mayor&iacute;a si no todos de estos manejadores de ventanas se encuentran
	disponibles para instalar en la colecci&oacute;n de ports de FreeBSD.</p></li>
    </ul>

    <h2><a name="people">Ayudando a otra gente</a></h2>

    <p>Todo el mundo tiene algo con lo que contribuir a la comunidad de FreeBSD,
      ¡incluso los principiantes! Algunos est&aacute;n ocupados trabajando con el
	nuevo grupo de abogacía y algunos de han visto involucrados con el	
        <a href="../docproj/docproj.html">Proyecto de Documentaci&oacute;n</a> como
	revisores. Otros principiantes en FreeBSD tienen sus propias habilidades y 
	experiencias para compartir, est&eacute;n o no relacionadas con los 
	ordenadores, o tan solo quieren relacionarse con otros principiantes y 
	quieren hacerles sentir bienvenidos. Siempre hay gente alrededor que ayuda
	a otros simplemente porque les gusta. Escribe a 
     <a href="mailto:freebsd-newbies@freebsd.org">Principiantes en FreeBSD</a>
      para m&aacute;s informaci&oacute;n.</p>

    <p>Los amigos que funcionan bajo FreeBSD son un gran recurso. Ning&uacute;n
	libro puede reemplazar hablar por tel&eacute;fono o por encima de una pizza
	con alguien que tiene las mismas inquietudes, disfruta con las mismas cosas,
	y se enfrenta a los mismos desaf&iacute;os. Si no tienes muchos amigos que 
	usen FreeBSD, considera el usar tus viejos CDs de FreeBSD para crearte algunos
	m&aacute;s :-)</p>

    <p><a href="../support.html#user">Los grupos de usuarios</a> son
	buenos sitios para encontrar a otros usuarios de FreeBSD. Si no hay
	alguno cerca, quiz&aacute; puedas iniciar uno.</p>
    
    <p>Antes de hablarle a las personas reales acerca de tus nuevas habilidades
	quiz&aacute quieras revisar la <a
      href="http://manuel.brad.ac.uk/help/.faq/.unix/.pronun.html">Gu&iacute;a de Pronunciaci&oacute;n</a>
      y el <a
      href="http://www.wins.uva.nl/~mes/jargon/">Fichero de Jerga</a> :-)</p>

    <p>En l&iacute;nea tenemos la lista de correo
      <a href="http://www.welearn.com.au/freebsd/newbies/">Principiantes en FreeBSD</a>
        para aquellas discusiones no t&eacute;cnicas acerca de asuntos de
        inter&eacute;s para principiantes. Otra lista de correo,
      <a href="mailto:questions@freebsd.org">Preguntas de FreeBSD</a>,
	resuelve nuestras dudas acerca del uso de FreeBSD.</p>
    
      &footer;
  </body>
</html>


