<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/de/releases/snapshots.sgml,v 1.3 2004/05/17 22:41:55 mheinen Exp $">
<!ENTITY dedate "$FreeBSDde: de-www/releases/snapshots.sgml,v 1.4 2004/05/16 22:10:35 mheinen Exp $">
<!ENTITY reference "basiert auf: 1.17">
<!ENTITY title "FreeBSD Snapshot Releases">
<!ENTITY % navincludes SYSTEM "../includes.navdownload.sgml"> %navincludes;
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<html>
  &header;

    <h2>Was sind Snapshots?</h2>

    <p>Im Rahmen der Bem&uuml;hungen, die Qualit&auml;t der
      ver&ouml;ffentlichten FreeBSD-Version zu verbessern, werden seit
      einiger Zeit <em>Test</em>-Versionen ver&ouml;ffentlicht, die
      als Snapshot (Schnapschu&szlig;) bezeichnet werden.  Damit
      sollen Probleme aufgedeckt und behoben, bevor eine fehlerhafte
      Version ver&ouml;ffentlicht wird, die die Anwender an die Decke
      gehen l&auml;&szlig;t.  Diese Snapshots sind &auml;hnlich wie
      vollst&auml;ndige Versionen, allerdings etwas spartanischer.
      Falls sie dar&uuml;ber nachdenken, einen Snapshot einzusetzen,
      sollten Sie sich &uuml;ber die folgenden Punkte im klaren
      sein:</p>

    <ul>
      <li>In den Snapshots werden in der Regel keine neuen
	XFree86-Versionen erzeugt; auch das Verzeichnis tools wird in
	der Regel ncht aktualisiert werden.  Dies gilt nat&uuml;rlich
	nicht, wenn eines dieser Dinge betroffen ist.</li>

      <li>Die Versionsnummer wird f&uuml;r den Snapshot nicht
	ge&auml;ndert.  Sie steht <em>nur</em> auf den
	Installationdisketten, damit klar ist, wann der Snapshot
	erzeugt werden.  Es sind <em>keine</em>
	Ver&ouml;ffentlichungen, sondern <em>Snapshots</em>, und der
	Unterschied darf nicht untergehen.  Nat&uuml;rlich k&ouml;nnen
	und werden die Leute die Snapshots mit Datum in EMails und
	News erw&auml;hnen; wir wollen nur nicht, da&szlig; jemand
	glaubt, heute w&auml;re Weihnachten, weil die n&auml;chste
	Version schon ver&ouml;ffentlicht wurde!</li>

      <li>Weiterhin wird es keine Aktualisierung der Dokumentation
	geben.  Wenn in einem README noch auf die vorgehende Version
	verwiesen wird, Pech.  Es ist deutlich wichtiger, die
	Korrekturen f&uuml;r die behobenen Fehler und die Neuerungen
	f&uuml;r Tests verf&uuml;gbar zu machen.  Beschwerden
	&uuml;ber solche Dinge wandern ungelesen in den
	M&uuml;lleimer.  Nochmals:  Es sind <em>Snapshots</em>, nicht
	Ver&ouml;ffentlichungen.</li>
    </ul>

    <p>Kommentare zu den Snapshots sind nat&uuml;rlich hochwillkommen.
      Davon haben nicht nur wir etwas - alle, die FreeBSd f&uuml;r
      wichtige Anwendungen einsetzen, sollten es begr&uuml;&szlig;en,
      wenn sie die M&ouml;glichkeit erhalten, neuere Versionen in
      einem kontrollierten Rahmen testen zu k&ouml;nnen.
      Au&szlig;erdem sind die Snapshots der beste Beweis, da&szlig;
      Ihre Kommentare und Vorschl&auml;ge eingearbeitet werden und
      da&szlig; Sie (hoffentlich) mit der n&auml;chsten
      ver&ouml;ffentlichten Version keine b&ouml;sen
      &Uuml;berraschungen erleben werden.  Wenn Sie uns aber nach der
      Ver&ouml;ffentlichung der n&auml;chsten Version bitterb&ouml;se
      Briefe schreiben, weil etwas nicht funktioniert, und es sich
      dann herausstellt, da&szlig; Sie niemals einer der Snapshots
      ausprobiert haben...</p>

    <h2>Wo finde ich Snapshots?</h2>

    <p>Snapshots sowohl von <a
      href="&base;/../doc/de_DE.ISO8859-1/books/handbook/current-stable.html#CURRENT">FreeBSD-CURRENT</a>
      als auch von <a
      href="&base;/../doc/de_DE.ISO8859-1/books/handbook/current-stable.html#STABLE">FreeBSD-STABLE</a>
      k&ouml;nen mit anonymous FTP von <a
      href="ftp://current.FreeBSD.org/pub/FreeBSD/">
      ftp://current.FreeBSD.org/pub/FreeBSD/</a> bezogen werden.  Die
      Snapshot-Versionen befinden sich in den Verzeichnissen mit den
      Namen <b>REL-YYYYMMDD-*SNAP</b>.  `<b>REL</b>' bezeichnet das
      Release (beispielsweise 5.2-CURRENT oder 4.9-STABLE),
      `<b>YYYY</b>' ist das Jahr, `<b>MM</b>' der Monat und
      `<b>DD</b>' der Tag der Ver&ouml;ffentlichung dieses Snapshots.
      Jedes Snapshot-Verzeichnis enth&auml;lt die Datei
      `<b>RELNOTES.TXT</b>', in dem die &Auml;nderungen beschrieben
      werden, die in den jeweiligen Snapshot eingeflossen sind.</p>

    <p>
      <a href="index.html">Release Home</a>
    </p>

    &footer;
  </body>
</html>
