Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/manual-pages/_index.po
Languages: ru

source: How to work with the FreeBSD Manual Pages
ru: Как работать со Cправочником FreeBSD

source: Chapter 11. Manual Pages
ru: Глава 11. Справочник

source: Manual Pages
ru: Справочник

source: Introduction
ru: Введение

source: _Manual pages_, commonly shortened to _man pages_, were conceived as readily-available reminders for command syntax, device driver details, or configuration file formats. They have become an extremely valuable quick-reference from the command line for users, system administrators, and programmers.
ru: _Справочник_, часто сокращаемый до _man-страниц_, изначально задумывались как легкодоступные напоминания о синтаксисе команд, деталях драйверов устройств или форматах конфигурационных файлов. Со временем они стали крайне полезным справочным материалом для быстрого ознакомления прямо из командной строки для пользователей, системных администраторов и программистов.

source: Although intended as reference material rather than tutorials, the EXAMPLES sections of manual pages often provide detailed use case.
ru: Хотя они предназначены скорее как справочные материалы, а не учебные руководства, разделы EXAMPLES в manual pages часто содержат подробные примеры использования.

source: Manual pages are generally shown interactively by the man:man[1] command. When the user types `man ls`, a search is performed for a manual page matching `ls`. The first matching result is displayed.
ru: Страницы Справочника обычно отображаются интерактивно с помощью команды man:man[1]. Когда пользователь вводит `man ls`, выполняется поиск страницы Справочника, соответствующей `ls`. Первый найденный результат отображается.

source: Sections
ru: Разделы

source: Manual pages are grouped into _sections_. Each section contains manual pages for a specific category of documentation:
ru: Страницы справочника (man-страницы) сгруппированы по _разделам_. Каждый раздел содержит man-страницы для определённой категории документации:

source: Section Number
ru: Номер раздела

source: Category
ru: Категория

source: General Commands
ru: Общие команды

source: System Calls
ru: Системные вызовы

source: Library Functions
ru: Функции библиотек

source: Kernel Interfaces
ru: Интерфейсы ядра

source: File Formats
ru: Форматы файлов

source: Games
ru: Игры

source: Miscellaneous
ru: Разное

source: System Manager
ru: Системный администратор

source: Kernel Developer
ru: Разработчик ядра

source: Markup
ru: Язык разметки

source: Various markup forms and rendering programs have been used for manual pages. FreeBSD has used man:groff[7] and the newer man:mandoc[1]. Most existing FreeBSD manual pages, and all new ones, use the man:mdoc[7] form of markup. This is a simple line-based markup that is reasonably expressive. It is mostly semantic: parts of text are marked up for what they are, rather than for how they should appear when rendered. There is some appearance-based markup which is usually best avoided.
ru: Для man-страниц использовались различные формы разметки и программы отображения. FreeBSD использовала man:groff[7] и более новую man:mandoc[1]. Большинство существующих man-страниц FreeBSD, а также все новые, используют разметку в формате man:mdoc[7]. Это простая построчная разметка, обладающая достаточной выразительностью. В основном она семантическая: части текста помечаются по их назначению, а не по тому, как они должны выглядеть при отображении. Существует некоторая разметка, основанная на внешнем виде, которую обычно лучше избегать.

source: Manual page source is usually interpreted and displayed to the screen interactively. The source files can be ordinary text files or compressed with man:gzip[1] to save space.
ru: Исходный код страницы справочника обычно интерпретируется и отображается на экране в интерактивном режиме. Исходные файлы могут быть обычными текстовыми файлами или сжатыми с помощью man:gzip[1] для экономии места.

source: Manual pages can also be rendered to other formats, including PostScript for printing or PDF generation. See man:man[1].
ru: Страницы справочника также могут быть преобразованы в другие форматы, включая PostScript для печати или генерации PDF. См. man:man[1].

source: Manual Page Sections
ru: Разделы Справочника

source: Manual pages are composed of several standard sections. Each section has a title in upper case, and the sections for a particular type of manual page appear in a specific order. For a category 1 General Command manual page, the sections are:
ru: Страницы справочника состоят из нескольких стандартных разделов. Каждый раздел имеет заголовок в верхнем регистре, а разделы для определённого типа man-страниц следуют в строго определённом порядке. Для man-страниц категории 1 (Общие команды) разделы идут в следующем порядке:

source: Section Name
ru: Название Раздела

source: Description
ru: Описание

source: NAME
ru: NAME (ИМЯ)

source: Name of the command
ru: Название команды

source: SYNOPSIS
ru: SYNOPSIS (СИНТАКСИС)

source: Format of options and arguments
ru: Формат опций и аргументов

source: DESCRIPTION
ru: DESCRIPTION (ОПИСАНИЕ)

source: Description of purpose and usage
ru: Описание назначения и использования

source: ENVIRONMENT
ru: ENVIRONMENT (ОКРУЖЕНИЕ)

source: Environment settings that affect operation
ru: Настройки окружения, влияющие на работу

source: EXIT STATUS
ru: EXIT STATUS (СТАТУС ВЫХОДА)

source: Error codes returned on exit
ru: Коды ошибок, возвращаемые при завершении

source: EXAMPLES
ru: EXAMPLES (ПРИМЕРЫ)

source: Examples of usage
ru: Примеры использования

source: COMPATIBILITY
ru: COMPATIBILITY (СОВМЕСТИМОСТЬ)

source: Compatibility with other implementations
ru: Совместимость с другими реализациями

source: SEE ALSO
ru: SEE ALSO (СМ. ТАКЖЕ)

source: Cross-reference to related manual pages
ru: Перекрестная ссылка на связанные страницы руководства

source: STANDARDS
ru: STANDARDS (СТАНДАРТЫ)

source: Compatibility with standards like POSIX
ru: Совместимость со стандартами, такими как POSIX

source: HISTORY
ru: HISTORY (ИСТОРИЯ)

source: History of implementation
ru: История реализации

source: BUGS
ru: BUGS (ИЗВЕСТНЫЕ ОШИБКИ)

source: Known bugs
ru: Известные ошибки

source: AUTHORS
ru: AUTHORS (АВТОРЫ)

source: People who created the command or wrote the manual page.
ru: Люди, которые создали команду или написали справочную страницу.

source: Some sections are optional, and the combination of sections for a specific type of manual page vary. Examples of the most common types are shown later in this chapter.
ru: Некоторые разделы являются необязательными, и сочетание разделов для конкретного типа справочной страницы может различаться. Примеры наиболее распространённых типов приведены далее в этой главе.

source: Macros
ru: Макросы

source: man:mdoc[7] markup is based on _macros_. Lines that begin with a dot contain macro commands, each two or three letters long. For example, consider this portion of the man:ls[1] manual page:
ru: Разметка man:mdoc[7] основана на _макросах_. Строки, начинающиеся с точки, содержат макрокоманды, каждая длиной в две или три буквы. Например, рассмотрим эту часть man-страницы man:ls[1]:

source: A _Document date_ and _Document title_ are defined.
ru: Определены _Дата документа_ (.Dd) и _Название документа_ (.Dt).

source: A _Section header_ for the NAME section is defined. Then the _Name_ of the command and a one-line _Name description_ are defined.
ru: Для раздела NAME определяется _Заголовок раздела_ (.Sh). Затем определяется _Имя_ (.Nm) команды и _Описание имени_ (.Nd) в одну строку.

source: The SYNOPSIS section begins. This section describes the command-line options and arguments accepted.
ru: Начинается раздел SYNOPSIS (.Sh). В этом разделе описываются параметры командной строки и аргументы, которые принимаются.

source: _Name_ (`.Nm`) has already been defined, and repeating it here just displays the defined value in the text.
ru: _Имя_ (`.Nm`) уже определено, и его повторение здесь просто отображает заданное значение в тексте.

source: An _Optional_ _Flag_ called `-libxo` is shown. The `Fl` macro adds a dash to the beginning of flags, so this appears in the manual page as `--libxo`.
ru: Отображается _необязательный_ _флаг_ (.Op Fl) `-libxo`. Макрос `Fl` добавляет тире в начало флагов, поэтому в руководстве он отображается как `--libxo`.

source: A long list of optional single-character flags are shown.
ru: Отображается длинный список необязательных флагов, состоящих из одного символа.

source: An optional `-D` flag is defined. If the `-D` flag is given, it must be followed by an _Argument_. The argument is a _format_, a string that tells man:ls[1] what to display and how to display it. Details on the format string are given later in the manual page.
ru: Определён необязательный флаг `-D`. Если указан флаг `-D`, за ним должен следовать _аргумент_. Аргумент представляет собой _формат_ — строку, которая указывает man:ls[1], что и как отображать. Подробности о строке формата приведены далее на странице руководства.

source: A final optional argument is defined. Since no name is specified for the argument, the default of `file ...` is used.
ru: Определен последний необязательный аргумент. Поскольку для аргумента не указано имя, используется значение по умолчанию `file ...`.

source: The _Section header_ for the DESCRIPTION section is defined.
ru: _Заголовок раздела_ (.Sh) для раздела DESCRIPTION определен.

source: When rendered with the command `man ls`, the result displayed on the screen looks like this:
ru: При отображении с помощью команды `man ls` результат выводится на экран следующим образом:

source: Optional values are shown inside square brackets.
ru: Необязательные значения указаны в квадратных скобках.

source: Markup Guidelines
ru: Руководство по разметке

source: The man:mdoc[7] markup language is not very strict. For clarity and consistency, the FreeBSD Documentation project adds some additional style guidelines:
ru: Язык разметки man:mdoc[7] не является очень строгим. Для ясности и согласованности проект FreeBSD Documentation добавляет некоторые дополнительные рекомендации по стилю:

source: Only the first letter of macros is upper case
ru: Только первая буква макросов пишется с заглавной буквы

source: Always use upper case for the first letter of a macro and lower case for the remaining letters.
ru: Всегда используйте заглавную букву для первого символа макроса и строчные буквы для остальных символов.

source: Begin new sentences on new lines
ru: Начинайте новые предложения с новых строк

source: Start a new sentence on a new line, do not begin it on the same line as an existing sentence.
ru: Начинайте новое предложение с новой строки, не начинайте его на той же строке, что и существующее предложение.

source: Update `.Dd` when making non-trivial changes to a manual page
ru: Обновите `.Dd` при внесении значительных изменений в справочную страницу

source: The _Document date_ informs the reader about the last time the manual page was updated. It is important to update whenever non-trivial changes are made to the manual pages. Trivial changes like spelling or punctuation fixes that do not affect usage can be made without updating `.Dd`.
ru: _Дата документа_ сообщает читателю, когда страница руководства была последний раз обновлена. Важно обновлять её при внесении значительных изменений в страницы руководства. Незначительные правки, такие как исправления орфографии или пунктуации, которые не влияют на использование, могут быть сделаны без обновления `.Dd`.

source: Give examples
ru: Приведите примеры

source: Show the reader examples when possible. Even trivial examples are valuable, because what is trivial to the writer is not necessarily trivial to the reader. Three examples are a good goal. A trivial example shows the minimal requirements, a serious example shows actual use, and an in-depth example demonstrates unusual or non-obvious functionality.
ru: Показывайте читателю примеры, когда это возможно. Даже простые примеры ценны, потому что то, что тривиально для автора, не обязательно тривиально для читателя. Хорошей целью являются три примера. Простой пример демонстрирует минимальные требования, серьезный пример показывает реальное использование, а углубленный пример демонстрирует неочевидную или нестандартную функциональность.

source: Include the BSD license
ru: Включить лицензию BSD

source: Include the BSD license on new manual pages. The preferred license is available from the extref:{committers-guide}[Committer's Guide].
ru: Включите лицензию BSD в новые руководства. Предпочтительная лицензия доступна в extref:{committers-guide}[Руководстве коммиттера].

source: Markup Tricks
ru: Приемы Разметки

source: Add a space before punctuation on a line with macros. Example:
ru: Добавьте пробел перед пунктуацией на строке с макросами. Пример:

source: Note how the commas at the end of the `.Xr` lines have been placed after a space. The `.Xr` macro expects two parameters to follow it, the name of an external manual page, and a section number. The space separates the punctuation from the section number. Without the space, the external links would incorrectly point to section `4,` or `8,`.
ru: Обратите внимание, как запятые в конце строк `.Xr` размещены после пробела. Макрос `.Xr` ожидает два параметра: имя внешней страницы руководства и номер раздела. Пробел отделяет пунктуацию от номера раздела. Без пробела внешние ссылки будут некорректно указывать на разделы `4,` или `8,`.

source: Important Macros
ru: Важные макросы

source: Some very common macros will be shown here. For more usage examples, see man:mdoc[7], man:groff_mdoc[7], or search for actual use in [.filename]#/usr/share/man/man*# directories. For example, to search for examples of the `.Bd` _Begin display_ macro:
ru: Здесь будут показаны некоторые очень распространённые макросы. Для большего количества примеров использования см. man:mdoc[7], man:groff_mdoc[7] или выполните поиск реальных примеров в каталогах [.filename]#/usr/share/man/man*#. Например, чтобы найти примеры макроса `.Bd` (_Begin display_):

source: Organizational Macros
ru: Организационные Макросы

source: Some macros are used to define logical blocks of a manual page.
ru: Некоторые макросы используются для определения логических блоков страницы руководства.

source: Organizational Macro
ru: Организационные Макро

source: Use
ru: Используйте

source: Section header. Followed by the name of the section, traditionally all upper case. Think of these as chapter titles.
ru: Заголовок раздела. За ним следует название раздела, традиционно записанное в верхнем регистре. Можно рассматривать их как названия глав.

source: Subsection header. Followed by the name of the subsection. Used to divide a `.Sh` section into subsections.
ru: Подзаголовок раздела. За ним следует название подраздела. Используется для разделения раздела `.Sh` на подразделы.

source: Begin list. Start a list of items.
ru: Начало списка (Begin list). Начать перечень элементов.

source: End a list.
ru: Конец списка (End List).

source: Begin display. Begin a special area of text, like an indented area.
ru: Начало отображения (Begin display). Начать специальную область текста, например, область с отступом.

source: End display.
ru: Завершить отображение (End display).

source: Inline Macros
ru: Встроенные макросы

source: Many macros are used to mark up inline text.
ru: Многие макросы используются для разметки текста внутри строк.

source: Inline Macro
ru: Встроенный макрос

source: Name. Called with a name as a parameter on the first use, then used later without the parameter to display the name that has already been defined.
ru: Имя (Name). При первом использовании вызывается с именем в качестве параметра, затем используется без параметра для отображения уже определенного имени.

source: Path to a file. Used to mark up filenames and directory paths.
ru: Путь к файлу (Path to a file). Используется для обозначения имен файлов и путей к каталогам.

source: Sample Manual Page Structures
ru: Пример структуры страницы руководства

source: This section shows minimal desired man page contents for several common categories of manual pages.
ru: Этот раздел демонстрирует минимально желаемое содержание man-страниц для нескольких распространённых категорий руководств.

source: Section 1 or 8 Command
ru: Раздел 1 или 8 — Команда

source: The preferred basic structure for a section 1 or 8 command:
ru: Предпочтительная базовая структура для раздела 1 или 8 — Команда:

source: Section 4 Device Driver
ru: Раздел 4 — Драйверы устройств

source: The preferred basic structure for a section 4 device driver:
ru: Предпочтительная базовая структура для раздела 4 — драйверы устройств:

source: Section 5 Configuration File
ru: Раздел 5 — Файл конфигурации

source: The preferred basic structure for a section 5 configuration file:
ru: Предпочтительная базовая структура для раздела 5 — файл конфигурации:

source: Testing
ru: Тестирование

source: Testing a new manual page can be challenging. Fortunately there are some tools that can assist in the task. Some of them, like man:man[1], do not look in the current directory. It is a good idea to prefix the filename with `./` if the new manual page is in the current directory. An absolute path can also be used.
ru: Проверка новой страницы руководства может быть непростой задачей. К счастью, существуют инструменты, которые могут помочь в этом. Некоторые из них, например man:man[1], не ищут в текущем каталоге. Хорошей практикой является добавление префикса `./` к имени файла, если новая страница руководства находится в текущем каталоге. Также можно использовать абсолютный путь.

source: Use man:mandoc[1]'s linter to check for parsing errors:
ru: Используйте линтер man:mandoc[1] для проверки на ошибки парсинга:

source: Use package:textproc/igor[] to proofread the manual page:
ru: Используйте package:textproc/igor[] для проверки страниц Справочника:

source: Another useful tool is package:textproc/vale[]. It does not support the man:mdoc[7] syntax but the rendered manual page can be read from standard input:
ru: Еще один полезный инструмент — package:textproc/vale[]. Он не поддерживает синтаксис man:mdoc[7], но обработанную страницу руководства можно прочитать из стандартного ввода:

source: package:textproc/vale[] is highly configurable. It is advised to read its documentation.
ru: package:textproc/vale[] обладает высокой степенью настраиваемости. Рекомендуется ознакомиться с его документацией.

source: Use man:man[1] to check the final result of your changes:
ru: Используйте man:man[1] для проверки конечного результата ваших изменений:

source: You can use man:col[1] to filter the output of man:man[1] and get rid of the backspace characters before loading the result in your favorite editor for spell checking:
ru: Вы можете использовать man:col[1] для фильтрации вывода man:man[1] и удаления backspace-символов перед загрузкой результата в ваш любимый редактор для проверки орфографии:

source: Spell-checking with fully-featured dictionaries is encouraged, and can be accomplished by using package:textproc/hunspell[] or package:textproc/aspell[] combined with package:textproc/en-hunspell[] or package:textproc/en-aspell[], respectively. For instance:
ru: Проверка орфографии с использованием полнофункциональных словарей рекомендуется и может быть выполнена с помощью package:textproc/hunspell[] или package:textproc/aspell[] в сочетании с package:textproc/en-hunspell[] или package:textproc/en-aspell[] соответственно. Например:

source: Example Manual Pages to Use as Templates
ru: Примеры страниц Справочника для использования в качестве шаблонов

source: Some manual pages are suitable as in-depth examples.
ru: Некоторые страницы Справочника могут служить подробными примерами.

source: Manual Page
ru: Страница Справочника

source: Path to Source Location
ru: Путь к расположению исходного кода

source: Resources
ru: Ресурсы

source: Resources for manual page writers:
ru: Ресурсы для авторов справочных страниц:

source: http://manpages.bsd.lv/mdoc.html[Practical UNIX Manuals: mdoc]
ru: http://manpages.bsd.lv/mdoc.html[Практические руководства UNIX: mdoc]

source: http://manpages.bsd.lv/history.html[History of UNIX Manpages]
ru: http://manpages.bsd.lv/history.html[История man-страниц UNIX]
