Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/nanobsd/_index.po
Languages: es, pt_br

source: The different partition sizes can be set through the use of `NANO_CODESIZE`, `NANO_CONFSIZE`, and `NANO_DATASIZE` as a multiple of 512 bytes sectors. `NANO_CODESIZE` defines the size of the first two image partitions: `code#1` and `code#2`. They have to be big enough to hold all the files that will be produced as a result of the `buildworld` and `buildkernel` processes. `NANO_CONFSIZE` defines the size of the configuration file partition, so it does not need to be very big; but do not make it so small that it will not hold all configuration files. Finally, `NANO_DATASIZE` defines the size of an optional partition, that can be used on the appliance. The last partition can be used, for example, to keep files created on the fly on disk.
es: Los diferentes tamaños de partición se pueden establecer mediante el uso de `NANO_CODESIZE`, `NANO_CONFSIZE`, y `NANO_DATASIZE` como múltiplos de sectores de 512 bytes. `NANO_SIZE` define el tamaño de las dos primeras particiones: `code#1` and `code#2`. Tienen que ser suficientemente grandes para contener todos los ficheros que se producirán como resultado de los procesos `buildworld` y `buildkernel`. `NANO_CONFSIZE` define el tamaño de la partición de ficheros de configuración por lo que no tiene que ser muy grande; pero no la hagas tan pequeña que no pueda albergar los ficheros. Por último `NANO_DATASIZE` define el tamaño de una partición opcional, que se puede usar en el dispositivo. Por ejemplo, se puede utilizar la última partición para mantener en disco ficheros creados al vuelo.
pt_br: Os diferentes tamanhos das partições podem ser definidos por meio do uso de `NANO_CODESIZE`, `NANO_CONFSIZE` e `NANO_DATASIZE` como múltiplos de setores de 512 bytes. `NANO_CODESIZE` define o tamanho das duas primeiras partições da imagem: `code#1` e `code#2`. Elas devem ser grandes o suficiente para armazenar todos os arquivos que serão produzidos como resultado dos processos `buildworld` e `buildkernel`. `NANO_CONFSIZE` define o tamanho da partição do arquivo de configuração, portanto, não precisa ser muito grande, mas não a faça tão pequena que não possa armazenar todos os arquivos de configuração. Por fim, `NANO_DATASIZE` define o tamanho de uma partição opcional que pode ser usada no aparelho. A última partição pode ser usada, por exemplo, para manter arquivos criados dinamicamente no disco.

source: Custom Functions
es: Funciones Personalizadas
pt_br: Funções Personalizadas

source: It is possible to fine-tune NanoBSD using shell functions in the configuration file. The following example illustrates the basic model of custom functions:
es: Es posible afinar NanoBSD utilizando funciones del shell en el fichero de configuración. El siguiente ejemplo ilustra el modelo básico de las funciones personalizadas:
pt_br: É possível ajustar o NanoBSD usando funções de shell no arquivo de configuração. O exemplo a seguir ilustra o modelo básico de funções personalizadas:

source: A more useful example of a customization function is the following, which changes the default size of the [.filename]#/etc# directory from 5MB to 30MB:
es: Un ejemplo más útil de una función de personalización es el siguiente, el cual cambia el tamaño por defecto del directorio [.filename]#/etc# de 5MB a 30MB:
pt_br: Um exemplo mais útil de uma função de personalização é o seguinte, que altera o tamanho padrão do diretório [.filename]#/etc# de 5MB para 30MB:

source: There are a few default pre-defined customization functions ready for use:
es: Estas son algunas funciones de personalización incluidas por defecto y listas para ser usadas:
pt_br: Existem algumas funções de customização pré-definidas por padrão e prontas para uso:

source: `cust_comconsole` - Disables man:getty[8] on the VGA devices (the [.filename]#/dev/ttyv*# device nodes) and enables the use of the COM1 serial port as the system console.
es: `cust_comconsole` - Deshabilita man:getty[8] en los dispositivos VGA (los nodos de dispositivo [.filename]#/dev/ttyv*#) y habilita el uso del puerto serie COM1 como consola del sistema.
pt_br: `cust_comconsole` - Desabilita o man:getty[8] nos dispositivos VGA (os nós de dispositivo [.filename]#/dev/ttyv*#) e habilita o uso da porta serial COM1 como console do sistema.

source: `cust_allow_ssh_root` - Allow `root` to login via man:sshd[8].
es: `cust_allow_ssh_root` - Permite al usuario `root` hacer login vía man:sshd[8].
pt_br: `cust_allow_ssh_root` - Permite que o usuário `root` faça login via man:sshd[8].

source: `cust_install_files` - Installs files from the [.filename]#nanobsd/Files# directory, which contains some useful scripts for system administration.
es: `cust_install_files` - Instala ficheros desde el directorio [.filename]#nanobsd/Files#, el cual contiene algunos scripts útiles para la administración del sistema.
pt_br: `cust_install_files` - Instala arquivos do diretório [.filename]#nanobsd/Files#, que contém alguns scripts úteis para administração do sistema.

source: `cust_pkgng` - Installs packages from the [.filename]#nanobsd/Pkg# directory (needs also pkg-* package to bootstrap).
pt_br: `cust_pkgng` - Instala pacotes do diretório [.filename]#nanobsd/Pkg#, (necessita também do pacote pkg-* para inicialização).

source: Adding Packages
es: Agregando Paquetes
pt_br: Adicionando Pacotes

source: Packages can be added to a NanoBSD image, to provide specific functionalities on the appliance. To do so, either:
es: Se pueden agregar paquetes a una imagen de NanoBSD para proporcionar funcionalidades específicas para el dispositivo. Para ello, o bien:
pt_br: Pacotes podem ser adicionados a uma imagem do NanoBSD para fornecer funcionalidades específicas no aparelho. Para fazer isso, você pode escolher uma das seguintes opções:

source: Add the `cust_pkgng` to the `NANO_CUSTOMIZE` variable, or
es: Añade `cust_pkgng` a la variable `NANO_CUSTOMIZE`, o
pt_br: Adicionar `cust_pkgng` à variável `NANO_CUSTOMIZE`, ou

source: Add a `'customize_cmd cust_pkgng'` command in a customized configuration file.
es: Añade el comando `'customize_cmd cust_pkgng'` en un fichero de configuración personalizado.
pt_br: Adicionar o comando `'customize_cmd cust_pkgng'` em um arquivo de configuração personalizado.

source: Both methods achieve the same result: launching the `cust_pkgng` routine. This routine will go through `NANO_PACKAGE_DIR` directory to find either all packages or just the list of packages in the `NANO_PACKAGE_LIST` variable.
es: Ambos métodos consiguen el mismo resultado: lanzar la rutina `cust_pkgng`. Esta rutina recorrerá el directorio `NANO_PACKAGE_DIR` para encontrar bien todos los paquetes o sólo la lista de paquetes de la variable `NANO_PACKAGE_LIST`.
pt_br: Ambos os métodos alcançam o mesmo resultado: executar a rotina `cust_pkgng`. Essa rotina percorrerá o diretório `NANO_PACKAGE_DIR` para encontrar todos os pacotes ou apenas a lista de pacotes na variável `NANO_PACKAGE_LIST`.

source: It is common, when installing applications through pkg on a standard FreeBSD environment, that the install process puts configuration files, in the [.filename]#usr/local/etc# directory, and startup scripts in the [.filename]#/usr/local/etc/rc.d# directory. So, after the required packages have been installed, they need to be configured in order for them to start right out of the box. To do so, the necessary configuration files have to be installed in the correct directories. This can be achieved by writing dedicated routines or the generic `cust_install_files` routine can be used to lay out files properly from the [.filename]#/usr/src/tools/tools/nanobsd/Files# directory. Usually a statement, sometimes multiple statements, in the [.filename]#/etc/rc.conf# also needs to be added for each package.
es: Cuando se instalan aplicaciones mediante pkg en un entorno FreeBSD estándar, es habitual que el proceso de instalación cree ficheros de configuración en el directorio [.filename]#/usr/local/etc#, y scripts de arranque en el directorio [.filename]#/usr/local/etc/rc.d#. De modo que después de que se hayan instalado los paquetes necesarios, necesitan ser configurados para que estén listos para usar. Para ello se tienen que instalar los ficheros de configuración necesarios en los directorios correctos. Esto se puede conseguir escribiendo rutinas dedicadas o se puede utilizar la rutina genérica `cust_install_files` para copiar los ficheros desde el directorio [.filename]#/usr/src/tools/tools/nanobsd/Files#. Para cada paquete normalmente se necesita añadir una línea (a veces varias) en [.filename]#/etc/rc.conf#.
pt_br: É comum, ao instalar aplicativos por meio do pkg em um ambiente FreeBSD padrão, que o processo de instalação coloque arquivos de configuração no diretório [.filename]#usr/local/etc# e scripts de inicialização no diretório [.filename]#/usr/local/etc/rc.d#. Portanto, após a instalação dos pacotes necessários, eles precisam ser configurados para iniciar imediatamente. Para fazer isso, os arquivos de configuração necessários devem ser instalados nos diretórios corretos. Isso pode ser feito escrevendo rotinas dedicadas ou utilizando a rotina genérica `cust_install_files` para organizar os arquivos corretamente a partir do diretório [.filename]#/usr/src/tools/tools/nanobsd/Files#. Geralmente, também é necessário adicionar uma ou várias declarações no arquivo [.filename]#/etc/rc.conf# para cada pacote.

source: Configuration File Example
es: Ejemplo de Archivo de Configuración
pt_br: Exemplo do arquivo de configuração

source: A complete example of a configuration file for building a custom NanoBSD image can be:
es: Un ejemplo completo de un archivo de configuración para construir una imagen personalizada de NanoBSD podría ser:
pt_br: Um exemplo completo de um arquivo de configuração para construir uma imagem personalizada do NanoBSD pode ser:

source: All the build and install compilation options can be found in the man:src.conf[5] man page, but not all options can or should be used when building a NanoBSD image. The build and install options should be defined according to the needs of the image being built.
es: Todas las opciones de construcción e instalación se pueden encontrar en la página del manual de man:src.conf[5], pero no todas las opciones se pueden o se deben usar cuando se construye una imagen de NanoBSD. Las opciones de construcción e instalación se deberían definir de acuerdo a las necesidades de la imagen que se está construyendo.
pt_br: Todas as opções de compilação e instalação podem ser encontradas na página do manual man:src.conf[5], mas nem todas as opções podem ou devem ser usadas ao construir uma imagem do NanoBSD. As opções de compilação e instalação devem ser definidas de acordo com as necessidades da imagem sendo construída.

source: For example, the ftp client and server might not be needed. Adding `WITHOUT_FTP=TRUE` to a configuration file in the `CONF_BUILD` section will avoid having them built. Also, if the NanoBSD appliance will not be used to build programs then it is possible to add the `WITHOUT_BINUTILS=TRUE` in the `CONF_INSTALL` section; but not in the `CONF_BUILD` section as they will be used to build the NanoBSD image.
es: Por ejemplo, el cliente y el servidor de ftp podrían no ser necesarios. Añadir `WITHOUT_FTP=TRUE` a un fichero de configuración en la sección `CONF_BUILD` evitará compilarlos. También, si el dispositivo NanoBSD no se va a usar para construir programas entonces es posible añadir `WITHOUT_BINUTILS=TRUE` en la sección `CONF_INSTALL`; pero no en la sección `CONF_BUILD` ya que serán usadas para construir la imagen de NanoBSD.
pt_br: Por exemplo, o cliente e servidor FTP podem não ser necessários. Adicionar `WITHOUT_FTP=TRUE` em um arquivo de configuração na seção `CONF_BUILD` evitará que eles sejam compilados. Além disso, se o aparelho NanoBSD não será usado para compilar programas, é possível adicionar `WITHOUT_BINUTILS=TRUE` na seção `CONF_INSTALL`; mas não na seção `CONF_BUILD`, pois eles serão usados para construir a imagem do NanoBSD.

source: Not building a particular set of programs - through a compilation option - shortens the overall building time and lowers the required size for the disk image, whereas not installing the same specific set of programs does not lower the overall building time.
es: Evitar compilar un conjunto de programas en particular - mediante una opción de compilación - acorta el tiempo total de construcción y reduce el tamaño necesario para la imagen de disco, mientras que no instalar dicho conjunto de programas no disminuye el tiempo total de construcción.
pt_br: Não compilar um conjunto específico de programas - por meio de uma opção de compilação - reduz o tempo total de compilação e diminui o tamanho necessário para a imagem do disco, enquanto não instalar o mesmo conjunto específico de programas não reduz o tempo total de compilação.

source: Updating NanoBSD
es: Actualizando NanoBSD
pt_br: Atualizando o NanoBSD

source: The update process of NanoBSD is relatively simple:
es: El proceso de actualización de NanoBSD es relativamente simple:
pt_br: O processo de atualização do NanoBSD é relativamente simples:

source: Build a new NanoBSD image, as usual.
es: Construye una nueva imagen de NanoBSD de forma habitual.
pt_br: Construa uma nova imagem do NanoBSD, como de costume.

source: Upload the new image into an unused partition of a running NanoBSD appliance.
es: Sube la imagen nueva a una partición sin usar en el dispositivo que esté ejecutando NanoBSD.
pt_br: Faça o upload da nova imagem para uma partição não utilizada de um aparelho NanoBSD em execução.

source: The most important difference of this step from the initial NanoBSD installation is that now instead of using [.filename]#\_.disk.full# (which contains an image of the entire disk), the [.filename]#_.disk.image# image is installed (which contains an image of a single system partition).
es: La diferencia más importante entre este paso y la instalación inicial de NanoBSD es que ahora, en lugar de usar [.filename]#\_.disk.full# (que contiene la imagen completa del disco), se instala la imagen [.filename]#_.disk.image# (la cual contiene la imagen de una sola partición del sistema).
pt_br: A diferença mais importante deste passo em relação à instalação inicial do NanoBSD é que, em vez de usar o arquivo [.filename]#\_.disk.full# (que contém uma imagem do disco inteiro), é instalada a imagem [.filename]#_.disk.image# (que contém uma imagem de uma única partição do sistema).

source: Reboot, and start the system from the newly installed partition.
es: Reinicia y arranca el sistema desde la partición recién instalada.
pt_br: Reinicie e inicie o sistema a partir da partição recém-instalada.

source: If all goes well, the upgrade is finished.
es: Si todo termina correctamente, la actualización habrá finalizado.
pt_br: Se tudo correr bem, a atualização está concluída.

source: If anything goes wrong, reboot back into the previous partition (which contains the old, working image), to restore system functionality as fast as possible. Fix any problems of the new build, and repeat the process.
es: Si algo sale mal, reinicia en la partición anterior (que contiene la antigua imagen que funciona correctamente), para restaurar la funcionalidad del sistema tan rápido como sea posible. Arregla los problemas de la nueva imagen y repite el proceso.
pt_br: Se algo der errado, reinicie a partição anterior (que contém a imagem antiga que estava em funcionamento) para restaurar a funcionalidade do sistema o mais rápido possível. Corrija quaisquer problemas da nova compilação e repita o processo.

source: To install new image onto the running NanoBSD system, it is possible to use either the [.filename]#updatep1# or [.filename]#updatep2# script located in the [.filename]#/root# directory, depending from which partition is running the current system.
es: Para instalar una nueva imagen en un sistema que está ejecutando NanoBSD, es posible utilizar los scripts [.filename]#updatep1# o [.filename]#updatep2# que se encuentran en el directorio [.filename]#/root#, dependiendo de la partición desde la que se esté ejecutando el sistema actual.
pt_br: Para instalar uma nova imagem em um sistema NanoBSD em execução, é possível usar o script [.filename]#updatep1# ou [.filename]#updatep2#, localizados no diretório [.filename]#/root#, dependendo de qual partição o sistema atual está sendo executado.

source: According to which services are available on host serving new NanoBSD image and what type of transfer is preferred, it is possible to examine one of these three ways:
es: Dependiendo de los servicios disponibles en el host que ofrece la nueva imagen de NanoBSD y el tipo de transferencia preferido, es posible examinar uno de estos tres métodos:
pt_br: Dependendo dos serviços disponíveis no host que está servindo a nova imagem do NanoBSD e do tipo de transferência preferido, é possível examinar uma dessas três opções:

source: Using man:ftp[1]
es: Usar man:ftp[1]
pt_br: Usando o comando man:ftp[1]

source: If the transfer speed is in first place, use this example:
es: Si la velocidad de transferencia es una prioridad, utiliza este ejemplo:
pt_br: Se a velocidade de transferência estiver em primeiro lugar, use este exemplo:

source: Using man:ssh[1]
es: Usar man:ssh[1]
pt_br: Usando o comando man:ssh[1]

source: If a secure transfer is preferred, consider using this example:
es: Si prefieres una transferencia segura, considera usar este ejemplo:
pt_br: Se uma transferência segura for preferida, considere usar este exemplo:

source: Using man:nc[1]
es: Usar man:nc[1]
pt_br: Usando o comando man:nc[1]

source: Try this example if the remote host is not running neither man:ftpd[8] or man:sshd[8] service:
es: Prueba este ejemplo si el host remoto no está ejecutando ni el servicio man:ftpd[8] ni el servicio man:sshd[8]:
pt_br: Experimente este exemplo se o host remoto não estiver executando os serviços man:ftpd[8] ou man:sshd[8]:

source: At first, open a TCP listener on host serving the image and make it send the image to client:
es: En primer lugar, abre un puerto TCP en el host que se encuentra sirviendo la imagen y haz que envíe la imagen al cliente:
pt_br: Primeiramente, abra um socket TCP em modo escuta no host que serve a imagem e envie a imagem para o cliente:

source: Make sure that the used port is not blocked to receive incoming connections from NanoBSD host by firewall.
es: Asegúrate de que el puerto que usas no está bloqueado por ningún firewall para recibir conexiones entrantes desde el host NanoBSD.
pt_br: Verifique se a porta utilizada não está bloqueada pelo firewall para receber conexões originadas do host NanoBSD.

source: Connect to the host serving new image and execute [.filename]#updatep1# script:
es: Conéctate al host que sirve la nueva imagen y ejecuta el script [.filename]#updatep1#:
pt_br: Conecte-se ao host que está servindo a nova imagem e execute o script [.filename]#updatep1#:
