Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/nanobsd/_index.po
Languages: es, pt_br

source: This document provides information about the NanoBSD tools, which can be used to create FreeBSD system images for embedded applications, suitable for use on a USB key, memory card or other mass storage media.
es: Este documento proporciona información sobre las herramientas NanoBSD, las cuales pueden ser usadas para crear imágenes de FreeBSD para aplicaciones embebidas, adecuadas para su uso en una memoria USB, tarjeta de memoria, u otro medio de almacenamiento.
pt_br: Este documento fornece informações sobre as ferramentas NanoBSD, que podem ser usadas para criar imagens de sistema FreeBSD para aplicações embarcadas, adequadas para uso em uma chave USB, cartão de memória ou outro meio de armazenamento em massa.

source: Introduction to NanoBSD
es: Introducción a NanoBSD
pt_br: Introdução ao NanoBSD

source: Abstract
es: Resumen
pt_br: Resumo

source: NanoBSD is a tool developed by {phk} and now maintained by {imp}. It creates a FreeBSD system image for embedded applications, suitable for use on a USB key, memory card or other mass storage media.
es: NanoBSD es una herramienta desarrollada por {phk} y mantenida ahora por {imp}. La herramienta crea una imagen para aplicaciones embebidas, adecuada para su uso en una memoria USB, tarjeta de memoria, u otro medio de almacenamiento.
pt_br: O NanoBSD é uma ferramenta desenvolvida por {phk} e agora mantida por {imp}. Ela cria uma imagem do sistema FreeBSD para aplicações embarcadas, adequada para uso em uma chave USB, cartão de memória ou outro meio de armazenamento em massa.

source: It can be used to build specialized install images, designed for easy installation and maintenance of systems commonly called "computer appliances". Computer appliances have their hardware and software bundled in the product, which means all applications are pre-installed. The appliance is plugged into an existing network and can begin working (almost) immediately.
es: Puede usarse para crear imágenes de instalación especializadas, diseñadas para instalar y mantener sistemas comúnmente llamados "aparatos de computación" (computer appliances). Los aparatos de computación incluyen el hardware y software en el mismo producto, lo cual significa que todas las aplicaciones vienen preinstaladas. El aparato se conecta a una red existente y puede comenzar a funcionar (casi) de inmediato.
pt_br: Pode ser usado para construir imagens de instalação especializadas, projetadas para facilitar a instalação e manutenção de sistemas comumente chamados de "computer appliances". Os computer appliances têm seu hardware e software empacotados no produto, o que significa que todos os aplicativos estão pré-instalados. O aparelho é conectado a uma rede existente e pode começar a funcionar (quase) imediatamente.

source: The features of NanoBSD include:
es: Las funcionalidades de NanoBSD incluyen:
pt_br: As características do NanoBSD incluem:

source: Ports and packages work as in FreeBSD - Every single application can be installed and used in a NanoBSD image, the same way as in FreeBSD.
es: Los ports y paquetes funcionan de la misma manera que en FreeBSD — Cada aplicación puede ser instalada y usada en una imagen de NanoBSD, de la misma manera que en FreeBSD.
pt_br: Os Ports e pacotes funcionam como no FreeBSD - Cada aplicação pode ser instalada e usada em uma imagem NanoBSD, da mesma forma que no FreeBSD.

source: No missing functionality - If it is possible to do something with FreeBSD, it is possible to do the same thing with NanoBSD, unless the specific feature or features were explicitly removed from the NanoBSD image when it was created.
es: No se pierde funcionalidad - Si es posible hacer algo con FreeBSD, es posible hacer lo mismo con NanoBSD, excepto si las funciones específicas fueron explícitamente eliminadas de la imagen de NanoBSD cuando fue creada.
pt_br: Nenhuma funcionalidade faltante - Se é possível fazer algo com o FreeBSD, é possível fazer a mesma coisa com o NanoBSD, a menos que a funcionalidade específica tenha sido explicitamente removida da imagem do NanoBSD quando ela foi criada.

source: Everything is read-only at run-time - It is safe to pull the power-plug. There is no necessity to run man:fsck[8] after a non-graceful shutdown of the system.
es: El sistema es de sólo lectura en tiempo de ejecución, por lo tanto es seguro quitar el cable de alimentación. No hay necesidad de correr man:fsck[8] después de un apagado abrupto del sistema.
pt_br: O sistema opera em modo read-only em tempo de execução - É seguro puxar o plugue de energia. Não há necessidade de executar o man:fsck[8] após um desligamento abrupto do sistema.

source: Easy to build and customize - Making use of just one shell script and one configuration file it is possible to build reduced and customized images satisfying any arbitrary set of requirements.
es: Es fácil de crear y personalizar — Haciendo uso de un único script y solamente un archivo de configuración, es posible crear imágenes reducidas y personalizadas para satisfacer un conjunto arbitrario de requisitos.
pt_br: É fácil de compilar e personalizar - Usando apenas um script de shell e um arquivo de configuração, é possível criar imagens reduzidas e personalizadas, satisfazendo qualquer conjunto arbitrário de requisitos.

source: NanoBSD Howto
es: NanoBSD paso a paso
pt_br: Guia do NanoBSD

source: The Design of NanoBSD
es: El Diseño de NanoBSD
pt_br: O Design do NanoBSD

source: Once the image is present on the medium, it is possible to boot NanoBSD. The mass storage medium is divided into three parts by default:
es: Una vez que la imagen está presente en el medio, es posible arrancar NanoBSD. El medio de almacenamiento está dividido por defecto en tres partes:
pt_br: Uma vez que a imagem está presente no meio de armazenamento, é possível inicializar o NanoBSD. O meio de armazenamento em massa é dividido em três partes por padrão:

source: Two image partitions: `code#1` and `code#2`.
es: Dos particiones de imagen: `code#1` y `code#2`.
pt_br: Duas partições de imagem: `code#1` e `code#2`.

source: The configuration file partition, which can be mounted under the [.filename]#/cfg# directory at run time.
es: La partición del archivo de configuración, que se puede montar bajo el directorio [.filename]#/cfg# en tiempo de ejecución.
pt_br: A partição do arquivo de configuração, que pode ser montada sob o diretório [.filename]#/cfg# em tempo de execução.

source: These partitions are normally mounted read-only.
es: Estas particiones normalmente se montan como solo lectura.
pt_br: Essas partições são normalmente montadas em modo read-only (somente leitura).

source: The [.filename]#/etc# and [.filename]#/var# directories are man:md[4] (malloc) disks.
es: Los directorios [.filename]#/etc# y [.filename]#/var# son discos malloc (malloc disks) man:md[4].
pt_br: Os diretórios [.filename]#/etc# e [.filename]#/var# são discos man:md[4] (malloc).

source: The configuration file partition persists under the [.filename]#/cfg# directory. It contains files for [.filename]#/etc# directory and is briefly mounted read-only right after the system boot, therefore it is required to copy modified files from [.filename]#/etc# back to the [.filename]#/cfg# directory if changes are expected to persist after the system restarts.
es: La partición del archivo de configuración reside en el directorio [.filename]#/cfg#. Contiene archivos para el directorio [.filename]#/etc# y se monta brevemente como una partición de solo lectura tras el arranque del sistema; por lo tanto, es necesaria para copiar archivos modificados desde [.filename]#/etc# de vuelta hacia el directorio [.filename]#/cfg# si se espera que los cambios persistan después de reiniciar el sistema.
pt_br: A partição do arquivo de configuração persiste no diretório [.filename]#/cfg#. Ele contém arquivos para o diretório [.filename]#/etc# e é montado brevemente como somente leitura logo após a inicialização do sistema. Portanto, é necessário copiar os arquivos modificados do diretório [.filename]#/etc# de volta para o diretório [.filename]#/cfg# se as alterações precisarem ser mantidas após a reinicialização do sistema.

source: Making Persistent Changes to [.filename]#/etc/resolv.conf#
es: Haciendo Cambios Persistentes en [.filename]#/etc/resolv.conf#
pt_br: Fazendo alterações persistentes no arquivo [.filename]#/etc/resolv.conf#

source: The partition containing [.filename]#/cfg# should be mounted only at boot time and while overriding the configuration files.
es: La partición que contiene [.filename]#/cfg# debería ser montada solo en el arranque y cuando se sustituyan las directivas de los archivos de configuración.
pt_br: A partição que contém o diretório [.filename]#/cfg# deve ser montada somente no momento da inicialização e enquanto sobrescreve os arquivos de configuração.

source: Keeping [.filename]#/cfg# mounted at all times is not a good idea, especially if the NanoBSD system runs off a mass storage medium that may be adversely affected by a large number of writes to the partition (like when the filesystem syncer flushes data to the system disks).
es: Mantener [.filename]#/cfg# montado todo el tiempo no es una buena idea, especialmente si el sistema NanoBSD se ejecuta en un medio de almacenamiento masivo que puede verse afectado negativamente por un alto número de escrituras en la partición (como cuando el sincronizador del sistema de archivos vuelca los datos hacia los discos del sistema).
pt_br: Manter o [.filename]#/cfg# montado o tempo todo não é uma boa idéia, especialmente se o sistema NanoBSD rodar em um meio de armazenamento em massa que pode ser afetado adversamente por um grande número de gravações na partição (como quando o sincronizador do sistema de arquivos libera dados para os discos do sistema).

source: Building a NanoBSD Image
es: Compilar una Imagen de NanoBSD
pt_br: Construindo uma imagem NanoBSD

source: A NanoBSD image is built using a simple [.filename]#nanobsd.sh# shell script, which can be found in the [.filename]#/usr/src/tools/tools/nanobsd# directory. This script creates an image, which can be copied on the storage medium using the man:dd[1] utility.
es: Una imagen de NanoBSD se construye usando el sencillo script [.filename]#nanobsd.sh# que puede encontrarse en el directorio [.filename]#/usr/src/tools/tools/nanobsd#. Este script crea una imagen que se puede copiar al medio de almacenamiento utilizando la herramienta man:dd[1].
pt_br: Uma imagem NanoBSD é compilada usando um simples shell script [.filename]#nanobsd.sh#, que pode ser encontrado no diretório [.filename]#/usr/src/tools/tools/nanobsd#. Este script cria uma imagem, que pode ser copiada no meio de armazenamento usando o utilitário man:dd[1].

source: The necessary commands to build a NanoBSD image are:
es: Los comandos necesarios para construir una imagen NanoBSD son:
pt_br: Os comandos necessários para construir uma imagem NanoBSD são:

source: Change the current directory to the base directory of the NanoBSD build script.
es: Cambia el directorio actual por el directorio base del script de construcción de NanoBSD.
pt_br: Altere o diretório atual para o diretório base do script de compilação do NanoBSD.

source: Start the build process.
es: Comienza el proceso de compilación.
pt_br: Inicie o processo de compilação.

source: Change the current directory to the place where the built images are located.
es: Cambia el directorio actual por el lugar donde se encuentran las imágenes compiladas.
pt_br: Altere o diretório atual para o local onde as imagens compiladas estão localizadas.

source: Install NanoBSD onto the storage medium.
es: Instala NanoBSD en el medio de almacenamiento.
pt_br: Instale o NanoBSD no meio de armazenamento.

source: Options When Building a NanoBSD Image
es: Opciones al Construir una Imagen de NanoBSD
pt_br: Opções ao compilar uma imagem NanoBSD

source: When building a NanoBSD image, several build options can be passed to [.filename]#nanobsd.sh# on the command line. These options can have a significant impact on the build process.
es: Cuando se construye una imagen de NanoBSD, se pueden pasar varias opciones a [.filename]#nanobsd.sh# en la línea de comando. Estas opciones pueden tener un impacto significativo en el proceso de construcción.
pt_br: Ao construir uma imagem NanoBSD, várias opções de compilação podem ser passadas para [.filename]#nanobsd.sh# na linha de comando. Essas opções podem ter um impacto significativo no processo de compilação.

source: Some options are for verbosity purposes:
es: Algunas opciones tienen propósitos de verbosidad:
pt_br: Algumas opções são para fins de verbosidade:

source: `-h`: prints the help summary page.
es: `-h`: imprime un resumen de la página de ayuda.
pt_br: `-h`: imprime a página resumida de ajuda.

source: `-q`: makes output quieter.
es: `-q`: hace que la salida sea más silenciosa.
pt_br: `-q`: torna a saída mais silenciosa.

source: `-v`: makes output more verbose
es: `-v`: hace que la salida sea más verbosa
pt_br: `-v`: torna a saída mais detalhada (verbose)

source: Some other options can be used to restrict the building process. Sometimes it is not necessary to rebuild everything from sources, especially if an image has already been built, and only little change is made.
es: Otras opciones se pueden usar para restringir el proceso de construcción. A veces no es necesario reconstruir todo desde las fuentes, especialmente si ya se ha construido una imagen y sólo se han hecho pequeños cambios.
pt_br: Algumas outras opções podem ser usadas para restringir o processo de compilação. Às vezes, não é necessário reconstruir tudo a partir das fontes, especialmente se uma imagem já foi compilada e apenas poucas alterações foram feitas.

source: `-k`: do not build the kernel
es: `-k`: no construir el kernel
pt_br: `-k`: não compilar o kernel

source: `-w`: do not build world
es: `-w`: no construir world
pt_br: `-w`: não compilar o mundo (world)

source: `-b`: do not build either kernel and world
es: `-b`: no construir ni el kernel ni world
pt_br: `-b`: não compilar nem o kernel e nem o mundo (world)

source: `-i`: do not build a disk image at all. As a file will not be created, it will not be possible to man:dd[1] it to a storage media.
es: `-i`: no construir una imagen de disco. Como no se creará un fichero, no será posible copiarlo con man:dd[1] al medio de almacenamiento.
pt_br: `-i`: não compilar uma imagem de disco. Como um arquivo não será criado, não será possível usá-lo com o comando man:dd[1] para gravá-lo em um dispositivo de armazenamento.

source: `-f`: do not build a disk image of the first partition (which is useful for upgrade purposes)
es: `-f`: no construir una imagen de disco de la primera partición (útil para actualizaciones)
pt_br: `-f`: não compilar uma imagem de disco para a primeira partição (o que é útil para fins de atualização)

source: `-n`: add `-DNO_CLEAN` to `buildworld`, `buildkernel`. Also, all the files that have already been built in a previous run are kept.
es: `-n`: añade `-DNO_CLEAN` a `buildworld`, `buildkernel`. También se guardan todos los ficheros que se hayan construido en una ejecución previa.
pt_br: `-n`: adiciona `-DNO_CLEAN` as etapas `buildworld` e `buildkernel`. Além disso, todos os arquivos que já foram compilados em uma execução anterior são mantidos.

source: A configuration file can be used to tweak as many elements as desired. Load it with `-c`
es: Se puede usar un fichero de configuración para ajustar cuantos elementos como se quiera. Cárgalo con `-c`
pt_br: Um arquivo de configuração pode ser usado para ajustar quantos elementos desejar. Carregue-o com `-c`

source: The last options are:
es: Las últimas opciones son:
pt_br: As últimas opções são:

source: `-K`: do not install a kernel. A disk image without a kernel will not be able to achieve a normal boot sequence.
es: `-K`: no instalar un kernel. Una imagen de disco sin un kernel no será capaz de realizar una secuencia normal de arranque.
pt_br: `-K`: não instalar um kernel. Uma imagem de disco sem um kernel não poderá executar uma sequência de inicialização normal.

source: The Complete Image Building Process
es: El Proceso Completo de Creación de Imágenes
pt_br: O Processo Completo de Compilação de Imagens

source: The complete image building process is going through a lot of steps. The exact steps taken will depend on the chosen options when starting the script. Assuming the script is run with no particular options, this is what will happen.
es: El proceso completo de creación de imágenes tiene muchos pasos. Los pasos exactos dependerán de las opciones escogidas cuando se inicia el script. Asumiendo que el script se ejecuta sin opciones particulares, esto es lo que pasará.
pt_br: O processo completo de compilação de imagens passa por muitas etapas. As etapas exatas dependerão das opções selecionadas ao iniciar o script. Supondo que o script seja executado sem opções específicas, isso é o que acontecerá.

source: `run_early_customize`: commands that are defined in a supplied configuration file.
es: `run_early_customize`: comandos que se definen en un fichero de configuración que se ha proporcionado.
pt_br: `run_early_customize`: comandos que são definidos em um arquivo de configuração fornecido.

source: `clean_build`: Just cleans the build environment by deleting the previously built files.
es: `clean_build`: Simplemente limpia el entorno de construcción mediante el borrado de ficheros construidos previamente.
pt_br: `clean_build`: Apenas limpa o ambiente de compilação excluindo os arquivos previamente compilados.

source: `make_conf_build`: Assemble make.conffrom the `CONF_WORLD` and `CONF_BUILD` variables.
es: `make_conf_build`: Ensambla make.conf a partir de las variables `CONF_WORLD` y `CONF_BUILD`.
pt_br: `make_conf_build`: Monta o arquivo make.conf a partir das variáveis `CONF_WORLD` e `CONF_BUILD`.

source: `build_world`: Build world.
es: `build_world`: Construye world.
pt_br: `build_world`: Compila o mundo (world).

source: `build_kernel`: Build the kernel files.
es: `build_kernel`: Construye los ficheros del kernel.
pt_br: `build_kernel`: Compila os arquivos do kernel.

source: `clean_world`: Clean the destination directory.
es: `clean_world`: Limpia el directorio de destino.
pt_br: `clean_world`: Limpa o diretório de destino.

source: `make_conf_install`: Assemble make.conf from the `CONF_WORLD` and `CONF_INSTALL` variables.
es: `make_conf_install`: Ensambla make.conf a partir de las variables `CONF_WORLD` y `CONF_INSTALL`.
pt_br: `make_conf_install`: Monta o arquivo make.conf a partir das variáveis `CONF_WORLD` e `CONF_INSTALL`.

source: `install_world`: Install all files built during `buildworld`.
es: `install_world`: Instala todos los ficheros construidos durante la fase `buildworld`.
pt_br: `install_world`: Instala todos os arquivos construídos durante o `buildworld`.

source: `install_etc`: Install the necessary files in the [.filename]#/etc# directory, based on the `make distribution` command.
es: `install_etc`: Instala los ficheros necesarios en el directorio [.filename]#/etc# basándose en el comando `make distribution`.
pt_br: `install_etc`: Instala os arquivos necessários no diretório [.filename]#/etc#, com base no comando `make distribution`.

source: `setup_nanobsd_etc`: the first configuration specific to NanoBSD takes place at this stage. The [.filename]#/etc/diskless# is created and the root filesystem is defined as read-only.
es: `setup_nanobsd_etc`: la primera configuración específica de NanoBSD tiene lugar en esta fase. Se crea [.filename]#/etc/diskless# y se define el sistema de ficheros raíz como sólo lectura.
pt_br: `setup_nanobsd_etc`: a primeira configuração específica do NanoBSD ocorre nesta etapa. O diretório [.filename]#/etc/diskless# é criado e o sistema de arquivos raiz é definido como somente leitura.

source: `install_kernel`: the kernel and modules files are installed.
es: `install_kernel`: se instalan los ficheros del kernel y los módulos.
pt_br: `install_kernel`: os arquivos do kernel e dos módulos são instalados.

source: `run_customize`: all the customizing routines defined by the user will be called.
es: `run_customize`: se llama a todas las rutinas personalizadas definidas por el usuario.
pt_br: `run_customize`: todas as rotinas de personalização definidas pelo usuário serão chamadas.

source: `setup_nanobsd`: a special configuration directory layout is setup. The [.filename]#/usr/local/etc# gets moved to [.filename]#/etc/local# and a symbolic link is created back from [.filename]#/etc/local# to [.filename]#/usr/local/etc#.
es: `setup_nanobsd`: se configura un esquema especial de directorios de configuración. [.filename]#/usr/local/etc# se mueve a [.filename]#/etc/local# y se crea un enlace simbólico de vuelta desde [.filename]#/etc/local# a [.filename]#/usr/local/etc#.
pt_br: `setup_nanobsd`: uma estrutura especial de diretórios de configuração é configurada. O diretório [.filename]#/usr/local/etc# é movido para [.filename]#/etc/local# e um link simbólico é criado de volta de [.filename]#/etc/local# para [.filename]#/usr/local/etc#.

source: `prune_usr`: the empty directories from [.filename]#/usr# are removed.
es: `prune_usr`: se eliminan los directorios vacíos de [.filename]#/usr#.
pt_br: `prune_usr`: os diretórios vazios de [.filename]#/usr# são removidos.

source: `run_late_customize`: the very last custom scripts can be run at this point.
es: `run_late_customize`: en este punto se ejecutan los últimos scripts personalizados.
pt_br: `run_late_customize`: os últimos scripts personalizados podem ser executados neste ponto.

source: `fixup_before_diskimage`: List all installed files in a metalog
es: `fixup_before_diskimage`: Lista todos los ficheros instalados en un metalog.
pt_br: `fixup_before_diskimage`: Lista todos os arquivos instalados em um metalog

source: `create_diskimage`: creates the actual disk image, based on the disk geometries provides parameters.
es: `create_diskimage`: crea la imagen de disco real basada en los parámetros proporcionados sobre las geometrías del disco.
pt_br: `create_diskimage`: cria a imagem de disco, com base nos parâmetros de geometria de disco fornecidos.

source: `last_orders`: does nothing for now.
es: `last_orders`: no hace nada de momento.
pt_br: `last_orders`: não faz nada por enquanto.

source: Customizing a NanoBSD Image
es: Personalizar una Imagen de NanoBSD
pt_br: Personalizando uma imagem NanoBSD

source: This is probably the most important and most interesting feature of NanoBSD. This is also where you will be spending most of the time when developing with NanoBSD.
es: Esta es probablemente la característica más importante y más interesante de NanoBSD. Es también donde pasarás la mayor parte del tiempo cuando desarrolles con NanoBSD.
pt_br: Esta é provavelmente a característica mais importante e mais interessante do NanoBSD. É também onde você passará a maior parte do tempo ao desenvolver com o NanoBSD.

source: Invocation of the following command will force the [.filename]#nanobsd.sh# to read its configuration from [.filename]#myconf.nano# located in the current directory:
es: Invocar el siguiente comando forzará a [.filename]#nanobsd.sh# a leer su configuración desde el archivo [.filename]#myconf.nano# situado en el directorio actual:
pt_br: A invocação do seguinte comando forçará o [.filename]#nanobsd.sh# a ler sua configuração de [.filename]#myconf.nano# localizado no diretório atual:

source: Customization is done in two ways:
es: La personalización puede realizarse de dos formas:
pt_br: A personalização é feita de duas maneiras:

source: Configuration options
es: Opciones de configuración
pt_br: Opções de configuração

source: Custom functions
es: Funciones personalizadas
pt_br: Funções personalizadas
