freebsd/freebsd-doc/documentation/manual-pages/ru/man8/intro.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)intro.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/share/man/man8/intro.8,v 1.12 2006/10/21 20:35:49 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man8/intro.8,v 1.4 2007/11/20 13:50:08 ru Exp $
.\" $FreeBSD$
.\"
.Dd 22 октября 2006
.Dt INTRO 8
.Os
.Sh НАЗВАНИЕ
.Nm intro
.Nd "введение в команды и процедуры управления системой"
.Sh ОПИСАНИЕ
Этот раздел содержит информацию, касающуюся обслуживания и
управления системой.
.Pp
Описаны команды, используемые для создания новых файловых систем
.Pq Xr newfs 8 ,
проверки целостности файловых систем
.Pq Xr fsck 8 ,
контроля над использованием дискового пространства
.Pq Xr edquota 8 ,
создания резервных копий системы
.Pq Xr dump 8 ,
и восстановления файлов, когда диски безвременно гибнут
.Pq Xr restore 8 .
.\" Для получения информации, касающейся форматирования дисков и лент,
.\" обратитесь к странице справочника
.\" .Xr format 8
.\" для конкретной архитектуры, на которой работает система.
В этом разделе также описаны сетевые службы, такие как
.Xr inetd 8
и
.Xr ftpd 8 .
.Pp
Все команды устанавливают статус завершения.
Чтобы проверить, завершилась ли команда успешно,
нужно проверить его значение.
Если не указано иначе (редко), значение 0 означает успешное
завершение команды, тогда как значение >0 означает ошибку.
Некоторые команды пытаются описать суть сбоя, используя
коды ошибок, определённые в
.Xr sysexits 3 ,
или устанавливают код в произвольные значения >0 (обычно 1), но зачастую
подобные значения не документируются в справочнике.
.Pp
Некоторые страницы этого раздела касаются общих вопросов
управления системой.
.Pp
Например, страница
.Xr boot 8
описывает процесс загрузки системы,
а страница
.Xr diskless 8
описывает процедуру загрузки системы по сети.
Чтобы понять, как интерпретировать дампы сбоя системы,
обратитесь к
.Xr crash 8 .
.Sh ИСТОРИЯ
Страница справочника
.Nm
этого раздела появилась в
.Bx 4.2 .
