freebsd/freebsd-doc/documentation/manual-pages/ru/man8/mount_ntfs.8
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" Copyright (c) 1999 Semen Ustimenko
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_ntfs/mount_ntfs.8,v 1.21 2005/02/10 09:19:31 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man8/mount_ntfs.8,v 1.2 2007/11/20 13:50:08 ru Exp $
.\" $FreeBSD$
.\"
.Dd 3 января 1999
.Dt MOUNT_NTFS 8
.Os
.Sh НАЗВАНИЕ
.Nm mount_ntfs
.Nd смонтировать файловую систему NTFS
.Sh СИНТАКСИС
.Nm
.Op Fl a
.Op Fl i
.Op Fl u Ar пользователь
.Op Fl g Ar группа
.Op Fl m Ar маска
.Op Fl C Ar кодировка
.Op Fl W Ar u2wtable
.Pa спецфайл
.Pa точка_монтирования
.Sh ОПИСАНИЕ
Утилита
.Nm
монтирует файловую систему NTFS, располагающуюся на устройстве
.Pa спецфайл ,
в каталог
.Pa точка_монтирования .
Эту команду обычно исполняет
.Xr mount 8
во время загрузки, но она может быть использована любым пользователем
для монтирования файловой системы NTFS в любой каталог, владельцем
которого он является (разумеется, при условии, что у пользователя есть
соответствующие права доступа к устройству, на котором располагается
файловая система).
.Pp
Имеются следующие опции:
.Bl -tag -width Ds
.It Fl a
Возвращать в
.Fn readdir
в том числе и имена MS-DOS 8.3.
.It Fl i
Выполнять поиск имени без учёта регистра для всех имён,
за исключением имён POSIX.
.It Fl u Ar пользователь
Сделать владельцем файлов в файловой системе пользователя
.Ar пользователь .
Владельцем по умолчанию является владелец каталога,
в который монтируется файловая система.
.It Fl g Ar группа
Сделать группой, владеющей файлами в файловой системе, группу
.Ar группа .
Группой по умолчанию является группа каталога,
в который монтируется файловая система.
.It Fl m Ar маска
Задать наибольшие возможные права доступа для файлов
в файловой системе.
.It Fl C Ar кодировка
Задать локальный набор символов
.Ar кодировка
для преобразования имён файлов из Unicode.
В настоящий момент поддерживается только чтение, поэтому при использовании
этой опции файловая система будет смонтирована в режиме только для чтения.
.It Fl W Ar u2wtable
Задать таблицу трансляции из
.Ux
в
.Tn Unicode .
См.\&
.Xr mount_msdosfs 8
для описания этой опции.
.Bf Em
Эта опция поддерживается только лишь с целью обратной совместимости,
и в будущем будет удалена.
Пожалуйста, не используйте её.
.Ef
.El
.Sh ВОЗМОЖНОСТИ
К атрибутам файлов NTFS можно получить доступ следующим образом:
.Bd -literal -offset indent
foo[[:ATTRTYPE]:ATTRNAME]
.Ed
.Pp
.Sq ATTRTYPE
должен быть одним из идентификаторов, перечисленных в
файле $AttrDef тома NTFS (по умолчанию $DATA).
.Sq ATTRNAME
есть имя атрибута (по умолчанию отсутствует).
.Sh ПРИМЕРЫ
Смонтировать том NTFS, находящийся на
.Pa /dev/ad1s1 :
.Pp
.Dl "mount_ntfs /dev/ad1s1 /mnt"
.Pp
Получить имя тома (в Unicode):
.Pp
.Dl "cat /mnt/\e$Volume:\e$VOLUME_NAME"
.Pp
Прочитать необработанные данные каталога:
.Pp
.Dl "cat /mnt/foodir:\e$INDEX_ROOT:\e$I30"
.Pp
Смонтировать том NTFS с русскими именами, расположенный на втором
логическом диске расширенного раздела, т.е.\& на
.Pa /dev/ad0s6 :
.Pp
.Dl "mount_ntfs -C KOI8-R /dev/ad0s6 /mnt"
.Sh ЗАПИСЬ
Существует ограниченная возможность записи.
Ограничения: файл должен быть нерезидентным (не должен содержаться
в MFT, что обычно случается для очень маленьких файлов)
и не должен содержать неинициализированных пропусков (sparces);
не поддерживаются также и сжатые файлы.
Имя файла не должно содержать мультибайтовые символы.
.Sh СМОТРИ ТАКЖЕ
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr mount_msdosfs 8
.Sh ПРЕДОСТЕРЕЖЕНИЯ
Эта утилита предназначена главным образом для доступа к NTFS-тому на чтение.
См.\& секцию
.Sx ЗАПИСЬ
для подробностей о записи на том NTFS.
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась во
.Fx 3.0 .
.Pp
Подпрограмму конверсии из Unicode добавил
.An Ryuichiro Imura Aq imura@ryu16.org
в 2003 году.
.Sh АВТОРЫ
Реализация NTFS в ядре, утилита
.Nm
и документация были написаны
.An Семёном Устименко Aq semenu@FreeBSD.org .
