Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: When a packet matches a rule with the `log` keyword, a message will be logged to man:syslogd[8] with a facility name of `SECURITY`. Logging only occurs if the number of packets logged for that particular rule does not exceed a specified LOG_AMOUNT. If no LOG_AMOUNT is specified, the limit is taken from the value of `net.inet.ip.fw.verbose_limit`. A value of zero removes the logging limit. Once the limit is reached, logging can be re-enabled by clearing the logging counter or the packet counter for that rule, using `ipfw resetlog`.
ko: 패킷이 `log` 키워드가 있는 규칙과 일치하면, `SECURITY`라는 이름으로 man:syslogd[8]에 메시지가 기록됩니다. 로깅은 특정 규칙에 대해 기록된 패킷 수가 지정된 LOG_AMOUNT를 초과하지 않는 경우에만 발생합니다. LOG_AMOUNT를 지정하지 않으면 `net.inet.ip.fw.verbose_limit`의 값에서 제한을 가져옵니다. 값이 0이면 로깅 제한이 제거됩니다. 제한에 도달하면 `ipfw resetlog`를 사용하여 해당 규칙에 대한 로깅 카운터 또는 패킷 카운터를 지우면 로깅을 다시 활성화할 수 있습니다.
ru: Когда пакет соответствует правилу с ключевым словом `log`, сообщение будет записано в man:syslogd[8] с именем средства `SECURITY`. Запись в журнал происходит только в том случае, если количество пакетов, зарегистрированных для этого конкретного правила, не превышает указанного LOG_AMOUNT. Если LOG_AMOUNT не указан, лимит берется из значения `net.inet.ip.fw.verbose_limit`. Значение нуля снимает ограничение на запись в журнал. Как только лимит достигнут, запись в журнал можно снова включить, сбросив счетчик журналирования или счетчик пакетов для этого правила с помощью `ipfw resetlog`.

source: Logging is done after all other packet matching conditions have been met, and before performing the final action on the packet. The administrator decides which rules to enable logging on.
ko: 로깅은 다른 모든 패킷 매칭 조건이 충족된 후 패킷에 대한 최종 작업을 수행하기 전에 수행됩니다. 관리자는 로그온을 활성화할 규칙을 결정합니다.
ru: Журналирование выполняется после того, как все остальные условия сопоставления пакета выполнены, и перед выполнением конечного действия с пакетом. Администратор решает, для каких правил включить журналирование.

source: This optional value can be used to specify any protocol name or number found in [.filename]#/etc/protocols#.
ko: 이 옵션은 [.filename]#/etc/protocols#에 있는 프로토콜 이름이나 번호를 지정하는 데 사용할 수 있습니다.
ru: Это необязательное значение может использоваться для указания любого имени протокола или номера, найденного в [.filename]#/etc/protocols#.

source: The `from` keyword must be followed by the source address or a keyword that represents the source address. An address can be represented by `any`, `me` (any address configured on an interface on this system), `me6`, (any IPv6 address configured on an interface on this system), or `table` followed by the number of a lookup table which contains a list of addresses. When specifying an IP address, it can be optionally followed by its CIDR mask or subnet mask. For example, `1.2.3.4/25` or `1.2.3.4:255.255.255.128`.
ko: `from` 키워드 뒤에는 소스 주소 또는 소스 주소를 나타내는 키워드가 와야 합니다. 주소는 `any`, `me`(이 시스템의 인터페이스에 구성된 모든 주소), `me6`(이 시스템의 인터페이스에 구성된 모든 IPv6 주소) 또는 주소 목록이 포함된 조회 테이블의 번호 뒤에 `table`로 나타낼 수 있습니다. IP 주소를 지정할 때 선택적으로 그 뒤에 CIDR 마스크 또는 서브넷 마스크를 붙일 수 있습니다. 예를 들어 `1.2.3.4/25` 또는 `1.2.3.4:255.255.255.128`입니다.
ru: Ключевое слово `from` должно сопровождаться исходным адресом или ключевым словом, представляющим исходный адрес. Адрес может быть представлен как `any`, `me` (любой адрес, настроенный на интерфейсе этой системы), `me6` (любой IPv6-адрес, настроенный на интерфейсе этой системы) или `table`, за которым следует номер таблицы поиска, содержащей список адресов. При указании IP-адреса, он может быть дополнительно указан с маской CIDR или маской подсети. Например, `1.2.3.4/25` или `1.2.3.4:255.255.255.128`.

source: An optional source port can be specified using the port number or name from [.filename]#/etc/services#.
ko: 추가적인 소스 포트는 [.filename]#/etc/services#의 포트 번호 또는 이름을 사용하여 지정할 수 있습니다.
ru: Необязательный порт источника может быть указан с использованием номера порта или имени из [.filename]#/etc/services#.

source: The `to` keyword must be followed by the destination address or a keyword that represents the destination address. The same keywords and addresses described in the SRC section can be used to describe the destination.
ko: ‘to’ 키워드 뒤에는 목적지 주소 또는 목적지 주소를 나타내는 키워드가 와야 합니다. SRC 섹션에 설명된 것과 동일한 키워드와 주소를 사용하여 목적지를 설명할 수 있습니다.
ru: Ключевое слово `to` должно сопровождаться адресом назначения или ключевым словом, представляющим адрес назначения. Те же ключевые слова и адреса, которые описаны в разделе SRC, могут быть использованы для описания назначения.

source: An optional destination port can be specified using the port number or name from [.filename]#/etc/services#.
ko: 선택적 대상 포트는 [.filename]#/etc/services#의 포트 번호 또는 이름을 사용하여 지정할 수 있습니다.
ru: Необязательный порт назначения может быть указан с использованием номера порта или имени из [.filename]#/etc/services#.

source: Several keywords can follow the source and destination. As the name suggests, OPTIONS are optional. Commonly used options include `in` or `out`, which specify the direction of packet flow, `icmptypes` followed by the type of ICMP message, and `keep-state`.
ko: 소스 및 목적지 뒤에 여러 키워드를 붙일 수 있습니다. 이름에서 알 수 있듯이 옵션은 선택 사항입니다. 일반적으로 사용되는 옵션으로는 패킷 흐름의 방향을 지정하는 `in` 또는 `out`, ICMP 메시지 유형이 뒤따르는 `icmptypes`, `keep-state`가 있습니다.
ru: Несколько ключевых слов могут следовать за источником и назначением. Как следует из названия, OPTIONS являются необязательными. Часто используемые опции включают `in` или `out`, которые указывают направление потока пакетов, `icmptypes` с указанием типа ICMP-сообщения и `keep-state`.

source: When a `keep-state` rule is matched, the firewall will create a dynamic rule which matches bidirectional traffic between the source and destination addresses and ports using the same protocol.
ko: `keep-state` 규칙과 일치하면 방화벽은 동일한 프로토콜을 사용하는 원본과 대상 주소 및 포트 간의 양방향 트래픽을 일치시키는 동적 규칙을 생성합니다.
ru: Когда правило `keep-state` совпадает, межсетевой экран создаст динамическое правило, которое соответствует двунаправленному трафику между исходным и целевым адресами и портами, используя тот же протокол.

source: The dynamic rules facility is vulnerable to resource depletion from a SYN-flood attack which would open a huge number of dynamic rules. To counter this type of attack with IPFW, use `limit`. This option limits the number of simultaneous sessions by checking the open dynamic rules, counting the number of times this rule and IP address combination occurred. If this count is greater than the value specified by `limit`, the packet is discarded.
ko: 동적 규칙 기능은 수많은 동적 규칙을 열어주는 SYN-flood 공격으로 인한 리소스 고갈에 취약합니다. IPFW로 이러한 유형의 공격에 대응하려면 `limit`을 사용하십시오. 이 옵션은 열려 있는 동적 규칙을 확인하여 이 규칙과 IP 주소 조합이 발생한 횟수를 계산하여 동시 세션 수를 제한합니다. 이 횟수가 `limit`에 지정된 값보다 크면 패킷이 삭제됩니다.
ru: Функция динамических правил уязвима к истощению ресурсов из-за SYN-флуда, который может создать огромное количество динамических правил. Для защиты от такого типа атак в IPFW используйте параметр `limit`. Этот параметр ограничивает количество одновременных сессий, проверяя открытые динамические правила и подсчитывая, сколько раз встречалось сочетание данного правила и IP-адреса. Если это количество превышает значение, указанное в `limit`, пакет отбрасывается.

source: Dozens of OPTIONS are available. Refer to man:ipfw[8] for a description of each available option.
ko: 수십 가지 옵션을 사용할 수 있습니다. 사용 가능한 각 옵션에 대한 설명은 man:ipfw[8]을 참조하세요.
ru: Доступны десятки параметров `OPTIONS`. Описание каждого доступного параметра можно найти в man:ipfw[8].

source: Example Ruleset
ko: 규칙 집합 예시
ru: Пример набора правил

source: This section demonstrates how to create an example stateful firewall ruleset script named [.filename]#/etc/ipfw.rules#. In this example, all connection rules use `in` or `out` to clarify the direction. They also use `via` _interface-name_ to specify the interface the packet is traveling over.
ko: 이 섹션에서는 [.filename]#/etc/ipfw.rules#라는 이름의 상태분석형 방화벽 규칙집합 스크립트를 만드는 방법을 설명합니다. 이 예제에서 모든 연결 규칙은 방향을 명확히 하기 위해 `in` 또는 `out`을 사용합니다. 또한 패킷이 이동하는 인터페이스를 지정하기 위해 `via` _interface-name_을 사용합니다.
ru: В этом разделе показано, как создать пример набора правил для статического межсетевого экрана в виде скрипта с именем [.filename]#/etc/ipfw.rules#. В данном примере все правила соединений используют `in` или `out` для указания направления. Они также используют `via` _имя-интерфейса_ для указания интерфейса, через который проходит пакет.

source: When first creating or testing a firewall ruleset, consider temporarily setting this tunable:
ko: 방화벽 규칙 집합을 처음 만들거나 테스트할 때는 이 튜너블을 임시로 설정하는 것이 좋습니다:
ru: При первоначальном создании или тестировании набора правил межсетевого экрана рекомендуется временно установить этот параметр:

source: This sets the default policy of man:ipfw[8] to be more permissive than the default `deny ip from any to any`, making it slightly more difficult to get locked out of the system right after a reboot.
ko: 이렇게 하면 man:ipfw[8]의 기본 정책이 기본값인 `deny ip from any to any`보다는 허용적으로 설정되어 재부팅 직후 접근이 차단될 가능성이 낮아집니다.
ru: Это устанавливает политику по умолчанию для man:ipfw[8] более разрешительной, чем стандартная `deny ip from any to any`, что немного снижает вероятность блокировки системы сразу после перезагрузки.

source: The firewall script begins by indicating that it is a Bourne shell script and flushes any existing rules. It then creates the `cmd` variable so that `ipfw add` does not have to be typed at the beginning of every rule. It also defines the `pif` variable which represents the name of the interface that is attached to the Internet.
ko: 방화벽 스크립트는 본 셸 스크립트(Bourne shell script)라는 것을 나타내는 선언으로 시작하여 기존 규칙을 모두 플러시합니다. 그런 다음 `cmd` 변수를 생성하여 모든 규칙의 시작 부분에 `ipfw add`를 입력할 필요가 없도록 합니다. 또한 인터넷에 연결된 인터페이스의 이름을 나타내는 `pif` 변수를 정의합니다.
ru: Скрипт межсетевого экрана начинается с указания, что это скрипт Bourne shell, и очищает все существующие правила. Затем он создает переменную `cmd`, чтобы не приходилось вводить `ipfw add` в начале каждого правила. Также определяется переменная `pif`, которая представляет имя интерфейса, подключенного к Интернету.

source: The first two rules allow all traffic on the trusted internal interface and on the loopback interface:
ko: 처음 두 규칙은 신뢰할 수 있는 내부 인터페이스와 루프백 인터페이스의 모든 트래픽을 허용합니다:
ru: Первые два правила разрешают весь трафик на доверенном внутреннем интерфейсе и на loopback-интерфейсе:

source: The next rule allows the packet through if it matches an existing entry in the dynamic rules table:
ko: 다음 규칙은 패킷이 동적 규칙 테이블의 기존 항목과 일치하는 경우 패킷의 통과를 허용합니다:
ru: Следующее правило пропускает пакет, если он соответствует существующей записи в таблице динамических правил:

source: The next set of rules defines which stateful connections internal systems can create to hosts on the Internet:
ko: 다음 규칙 세트는 내부 시스템이 인터넷의 호스트에 만들 수 있는 상태분석형 연결을 정의합니다:
ru: Следующий набор правил определяет, какие состояния соединений внутренние системы могут устанавливать с узлами в Интернете:

source: The next set of rules controls connections from Internet hosts to the internal network. It starts by denying packets typically associated with attacks and then explicitly allows specific types of connections. All the authorized services that originate from the Internet use `limit` to prevent flooding.
ko: 다음 규칙 세트는 인터넷 호스트에서 내부 네트워크로의 연결을 제어합니다. 일반적으로 공격과 관련된 패킷을 거부하는 것으로 시작한 다음 특정 유형의 연결을 명시적으로 허용합니다. 인터넷에서 시작되는 모든 승인된 서비스는 플러딩을 방지하기 위해 `limit`를 사용합니다.
ru: Следующий набор правил управляет соединениями от хостов Интернета к внутренней сети. Он начинается с запрета пакетов, обычно связанных с атаками, а затем явно разрешает определённые типы соединений. Все авторизованные сервисы, поступающие из Интернета, используют `limit` для предотвращения перегрузки.

source: The last rule logs all packets that do not match any of the rules in the ruleset:
ko: 마지막 규칙은 규칙 집합의 규칙 중 어떤 규칙과도 일치하지 않는 모든 패킷을 기록합니다:
ru: Последнее правило записывает в журнал информацию о всех пакетах, которые не соответствуют ни одному из правил в наборе правил:

source: FreeBSD's IPFW firewall has two implementations of NAT: the userland implementation man:natd[8], and the more recent in-kernel NAT implementation. Both work in conjunction with IPFW to provide network address translation. This can be used to provide an Internet Connection Sharing solution so that several internal computers can connect to the Internet using a single public IP address.
ko: FreeBSD의 IPFW 방화벽에는 두 가지 NAT 구현이 있습니다: 사용자 공간 구현인 man:natd[8]와 더 최근의 In-Kernel NAT 구현입니다. 둘 다 IPFW와 함께 작동하여 네트워크 주소 변환을 제공합니다. 이는 인터넷 연결 공유 솔루션을 제공하는 데 사용할 수 있으므로 여러 내부 컴퓨터가 단일 공용 IP 주소를 사용하여 인터넷에 연결할 수 있습니다.
ru: Межсетевой экран IPFW в FreeBSD имеет две реализации NAT: реализацию в пользовательском пространстве man:natd[8] и более новую реализацию NAT в ядре. Обе работают совместно с IPFW для преобразования сетевых адресов. Это можно использовать для организации общего доступа в Интернет, чтобы несколько внутренних компьютеров могли подключаться к Интернету, используя один публичный IP-адрес.

source: To do this, the FreeBSD machine connected to the Internet must act as a gateway. This system must have two NICs, where one is connected to the Internet and the other is connected to the internal LAN. Each machine connected to the LAN should be assigned an IP address in the private network space, as defined by https://www.ietf.org/rfc/rfc1918.txt[RFC 1918].
ko: 이렇게 하려면 인터넷에 연결된 FreeBSD 머신이 게이트웨이 역할을 해야 합니다. 이 시스템에는 두 개의 NIC가 있어야 하며, 하나는 인터넷에 연결되고 다른 하나는 내부 LAN에 연결됩니다. LAN에 연결된 각 머신은 https://www.ietf.org/rfc/rfc1918.txt[RFC 1918]에 정의된 대로 개인 네트워크 공간에 IP 주소를 할당받아야 합니다.
ru: Для этого машина FreeBSD, подключённая к Интернету, должна выступать в роли шлюза. Эта система должна иметь две сетевые карты (NIC), где одна подключена к Интернету, а другая — к внутренней локальной сети (LAN). Каждой машине в LAN должен быть назначен IP-адрес из частного адресного пространства, как определено в https://www.ietf.org/rfc/rfc1918.txt[RFC 1918].

source: Some additional configuration is needed in order to enable the in-kernel NAT facility of IPFW. To enable in-kernel NAT support at boot time, the following must be set in [.filename]#/etc/rc.conf#:
ko: IPFW의 In-Kernel NAT 기능을 활성화하려면 몇 가지 추가 구성이 필요합니다. 부팅 시 In-Kernel NAT 지원을 활성화하려면 [.filename]#/etc/rc.conf#에서 다음을 설정해야 합니다:
ru: Для включения встроенной в ядро функции NAT в IPFW требуется дополнительная настройка. Чтобы поддержка NAT на уровне ядра включалась при загрузке, необходимо добавить следующие параметры в [.filename]#/etc/rc.conf#:

source: When `firewall_nat_enable` is set but `firewall_enable` is not, it will have no effect and do nothing. This is because the in-kernel NAT implementation is only compatible with IPFW.
ko: `firewall_nat_enable`이 설정되어 있지만 `firewall_enable`이 설정되어 있지 않으면 아무 효과도 없고 아무 일도 하지 않습니다. 이는 커널 내 NAT 구현이 IPFW와만 호환되기 때문입니다.
ru: Когда `firewall_nat_enable` установлен, но `firewall_enable` нет, это не будет иметь эффекта и ничего не сделает. Это связано с тем, что реализация NAT в ядре совместима только с IPFW.

source: When the ruleset contains stateful rules, the positioning of the NAT rule is critical and the `skipto` action is used. The `skipto` action requires a rule number so that it knows which rule to jump to. The example below builds upon the firewall ruleset shown in the previous section. It adds some additional entries and modifies some existing rules in order to configure the firewall for in-kernel NAT. It starts by adding some additional variables which represent the rule number to skip to, the `keep-state` option, and a list of TCP ports which will be used to reduce the number of rules.
ko: 규칙 집합에 상태 저장 규칙이 포함된 경우 NAT 규칙의 위치가 중요하며 `skipto` 액션이 사용됩니다. `skipto` 액션에는 어떤 규칙으로 건너뛸지 알 수 있도록 규칙 번호가 필요합니다. 아래 예제는 이전 섹션에 표시된 방화벽 규칙 집합을 기반으로 합니다. In-Kernel NAT에 대한 방화벽을 구성하기 위해 몇 가지 항목을 추가하고 기존 규칙을 일부 수정합니다. 먼저 skipto 규칙 번호, `keep-state` 옵션, 규칙 수를 줄이는 데 사용되는 TCP 포트 목록을 나타내는 몇 가지 변수를 추가합니다.
ru: Когда набор правил содержит правила с отслеживанием состояния, позиционирование правила NAT критически важно, и используется действие `skipto`. Действие `skipto` требует указания номера правила, чтобы знать, к какому правилу перейти. В приведённом ниже примере расширяется набор правил межсетевого экрана, показанный в предыдущем разделе. В него добавлены некоторые новые записи и изменены существующие правила для настройки межсетевого экрана с поддержкой NAT, встроенного в ядро. Начинается он с добавления дополнительных переменных, представляющих номер правила для перехода, опцию `keep-state` и список TCP-портов, который будет использоваться для сокращения количества правил.

source: With in-kernel NAT it is necessary to disable TCP segmentation offloading (TSO) due to the architecture of man:libalias[3], a library implemented as a kernel module to provide the in-kernel NAT facility of IPFW. TSO can be disabled on a per network interface basis using man:ifconfig[8] or on a system wide basis using man:sysctl[8]. To disable TSO system wide, the following must be set it [.filename]#/etc/sysctl.conf#:
ko: In-Kernel NAT를 사용하려면, IPFW에 In-Kernel NAT 기능을 제공하기 위해, 커널 모듈로 구현된 라이브러리인 man:libalias[3]의 아키텍처로 인해 TCP 세그먼트 오프로딩(TSO)을 비활성화해야 합니다. TSO는 man:ifconfig[8]를 사용하여 네트워크 인터페이스별로 비활성화하거나 man:sysctl[8]을 사용하여 시스템 전체에서 비활성화할 수 있습니다. 시스템 전체에서 TSO를 비활성화하려면 [.filename]#/etc/sysctl.conf#에 다음과 같이 설정해야 합니다:
ru: При использовании NAT в ядре необходимо отключить аппаратную сегментацию TCP (TSO) из-за архитектуры man:libalias[3] — библиотеки, реализованной в виде модуля ядра для обеспечения функциональности NAT в IPFW. TSO можно отключить для каждого сетевого интерфейса с помощью man:ifconfig[8] или для всей системы с помощью man:sysctl[8]. Чтобы отключить TSO для всей системы, необходимо добавить следующие настройки в [.filename]#/etc/sysctl.conf#:

source: A NAT instance will also be configured. It is possible to have multiple NAT instances each with their own configuration. For this example only one NAT instance is needed, NAT instance number 1. The configuration can take a few options such as: `if` which indicates the public interface, `same_ports` which takes care that aliased ports and local port numbers are mapped the same, `unreg_only` will result in only unregistered (private) address spaces to be processed by the NAT instance, and `reset` which will help to keep a functioning NAT instance even when the public IP address of the IPFW machine changes. For all possible options that can be passed to a single NAT instance configuration consult man:ipfw[8]. When configuring a stateful NATing firewall, it is necessary to allow translated packets to be reinjected in the firewall for further processing. This can be achieved by disabling `one_pass` behavior at the start of the firewall script.
ko: NAT 인스턴스도 구성합니다. 각각 고유한 구성으로 여러 개의 NAT 인스턴스를 가질 수 있습니다. 이 예제에서는 NAT 인스턴스 번호 1인 NAT 인스턴스 하나만 필요합니다. 구성에는 다음과 같은 몇 가지 옵션을 사용할 수 있습니다: 공용 인터페이스를 나타내는 `if`, 별칭 포트와 로컬 포트 번호가 동일하게 매핑되도록 하는 `same_ports`, 등록되지 않은(개인) 주소 공간만 NAT 인스턴스에서 처리하도록 하는 `unreg_only`, IPFW 머신의 공인 IP 주소가 변경되더라도 작동하는 NAT 인스턴스를 유지하는 데 도움이 되는 `reset` 등이 있습니다. 단일 NAT 인스턴스 구성에 전달할 수 있는 모든 가능한 옵션은 man:ipfw[8]을 참조하세요. 상태분석형 NAT 방화벽을 구성할 때는 추가 처리를 위해 변환된 패킷을 방화벽에 재주입할 수 있도록 허용해야 합니다. 이는 방화벽 스크립트 시작 시 `one_pass` 동작을 비활성화하면 됩니다.
ru: Будет также настроен экземпляр NAT. Возможно иметь несколько экземпляров NAT, каждый со своей конфигурацией. Для этого примера нужен только один экземпляр NAT — экземпляр NAT номер 1. Конфигурация может принимать несколько опций, таких как: `if`, указывающий публичный интерфейс, `same_ports`, обеспечивающий одинаковое отображение алиасов портов и локальных номеров портов, `unreg_only`, приводящий к обработке только незарегистрированных (частных) адресных пространств экземпляром NAT, и `reset`, который помогает поддерживать работоспособность экземпляра NAT даже при изменении публичного IP-адреса машины с IPFW. Для всех возможных опций, которые могут быть переданы в конфигурацию отдельного экземпляра NAT, обратитесь к man:ipfw[8]. При настройке межсетевого экрана с NAT и отслеживанием состояний необходимо разрешить повторное внедрение преобразованных пакетов в межсетевой экран для дальнейшей обработки. Это можно достичь, отключив поведение `one_pass` в начале скрипта межсетевого экрана.

source: The inbound NAT rule is inserted _after_ the two rules which allow all traffic on the trusted and loopback interfaces and after the reassemble rule but _before_ the `check-state` rule. It is important that the rule number selected for this NAT rule, in this example `100`, is higher than the first three rules and lower than the `check-state` rule. Furthermore, because of the behavior of in-kernel NAT it is advised to place a reassemble rule just before the first NAT rule and after the rules that allow traffic on trusted interface. Normally, IP fragmentation should not happen, but when dealing with IPSEC/ESP/GRE tunneling traffic it might and the reassembling of fragments is necessary before handing the complete packet over to the in-kernel NAT facility.
ko: 인바운드 NAT 규칙은 신뢰할 수 있는 인터페이스와 루프백 인터페이스의 모든 트래픽을 허용하는 두 규칙의 _뒤에_ 삽입되지만 `check-state` 규칙의 _앞에_ 삽입됩니다. 이 NAT 규칙에 대해 선택한 규칙 번호(이 예제에서는 `100`)가 처음 세 규칙보다 높고 `check-state` 규칙보다 낮은 것이 중요합니다. 또한, In-Kernel NAT의 동작으로 인해 재조립 규칙은 첫 번째 NAT 규칙 바로 앞과 신뢰할 수 있는 인터페이스의 트래픽을 허용하는 규칙 뒤에 배치하는 것이 좋습니다. 일반적으로 IP 조각화는 발생하지 않아야 하지만 IPSEC/ESP/GRE 터널링 트래픽을 처리할 때는 조각화가 발생할 수 있으며, 전체 패킷을 In-Kernel NAT 기능으로 넘기기 전에 조각을 재조립해야 합니다.
ru: Правило входящего NAT вставляется _после_ двух правил, которые разрешают весь трафик на доверенных интерфейсах и интерфейсе loopback, а также после правила пересборки, но _до_ правила `check-state`. Важно, чтобы номер правила, выбранный для этого NAT-правила (в данном примере `100`), был больше, чем первые три правила, и меньше, чем правило `check-state`. Кроме того, из-за особенностей работы встроенного NAT рекомендуется размещать правило пересборки непосредственно перед первым NAT-правилом и после правил, разрешающих трафик на доверенных интерфейсах. Обычно фрагментация IP-пакетов не должна происходить, но при работе с туннелированным трафиком IPSEC/ESP/GRE это возможно, и пересборка фрагментов необходима перед передачей полного пакета встроенному механизму NAT.

source: The reassemble rule was not needed with userland man:natd[8] because the internal workings of the IPFW `divert` action already takes care of reassembling packets before delivery to the socket as also stated in man:ipfw[8].
ko: 재조립 규칙은 사용자 공간 man:natd[8]에서는 필요하지 않은데, 이는 man:ipfw[8]에도 명시된 것처럼 IPFW `divert` 액션의 내부 동작이 이미 소켓으로 전달되기 전에 패킷 재조립을 처리하기 때문입니다.
ru: Правило пересборки не требовалось при использовании пользовательского демона man:natd[8], поскольку внутренняя работа действия `divert` в man:ipfw[8] уже обеспечивает пересборку пакетов перед их передачей в сокет, как также указано в man:ipfw[8].

source: The NAT instance and rule number used in this example does not match with the default NAT instance and rule number created by [.filename]#rc.firewall#. [.filename]#rc.firewall# is a script that sets up the default firewall rules present in FreeBSD.
ko: 이 예제에서 사용된 NAT 인스턴스 및 규칙 번호가 [.filename]#rc.firewall#에서 만든 기본 NAT 인스턴스 및 규칙 번호와 일치하지 않습니다. [.filename]#rc.firewall#은 FreeBSD에 있는 기본 방화벽 규칙을 설정하는 스크립트입니다.
ru: Экземпляр NAT и номер правила, используемые в этом примере, не совпадают с экземпляром NAT и номером правила, созданными по умолчанию в [.filename]#rc.firewall#. [.filename]#rc.firewall# — это скрипт, который настраивает правила межсетевого экрана по умолчанию в FreeBSD.
