Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: `quick`: if a packet matches this rule, the ACTION specified by the rule occurs and no further processing of any following rules will occur for this packet.
ko: `quick`: 패킷이 이 규칙과 일치하면 규칙에 지정된 ACTION이 발생하고 이 패킷에 대해 다음 규칙의 추가 처리가 수행되지 않습니다.
ru: `quick`: если пакет соответствует этому правилу, происходит ДЕЙСТВИЕ, указанное в правиле, и дальнейшая обработка последующих правил для этого пакета не выполняется.

source: `on`: must be followed by the interface name as displayed by man:ifconfig[8]. The rule will only match if the packet is going through the specified interface in the specified direction.
ko: `on`: 뒤에는 man:ifconfig[8]에 표시된 인터페이스 이름이 와야 합니다. 이 규칙은 패킷이 지정된 인터페이스를 지정된 방향으로 통과하는 경우에만 일치합니다.
ru: `on`: должен сопровождаться именем интерфейса, как отображается в man:ifconfig[8]. Правило будет применяться только в том случае, если пакет проходит через указанный интерфейс в указанном направлении.

source: When using the `log` keyword, the following qualifiers may be used in this order:
ko: `log` 키워드를 사용할 때는 다음 한정자를 순서대로 사용할 수 있습니다:
ru: При использовании ключевого слова `log` следующие квалификаторы могут быть указаны в таком порядке:

source: `body`: indicates that the first 128 bytes of the packet contents will be logged after the headers.
ko: `body`: 패킷 내용의 첫 128바이트가 헤더 뒤에 기록됨을 나타냅니다.
ru: `body`: указывает, что первые 128 байт содержимого пакета будут записаны в журнал после заголовков.

source: `first`: if the `log` keyword is being used in conjunction with a `keep state` option, this option is recommended so that only the triggering packet is logged and not every packet which matches the stateful connection.
ko: `first`: `log` 키워드가 `keep state` 옵션과 함께 사용되는 경우 상태 분석형 연결과 일치하는 모든 패킷이 아니라, 트리거 패킷만 기록되도록 이 옵션을 사용하는 것이 좋습니다.
ru: `first`: если ключевое слово `log` используется вместе с опцией `keep state`, рекомендуется использовать эту опцию, чтобы регистрировался только инициирующий пакет, а не каждый пакет, соответствующий соединению с отслеживанием состояний.

source: Additional options are available to specify error return messages. Refer to man:ipf[5] for more details.
ko: 오류 반환 메시지를 지정하는 추가 옵션을 사용할 수 있습니다. 자세한 내용은 man:ipf[5]를 참조하세요.
ru: Дополнительные параметры доступны для указания сообщений об ошибках. Подробности смотрите в man:ipf[5].

source: The protocol type is optional. However, it is mandatory if the rule needs to specify a SRC_PORT or a DST_PORT as it defines the type of protocol. When specifying the type of protocol, use the `proto` keyword followed by either a protocol number or name from [.filename]#/etc/protocols#. Example protocol names include `tcp`, `udp`, or `icmp`. If PROTO_TYPE is specified but no SRC_PORT or DST_PORT is specified, all port numbers for that protocol will match that rule.
ko: 프로토콜 유형은 선택 사항입니다. 그러나 규칙이 프로토콜 유형을 정의하기 때문에 SRC_PORT 또는 DST_PORT를 지정해야 하는 경우 필수입니다. 프로토콜 유형을 지정할 때는 `proto` 키워드 뒤에 프로토콜 번호 또는 [.filename]#/etc/protocols#의 이름을 사용합니다. 프로토콜 이름의 예로는 `tcp`, `udp`, `icmp` 등이 있습니다. 만약 PROTO_TYPE이 지정되었지만 SRC_PORT 또는 DST_PORT가 지정되지 않은 경우, 해당 프로토콜에 대해 모든 포트 번호가 적용됩니다.
ru: Тип протокола является необязательным. Однако он обязателен, если в правиле необходимо указать SRC_PORT или DST_PORT, так как он определяет тип протокола. При указании типа протокола используйте ключевое слово `proto`, за которым следует номер протокола или его имя из [.filename]#/etc/protocols#. Примеры названий протоколов: `tcp`, `udp` или `icmp`. Если указан PROTO_TYPE, но не указаны SRC_PORT или DST_PORT, все номера портов для этого протокола будут соответствовать этому правилу.

source: The `from` keyword is mandatory and is followed by a keyword which represents the source of the packet. The source can be a hostname, an IP address followed by the CIDR mask, an address pool, or the keyword `all`. Refer to man:ipf[5] for examples.
ko: ‘from` 키워드는 필수이며 그 뒤에 패킷의 소스를 나타내는 키워드가 이어집니다. 소스는 호스트 이름, IP 주소 뒤에 CIDR 마스크, 주소 풀 또는 키워드 `all`이 될 수 있습니다. 예제는 man:ipf[5]를 참조하세요.
ru: Ключевое слово `from` является обязательным и сопровождается ключевым словом, обозначающим источник пакета. Источником может быть имя хоста, IP-адрес с указанием маски CIDR, пул адресов или ключевое слово `all`. Примеры можно найти в man:ipf[5].

source: There is no way to match ranges of IP addresses which do not express themselves easily using the dotted numeric form / mask-length notation. The package:net-mgmt/ipcalc[] package or port may be used to ease the calculation of the CIDR mask. Additional information is available at the utility's web page: http://jodies.de/ipcalc[http://jodies.de/ipcalc].
ko: 점 숫자 형식이나 마스크 길이 표기법과 같이 쉽게 표현되지 않는 IP 주소 범위를 일치시킬 수 있는 방법은 지원되지 않습니다. package:net-mgmt/ipcalc[] 패키지 또는 포트를 사용하면 CIDR 마스크 계산을 쉽게 할 수 있습니다. 추가 정보는 유틸리티 웹 페이지(http://jodies.de/ipcalc[http://jodies.de/ipcalc])에서 확인할 수 있습니다.
ru: Единственный способ задать диапазоны IP-адресов, это представить их в нотации — числа, разделенные точками / длина маски. Пакет или порт package:net-mgmt/ipcalc[] может быть использован для упрощения расчета маски CIDR. Дополнительная информация доступна на веб-странице утилиты: http://jodies.de/ipcalc[http://jodies.de/ipcalc].

source: The port number of the source is optional. However, if it is used, it requires PROTO_TYPE to be first defined in the rule. The port number must also be preceded by the `proto` keyword.
ko: 소스의 포트 번호는 선택 사항입니다. 그러나 포트 번호를 사용하는 경우 규칙에 PROTO_TYPE을 먼저 정의해야 합니다. 또한 포트 번호 앞에는 `proto` 키워드가 와야 합니다.
ru: Номер порта источника является необязательным. Однако, если он используется, требуется, чтобы PROTO_TYPE был сначала определён в правиле. Номер порта также должен предваряться ключевым словом `proto`.

source: A number of different comparison operators are supported: `=` (equal to), `!=` (not equal to), `<` (less than), `>` (greater than), `<=` (less than or equal to), and `>=` (greater than or equal to).
ko: 다양한 비교 연산자가 지원됩니다: `=`(같음), `!=`(같지 않음), `<`(보다 작음), `>`(보다 큼), `<=`(작거나 같음), `>=`(크거나 같음) 등 다양한 비교 연산자가 지원됩니다.
ru: Поддерживается несколько различных операторов сравнения: `=` (равно), `!=` (не равно), `<` (меньше), `>` (больше), `<=` (меньше или равно) и `>=` (больше или равно).

source: To specify port ranges, place the two port numbers between `<>` (less than and greater than ), `><` (greater than and less than ), or `:` (greater than or equal to and less than or equal to).
ko: 포트 범위를 지정하려면 두 포트 번호를 `<>`(보다 작거나 큰 ), `><`(보다 크거나 작은) 또는 `:`(보다 크거나 같은, 보다 작거나 같은) 사이에 넣습니다.
ru: Для указания диапазона портов поместите два номера порта между `<>` (меньше и больше), `><` (больше и меньше) или `:` (больше или равно и меньше или равно).

source: The `to` keyword is mandatory and is followed by a keyword which represents the destination of the packet. Similar to SRC_ADDR, it can be a hostname, an IP address followed by the CIDR mask, an address pool, or the keyword `all`.
ko: `to` 키워드는 필수이며 그 뒤에 패킷의 목적지를 나타내는 키워드가 이어집니다. SRC_ADDR과 유사하게 호스트 이름, IP 주소 뒤에 CIDR 마스크, 주소 풀 또는 키워드 `all`을 사용할 수 있습니다.
ru: Ключевое слово `to` является обязательным и за ним следует ключевое слово, обозначающее назначение пакета. Аналогично SRC_ADDR, это может быть имя хоста, IP-адрес с маской CIDR, пул адресов или ключевое слово `all`.

source: Similar to SRC_PORT, the port number of the destination is optional. However, if it is used, it requires PROTO_TYPE to be first defined in the rule. The port number must also be preceded by the `proto` keyword.
ko: SRC_PORT와 마찬가지로 목적지의 포트 번호는 선택 사항입니다. 그러나 이 포트 번호를 사용하는 경우 규칙에 PROTO_TYPE을 먼저 정의해야 합니다. 또한 포트 번호 앞에는 `proto` 키워드가 와야 합니다.
ru: Аналогично SRC_PORT, номер порта назначения является необязательным. Однако, если он используется, требуется, чтобы PROTO_TYPE был сначала определён в правиле. Номер порта также должен предваряться ключевым словом `proto`.

source: If `tcp` is specified as the PROTO_TYPE, flags can be specified as letters, where each letter represents one of the possible TCP flags used to determine the state of a connection. Possible values are: `S` (SYN), `A` (ACK), `P` (PSH), `F` (FIN), `U` (URG), `R` (RST), `C` (CWN), and `E` (ECN).
ko: `tcp`가 PROTO_TYPE으로 지정되면 플래그를 문자로 지정할 수 있으며, 각 문자는 연결 상태를 결정하는 데 사용되는 가능한 TCP 플래그 중 하나를 나타냅니다. 가능한 값은 다음과 같습니다: `S`(SYN), `A`(ACK), `P`(PSH), `F`(FIN), `U`(URG), `R`(RST), `C`(CWN), `E`(ECN).
ru: Если в качестве `PROTO_TYPE` указан `tcp`, флаги могут быть заданы в виде букв, где каждая буква представляет один из возможных флагов TCP, используемых для определения состояния соединения. Возможные значения: `S` (SYN), `A` (ACK), `P` (PSH), `F` (FIN), `U` (URG), `R` (RST), `C` (CWN) и `E` (ECN).

source: If `icmp` is specified as the PROTO_TYPE, the ICMP type to match can be specified. Refer to man:ipf[5] for the allowable types.
ko: ‘icmp’가 PROTO_TYPE으로 지정되면 일치할 ICMP 유형을 지정할 수 있습니다. 허용되는 유형은 man:ipf[5]를 참조하세요.
ru: Если указан `icmp` в качестве PROTO_TYPE, можно указать тип ICMP для сопоставления. Допустимые типы приведены в man:ipf[5].

source: If a `pass` rule contains `keep state`, IPF will add an entry to its dynamic state table and allow subsequent packets that match the connection. IPF can track state for TCP, UDP, and ICMP sessions. Any packet that IPF can be certain is part of an active session, even if it is a different protocol, will be allowed.
ko: `pass` 규칙이 `keep state`를 가지고 있는 IPF는 동적 상태 테이블에 항목을 추가하고 연결과 일치하는 후속 패킷을 허용합니다. IPF는 TCP, UDP 및 ICMP 세션의 상태를 추적할 수 있습니다. IPF가 활성 세션의 일부라고 확신할 수 있는 패킷은 프로토콜이 다르더라도 모두 허용됩니다.
ru: Если правило `pass` содержит `keep state`, IPF добавит запись в свою таблицу динамического состояния и разрешит последующие пакеты, соответствующие соединению. IPF может отслеживать состояние сеансов TCP, UDP и ICMP. Любой пакет, который IPF может однозначно идентифицировать как часть активного сеанса, даже если это другой протокол, будет разрешён.

source: In IPF, packets destined to go out through the interface connected to the public Internet are first checked against the dynamic state table. If the packet matches the next expected packet comprising an active session conversation, it exits the firewall and the state of the session conversation flow is updated in the dynamic state table. Packets that do not belong to an already active session are checked against the outbound ruleset. Packets coming in from the interface connected to the public Internet are first checked against the dynamic state table. If the packet matches the next expected packet comprising an active session, it exits the firewall and the state of the session conversation flow is updated in the dynamic state table. Packets that do not belong to an already active session are checked against the inbound ruleset.
ko: IPF에서는 공용 인터넷에 연결된 인터페이스를 통해 나가려는 패킷을 먼저 동적 상태 테이블에서 확인합니다. 패킷이 활성 세션 대화를 구성한 다음 예상 패킷과 일치하면 방화벽을 종료하고 세션 대화 흐름의 상태가 동적 상태 테이블에서 업데이트됩니다. 이미 활성화된 세션에 속하지 않은 패킷은 아웃바운드 규칙 집합에 대해 확인됩니다. 공용 인터넷에 연결된 인터페이스에서 들어오는 패킷은 먼저 동적 상태 테이블을 이용해 확인합니다. 패킷이 활성 세션을 구성하는 다음 예상 패킷과 일치하면 방화벽을 종료하고 세션 대화 흐름의 상태가 동적 상태 테이블에서 업데이트됩니다. 이미 활성화된 세션에 속하지 않는 패킷은 인바운드 규칙 집합을 써서 확인합니다.
ru: В IPF пакеты, предназначенные для выхода через интерфейс, подключенный к публичному интернету, сначала проверяются в динамической таблице состояний. Если пакет соответствует следующему ожидаемому пакету активного сеанса связи, он проходит через межсетевой экран, и состояние потока сеанса обновляется в динамической таблице состояний. Пакеты, не принадлежащие к уже активному сеансу, проверяются в соответствии с набором правил для исходящего трафика. Пакеты, поступающие через интерфейс, подключенный к публичному интернету, сначала проверяются в динамической таблице состояний. Если пакет соответствует следующему ожидаемому пакету активного сеанса, он проходит через межсетевой экран, и состояние потока сеанса обновляется в динамической таблице состояний. Пакеты, не принадлежащие к уже активному сеансу, проверяются в соответствии с набором правил для входящего трафика.

source: Several keywords can be added after `keep state`. If used, these keywords set various options that control stateful filtering, such as setting connection limits or connection age. Refer to man:ipf[5] for the list of available options and their descriptions.
ko: `keep state` 뒤에 여러 키워드를 추가할 수 있습니다. 키워드를 사용하면 연결 제한 또는 연결 기간 설정 등 상태 저장 필터링을 제어하는 다양한 옵션을 설정할 수 있습니다. 사용 가능한 옵션 목록과 설명은 man:ipf[5]를 참조하세요.
ru: Несколько ключевых слов могут быть добавлены после `keep state`. Если они используются, эти ключевые слова устанавливают различные параметры, управляющие фильтрацией с отслеживанием статуса, такие как установка ограничений на соединения или времени жизни соединения. Подробный список доступных параметров и их описания можно найти в man:ipf[5].

source: This section demonstrates how to create an example ruleset which only allows services matching `pass` rules and blocks all others.
ko: 이 섹션에서는 ‘pass’ 규칙과 일치하는 서비스만 허용하고 다른 모든 서비스는 차단하는 예제 규칙 집합을 만드는 방법을 설명합니다.
ru: Этот раздел демонстрирует, как создать пример набора правил, который разрешает только сервисы, соответствующие правилам `pass`, и блокирует все остальные.

source: FreeBSD uses the loopback interface ([.filename]#lo0#) and the IP address `127.0.0.1` for internal communication. The firewall ruleset must contain rules to allow free movement of these internally used packets:
ko: FreeBSD는 내부 통신을 위해 루프백 인터페이스([.filename]#lo0#)와 IP 주소 `127.0.0.1`을 사용합니다. 방화벽 규칙 집합에는 이러한 내부적으로 사용되는 패킷의 자유로운 이동을 허용하는 규칙이 포함되어야 합니다:
ru: FreeBSD использует loopback-интерфейс (интерфейс обратной петли) ([.filename]#lo0#) и IP-адрес `127.0.0.1` для внутреннего взаимодействия. Набор правил межсетевого экрана должен включать правила, разрешающие свободное перемещение этих внутренних пакетов:

source: The public interface connected to the Internet is used to authorize and control access of all outbound and inbound connections. If one or more interfaces are cabled to private networks, those internal interfaces may require rules to allow packets originating from the LAN to flow between the internal networks or to the interface attached to the Internet. The ruleset should be organized into three major sections: any trusted internal interfaces, outbound connections through the public interface, and inbound connections through the public interface.
ko: 인터넷에 연결된 공용 인터페이스는 모든 아웃바운드 및 인바운드 연결의 액세스를 승인하고 제어하는 데 사용됩니다. 하나 이상의 인터페이스가 개인 네트워크에 연결되어 있는 경우, 이러한 내부 인터페이스에는 LAN에서 시작된 패킷이 내부 네트워크 간 또는 인터넷에 연결된 인터페이스로 흐르도록 허용하는 규칙이 필요할 수 있습니다. 규칙 집합은 신뢰할 수 있는 내부 인터페이스, 공용 인터페이스를 통한 아웃바운드 연결, 공용 인터페이스를 통한 인바운드 연결의 세 가지 주요 섹션으로 구성되어야 합니다.
ru: Публичный интерфейс, подключенный к Интернету, используется для авторизации и контроля доступа всех исходящих и входящих соединений. Если один или несколько интерфейсов подключены к частным сетям, этим внутренним интерфейсам могут потребоваться правила, разрешающие передачу пакетов, исходящих из локальной сети, между внутренними сетями или к интерфейсу, подключенному к Интернету. Набор правил должен быть организован в три основных раздела: доверенные внутренние интерфейсы, исходящие соединения через публичный интерфейс и входящие соединения через публичный интерфейс.

source: These two rules allow all traffic to pass through a trusted LAN interface named [.filename]#xl0#:
ko: 이 두 가지 규칙은 모든 트래픽이 [.filename]#xl0#이라는 신뢰할 수 있는 LAN 인터페이스를 통과하도록 허용합니다:
ru: Эти два правила разрешают весь трафик через доверенный интерфейс LAN с именем [.filename]#xl0#:

source: The rules for the public interface's outbound and inbound sections should have the most frequently matched rules placed before less commonly matched rules, with the last rule in the section blocking and logging all packets for that interface and direction.
ko: 공용 인터페이스의 아웃바운드 및 인바운드 섹션에 대한 규칙은 가장 자주 일치하는 규칙이 덜 자주 일치하는 규칙 앞에 배치되어야 하며, 섹션의 마지막 규칙이 해당 인터페이스 및 방향에 대한 모든 패킷을 차단하고 로깅해야 합니다.
ru: Правила для исходящего и входящего разделов публичного интерфейса должны иметь наиболее часто совпадающие правила, расположенные перед менее часто совпадающими, а последнее правило в разделе должно блокировать и журналировать все пакеты для этого интерфейса и направления.

source: This set of rules defines the outbound section of the public interface named [.filename]#dc0#. These rules keep state and identify the specific services that internal systems are authorized for public Internet access. All the rules use `quick` and specify the appropriate port numbers and, where applicable, destination addresses.
ko: 이 규칙 집합은 [.filename]#dc0#이라는 공용 인터페이스의 아웃바운드 섹션을 정의합니다. 이러한 규칙은 내부 시스템이 공용 인터넷 액세스를 위해 승인된 특정 서비스를 식별하고 상태를 유지합니다. 모든 규칙은 ‘quick’을 사용하며 적절한 포트 번호와 해당되는 경우 대상 주소를 지정합니다.
ru: Этот набор правил определяет исходящий раздел общедоступного интерфейса с именем [.filename]#dc0#. Эти правила сохраняют состояние и определяют конкретные службы, для которых внутренние системы авторизованы для доступа к общедоступному Интернету. Все правила используют `quick` и указывают соответствующие номера портов и, где применимо, адреса назначения.

source: This example of the rules in the inbound section of the public interface blocks all undesirable packets first. This reduces the number of packets that are logged by the last rule.
ko: 퍼블릭 인터페이스의 인바운드 섹션에 대한 이 규칙 예시는 바람직하지 않은 패킷을 모두 먼저 차단합니다. 이렇게 하면 마지막 규칙에 의해 기록되는 패킷 수가 줄어듭니다.
ru: Этот пример правил в разделе входящего трафика публичного интерфейса сначала блокирует все нежелательные пакеты. Это уменьшает количество пакетов, регистрируемых последним правилом.

source: Any time there are logged messages on a rule with the `log first` option, run `ipfstat -hio` to evaluate how many times the rule has been matched. A large number of matches may indicate that the system is under attack.
ko: `log first` 옵션이 있는 규칙에 기록된 메시지가 있을 때마다 `ipfstat -hio`를 실행하여 규칙이 일치한 횟수를 평가합니다. 일치하는 횟수가 많으면 시스템이 공격을 받고 있음을 나타낼 수 있습니다.
ru: Всякий раз, когда регистрируются сообщения о правиле с опцией `log first`, выполните команду `ipfstat -hio`, чтобы оценить, сколько раз правило сработало. Большое количество срабатываний может указывать на то, что система подвергается атаке.

source: The rest of the rules in the inbound section define which connections are allowed to be initiated from the Internet. The last rule denies all connections which were not explicitly allowed by previous rules in this section.
ko: 인바운드 섹션의 나머지 규칙은 인터넷에서 시작할 수 있는 연결을 정의합니다. 마지막 규칙은 이 섹션의 이전 규칙에서 명시적으로 허용되지 않은 모든 연결을 거부합니다.
ru: Остальные правила в разделе входящего трафика определяют, какие соединения могут быть инициированы из Интернета. Последнее правило запрещает все соединения, которые не были явно разрешены предыдущими правилами в этом разделе.

source: Configuring NAT
ko: NAT 구성하기
ru: Настройка NAT

source: To enable NAT, add these statements to [.filename]#/etc/rc.conf# and specify the name of the file containing the NAT rules:
ko: NAT를 사용하려면 [.filename]#/etc/rc.conf#에 다음 구문을 추가하고 NAT 규칙이 포함된 파일 이름을 지정합니다:
ru: Чтобы включить NAT, добавьте следующие выражения в [.filename]#/etc/rc.conf# и укажите имя файла, содержащего правила NAT:

source: NAT rules are flexible and can accomplish many different things to fit the needs of both commercial and home users. The rule syntax presented here has been simplified to demonstrate common usage. For a complete rule syntax description, refer to man:ipnat[5].
ko: NAT 규칙은 유연하며 상업용 및 가정용 사용자 모두의 요구에 맞게 다양한 기능을 수행할 수 있습니다. 여기에 제시된 규칙 구문은 일반적인 사용법을 보여주기 위해 단순화되었습니다. 전체 규칙 구문에 대한 설명은 man:ipnat[5]를 참조하세요.
ru: Правила NAT гибки и могут выполнять множество различных задач, подходящих как для коммерческих, так и для домашних пользователей. Синтаксис правил, представленный здесь, упрощен для демонстрации типичного использования. Полное описание синтаксиса правил можно найти в man:ipnat[5].

source: The basic syntax for a NAT rule is as follows, where `map` starts the rule and _IF_ should be replaced with the name of the external interface:
ko: NAT 규칙의 기본 구문은 다음과 같으며, 여기서 `map`은 규칙을 시작하고 _IF_는 외부 인터페이스의 이름으로 대체해야 합니다:
ru: Базовая синтаксическая структура правила NAT выглядит следующим образом, где `map` начинает правило, а _IF_ следует заменить на имя внешнего интерфейса:

source: The _LAN_IP_RANGE_ is the range of IP addresses used by internal clients. Usually, it is a private address range such as `192.168.1.0/24`. The _PUBLIC_ADDRESS_ can either be the static external IP address or the keyword `0/32` which represents the IP address assigned to _IF_.
ko: _LAN_IP_RANGE_는 내부 클라이언트에서 사용하는 IP 주소의 범위입니다. 일반적으로 `192.168.1.0/24`와 같은 개인 주소 범위입니다. _PUBLIC_ADDRESS_는 정적 외부 IP 주소이거나 _IF_에 할당된 IP 주소를 나타내는 키워드 `0/32`일 수 있습니다.
ru: _LAN_IP_RANGE_ — это диапазон IP-адресов, используемых внутренними клиентами. Обычно это частный диапазон адресов, например `192.168.1.0/24`. _PUBLIC_ADDRESS_ может быть либо статическим внешним IP-адресом, либо ключевым словом `0/32`, которое представляет IP-адрес, назначенный _IF_.

source: In IPF, when a packet arrives at the firewall from the LAN with a public destination, it first passes through the outbound rules of the firewall ruleset. Then, the packet is passed to the NAT ruleset which is read from the top down, where the first matching rule wins. IPF tests each NAT rule against the packet's interface name and source IP address. When a packet's interface name matches a NAT rule, the packet's source IP address in the private LAN is checked to see if it falls within the IP address range specified in _LAN_IP_RANGE_. On a match, the packet has its source IP address rewritten with the public IP address specified by _PUBLIC_ADDRESS_. IPF posts an entry in its internal NAT table so that when the packet returns from the Internet, it can be mapped back to its original private IP address before being passed to the firewall rules for further processing.
ko: IPF에서는 패킷이 공용 목적지를 가지고 LAN을 통해 방화벽에 도착하면, 먼저 방화벽 규칙 집합의 아웃바운드 규칙을 통과합니다. 그런 다음 패킷은 위에서 아래로 읽혀지는 NAT 규칙 집합으로 전달되며, 여기서 가장 먼저 일치하는 규칙이 승리합니다. IPF는 패킷의 인터페이스 이름과 소스 IP 주소에 대해 각 NAT 규칙을 테스트합니다. 패킷의 인터페이스 이름이 NAT 규칙과 일치하면, 개인 LAN에서 패킷의 소스 IP 주소가 _LAN_IP_RANGE_에 지정된 IP 주소 범위에 속하는지 확인합니다. 일치하는 경우 패킷의 소스 IP 주소는 _PUBLIC_ADDRESS_에 지정된 공용 IP 주소로 재작성됩니다. IPF는 패킷이 인터넷에서 반환될 때, 추가 처리를 위해 방화벽 규칙으로 전달되기 전에 원래의 개인 IP 주소로 다시 매핑될 수 있도록 내부 NAT 테이블에 항목을 게시합니다.
ru: В IPF, когда пакет прибывает на межсетевой экран из локальной сети с публичным адресом назначения, он сначала проходит через исходящие правила набора правил межсетевого экрана. Затем пакет передается в набор правил NAT, который читается сверху вниз, и первое совпадающее правило применяется. IPF проверяет каждое правило NAT на соответствие имени интерфейса и исходному IP-адресу пакета. Когда имя интерфейса пакета совпадает с правилом NAT, исходный IP-адрес пакета в частной локальной сети проверяется на вхождение в диапазон IP-адресов, указанный в _LAN_IP_RANGE_. При совпадении исходный IP-адрес пакета перезаписывается публичным IP-адресом, указанным в _PUBLIC_ADDRESS_. IPF добавляет запись в свою внутреннюю таблицу NAT, чтобы при возврате пакета из Интернета он мог быть сопоставлен с исходным частным IP-адресом перед передачей в набор правил межсетевого экрана для дальнейшей обработки.

source: For networks that have large numbers of internal systems or multiple subnets, the process of funneling every private IP address into a single public IP address becomes a resource problem. Two methods are available to relieve this issue.
ko: 내부 시스템이 많거나 서브넷이 여러개인 네트워크의 경우, 모든 사설 IP 주소를 하나의 공용 IP 주소로 퍼널링하는 과정에서 리소스 문제가 발생할 수 있습니다. 이 문제를 해결하기 위해 두 가지 방법을 사용할 수 있습니다.
ru: Для сетей с большим количеством внутренних систем или несколькими подсетями процесс перенаправления каждого частного IP-адреса в один публичный IP-адрес становится проблемой с точки зрения ресурсов. Доступны два метода для решения этой проблемы.
