Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: Even with a properly configured gateway to handle network address translation, one may have to compensate for other people's misconfigurations. A common misconfiguration is to let traffic with non-routable addresses out to the Internet. Since traffic from non-routeable addresses can play a part in several DoS attack techniques, consider explicitly blocking traffic from non-routeable addresses from entering the network through the external interface.
ko: 네트워크 주소 변환을 처리하도록 게이트웨이를 올바르게 구성했더라도 사용자의 잘못된 구성을 보완해야 할 수 있습니다. 일반적인 잘못된 구성은 라우팅할 수 없는 주소를 가진 트래픽을 인터넷으로 내보내는 것입니다. 라우팅할 수 없는 주소의 트래픽은 여러 DoS 공격 기법의 일부가 될 수 있으므로 라우팅할 수 없는 주소의 트래픽이 외부 인터페이스를 통해 네트워크에 유입되지 않도록 명시적으로 차단하는 것이 좋습니다.
ru: Даже при правильно настроенном шлюзе для обработки преобразования сетевых адресов может потребоваться компенсировать ошибки в конфигурации, сделанные другими людьми. Распространённой ошибкой является пропуск трафика с не маршрутизируемыми адресами в Интернет. Поскольку трафик с не маршрутизируемых адресов может использоваться в нескольких методах DoS-атак, рекомендуется явно блокировать такой трафик от попадания в сеть через внешний интерфейс.

source: In this example, a macro containing non-routable addresses is defined, then used in blocking rules. Traffic to and from these addresses is quietly dropped on the gateway's external interface.
ko: 이 예에서는 라우팅할 수 없는 주소가 포함된 매크로를 정의한 다음 차단 규칙에 사용합니다. 이러한 주소로 들어오고 나가는 트래픽은 게이트웨이의 외부 인터페이스에서 조용히 차단됩니다.
ru: В этом примере определяется макрос, содержащий не маршрутизируемые адреса, который затем используется в правилах блокировки. Трафик на эти адреса и с этих адресов тихо отбрасывается на внешнем интерфейсе шлюза.

source: Enabling ALTQ
ko: ALTQ 활성화하기
ru: Включение ALTQ

source: On FreeBSD, ALTQ can be used with PF to provide Quality of Service (QOS). Once ALTQ is enabled, queues can be defined in the ruleset which determine the processing priority of outbound packets.
ko: FreeBSD에서 ALTQ는 PF와 함께 사용되어 서비스 품질(QOS)을 향상시킬 수 있습니다. ALTQ가 활성화되면, 아웃바운드 패킷의 처리 우선순위를 결정하는 큐를 규칙 집합에 정의할 수 있습니다.
ru: На FreeBSD ALTQ можно использовать с PF для обеспечения качества обслуживания (QOS — Quality of Service). После включения ALTQ в наборе правил можно определить очереди, которые определяют приоритет обработки исходящих пакетов.

source: Before enabling ALTQ, refer to man:altq[4] to determine if the drivers for the network cards installed on the system support it.
ko: ALTQ를 활성화하기 전에 man:altq[4]를 참조하여 시스템에 설치된 네트워크 카드의 드라이버가 이를 지원하는지 확인합니다.
ru: Прежде чем включить ALTQ, обратитесь к man:altq[4], чтобы определить, поддерживают ли его драйверы сетевых карт, установленных в системе.

source: ALTQ is not available as a loadable kernel module. If the system's interfaces support ALTQ, create a custom kernel using the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]. The following kernel options are available. The first is needed to enable ALTQ. At least one of the other options is necessary to specify the queueing scheduler algorithm:
ko: ALTQ는 커널 모듈을 로드하는 방식으로 사용할 수 없습니다. 시스템 인터페이스가 ALTQ를 지원하는 경우 crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성]의 지침을 사용하여 사용자 정의 커널을 생성하세요. 다음 커널 옵션을 사용할 수 있습니다. 첫 번째는 ALTQ를 활성화하는 데 필요합니다. 그리고 큐잉 스케줄러 알고리즘을 지정하려면 다른 옵션 중 하나 이상이 필요합니다:
ru: ALTQ недоступен в виде загружаемого модуля ядра. Если интерфейсы системы поддерживают ALTQ, создайте собственное ядро, следуя инструкциям в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]. Доступны следующие параметры ядра. Первый необходим для включения ALTQ. Хотя бы один из остальных параметров требуется для указания алгоритма планирования очередей:

source: The following scheduler algorithms are available:
ko: 사용할 수 있는 스케줄러 알고리즘은 다음과 같습니다:
ru: Доступны следующие алгоритмы планировщика:

source: Class Based Queuing (CBQ) is used to divide a connection's bandwidth into different classes or queues to prioritize traffic based on filter rules.
ko: 클래스 기반 큐(Class Based Queuing, CBQ)는 연결의 대역폭을 여러 클래스 또는 큐로 나누어 필터 규칙에 따라 트래픽의 우선 순위를 지정하는 데 사용됩니다.
ru: Очереди на основе классов (CBQ — Class Based Queuing) используется для разделения пропускной способности соединения на различные классы или очереди с целью приоритизации трафика на основе правил фильтрации.

source: Random Early Detection (RED) is used to avoid network congestion by measuring the length of the queue and comparing it to the minimum and maximum thresholds for the queue. When the queue is over the maximum, all new packets are randomly dropped.
ko: 무작위 조기 감지(Random Early Detection, RED)는 대기열의 길이를 측정하고 대기열의 최소 및 최대 임계값과 비교하여 네트워크 혼잡을 방지하는 데 사용됩니다. 대기열이 최대 임계값을 초과하면 모든 새 패킷이 무작위로 삭제됩니다.
ru: Случайное раннее обнаружение (RED — Random Early Detection) используется для предотвращения перегрузки сети путем измерения длины очереди и сравнения ее с минимальным и максимальным порогами для очереди. Когда очередь превышает максимальный порог, все новые пакеты случайным образом отбрасываются.

source: In Random Early Detection In and Out (RIO) mode, RED maintains multiple average queue lengths and multiple threshold values, one for each QOS level.
ko: 무작위 조기 감지 입출력(Random Early Detection In and Out, RIO) 모드에서 RED는 각 QOS 수준에 대해 하나씩 여러 개의 평균 대기열 길이와 여러 임계값을 유지합니다.
ru: В режиме Случайного раннего обнаружения для входящего и исходящего трафика (RIO) RED поддерживает несколько средних длин очередей и несколько пороговых значений, по одному для каждого уровня QOS.

source: Hierarchical Fair Service Curve Packet Scheduler (HFSC) is described in http://www-2.cs.cmu.edu/\~hzhang/HFSC/main.html[http://www-2.cs.cmu.edu/~hzhang/HFSC/main.html].
ko: 계층적 공정 서비스 곡선 패킷 스케줄러(Hierarchical Fair Service Curve Packet Scheduler, HFSC)는 http://www-2.cs.cmu.edu/\~hzhang/HFSC/main.html[http://www-2.cs.cmu.edu/~hzhang/HFSC/main.html]에 설명되어 있습니다.
ru: Иерархический планировщик пакетов с гарантированной справедливой кривой обслуживания (HFSC) описан на http://www-2.cs.cmu.edu/\~hzhang/HFSC/main.html[http://www-2.cs.cmu.edu/~hzhang/HFSC/main.html].

source: Priority Queuing (PRIQ) always passes traffic that is in a higher queue first.
ko: 우선 순위 대기열(Priority Queuing, PRIQ)은 항상 대기열이 높은 트래픽을 먼저 통과시킵니다.
ru: Очереди с приоритетом (PRIQ) всегда пропускают трафик из более высокоуровневой очереди первым.

source: More information about the scheduling algorithms and example rulesets are available at the https://web.archive.org/web/20151109213426/http://www.openbsd.org/faq/pf/queueing.html[OpenBSD's web archive].
ko: 스케줄링 알고리즘 및 예제 규칙 집합에 대한 자세한 내용은 https://web.archive.org/web/20151109213426/http://www.openbsd.org/faq/pf/queueing.html[OpenBSD 웹 아카이브]에서 확인할 수 있습니다.
ru: Дополнительная информация о алгоритмах планирования и примеры наборов правил доступны на https://web.archive.org/web/20151109213426/http://www.openbsd.org/faq/pf/queueing.html[архивированной странице OpenBSD].

source: IPFW is a stateful firewall written for FreeBSD which supports both IPv4 and IPv6. It is comprised of several components: the kernel firewall filter rule processor and its integrated packet accounting facility, the logging facility, NAT, the man:dummynet[4] traffic shaper, a forward facility, a bridge facility, and an ipstealth facility.
ko: IPFW는 FreeBSD용으로 작성된 상태분석형 방화벽으로, IPv4와 IPv6를 모두 지원합니다. 커널 방화벽 필터 규칙 프로세서와 통합 패킷 어카운팅 기능, 로깅 기능, NAT, man:dummynet[4] 트래픽 셰이퍼, 포워드 기능, 브리지 기능, ipstealth 기능 등 여러 구성 요소로 이루어져 있습니다.
ru: IPFW — это межсетевой экран с отслеживанием состояний, разработанный для FreeBSD, который поддерживает как IPv4, так и IPv6. Он состоит из нескольких компонентов: процессора правил фильтрации межсетевого экрана в ядре и встроенного механизма учёта пакетов, механизма журналирования, NAT, механизма управления трафиком man:dummynet[4], механизма переадресации, механизма моста и механизма ipstealth.

source: FreeBSD provides a sample ruleset in [.filename]#/etc/rc.firewall# which defines several firewall types for common scenarios to assist novice users in generating an appropriate ruleset. IPFW provides a powerful syntax which advanced users can use to craft customized rulesets that meet the security requirements of a given environment.
ko: FreeBSD는 초보 사용자가 적절한 규칙 집합을 생성하는 데 도움이 되도록 일반적인 시나리오에 대한 몇 가지 방화벽 유형을 정의하는 샘플 규칙 집합을 [.filename]#/etc/rc.firewall#에 제공합니다. IPFW는 고급 사용자가 특정 환경의 보안 요구 사항을 충족하는 맞춤형 규칙 집합을 만드는 데 사용할 수 있는 강력한 구문을 제공합니다.
ru: FreeBSD предоставляет пример набора правил в [.filename]#/etc/rc.firewall#, который определяет несколько типов межсетевых экранов для распространённых сценариев, чтобы помочь новичкам в создании подходящего набора правил. IPFW предлагает мощный синтаксис, с помощью которого опытные пользователи могут создавать настраиваемые наборы правил, соответствующие требованиям безопасности заданного окружения.

source: This section describes how to enable IPFW, provides an overview of its rule syntax, and demonstrates several rulesets for common configuration scenarios.
ko: 이 섹션에서는 IPFW를 사용 설정하는 방법을 설명하고, 규칙 구문에 대한 개요를 제공하며, 일반적인 구성 시나리오에 대한 몇 가지 규칙 집합을 보여 줍니다.
ru: Этот раздел описывает, как включить IPFW, предоставляет обзор синтаксиса его правил и демонстрирует несколько наборов правил для распространённых сценариев настройки.

source: Enabling IPFW
ko: IPFW 활성화하기
ru: Включение IPFW

source: IPFW is included in the basic FreeBSD install as a kernel loadable module, meaning that a custom kernel is not needed in order to enable IPFW.
ko: IPFW는 커널 로딩이 가능한 모듈 형태로 기본 FreeBSD 설치에 포함되어 있으므로, IPFW를 활성화하기 위해 커스텀 커널이 필요하지 않습니다.
ru: IPFW включён в базовую установку FreeBSD в виде загружаемого модуля ядра, что означает, что для его включения не требуется собирать собственное ядро.

source: For those users who wish to statically compile IPFW support into a custom kernel, see <<firewalls-ipfw-kernelconfig>>.
ko: IPFW 지원을 사용자 지정 커널에 정적으로 컴파일하려는 사용자의 경우 <<firewalls-ipfw-kernelconfig>>을 참조하세요.

source: To configure the system to enable IPFW at boot time, add `firewall_enable="YES"` to [.filename]#/etc/rc.conf#:
ko: 부팅 시 IPFW를 사용하도록 시스템을 구성하려면 [.filename]#/etc/rc.conf#에 `firewall_enable=“YES”`를 추가합니다:
ru: Для настройки системы для включения IPFW при загрузке добавьте `firewall_enable="YES"` в файл [.filename]#/etc/rc.conf#:

source: To use one of the default firewall types provided by FreeBSD, add another line which specifies the type:
ko: FreeBSD에서 제공하는 기본 방화벽 유형 중 하나를 사용하려면 유형을 지정하는 내용을 추가합니다:
ru: Чтобы использовать один из типов межсетевых экранов, предоставляемых FreeBSD, добавьте строку с указанием типа:

source: The available types are:
ko: 사용 가능한 유형은:
ru: Доступные типы:

source: `open`: passes all traffic.
ko: `open`: 모든 트래픽을 통과시킵니다.
ru: `open`: пропускает весь трафик.

source: `client`: protects only this machine.
ko: `client`: 이 장비만 보호합니다.
ru: `client`: защищает только эту машину.

source: `simple`: protects the whole network.
ko: `simple`: 전체 네트워크를 보호합니다.
ru: `simple`: защищает всю сеть.

source: `closed`: entirely disables IP traffic except for the loopback interface.
ko: `closed`: 루프백 인터페이스를 제외한 IP 트래픽을 완전히 비활성화합니다.
ru: `closed`: полностью отключает IP-трафик, за исключением интерфейса loopback.

source: `workstation`: protects only this machine using stateful rules.
ko: `workstation`: 상태분석형 규칙을 이용해 이 장비만 보호합니다.
ru: `workstation`: защищает только эту машину с использованием правил с отслеживанием состояния.

source: `UNKNOWN`: disables the loading of firewall rules.
ko: `UNKNOWN`: 방화벽 규칙의 로딩을 비활성화합니다.
ru: `UNKNOWN`: отключает загрузку правил межсетевого экрана.

source: [.filename]#filename#: full path of the file containing the firewall ruleset.
ko: [.filename]#filename#: 방화벽 규칙 집합이 포함된 파일의 전체 경로입니다.
ru: [.filename]#filename#: полный путь к файлу, содержащему набор правил межсетевого экрана.

source: If `firewall_type` is set to either `client` or `simple`, modify the default rules found in [.filename]#/etc/rc.firewall# to fit the configuration of the system.
ko: `firewall_type`이 `client` 또는 `simple`으로 설정된 경우, [.filename]#/etc/rc.firewall#에 있는 기본 규칙을 시스템 구성에 맞게 수정합니다.
ru: Если `firewall_type` установлен в значение `client` или `simple`, измените правила по умолчанию, указанные в [.filename]#/etc/rc.firewall#, чтобы они соответствовали конфигурации системы.

source: Note that the `filename` type is used to load a custom ruleset.
ko: `filename` 유형은 사용자 정의 규칙 집합을 로드하는 데 사용됩니다.
ru: Обратите внимание, что тип `filename` используется для загрузки пользовательского набора правил.

source: An alternate way to load a custom ruleset is to set the `firewall_script` variable to the absolute path of an _executable script_ that includes IPFW commands. The examples used in this section assume that the `firewall_script` is set to [.filename]#/etc/ipfw.rules#:
ko: 사용자 지정 규칙 집합을 로드하는 다른 방법은 `firewall_script` 변수를 IPFW 명령이 포함된 _실행 가능한 스크립트_의 절대 경로로 설정하는 것입니다. 이 섹션에 사용된 예제에서는 `firewall_script`가 [.filename]#/etc/ipfw.rules#로 설정되어 있다고 가정합니다:
ru: Альтернативный способ загрузки пользовательского набора правил — присвойте переменной `firewall_script` значение, равное абсолютному пути к _исполняемому скрипту_, который включает команды IPFW. Примеры, используемые в этом разделе, предполагают, что `firewall_script` установлен в [.filename]#/etc/ipfw.rules#:

source: To enable logging through man:syslogd[8], include this line:
ko: man:syslogd[8]를 통해 로깅을 활성화하려면 다음을 포함시키세요:
ru: Чтобы включить ведение журнала через man:syslogd[8], добавьте следующую строку:

source: Only firewall rules with the `log` option will be logged. The default rules do not include this option and it must be manually added. Therefore it is advisable that the default ruleset is edited for logging. In addition, log rotation may be desired if the logs are stored in a separate file.
ko: `log` 옵션이 있는 방화벽 규칙만 기록됩니다. 기본 규칙에는 이 옵션이 포함되어 있지 않으므로 수동으로 추가해야 합니다. 따라서 로깅을 위해 기본 규칙 집합을 편집하는 것이 좋습니다. 또한 로그가 별도의 파일에 저장되는 경우 로그 로테이션이 필요할 수 있습니다.
ru: В журнал будут записываться только правила межсетевого экрана с опцией `log`. Правила по умолчанию не включают эту опцию, и её необходимо добавить вручную. Поэтому рекомендуется отредактировать набор правил по умолчанию для ведения журнала. Кроме того, может потребоваться ротация журналов, если они сохраняются в отдельный файл.

source: There is no [.filename]#/etc/rc.conf# variable to set logging limits. To limit the number of times a rule is logged per connection attempt, specify the number using this line in [.filename]#/etc/sysctl.conf#:
ko: 로깅 제한을 설정할 수 있는 [.filename]#/etc/rc.conf# 변수는 없습니다. 연결 시도당 규칙이 기록되는 횟수를 제한하려면 [.filename]#/etc/sysctl.conf#에서 다음 내용을 사용하여 횟수를 지정하세요:
ru: В файле [.filename]#/etc/rc.conf# нет переменной для установки ограничений журналирования. Чтобы ограничить количество записей в журнале для каждого правила на одну попытку соединения, укажите число с помощью следующей строки в [.filename]#/etc/sysctl.conf#:

source: To enable logging through a dedicated interface named `ipfw0`, add this line to [.filename]#/etc/rc.conf# instead:
ko: ‘ipfw0’이라는 전용 인터페이스를 통해 로깅을 사용하려면 [.filename]#/etc/rc.conf#에 이 줄을 추가하세요:
ru: Для включения журналирования через выделенный интерфейс с именем `ipfw0`, добавьте следующую строку в [.filename]#/etc/rc.conf# вместо этого:

source: Then use tcpdump to see what is being logged:
ko: 그런 다음 tcpdump를 사용하여 기록되는 내용을 확인합니다:
ru: Затем используйте tcpdump для просмотра записываемых данных:

source: There is no overhead due to logging unless tcpdump is attached.
ko: tcpdump를 첨부하지 않는 한 로깅으로 인한 오버헤드는 없습니다.
ru: Нет накладных расходов из-за ведения журнала, если не подключен tcpdump.

source: After saving the needed edits, start the firewall. To enable logging limits now, also set the `sysctl` value specified above:
ko: 필요한 내용을 편집, 저장한 후 방화벽을 시작합니다. 지금 로깅 제한을 사용하려면 위에 지정된 `sysctl` 값도 설정하세요:
ru: После сохранения необходимых изменений запустите межсетевой экран. Чтобы сразу включить ограничения журналирования, также установите указанное выше значение `sysctl`:

source: IPFW Rule Syntax
ko: IPFW 규칙 문법
ru: Синтаксис правил IPFW

source: When a packet enters the IPFW firewall, it is compared against the first rule in the ruleset and progresses one rule at a time, moving from top to bottom in sequence. When the packet matches the selection parameters of a rule, the rule's action is executed and the search of the ruleset terminates for that packet. This is referred to as "first match wins". If the packet does not match any of the rules, it gets caught by the mandatory IPFW default rule number 65535, which denies all packets and silently discards them. However, if the packet matches a rule that contains the `count`, `skipto`, or `tee` keywords, the search continues. Refer to man:ipfw[8] for details on how these keywords affect rule processing.
ko: 패킷이 IPFW 방화벽에 들어오면 규칙 세트의 첫 번째 규칙과 비교하여 한 번에 하나의 규칙을 순서대로 위에서 아래로 이동하면서 확인합니다. 패킷이 규칙의 선택 매개변수와 일치하면 규칙의 동작이 실행되고 해당 패킷에 대한 규칙 세트 검색이 종료됩니다. 이를 “첫 번째 일치 승리”라고 합니다. 패킷이 어떤 규칙과도 일치하지 않는 경우, 모든 패킷을 거부하고 자동으로 폐기하는 필수 IPFW 기본 규칙 번호 65535에 의해 패킷이 포착됩니다. 그러나 패킷이 `count`, `skipto` 또는 `tee` 키워드가 포함된 규칙과 일치하면 검색이 계속됩니다. 이러한 키워드가 규칙 처리에 미치는 영향에 대한 자세한 내용은 man:ipfw[8]을 참조하세요.
ru: Когда пакет попадает в межсетевой экран IPFW, он сравнивается с первым правилом в наборе правил и последовательно обрабатывается сверху вниз, правило за правилом. Если пакет соответствует параметрам выбора правила, выполняется действие этого правила, и поиск в наборе правил для данного пакета прекращается. Это называется «первое совпадение побеждает». Если пакет не соответствует ни одному из правил, он попадает под действие обязательного правила IPFW с номером 65535, которое запрещает все пакеты и тихо их отбрасывает. Однако, если пакет соответствует правилу, содержащему ключевые слова `count`, `skipto` или `tee`, поиск продолжается. Подробнее о том, как эти ключевые слова влияют на обработку правил, см. в man:ipfw[8].

source: When creating an IPFW rule, keywords must be written in the following order. Some keywords are mandatory while other keywords are optional. The words shown in uppercase represent a variable and the words shown in lowercase must precede the variable that follows it. The `+#+` symbol is used to mark the start of a comment and may appear at the end of a rule or on its own line. Blank lines are ignored.
ko: IPFW 규칙을 만들 때 키워드는 다음 순서로 작성해야 합니다. 일부 키워드는 필수이고 다른 키워드는 선택 사항입니다. 대문자로 표시된 단어는 변수를 나타내며 소문자로 표시된 단어는 그 뒤에 오는 변수 앞에 와야 합니다. ‘+##’ 기호는 댓글의 시작을 표시하는 데 사용되며 규칙의 끝이나 자체 줄에 표시할 수 있습니다. 빈 줄은 무시됩니다.
ru: При создании правила IPFW ключевые слова должны быть записаны в следующем порядке. Некоторые ключевые слова являются обязательными, а другие — опциональными. Слова, написанные в верхнем регистре, обозначают переменную, а слова в нижнем регистре должны предшествовать следующей за ними переменной. Символ `+#+` используется для обозначения начала комментария и может находиться в конце правила или на отдельной строке. Пустые строки игнорируются.

source: This section provides an overview of these keywords and their options. It is not an exhaustive list of every possible option. Refer to man:ipfw[8] for a complete description of the rule syntax that can be used when creating IPFW rules.
ko: 이 섹션에서는 이러한 키워드와 해당 옵션에 대한 개요를 제공합니다. 가능한 모든 옵션의 전체 목록은 아닙니다. IPFW 규칙을 만들 때 사용할 수 있는 규칙 구문에 대한 전체 설명은 man:ipfw[8]를 참조하세요.
ru: В этом разделе представлен обзор этих ключевых слов и их параметров. Это не исчерпывающий список всех возможных вариантов. Для полного описания синтаксиса правил, которые можно использовать при создании правил IPFW, обратитесь к man:ipfw[8].

source: Every rule must start with `ipfw add`.
ko: 모든 규칙은 `ipfw add`로 시작해야 합니다.
ru: Каждое правило должно начинаться с `ipfw add`.

source: Each rule is associated with a number from `1` to `65534`. The number is used to indicate the order of rule processing. Multiple rules can have the same number, in which case they are applied according to the order in which they have been added.
ko: 각 규칙은 `1`에서 `65534` 사이의 숫자와 연관되어 있습니다. 이 번호는 규칙 처리 순서를 나타내는 데 사용됩니다. 여러 규칙이 동일한 번호를 가질 수 있으며, 이 경우 규칙이 추가된 순서에 따라 적용됩니다.
ru: Каждое правило связано с числом от `1` до `65534`. Этот номер используется для указания порядка обработки правил. Несколько правил могут иметь одинаковый номер, в таком случае они применяются в порядке их добавления.

source: Each rule is associated with a set number from `0` to `31`. Sets can be individually disabled or enabled, making it possible to quickly add or delete a set of rules. If a SET_NUMBER is not specified, the rule will be added to set `0`.
ko: 각 규칙은 `0`에서 `31` 사이의 세트 번호와 연결됩니다. 세트는 개별적으로 비활성화하거나 활성화할 수 있으므로 규칙 집합을 빠르게 추가하거나 삭제할 수 있습니다. SET_NUMBER를 지정하지 않으면 규칙이 `0` 세트에 추가됩니다.
ru: Каждое правило связано с номером набора от `0` до `31`. Наборы можно отключать или включать по отдельности, что позволяет быстро добавлять или удалять набор правил. Если `SET_NUMBER` не указан, правило будет добавлено в набор `0`.

source: A rule can be associated with one of the following actions. The specified action will be executed when the packet matches the selection criterion of the rule.
ko: 규칙은 다음 작업 중 하나와 연결할 수 있습니다. 패킷이 규칙의 선택 기준과 일치하면 지정된 작업이 실행됩니다.
ru: Правило может быть связано с одним из следующих действий. Указанное действие будет выполнено, когда пакет соответствует критерию выбора правила.

source: `allow | accept | pass | permit`: these keywords are equivalent and allow packets that match the rule.
ko: `allow | accept | pass | permit`: 이 키워드는 동등한 키워드이며 규칙과 일치하는 패킷을 허용합니다.
ru: `allow | accept | pass | permit`: эти ключевые слова эквивалентны и разрешают пакеты, соответствующие правилу.

source: `check-state`: checks the packet against the dynamic state table. If a match is found, execute the action associated with the rule which generated this dynamic rule, otherwise move to the next rule. A `check-state` rule does not have selection criterion. If no `check-state` rule is present in the ruleset, the dynamic rules table is checked at the first `keep-state` or `limit` rule.
ko: `check-state`: 동적 상태 테이블에 대해 패킷을 확인합니다. 일치하는 항목이 발견되면 이 동적 규칙을 생성한 규칙과 관련된 작업을 실행하고, 그렇지 않으면 다음 규칙으로 이동합니다. `check-state` 규칙에는 선택 기준이 없습니다. 규칙 집합에 `check-state` 규칙이 없는 경우 동적 규칙 테이블은 첫 번째 `keep-state` 또는 `limit` 규칙에서 확인됩니다.
ru: `check-state`: проверяет пакет по таблице динамических состояний. Если совпадение найдено, выполняется действие, связанное с правилом, которое создало это динамическое правило, в противном случае осуществляется переход к следующему правилу. Правило `check-state` не имеет критериев выбора. Если правило `check-state` отсутствует в наборе правил, таблица динамических правил проверяется при первом правиле `keep-state` или `limit`.

source: `count`: updates counters for all packets that match the rule. The search continues with the next rule.
ko: `count`: 규칙과 일치하는 모든 패킷에 대한 카운터를 업데이트합니다. 검색은 다음 규칙으로 계속됩니다.
ru: `count`: обновляет счетчики для всех пакетов, соответствующих правилу. Поиск продолжается со следующего правила.

source: `deny | drop`: either word silently discards packets that match this rule.
ko: `deny | drop`: 이 규칙과 일치하는 패킷은 조용히 폐기됩니다.
ru: `deny | drop`: любое из этих слов тихо отбрасывает пакеты, соответствующие этому правилу.

source: Additional actions are available. Refer to man:ipfw[8] for details.
ko: 추가 작업을 사용할 수 있습니다. 자세한 내용은 man:ipfw[8]을 참조하세요.
ru: Доступны дополнительные действия. Подробности смотрите в man:ipfw[8].
