Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: The first method is to assign a range of ports to use as source ports. By adding the `portmap` keyword, NAT can be directed to only use source ports in the specified range:
ko: 첫 번째 방법은 소스 포트로 사용할 포트 범위를 지정하는 것입니다. `portmap` 키워드를 추가하면 NAT가 지정된 범위의 소스 포트만 사용하도록 지시할 수 있습니다:
ru: Первый метод заключается в назначении диапазона портов для использования в качестве исходных портов. Добавление ключевого слова `portmap` позволяет указать NAT использовать только исходные порты из заданного диапазона:

source: Alternately, use the `auto` keyword which tells NAT to determine the ports that are available for use:
ko: 또는 `auto` 키워드를 사용하여 NAT가 사용 가능한 포트를 결정하도록 지시합니다:
ru: Или используйте ключевое слово `auto`, которое указывает NAT определить порты, доступные для использования:

source: The second method is to use a pool of public addresses. This is useful when there are too many LAN addresses to fit into a single public address and a block of public IP addresses is available. These public addresses can be used as a pool from which NAT selects an IP address as a packet's address is mapped on its way out.
ko: 두 번째 방법은 공개 주소 풀을 사용하는 것입니다. 이 방법은 LAN 주소가 너무 많아서 하나의 공용 주소에 넣을 수 없고 공용 IP 주소 블록을 사용할 수 있는 경우에 유용합니다. 이러한 공용 주소는 패킷의 주소가 나가는 도중 매핑될 때 NAT가 IP 주소를 선택하는 풀로 사용할 수 있습니다.
ru: Второй метод заключается в использовании пула публичных адресов. Это полезно, когда количество локальных адресов слишком велико, чтобы уместиться в один публичный адрес, и доступен блок публичных IP-адресов. Эти публичные адреса могут использоваться как пул, из которого NAT выбирает IP-адрес для отображения адреса пакета при его выходе.

source: The range of public IP addresses can be specified using a netmask or CIDR notation. These two rules are equivalent:
ko: 공인 IP 주소의 범위는 넷마스크 또는 CIDR 표기법을 사용하여 지정할 수 있습니다. 이 두 규칙은 동일합니다:
ru: Диапазон публичных IP-адресов может быть указан с использованием маски сети или нотации CIDR. Эти два правила эквивалентны:

source: A common practice is to have a publically accessible web server or mail server segregated to an internal network segment. The traffic from these servers still has to undergo NAT, but port redirection is needed to direct inbound traffic to the correct server. For example, to map a web server using the internal address `10.0.10.25` to its public IP address of `20.20.20.5`, use this rule:
ko: 공개적으로 액세스할 수 있는 웹 서버 또는 메일 서버는 내부 네트워크 세그먼트로 분리하는 것이 일반적입니다. 이러한 서버의 트래픽은 여전히 NAT를 거쳐야 하지만 인바운드 트래픽을 올바른 서버로 보내려면 포트 리디렉션이 필요합니다. 예를 들어 내부 주소 `10.0.10.25`를 사용하는 웹 서버를 공용 IP 주소인 `20.20.20.5`에 매핑하려면 이 규칙을 사용합니다:

source: If it is the only web server, this rule would also work as it redirects all external HTTP requests to `10.0.10.25`:
ko: 유일한 웹 서버인 경우, 이 규칙은 모든 외부 HTTP 요청을 `10.0.10.25`로 리디렉션하므로 이 규칙도 작동합니다:
ru: Если это единственный веб-сервер, это правило также будет работать, так как оно перенаправляет все внешние HTTP-запросы на `10.0.10.25`:

source: IPF has a built in FTP proxy which can be used with NAT. It monitors all outbound traffic for active or passive FTP connection requests and dynamically creates temporary filter rules containing the port number used by the FTP data channel. This eliminates the need to open large ranges of high order ports for FTP connections.
ko: IPF에는 NAT와 함께 사용할 수 있는 FTP 프록시가 내장되어 있습니다. 이 프록시는 모든 아웃바운드 트래픽에서 액티브 또는 패시브 FTP 연결 요청을 모니터링하고 FTP 데이터 채널에서 사용하는 포트 번호가 포함된 임시 필터 규칙을 동적으로 생성합니다. 따라서 FTP 연결을 위해 높은 수준의 포트를 광범위하게 열 필요가 없습니다.
ru: В IPF встроен FTP-прокси, который можно использовать с NAT. Он отслеживает весь исходящий трафик на предмет запросов активных или пассивных FTP-соединений и динамически создает временные правила фильтрации, содержащие номер порта, используемого FTP-каналом данных. Это устраняет необходимость открывать большие диапазоны портов высокого порядка для FTP-соединений.

source: In this example, the first rule calls the proxy for outbound FTP traffic from the internal LAN. The second rule passes the FTP traffic from the firewall to the Internet, and the third rule handles all non-FTP traffic from the internal LAN:
ko: 이 예에서 첫 번째 규칙은 내부 LAN에서 아웃바운드 FTP 트래픽에 대해 프록시를 호출합니다. 두 번째 규칙은 방화벽에서 인터넷으로 FTP 트래픽을 전달하고, 세 번째 규칙은 내부 LAN의 모든 비-FTP 트래픽을 처리합니다:
ru: В этом примере первое правило вызывает прокси для исходящего FTP-трафика из внутренней локальной сети. Второе правило пропускает FTP-трафик из межсетевого экрана в Интернет, а третье правило обрабатывает весь не-FTP трафик из внутренней локальной сети:

source: The FTP `map` rules go before the NAT rule so that when a packet matches an FTP rule, the FTP proxy creates temporary filter rules to let the FTP session packets pass and undergo NAT. All LAN packets that are not FTP will not match the FTP rules but will undergo NAT if they match the third rule.
ko: FTP `map` 규칙은 NAT 규칙보다 먼저 적용되므로 패킷이 FTP 규칙과 일치하면 FTP 프록시는 임시 필터 규칙을 생성하여 FTP 세션 패킷을 통과시키고 NAT를 거치게 합니다. FTP가 아닌 모든 LAN 패킷은 FTP 규칙과 일치하지 않지만 세 번째 규칙과 일치하는 경우 NAT를 거칩니다.
ru: Правила FTP `map` размещаются перед правилом NAT, так что при совпадении пакета с правилом FTP прокси-сервер FTP создает временные правила фильтрации, позволяющие пакетам FTP-сессии проходить и подвергаться NAT. Все пакеты из локальной сети, не относящиеся к FTP, не будут соответствовать правилам FTP, но подвергнутся NAT, если они соответствуют третьему правилу.

source: Without the FTP proxy, the following firewall rules would instead be needed. Note that without the proxy, all ports above `1024` need to be allowed:
ko: FTP 프록시가 없으면 대신 다음 방화벽 규칙이 필요합니다. 프록시가 없으면 `1024` 이상의 모든 포트를 허용해야 한다는 점에 유의하세요:
ru: Без FTP-прокси потребуются следующие правила межсетевого экрана. Обратите внимание, что без прокси необходимо разрешить все порты выше `1024`:

source: Whenever the file containing the NAT rules is edited, run `ipnat` with `-CF` to delete the current NAT rules and flush the contents of the dynamic translation table. Include `-f` and specify the name of the NAT ruleset to load:
ko: NAT 규칙이 포함된 파일을 편집할 때마다 `-CF`와 함께 `ipnat`를 실행하여 현재 NAT 규칙을 삭제하고 동적 번역 테이블의 내용을 플러시합니다. `-f`를 포함하고 로드할 NAT 규칙 집합의 이름을 지정합니다:
ru: Всякий раз, когда редактируется файл, содержащий правила NAT, выполните `ipnat` с `-CF`, чтобы удалить текущие правила NAT и очистить содержимое таблицы динамической трансляции. Используйте `-f` и укажите имя набора правил NAT для загрузки:

source: To display the NAT statistics:
ko: NAT 통계를 화면에 표시하려면:
ru: Для отображения статистики NAT:

source: To list the NAT table's current mappings:
ko: 현재 NAT 매핑 테이블을 확인하려면:
ru: Для отображения текущих сопоставлений таблицы NAT:

source: To turn verbose mode on and display information relating to rule processing and active rules and table entries:
ko: 자세한 설명 모드를 켜고 규칙 처리, 활성 규칙 및 테이블 항목과 관련된 정보를 표시하려면:
ru: Чтобы включить подробный режим и отображать информацию, связанную с обработкой правил, активными правилами и записями таблиц:

source: Viewing IPF Statistics
ko: IPF 통계보기
ru: Просмотр статистики IPF

source: IPF includes man:ipfstat[8] which can be used to retrieve and display statistics which are gathered as packets match rules as they go through the firewall. Statistics are accumulated since the firewall was last started or since the last time they were reset to zero using `ipf -Z`.
ko: IPF에는 방화벽을 통과할 때 패킷 일치 규칙으로 수집된 통계를 검색하고 표시하는 데 사용할 수 있는 man:ipfstat[8]이 포함되어 있습니다. 통계는 방화벽이 마지막으로 시작된 이후 또는 `ipf -Z`를 사용하여 가장 최근 0으로 재설정된 이후를 집계합니다.
ru: В пакет IPF входит программа man:ipfstat[8], которую можно использовать для получения и отображения статистики, собираемой при совпадении пакетов с правилами при прохождении через межсетевой экран. Статистика накапливается с момента последнего запуска межсетевого экрана или с момента последнего сброса статистики в ноль с помощью команды `ipf -Z`.

source: The default `ipfstat` output looks like this:
ko: 기본 `ipfstat` 출력은 다음과 같이 표시됩니다:
ru: Вывод `ipfstat` по умолчанию выглядит следующим образом:

source: Several options are available. When supplied with either `-i` for inbound or `-o` for outbound, the command will retrieve and display the appropriate list of filter rules currently installed and in use by the kernel. To also see the rule numbers, include `-n`. For example, `ipfstat -on` displays the outbound rules table with rule numbers:
ko: 몇 가지 옵션을 사용할 수 있습니다. 인바운드의 경우 `-i`, 또는 아웃바운드의 경우 `-o`와 함께 사용하면 명령어는 현재 설치되어 커널에서 사용 중인 적절한 필터 규칙 목록을 검색하여 표시합니다. 규칙 번호도 보려면 `-n`을 포함하세요. 예를 들어 `ipfstat -on`은 규칙 번호와 함께 아웃바운드 규칙 테이블을 표시합니다:
ru: Доступно несколько вариантов. При указании `-i` для входящего или `-o` для исходящего трафика команда получит и отобразит соответствующий список правил фильтрации, установленных и используемых ядром. Чтобы также увидеть номера правил, добавьте `-n`. Например, `ipfstat -on` выводит таблицу исходящих правил с номерами:

source: Include `-h` to prefix each rule with a count of how many times the rule was matched. For example, `ipfstat -oh` displays the outbound internal rules table, prefixing each rule with its usage count:
ko: 각 규칙 앞에 `-h`를 포함하면 규칙이 일치한 횟수를 계산하여 표시합니다. 예를 들어, `ipfstat -oh`는 아웃바운드 내부 규칙 테이블을 표시하며, 각 규칙 앞에 사용 횟수를 추가합니다:
ru: Включите `-h`, чтобы добавить перед каждым правилом количество его совпадений. Например, `ipfstat -oh` выводит таблицу внутренних правил для исходящего трафика, добавляя перед каждым правилом количество его использований:

source: To display the state table in a format similar to man:top[1], use `ipfstat -t`. When the firewall is under attack, this option provides the ability to identify and see the attacking packets. The optional sub-flags give the ability to select the destination or source IP, port, or protocol to be monitored in real time. Refer to man:ipfstat[8] for details.
ko: man:top[1]과 유사한 형식으로 상태 테이블을 표시하려면 `ipfstat -t`를 사용합니다. 방화벽이 공격을 받고 있는 경우 이 옵션을 사용하면 공격 패킷을 식별하고 확인할 수 있습니다. 선택적 하위 플래그를 사용하면 실시간으로 모니터링할 대상 또는 소스 IP, 포트 또는 프로토콜을 선택할 수 있습니다. 자세한 내용은 man:ipfstat[8]을 참조하세요.
ru: Для отображения таблицы состояний в формате, аналогичном man:top[1], используйте `ipfstat -t`. Когда межсетевой экран подвергается атаке, эта опция позволяет идентифицировать и просматривать атакующие пакеты. Дополнительные подфлаги дают возможность выбора IP-адреса назначения или источника, порта или протокола для мониторинга в реальном времени. Подробности смотрите в man:ipfstat[8].

source: IPF Logging
ko: IPF 로깅
ru: Журналирование IPF

source: IPF provides `ipmon`, which can be used to write the firewall's logging information in a human readable format. It requires that `options IPFILTER_LOG` be first added to a custom kernel using the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel].
ko: IPF는 방화벽의 로깅 정보를 사람이 읽을 수 있는 형식으로 작성하는 데 사용할 수 있는 `ipmon`을 제공합니다. 이를 사용하려면 먼저 `options IPFILTER_LOG`를 crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성]의 지침에 따라 커스텀 커널에 추가해야 합니다.
ru: IPF предоставляет `ipmon`, который может использоваться для записи информации журналирования межсетевого экрана в удобочитаемом формате. Для этого требуется сначала добавить `options IPFILTER_LOG` в собственное ядро, следуя инструкциям в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD].

source: This command is typically run in daemon mode in order to provide a continuous system log file so that logging of past events may be reviewed. Since FreeBSD has a built in man:syslogd[8] facility to automatically rotate system logs, the default [.filename]#rc.conf# `ipmon_flags` statement uses `-Ds`:
ko: 이 명령은 일반적으로 과거 이벤트의 로그를 검토할 수 있도록 지속적인 시스템 로그 파일을 제공하기 위해 데몬 모드에서 실행됩니다. FreeBSD에는 시스템 로그를 자동으로 순환하는 man:syslogd[8] 기능이 내장되어 있기 때문에, 기본 [.filename]#rc.conf#의 `ipmon_flags` 문은 `-Ds`를 사용합니다:
ru: Эта команда обычно запускается в режиме демона для обеспечения непрерывного ведения системного журнала, чтобы можно было просматривать записи о прошлых событиях. Поскольку FreeBSD имеет встроенное средство man:syslogd[8] для автоматической ротации системных журналов, параметр `ipmon_flags` по умолчанию в [.filename]#rc.conf# использует `-Ds`:

source: Logging provides the ability to review, after the fact, information such as which packets were dropped, what addresses they came from, and where they were going. This information is useful in tracking down attackers.
ko: 로깅은 어떤 패킷이 삭제되었는지, 어떤 주소에서 왔는지, 어디로 이동했는지 등의 정보를 사후에 검토할 수 있는 기능을 제공합니다. 이 정보는 공격자를 추적하는 데 유용합니다.
ru: Ведение журналов предоставляет возможность последующего просмотра информации, такой как: какие пакеты были отброшены, с каких адресов они пришли и куда направлялись. Эта информация полезна при отслеживании злоумышленников.

source: Once the logging facility is enabled in [.filename]#rc.conf# and started with `service ipmon start`, IPF will only log the rules which contain the `log` keyword. The firewall administrator decides which rules in the ruleset should be logged and normally only deny rules are logged. It is customary to include the `log` keyword in the last rule in the ruleset. This makes it possible to see all the packets that did not match any of the rules in the ruleset.
ko: [.filename]#rc.conf#에서 로깅 기능을 활성화하고 `service ipmon start`로 시작하면, IPF는 `log` 키워드가 포함된 규칙만 로깅합니다. 방화벽 관리자는 규칙 집합에서 어떤 규칙을 기록할지 결정하며 일반적으로 거부 규칙만 기록합니다. 규칙 집합의 마지막 규칙에 `log` 키워드를 포함하는 것이 일반적입니다. 이렇게 하면 규칙 집합의 규칙과 일치하지 않는 모든 패킷을 볼 수 있습니다.
ru: После включения системы журналирования в [.filename]#rc.conf# и запуска с помощью `service ipmon start`, IPF будет записывать в журнал только те правила, которые содержат ключевое слово `log`. Администратор межсетевого экрана решает, какие правила из набора должны записываться в журнал, и обычно регистрируются только правила с deny. Обычно ключевое слово `log` включают в последнее правило набора. Это позволяет увидеть все пакеты, которые не соответствуют ни одному из правил набора.

source: By default, `ipmon -Ds` mode uses `local0` as the logging facility. The following logging levels can be used to further segregate the logged data:
ko: 기본적으로 `ipmon -Ds` 모드는 `local0`을 로깅 도구로 사용합니다. 다음 로깅 수준을 사용하여 로깅된 데이터를 더 분리할 수 있습니다:
ru: По умолчанию режим `ipmon -Ds` использует `local0` как средство ведения журнала. Для дальнейшего разделения регистрируемых данных можно использовать следующие уровни ведения журнала:

source: In order to setup IPF to log all data to [.filename]#/var/log/ipfilter.log#, first create the empty file:
ko: 모든 데이터를 [.filename]#/var/log/ipfilter.log#에 기록하도록 IPF를 설정하려면 먼저 빈 파일을 생성합니다:
ru: Чтобы настроить IPF для записи всех данных в [.filename]#/var/log/ipfilter.log#, сначала создайте пустой файл:

source: Then, to write all logged messages to the specified file, add the following statement to [.filename]#/etc/syslog.conf#:
ko: 그런 다음 모든 로깅된 메시지를 지정된 파일에 쓰려면 [.filename]#/etc/syslog.conf#에 다음 명령을 추가합니다:
ru: Затем, чтобы записывать все журналируемые сообщения в указанный файл, добавьте следующую строку в [.filename]#/etc/syslog.conf#:

source: To activate the changes and instruct man:syslogd[8] to read the modified [.filename]#/etc/syslog.conf#, run `service syslogd reload`.
ko: 변경 사항을 활성화하고 man:syslogd[8]가 수정된 [.filename]#/etc/syslog.conf#를 읽도록 지시하려면 `service syslogd reload`를 실행합니다.
ru: Для активации изменений и указания man:syslogd[8] прочитать изменённый файл [.filename]#/etc/syslog.conf#, выполните команду `service syslogd reload`.

source: Do not forget to edit [.filename]#/etc/newsyslog.conf# to rotate the new log file.
ko: 새 로그 파일을 회전시키기 위해 [.filename]#/etc/newsyslog.conf#를 편집하는 것을 잊지 마세요.
ru: Не забудьте отредактировать [.filename]#/etc/newsyslog.conf# для ротации нового файла журнала.

source: Messages generated by `ipmon` consist of data fields separated by white space. Fields common to all messages are:
ko: `ipmon`에서 생성된 메시지는 공백으로 구분된 데이터 필드로 구성됩니다. 모든 메시지에 공통으로 사용되는 필드는 다음과 같습니다:
ru: Сообщения, генерируемые `ipmon`, состоят из полей данных, разделённых пробелами. Общие для всех сообщений поля:

source: The time of packet receipt. This is in the form HH:MM:SS.F, for hours, minutes, seconds, and fractions of a second.
ko: The time of packet receipt. 시간, 분, 초, 분초 단위의 HH:MM:SS.F 형식입니다.
ru: Время получения пакета. Указывается в формате ЧЧ:ММ:СС.Д, где ЧЧ - часы, ММ - минуты, СС - секунды, а Д - доли секунды.

source: The name of the interface that processed the packet.
ko: 패킷을 처리한 인터페이스의 이름.
ru: Имя интерфейса, обработавшего пакет.

source: The group and rule number of the rule in the format `@0:17`.
ko: `@0:17` 형식으로 된 그룹과 규칙의 규칙번호.
ru: Группа и номер правила в формате `@0:17`.

source: The action: `p` for passed, `b` for blocked, `S` for a short packet, `n` did not match any rules, and `L` for a log rule.
ko: The action: `p`는 통과됨, `b`는 차단됨, `S`는 짧은 패킷, `n`은 규칙과 일치하지 않음, `L`은 로그 규칙.
ru: Действие: `p` — пропущено, `b` — заблокировано, `S` — короткий пакет, `n` — не совпало ни с одним правилом, `L` — правило для журналирования.

source: The addresses written as three fields: the source address and port separated by a comma, the -> symbol, and the destination address and port. For example: `209.53.17.22,80 -> 198.73.220.17,1722`.
ko: 쉼표로 구분된 소스 주소와 포트 -> 기호, 대상 주소와 포트의 세 가지 필드로 작성된 주소. 예: `209.53.17.22,80 -> 198.73.220.17,1722`.
ru: Адреса записываются в виде трёх полей: исходный адрес и порт, разделённые запятой, символ `->` и адрес назначения с портом. Например: `209.53.17.22,80 -> 198.73.220.17,1722`.

source: `PR` followed by the protocol name or number: for example, `PR tcp`.
ko: 프로토콜의 이름이나 번호 다음에 오는 `PR`. 예: `PR tcp`.
ru: `PR` с указанием имени или номера протокола: например, `PR tcp`.

source: `len` followed by the header length and total length of the packet: for example, `len 20 40`.
ko: 헤더 길이와 패킷의 총 길이 다음에 오는 `len`. 예: `len 20 40`.
ru: `len`, за которым следует длина заголовка и общая длина пакета: например, `len 20 40`.

source: If the packet is a TCP packet, there will be an additional field starting with a hyphen followed by letters corresponding to any flags that were set. Refer to man:ipf[5] for a list of letters and their flags.
ko: 패킷이 TCP 패킷인 경우, 하이픈으로 시작하는 추가 필드에 설정된 플래그에 해당하는 문자가 이어집니다. 문자와 해당 플래그 목록은 man:ipf[5]를 참조하세요.
ru: Если пакет является TCP-пакетом, будет дополнительное поле, начинающееся с дефиса, за которым следуют буквы, соответствующие установленным флагам. Список букв и соответствующих флагов приведен в man:ipf[5].

source: If the packet is an ICMP packet, there will be two fields at the end: the first always being "icmp" and the next being the ICMP message and sub-message type, separated by a slash. For example: `icmp 3/3` for a port unreachable message.
ko: 패킷이 ICMP 패킷인 경우 마지막에 두 개의 필드가 있는데, 첫 번째는 항상 “icmp”이고 그 다음에는 슬래시로 구분된 ICMP 메시지 및 하위 메시지 유형이 있습니다. 예: 연결할 수 없는 포트 메시지의 경우 `icmp 3/3`.
ru: Если пакет является ICMP-пакетом, в конце будут два поля: первое всегда `icmp`, а следующее — тип ICMP-сообщения и подтип, разделённые косой чертой. Например: `icmp 3/3` для сообщения о недоступности порта.

source: Blacklistd is a daemon listening to sockets awaiting to receive notifications from other daemons about connection attempts that failed or were successful. It is most widely used in blocking too many connection attempts on open ports. A prime example is SSH running on the internet getting a lot of requests from bots or scripts trying to guess passwords and gain access. Using blacklistd, the daemon can notify the firewall to create a filter rule to block excessive connection attempts from a single source after a number of tries. Blacklistd was first developed on NetBSD and appeared there in version 7. FreeBSD 11 imported blacklistd from NetBSD.
ko: blacklistd는 소켓을 수신 대기하면서 다른 데몬으로부터 연결 시도가 실패했거나 성공했다는 알림을 받는 데몬입니다. 열린 포트에서 너무 많은 연결 시도를 차단하는 데 가장 널리 사용됩니다. 대표적인 예로 인터넷에서 실행되는 SSH가 비밀번호를 추측하고 액세스 권한을 얻으려는 봇이나 스크립트로부터 많은 요청을 받는 경우를 들 수 있습니다. blacklistd를 사용하면 데몬이 방화벽에 알림을 보내 여러 번 시도한 후 단일 소스에서 과도한 연결 시도를 차단하는 필터 규칙을 만들 수 있습니다. blacklistd는 NetBSD에서 처음 개발되어 버전 7에 등장했습니다. FreeBSD 11은 NetBSD에서 blacklistd를 가져왔습니다.
ru: Blacklistd — это демон, который прослушивает сокеты, ожидая получения уведомлений от других демонов о неудачных или успешных попытках подключения. Он наиболее широко используется для блокировки чрезмерного количества попыток подключения к открытым портам. Типичный пример — SSH, работающий в интернете и получающий множество запросов от ботов или скриптов, пытающихся угадать пароли и получить доступ. Используя blacklistd, демон может уведомить межсетевой экран о необходимости создания правила фильтрации для блокировки чрезмерных попыток подключения с одного источника после нескольких попыток. Blacklistd был первоначально разработан в NetBSD и появился там в версии 7. FreeBSD 11 импортировал blacklistd из NetBSD.

source: This chapter describes how to set up blacklistd, configure it, and provides examples on how to use it. Readers should be familiar with basic firewall concepts like rules. For details, refer to the firewall chapter. PF is used in the examples, but other firewalls available on FreeBSD should be able to work with blacklistd, too.
ko: 이 장에서는 blacklistd를 설정하고 구성하는 방법을 설명하고 사용 방법에 대한 예제를 제공합니다. 독자는 규칙과 같은 기본 방화벽 개념에 익숙해야 합니다. 자세한 내용은 방화벽 챕터를 참조하세요. 예제에서는 PF가 사용되었지만, FreeBSD에서 사용할 수 있는 다른 방화벽도 blacklistd와 함께 작동할 수 있어야 합니다.
ru: В этой главе описывается, как настроить blacklistd, его конфигурация, а также приводятся примеры использования. Читатели должны быть знакомы с основными концепциями межсетевого экрана, такими как правила. Подробности см. в главе о межсетевом экране. В примерах используется PF, но другие межсетевые экраны, доступные в FreeBSD, также должны работать с blacklistd.

source: Enabling Blacklistd
ko: blacklistd 활성화하기
ru: Включение blacklistd

source: The main configuration for blacklistd is stored in man:blacklistd.conf[5]. Various command line options are also available to change blacklistd's run-time behavior. Persistent configuration across reboots should be stored in [.filename]#/etc/blacklistd.conf#. To enable the daemon during system boot, add a `blacklistd_enable` line to [.filename]#/etc/rc.conf# like this:
ko: blacklistd의 기본 구성은 man:blacklistd.conf[5]에 저장됩니다. blacklistd의 런타임 동작을 변경하기 위해 다양한 명령줄 옵션도 사용할 수 있습니다. 재부팅 시에도 지속되는 구성은 [.filename]#/etc/blacklistd.conf#에 저장해야 합니다. 시스템 부팅 시 데몬을 활성화하려면 다음과 같이 [.filename]#/etc/rc.conf#에 `blacklistd_enable` 줄을 추가합니다:
ru: Основная конфигурация для blacklistd хранится в man:blacklistd.conf[5]. Также доступны различные параметры командной строки для изменения поведения blacklistd во время выполнения. Постоянная конфигурация, сохраняемая после перезагрузок, должна храниться в [.filename]#/etc/blacklistd.conf#. Чтобы включить демон во время загрузки системы, добавьте строку `blacklistd_enable` в [.filename]#/etc/rc.conf# следующим образом:

source: To start the service manually, run this command:
ko: 서비스를 수동으로 시작하려면 다음 명령을 실행합니다:
ru: Чтобы запустить службу вручную, выполните следующую команду:

source: Creating a Blacklistd Ruleset
ko: Blacklistd 규칙 집합 만들기
ru: Создание набора правил для blacklistd

source: Rules for blacklistd are configured in man:blacklistd.conf[5] with one entry per line. Each rule contains a tuple separated by spaces or tabs. Rules either belong to a `local` or a `remote`, which applies to the machine where blacklistd is running or an outside source, respectively.
ko: Blacklistd에 대한 규칙은 한 줄당 하나의 항목으로 man:blacklistd.conf[5]에 구성됩니다. 각 규칙은 공백 또는 탭으로 구분된 튜플을 포함합니다. 규칙은 `local` 또는 `remote`에 속하며, 각각 blacklistd가 실행 중인 머신 또는 외부 소스에 적용됩니다.
ru: Правила для blacklistd настраиваются в man:blacklistd.conf[5], по одному правилу на строку. Каждое правило содержит кортеж, разделённый пробелами или табуляциями. Правила относятся либо к `local`, либо к `remote`, что применяется соответственно к машине, на которой работает blacklistd, или к внешнему источнику.

source: Local Rules
ko: 로컬 규칙
ru: Правила local

source: An example blacklistd.conf entry for a local rule looks like this:
ko: 로컬 규칙에 대한 blacklistd.conf 항목의 예는 다음과 같습니다:
ru: Пример записи в blacklistd.conf для локального правила выглядит следующим образом:
