Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: PF will not start if it cannot find its ruleset configuration file. By default, FreeBSD does not ship with a ruleset and there is no [.filename]#/etc/pf.conf#. Example rulesets can be found in [.filename]#/usr/share/examples/pf/#. If a custom ruleset has been saved somewhere else, add a line to [.filename]#/etc/rc.conf# which specifies the full path to the file:
ko: 규칙 집합 구성 파일을 찾을 수 없으면 PF가 시작되지 않습니다. 기본적으로 FreeBSD는 규칙 집합을 함께 제공하지 않으며 [.filename]#/etc/pf.conf#가 없습니다. 규칙 집합의 예는 [.filename]#/usr/share/examples/pf/#에서 찾을 수 있습니다. 사용자 지정 규칙 집합이 다른 곳에 저장되어 있는 경우 [.filename]#/etc/rc.conf#에 파일의 전체 경로를 지정하는 한 줄을 추가하세요:
ru: PF не запустится, если не сможет найти файл конфигурации набора правил. По умолчанию FreeBSD не поставляется с готовым набором правил, и файл [.filename]#/etc/pf.conf# отсутствует. Примеры наборов правил можно найти в [.filename]#/usr/share/examples/pf/#. Если пользовательский набор правил был сохранён в другом месте, добавьте строку в [.filename]#/etc/rc.conf#, указывающую полный путь к файлу:

source: Logging support for PF is provided by man:pflog[4]. To enable logging support, add `pflog_enable=yes` to [.filename]#/etc/rc.conf#:
ko: PF에 대한 로깅 지원은 man:pflog[4]에서 제공합니다. 로깅 지원을 활성화하려면 [.filename]#/etc/rc.conf#에 `pflog_enable=yes`를 추가합니다:
ru: Поддержка журналирования для PF предоставляется man:pflog[4]. Для включения поддержки журналирования добавьте `pflog_enable=yes` в [.filename]#/etc/rc.conf#:

source: The following lines can also be added to change the default location of the log file or to specify any additional flags to pass to man:pflog[4] when it is started:
ko: 다음 줄을 추가하여 로그 파일의 기본 위치를 변경하거나 로그 파일이 시작될 때 man:pflog[4]에 전달할 추가 플래그를 지정할 수도 있습니다:
ru: Следующие строки также могут быть добавлены для изменения расположения файла журнала по умолчанию или для указания дополнительных флагов, передаваемых в man:pflog[4] при его запуске:

source: Finally, if there is a LAN behind the firewall and packets need to be forwarded for the computers on the LAN, or NAT is required, enable the following option:
ko: 마지막으로 방화벽 뒤에 LAN이 있고 LAN에 있는 컴퓨터에 대해 패킷을 전달해야 하거나 NAT가 필요한 경우 다음 옵션을 사용하도록 설정합니다:
ru: Наконец, если за межсетевым экраном есть локальная сеть (LAN) и пакеты необходимо перенаправлять для компьютеров в этой сети, или требуется NAT, включите следующую опцию:

source: After saving the needed edits, PF can be started with logging support by typing:
ko: 필요한 편집 내용을 저장한 후 입력하면 로깅 지원을 통해 PF를 시작할 수 있습니다:
ru: После сохранения необходимых изменений, PF можно запустить с поддержкой журналирования, набрав:

source: By default, PF reads its configuration rules from [.filename]#/etc/pf.conf# and modifies, drops, or passes packets according to the rules or definitions specified in this file. The FreeBSD installation includes several sample files located in [.filename]#/usr/share/examples/pf/#. Refer to the http://www.openbsd.org/faq/pf/[PF FAQ] for complete coverage of PF rulesets.
ko: 기본적으로 PF는 [.filename]#/etc/pf.conf#에서 구성 규칙을 읽고 이 파일에 지정된 규칙이나 정의에 따라 패킷을 수정, 드롭 또는 전달합니다. FreeBSD를 설치하면 [.filename]#/usr/share/examples/pf/#에 몇 가지 샘플 파일이 포함되어 있습니다. PF 규칙 집합에 대한 전체 내용은 http://www.openbsd.org/faq/pf/[PF FAQ]를 참조하세요.
ru: По умолчанию PF читает свои правила конфигурации из [.filename]#/etc/pf.conf# и изменяет, отбрасывает или пропускает пакеты в соответствии с правилами или определениями, указанными в этом файле. Установка FreeBSD включает несколько примеров файлов, расположенных в [.filename]#/usr/share/examples/pf/#. Полное описание наборов правил PF можно найти в http://www.openbsd.org/faq/pf/[PF FAQ].

source: To control PF, use `pfctl`. <<pfctl>> summarizes some useful options to this command. Refer to man:pfctl[8] for a description of all available options:
ko: PF를 제어하려면 `pfctl`을 사용합니다. <<pfctl>>에는 이 명령에 대한 몇 가지 유용한 옵션이 요약되어 있습니다. 사용 가능한 모든 옵션에 대한 설명은 man:pfctl[8]을 참조하십시오:

source: Useful `pfctl` Options
ko: 유용한 `pfctl` 옵션
ru: Полезные параметры `pfctl`

source: Command
ko: 명령어
ru: Команда

source: Purpose
ko: 목적
ru: Назначение

source: Enable PF.
ko: PF 활성화.
ru: Включить PF.

source: Disable PF.
ko: PF 비활성화.
ru: Отключить PF.

source: Flush all NAT, filter, state, and table rules and reload [.filename]#/etc/pf.conf#.
ko: 모든 NAT, 필터, 상태 및 테이블 규칙을 플러시하고 [.filename]#/etc/pf.conf#를 다시 로드합니다.
ru: Очистить все правила NAT, фильтрации, состояний и таблиц и перезагрузить [.filename]#/etc/pf.conf#.

source: Report on the filter rules, NAT rules, or state table.
ko: 필터 규칙, NAT 규칙 또는 상태 테이블에 대한 보고서를 작성합니다.
ru: Отчет о правилах фильтрации, правилах NAT или таблице состояний.

source: Check [.filename]#/etc/pf.conf# for errors, but do not load ruleset.
ko: [.filename]#/etc/pf.conf#에 오류가 있는지 확인하되, 규칙 집합을 로드하지 마세요.
ru: Проверить [.filename]#/etc/pf.conf# на ошибки, но не загружать набор правил.

source: package:security/sudo[] is useful for running commands like `pfctl` that require elevated privileges. It can be installed from the Ports Collection.
ko: package:security/sudo[]는 권한 상승이 필요한 `pfctl`과 같은 명령을 실행하는 데 유용합니다. 포트 컬렉션에서 설치할 수 있습니다.
ru: Пакет package:security/sudo[] полезен для выполнения команд, таких как `pfctl`, которые требуют повышенных привилегий. Он может быть установлен из Коллекции портов.

source: To keep an eye on the traffic that passes through the PF firewall, consider installing the package:sysutils/pftop[] package or port. Once installed, pftop can be run to view a running snapshot of traffic in a format which is similar to man:top[1].
ko: PF 방화벽을 통과하는 트래픽을 주시하려면 package:sysutils/pftop[] 패키지 또는 포트를 설치하는 것이 좋습니다. 설치가 완료되면 pftop을 실행하여 man:top[1]과 유사한 형식으로 트래픽의 실행 중인 스냅샷을 볼 수 있습니다.
ru: Для наблюдения за трафиком, проходящим через межсетевой экран PF, рекомендуется установить пакет package:sysutils/pftop[] или порт. После установки можно запустить pftop для просмотра текущего снимка трафика в формате, аналогичном man:top[1].

source: PF Rulesets
ko: PF 규칙 집합
ru: Наборы правил PF

source: This section demonstrates how to create a customized ruleset. It starts with the simplest of rulesets and builds upon its concepts using several examples to demonstrate real-world usage of PF's many features.
ko: 이 섹션에서는 사용자 정의 규칙 집합을 만드는 방법을 설명합니다. 가장 간단한 규칙 집합부터 시작하여 몇 가지 예제를 사용하여 개념을 바탕으로 PF의 다양한 기능을 실제로 사용하는 방법을 보여줍니다.
ru: Этот раздел демонстрирует, как создать настраиваемый набор правил. Он начинается с простейшего набора правил и развивает его концепции, используя несколько примеров для демонстрации практического применения множества возможностей PF.

source: The simplest possible ruleset is for a single machine that does not run any services and which needs access to one network, which may be the Internet. To create this minimal ruleset, edit [.filename]#/etc/pf.conf# so it looks like this:
ko: 가장 간단한 규칙 집합은 서비스를 실행하지 않고 하나의 네트워크(인터넷일 수 있는)에 액세스해야 하는 단일 머신에 대한 것입니다. 이 최소한의 규칙 집합을 만들려면 [.filename]#/etc/pf.conf#을 다음과 같이 편집하세요:
ru: Самый простой возможный набор правил предназначен для одиночной машины, которая не запускает никаких сервисов и которой требуется доступ к одной сети, возможно, к Интернету. Чтобы создать этот минимальный набор правил, отредактируйте файл [.filename]#/etc/pf.conf#, чтобы он выглядел следующим образом:

source: The first rule denies all incoming traffic by default. The second rule allows connections created by this system to pass out, while retaining state information on those connections. This state information allows return traffic for those connections to pass back and should only be used on machines that can be trusted. The ruleset can be loaded with:
ko: 첫 번째 규칙은 기본적으로 들어오는 모든 트래픽을 거부합니다. 두 번째 규칙은 이 시스템에서 생성된 연결은 해당 연결의 상태 정보를 유지하면서 전달할 수 있도록 허용합니다. 이 상태 정보를 통해 해당 연결에 대한 리턴 트래픽이 다시 전달될 수 있으며 신뢰할 수 있는 컴퓨터에서만 사용해야 합니다. 다음으로 규칙 집합을 로드할 수 있습니다:
ru: Первое правило по умолчанию запрещает весь входящий трафик. Второе правило разрешает исходящие соединения, созданные этой системой, сохраняя информацию о состоянии этих соединений. Эта информация о состоянии позволяет возвратному трафику для этих соединений проходить обратно и должна использоваться только на машинах, которым можно доверять. Набор правил можно загрузить с помощью:

source: In addition to keeping state, PF provides _lists_ and _macros_ which can be defined for use when creating rules. Macros can include lists and need to be defined before use. As an example, insert these lines at the very top of the ruleset:
ko: PF는 상태 유지 외에도 규칙을 만들 때 사용할 수 있도록 정의할 수 있는 _목록_과 _매크로_를 제공합니다. 매크로는 목록을 포함할 수 있으며 사용하기 전에 정의해야 합니다. 예를 들어, 규칙 집합의 맨 위에 이 줄을 삽입하세요:
ru: В дополнение к отслеживанию состояний, PF предоставляет _списки_ и _макросы_, которые можно определить для использования при создании правил. Макросы могут включать списки и должны быть определены до их использования. В качестве примера вставьте следующие строки в самое начало набора правил:

source: PF understands port names as well as port numbers, as long as the names are listed in [.filename]#/etc/services#. This example creates two macros. The first is a list of seven TCP port names and the second is one UDP port name. Once defined, macros can be used in rules. In this example, all traffic is blocked except for the connections initiated by this system for the seven specified TCP services and the one specified UDP service:
ko: PF는 포트 이름이 [.filename]#/etc/services#에 나열되어 있는 한, 포트 번호뿐만 아니라 포트 이름도 이해합니다. 이 예제에서는 두 개의 매크로를 생성합니다. 첫 번째는 7개의 TCP 포트 이름 목록이고 두 번째는 하나의 UDP 포트 이름입니다. 매크로를 정의하면 규칙에서 사용할 수 있습니다. 이 예제에서는 지정된 7개의 TCP 서비스와 지정된 1개의 UDP 서비스에 대해 이 시스템에서 시작된 연결을 제외한 모든 트래픽이 차단됩니다:
ru: PF понимает как имена портов, так и их номера, при условии, что имена перечислены в [.filename]#/etc/services#. В этом примере создаются два макроса. Первый — это список из семи имён TCP-портов, а второй — одно имя UDP-порта. После определения макросы можно использовать в правилах. В данном примере весь трафик блокируется, за исключением соединений, инициированных этой системой для семи указанных TCP-сервисов и одного указанного UDP-сервиса:

source: Even though UDP is considered to be a stateless protocol, PF is able to track some state information. For example, when a UDP request is passed which asks a name server about a domain name, PF will watch for the response to pass it back.
ko: UDP는 무상태 프로토콜로 간주되지만 PF는 일부 상태 정보를 추적할 수 있습니다. 예를 들어, 네임 서버에 도메인 이름을 묻는 UDP 요청이 전달되면 PF는 응답을 감시하여 이를 다시 전달합니다.
ru: Хотя UDP считается протоколом без сохранения состояния, PF способен отслеживать некоторую информацию о состоянии. Например, когда передается UDP-запрос к серверу имен с вопросом о доменном имени, PF будет ожидать ответ, чтобы пропустить его обратно.

source: Whenever an edit is made to a ruleset, the new rules must be loaded so they can be used:
ko: 규칙 집합을 편집할 때마다 새 규칙을 로드해야 사용할 수 있습니다:
ru: Всякий раз при внесении изменений в набор правил, новые правила должны быть загружены для их использования:

source: If there are no syntax errors, `pfctl` will not output any messages during the rule load. Rules can also be tested before attempting to load them:
ko: 구문 오류가 없는 경우 `pfctl`은 규칙 로드 중에 메시지를 출력하지 않습니다. 규칙을 로드하기 전에 규칙을 테스트할 수도 있습니다:
ru: Если нет синтаксических ошибок, `pfctl` не выводит сообщений во время загрузки правил. Правила также можно проверить перед попыткой их загрузки:

source: Including `-n` causes the rules to be interpreted only, but not loaded. This provides an opportunity to correct any errors. At all times, the last valid ruleset loaded will be enforced until either PF is disabled or a new ruleset is loaded.
ko: `-n`을 포함하면 규칙이 해석만 되고 로드되지 않습니다. 이렇게 하면 오류를 수정할 수 있습니다. 항상 PF가 비활성화되거나 새 규칙 집합이 로드될 때까지 PF는 마지막으로 로드된 _유효한_ 규칙 집합을 적용합니다.
ru: Включение опции `-n` приводит к тому, что правила только интерпретируются, но не загружаются. Это даёт возможность исправить любые ошибки. В любое время будет применяться последний загруженный корректный набор правил, пока либо PF не будет отключён, либо не будет загружен новый набор правил.

source: Adding `-v` to a `pfctl` ruleset verify or load will display the fully parsed rules exactly the way they will be loaded. This is extremely useful when debugging rules.
ko: `pfctl`에 `-v`를 추가하면 규칙 집합을 확인하거나 완전히 구문 분석된 규칙이 로드되는 방식 그대로 표시됩니다. 이 기능은 규칙을 디버깅할 때 매우 유용합니다.
ru: Добавление `-v` к проверке или загрузке набора правил `pfctl` отобразит полностью разобранные правила именно так, как они будут загружены. Это крайне полезно при отладке правил межсетевого экрана.

source: A Simple Gateway with NAT
ko: NAT를 갖춘 간단한 게이트웨이
ru: Простой шлюз с NAT

source: This section demonstrates how to configure a FreeBSD system running PF to act as a gateway for at least one other machine. The gateway needs at least two network interfaces, each connected to a separate network. In this example, [.filename]#xl0# is connected to the Internet and [.filename]#xl1# is connected to the internal network.
ko: 이 섹션에서는 PF를 실행하는 FreeBSD 시스템이 적어도 하나 이상의 다른 머신에 대한 게이트웨이 역할을 하도록 구성하는 방법을 보여줍니다. 게이트웨이에는 각각 별도의 네트워크에 연결된 두 개 이상의 네트워크 인터페이스가 필요합니다. 이 예제에서는 [.filename]#xl0#이 인터넷에 연결되어 있고 [.filename]#xl1#이 내부 네트워크에 연결되어 있습니다.
ru: В этом разделе показано, как настроить систему FreeBSD с PF для работы в качестве шлюза как минимум для одного другого компьютера. Шлюзу требуется как минимум два сетевых интерфейса, каждый из которых подключен к отдельной сети. В этом примере [.filename]#xl0# подключен к Интернету, а [.filename]#xl1# подключен к внутренней сети.

source: First, enable the gateway to let the machine forward the network traffic it receives on one interface to another interface. This sysctl setting will forward IPv4 packets:
ko: 먼저, 게이트웨이가 한 인터페이스에서 수신한 네트워크 트래픽을 다른 인터페이스로 전달할 수 있도록 설정합니다. 이 sysctl 설정은 IPv4 패킷을 전달합니다:
ru: Включите шлюз, чтобы позволить машине перенаправлять сетевой трафик, полученный на одном интерфейсе, на другой интерфейс. Этот параметр sysctl перенаправляет IPv4-пакеты:

source: To forward IPv6 traffic, use:
ko: IPv6 트래픽을 전달하려면 다음을 사용합니다:
ru: Для переадресации IPv6-трафика используйте:

source: To enable these settings at system boot, use man:sysrc[8] to add them to [.filename]#/etc/rc.conf#:
ko: 시스템 부팅 시 이러한 설정을 활성화하려면 man:sysrc[8]을 사용하여 [.filename]#/etc/rc.conf#에 추가합니다:
ru: Чтобы включить эти настройки при загрузке системы, используйте man:sysrc[8] для их добавления в [.filename]#/etc/rc.conf#:

source: Verify with `ifconfig` that both of the interfaces are up and running.
ko: `ifconfig`를 사용하여 두 인터페이스가 모두 실행 중인지 확인합니다.
ru: Проверьте с помощью `ifconfig`, что оба интерфейса активны и работают.

source: Next, create the PF rules to allow the gateway to pass traffic. While the following rule allows stateful traffic from hosts of the internal network to pass to the gateway, the `to` keyword does not guarantee passage all the way from source to destination:
ko: 다음으로, 게이트웨이가 트래픽을 통과하도록 허용하는 PF 규칙을 생성합니다. 다음 규칙은 내부 네트워크 호스트의 상태분석형 트래픽이 게이트웨이로 전달되는 것을 허용하지만, `to` 키워드가 소스에서 목적지까지 모든 경로를 보장하지는 않습니다:
ru: Далее создайте правила PF, чтобы позволить шлюзу передавать трафик. Хотя следующее правило разрешает трафик с сохранением статуса от хостов внутренней сети проходить к шлюзу, ключевое слово `to` не гарантирует прохождение всего пути от источника до назначения:

source: That rule only lets the traffic pass in to the gateway on the internal interface. To let the packets go further, a matching rule is needed:
ko: 이 규칙은 트래픽이 내부 인터페이스의 게이트웨이로만 통과하도록 허용합니다. 패킷을 더 멀리 보내려면 일치하는 규칙이 필요합니다:
ru: Это правило разрешает прохождение трафика только внутрь шлюза на внутреннем интерфейсе. Чтобы пакеты могли идти дальше, требуется соответствующее правило:

source: While these two rules will work, rules this specific are rarely needed. For a busy network admin, a readable ruleset is a safer ruleset. The remainder of this section demonstrates how to keep the rules as simple as possible for readability. For example, those two rules could be replaced with one rule:
ko: 위의 두 가지 규칙은 작동하지만, 이렇게 구체적인 규칙이 필요한 경우는 거의 없습니다. 바쁜 네트워크 관리자에게는 읽기 쉬운 규칙 집합이 더 안전한 규칙 집합입니다. 이 섹션의 나머지 부분에서는 가독성을 위해 규칙을 가능한 한 단순하게 유지하는 방법을 설명합니다. 예를 들어 두 개의 규칙을 하나의 규칙으로 대체할 수 있습니다:
ru: Хотя эти два правила будут работать, столь специфичные правила редко требуются. Для занятого сетевого администратора читаемый набор правил — это более безопасный набор правил. В оставшейся части этого раздела показано, как сохранять правила максимально простыми для удобочитаемости. Например, эти два правила можно заменить одним:

source: The `interface:network` notation can be replaced with a macro to make the ruleset even more readable. For example, a `$localnet` macro could be defined as the network directly attached to the internal interface (`$xl1:network`). Alternatively, the definition of `$localnet` could be changed to an _IP address/netmask_ notation to denote a network, such as `192.168.100.1/24` for a subnet of private addresses.
ko: `인터페이스:네트워크` 표기법을 매크로로 대체하여 규칙 집합을 더욱 읽기 쉽게 만들 수 있습니다. 예를 들어, `$localnet` 매크로는 내부 인터페이스에 직접 연결된 네트워크(`$xl1:network`)로 정의할 수 있습니다. 또는 `$localnet`의 정의를 _IP 주소/넷마스크_ 표기법으로 변경하여 사설 주소 서브넷의 경우 `192.168.100.1/24`와 같이 네트워크를 나타낼 수도 있습니다.
ru: Обозначение `interface:network` может быть заменено макросом для повышения читаемости набора правил. Например, можно определить макрос `$localnet` как сеть, непосредственно подключённую к внутреннему интерфейсу (`$xl1:network`). Или определение `$localnet` может быть изменено на _IP-адрес/маску сети_ для обозначения сети, например `192.168.100.1/24` для подсети частных адресов.

source: If required, `$localnet` could even be defined as a list of networks. Whatever the specific needs, a sensible `$localnet` definition could be used in a typical pass rule as follows:
ko: 필요한 경우 `$localnet`을 네트워크 목록으로 정의할 수도 있습니다. 구체적인 요구 사항이 무엇이든, 다음과 같이 일반적인 통과 규칙에 합리적인 `$localnet` 정의를 사용할 수 있습니다:
ru: Если требуется, `$localnet` можно определить даже как список сетей. Независимо от конкретных потребностей, разумное определение `$localnet` может быть использовано в типичном правиле пропуска следующим образом:

source: The following sample ruleset allows all traffic initiated by machines on the internal network. It first defines two macros to represent the external and internal 3COM interfaces of the gateway.
ko: 다음 샘플 규칙 세트는 내부 네트워크의 머신에서 시작된 모든 트래픽을 허용합니다. 먼저 게이트웨이의 외부 및 내부 3COM 인터페이스를 나타내는 두 개의 매크로를 정의합니다.
ru: Следующий пример набора правил разрешает весь трафик, инициированный машинами во внутренней сети. Сначала определяются два макроса для представления внешнего и внутреннего интерфейсов 3COM настраиваемого шлюза.

source: For dialup users, the external interface will use [.filename]#tun0#. For an ADSL connection, specifically those using PPP over Ethernet (PPPoE), the correct external interface is [.filename]#tun0#, not the physical Ethernet interface.
ko: 전화 접속 사용자의 경우 외부 인터페이스는 [.filename]#tun0#을 사용합니다. ADSL 연결, 특히 PPPoE(PPP를 통한 이더넷)를 사용하는 연결의 경우 올바른 외부 인터페이스는 물리적 이더넷 인터페이스가 아닌 [.filename]#tun0#입니다.
ru: Для пользователей коммутируемого доступа внешний интерфейс будет использовать [.filename]#tun0#. Для ADSL-подключения, особенно тех, которые используют PPP через Ethernet (PPPoE), правильный внешний интерфейс — это [.filename]#tun0#, а не физический Ethernet-интерфейс.

source: This ruleset introduces the `nat` rule which is used to handle the network address translation from the non-routable addresses inside the internal network to the IP address assigned to the external interface. The parentheses surrounding the last part of the nat rule `($ext_if)` is included when the IP address of the external interface is dynamically assigned. It ensures that network traffic runs without serious interruptions even if the external IP address changes.
ko: 이 규칙 집합은 내부 네트워크에서 내부 주소로 라우팅할 수 없는, 주소에서 외부 인터페이스에 할당된 IP 주소로 네트워크 주소 변환을 처리하는 데 사용되는 `nat` 규칙을 소개합니다. nat 규칙의 마지막 부분인 `($ext_if)`를 둘러싼 괄호는 외부 인터페이스의 IP 주소가 동적으로 할당될 때 포함됩니다. 외부 IP 주소가 변경되더라도 네트워크 트래픽이 심각한 중단 없이 실행되도록 보장합니다.
ru: Этот набор правил вводит правило `nat`, которое используется для обработки преобразования сетевых адресов из не маршрутизируемых адресов внутри внутренней сети в IP-адрес, назначенный внешнему интерфейсу. Скобки вокруг последней части правила nat `($ext_if)` включаются, когда IP-адрес внешнего интерфейса назначается динамически. Это гарантирует, что сетевой трафик будет работать без серьёзных перебоев, даже если внешний IP-адрес изменится.

source: Note that this ruleset probably allows more traffic to pass out of the network than is needed. One reasonable setup could create this macro:
ko: 이 규칙 집합은 아마도 필요한 것보다 더 많은 트래픽이 네트워크 외부로 전달되도록 허용할 수 있습니다. 합리적인 설정으로 이 매크로를 만들 수 있습니다:
ru: Обратите внимание, что этот набор правил, вероятно, разрешает больше трафика для выхода из сети, чем необходимо. Один из разумных вариантов настройки может создать этот макрос:

source: to use in the main pass rule:
ko: 메인 패스 규칙에 사용하려면:
ru: для использования в основном правиле пропуска:

source: A few other pass rules may be needed. This one enables SSH on the external interface:
ko: 몇 가지 다른 통과 규칙이 필요할 수 있습니다. 이 규칙은 외부 인터페이스에서 SSH를 사용하도록 설정합니다:
ru: Еще могут понадобиться несколько других правил пропуска . Это правило включает SSH на внешнем интерфейсе:

source: This macro definition and rule allows DNS and NTP for internal clients:
ko: 이 매크로 정의 및 규칙은 내부 클라이언트에 대한 DNS 및 NTP를 허용합니다:
ru: Это определение макроса и правило разрешают DNS и NTP для внутренних клиентов:

source: Note the `quick` keyword in this rule. Since the ruleset consists of several rules, it is important to understand the relationships between the rules in a ruleset. Rules are evaluated from top to bottom, in the sequence they are written. For each packet or connection evaluated by PF, _the last matching rule_ in the ruleset is the one which is applied. However, when a packet matches a rule which contains the `quick` keyword, the rule processing stops and the packet is treated according to that rule. This is very useful when an exception to the general rules is needed.
ko: 이 규칙의 ‘quick’ 키워드에 주목하세요. 규칙 집합은 여러 규칙으로 구성되므로 규칙 집합의 규칙 간의 관계를 이해하는 것이 중요합니다. 규칙은 작성된 순서대로 위에서 아래로 평가됩니다. PF가 평가하는 각 패킷 또는 연결에 대해, 규칙 세트에서 마지막으로 일치하는 규칙이 적용됩니다. 그러나 패킷이 ‘quick’ 키워드가 포함된 규칙과 일치하면 규칙 처리가 중지되고 해당 규칙에 따라 패킷이 처리됩니다. 이 기능은 일반 규칙에 대한 예외가 필요할 때 매우 유용합니다.
ru: Обратите внимание на ключевое слово `quick` в этом правиле. Поскольку набор правил состоит из нескольких правил, важно понимать взаимосвязи между ними. Правила обрабатываются сверху вниз, в порядке их написания. Для каждого пакета или соединения, оцениваемого PF, _последнее совпадающее правило_ в наборе является тем, которое применяется. Однако, когда пакет совпадает с правилом, содержащим ключевое слово `quick`, обработка правил прекращается, и пакет обрабатывается в соответствии с этим правилом. Это очень полезно, когда требуется исключение из общих правил.

source: Creating an FTP Proxy
ko: FTP 프록시 생성하기
ru: Создание FTP-прокси

source: Configuring working FTP rules can be problematic due to the nature of the FTP protocol. FTP pre-dates firewalls by several decades and is insecure in its design. The most common points against using FTP include:
ko: FTP 프로토콜의 특성으로 인해 동작중인 FTP 규칙을 구성하는 것은 문제가 될 수 있습니다. FTP는 방화벽보다 수십 년 전의 것으로, 설계상 안전하지 않습니다. FTP 사용에 반대하는 가장 일반적인 이유는 다음과 같습니다:
ru: Настройка рабочих правил FTP может быть проблематичной из-за особенностей протокола FTP. Протокол FTP появился на несколько десятилетий раньше межсетевых экранов и небезопасен по своей конструкции. Наиболее распространённые аргументы против использования FTP включают:

source: Passwords are transferred in the clear.
ko: 비밀번호가 투명하게 전송됩니다.
ru: Пароли передаются в открытом виде.

source: The protocol demands the use of at least two TCP connections (control and data) on separate ports.
ko: 이 프로토콜은 별도의 포트에서 최소 두 개의 TCP 연결(제어 및 데이터)을 사용하도록 요구합니다.
ru: Протокол требует использования как минимум двух TCP-соединений (управляющего канала и канала данных) на отдельных портах.
