Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: FreeBSD has three firewalls built into the base system: PF, IPFW, and IPFILTER. This chapter covers how to define packet filtering rules, the differences between the firewalls built into FreeBSD and how to use them
ko: FreeBSD에는 기본 시스템에 세 가지 방화벽이 내장되어 있습니다: PF, IPFW, 그리고 IPFILTER입니다. 이 장에서는 패킷 필터링 규칙을 정의하는 방법, FreeBSD에 내장된 방화벽 간의 차이점 및 사용 방법을 다룹니다
ru: В базовой системе FreeBSD встроено три межсетевых экрана: PF, IPFW и IPFILTER. В этой главе рассматривается, как определять правила фильтрации пакетов, различия между встроенными в FreeBSD межсетевыми экранами и способы их использования

source: IV. Network Communication
ko: IV. 네트워크 통신
ru: IV. Сетевое взаимодействие

source: Chapter 32. Firewalls
ko: 32장. 방화벽

source: Firewalls
ko: 방화벽
ru: Межсетевые экраны

source: Synopsis
ko: 요약
ru: Обзор

source: Firewalls make it possible to filter the incoming and outgoing traffic that flows through a system. A firewall can use one or more sets of "rules" to inspect network packets as they come in or go out of network connections and either allows the traffic through or blocks it. The rules of a firewall can inspect one or more characteristics of the packets such as the protocol type, source or destination host address, and source or destination port.
ko: 방화벽을 사용하면 시스템을 통해 들어오고 나가는 트래픽을 필터링할 수 있습니다. 방화벽은 하나 이상의 “규칙” 세트를 사용하여 네트워크 연결에서 들어오고 나가는 네트워크 패킷을 검사하고 트래픽을 통과시키거나 차단할 수 있습니다. 방화벽의 규칙은 프로토콜 유형, 소스 또는 대상 호스트 주소, 소스 또는 대상 포트와 같은 패킷의 하나 이상의 특성을 검사할 수 있습니다.
ru: Межсетевые экраны позволяют фильтровать входящий и исходящий трафик, проходящий через систему. Межсетевой экран может использовать один или несколько наборов "правил" для проверки сетевых пакетов при их поступлении или выходе из сетевых соединений и либо пропускает трафик, либо блокирует его. Правила межсетевого экрана могут проверять одну или несколько характеристик пакетов, таких как тип протокола, адрес исходного или целевого хоста, а также исходный или целевой порт.

source: Firewalls can enhance the security of a host or a network. They can be used to do one or more of the following:
ko: 방화벽은 호스트 또는 네트워크의 보안을 강화할 수 있습니다. 방화벽은 다음 중 하나 이상의 작업을 수행하는 데 사용할 수 있습니다:
ru: Межсетевые экраны могут повысить безопасность узла или сети. Они могут использоваться для выполнения одной или нескольких следующих функций:

source: Protect and insulate the applications, services, and machines of an internal network from unwanted traffic from the public Internet.
ko: 공용 인터넷의 원치 않는 트래픽으로부터 내부 네트워크의 애플리케이션, 서비스, 머신을 보호하고 격리합니다.
ru: Защищать и изолировать приложения, сервисы и машины внутренней сети от нежелательного трафика из общедоступного Интернета.

source: Limit or disable access from hosts of the internal network to services of the public Internet.
ko: 내부 네트워크 호스트의 공용 인터넷 서비스에 대한 액세스를 제한하거나 비활성화합니다.
ru: Ограничивать или отключать доступ с хостов внутренней сети к сервисам публичного Интернета.

source: Support network address translation (NAT), which allows an internal network to use private IP addresses and share a single connection to the public Internet using either a single IP address or a shared pool of automatically assigned public addresses.
ko: 내부 네트워크에서 사설 IP 주소를 사용하고 단일 IP 주소 또는 자동으로 할당된 공용 주소의 공유 풀을 사용하여 공용 인터넷에 대한 단일 연결을 공유할 수 있는 네트워크 주소 변환(NAT)을 지원합니다.
ru: Поддерживать преобразования сетевых адресов (NAT), что позволяет внутренней сети использовать частные IP-адреса и совместно использовать одно подключение к публичному интернету с помощью одного IP-адреса или общего пула автоматически назначаемых публичных адресов.

source: FreeBSD has three firewalls built into the base system: PF, IPFW, and IPFILTER, also known as IPF. FreeBSD also provides two traffic shapers for controlling bandwidth usage: man:altq[4] and man:dummynet[4]. ALTQ has traditionally been closely tied with PF and dummynet with IPFW. Each firewall uses rules to control the access of packets to and from a FreeBSD system, although they go about it in different ways and each has a different rule syntax.
ko: FreeBSD에는 기본 시스템에 세 가지 방화벽이 내장되어 있습니다: PF, IPFW, 그리고 IPF라고도 알려진 IPFILTER입니다. FreeBSD는 또한 대역폭 사용량을 제어하기 위한 두 가지 트래픽 셰이퍼인 man:altq[4]와 man:dummynet[4]을 제공합니다. ALTQ는 전통적으로 PF와 밀접하게 연관되어 있고, dummynet은 IPFW와 밀접하게 연관되어 있습니다. 각 방화벽은 규칙을 사용하여 FreeBSD 시스템과 주고받는 패킷의 액세스를 제어하지만, 그 방식이 다르고 규칙 구문도 각각 다릅니다.
ru: В базовой системе FreeBSD встроено три межсетевых экрана: PF, IPFW и IPFILTER, также известный как IPF. FreeBSD также предоставляет два инструмента для управления использованием пропускной способности: man:altq[4] и man:dummynet[4]. ALTQ традиционно тесно связан с PF, а dummynet — с IPFW. Каждый межсетевой экран использует правила для контроля доступа пакетов к системе FreeBSD и из неё, хотя подходы у них различаются, и каждый имеет свой собственный синтаксис правил.

source: FreeBSD provides multiple firewalls in order to meet the different requirements and preferences for a wide variety of users. Each user should evaluate which firewall best meets their needs.
ko: FreeBSD는 다양한 사용자들의 다양한 요구사항과 선호도를 충족시키기 위해 여러 방화벽을 제공합니다. 각 사용자는 자신의 필요에 가장 적합한 방화벽을 평가해야 합니다.
ru: FreeBSD предоставляет несколько межсетевых экранов для удовлетворения различных требований и предпочтений широкого круга пользователей. Каждый пользователь должен оценить, какой межсетевой экран лучше всего соответствует его потребностям.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: How to define packet filtering rules.
ko: 패킷 필터링 규칙을 정의하는 방법.
ru: Как определить правила фильтрации пакетов.

source: The differences between the firewalls built into FreeBSD.
ko: FreeBSD에 내장된 방화벽들 간의 차이점.
ru: Различия между межсетевыми экранами, встроенными в FreeBSD.

source: How to use and configure the PF firewall.
ko: PF 방화벽 사용 및 구성 방법.
ru: Как использовать и настроить межсетевой экран PF.

source: How to use and configure the IPFW firewall.
ko: IPFW 방화벽 사용 및 구성 방법.
ru: Как использовать и настроить межсетевой экран IPFW.

source: How to use and configure the IPFILTER firewall.
ko: IPFILTER 방화벽을 사용하고 구성하는 방법.
ru: Как использовать и настроить межсетевой экран IPFILTER.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand basic FreeBSD and Internet concepts.
ko: 기본적인 FreeBSD 사용법 및 인터넷의 개념.
ru: Понимать основы FreeBSD и принципы работы Интернета.

source: Since all firewalls are based on inspecting the values of selected packet control fields, the creator of the firewall ruleset must have an understanding of how TCP/IP works, what the different values in the packet control fields are, and how these values are used in a normal session conversation. For a good introduction, refer to http://www.ipprimer.com[Daryl's TCP/IP Primer].
ko: 모든 방화벽은 선택된 패킷 제어 필드의 값을 검사하는 것을 기반으로 하기 때문에 방화벽 규칙 집합을 만드는 사람은 TCP/IP의 작동 방식, 패킷 제어 필드의 다양한 값, 일반 세션 통신에서 이러한 값이 어떻게 사용되는지에 대해 이해해야 합니다. 이에 대한 자료로 http://www.ipprimer.com[Daryl's TCP/IP Primer]를 참고하세요.
ru: Поскольку все межсетевые экраны основаны на проверке значений выбранных управляющих полей пакетов, создатель набора правил межсетевого экрана должен понимать, как работает TCP/IP, какие значения содержатся в управляющих полях пакетов и как эти значения используются в обычном сеансе связи. Хорошее введение можно найти в http://www.ipprimer.com[TCP/IP Primer от Daryl].

source: Firewall Concepts
ko: 방화벽 개념
ru: Концепции межсетевого экрана

source: A ruleset contains a group of rules which pass or block packets based on the values contained in the packet. The bi-directional exchange of packets between hosts comprises a session conversation. The firewall ruleset processes both the packets arriving from the public Internet, as well as the packets produced by the system as a response to them. Each TCP/IP service is predefined by its protocol and listening port. Packets destined for a specific service originate from the source address using an unprivileged port and target the specific service port on the destination address. All the above parameters can be used as selection criteria to create rules which will pass or block services.
ko: 규칙 집합에는 패킷에 포함된 값에 따라 패킷을 통과시키거나 차단하는 규칙 그룹이 포함되어 있습니다. 호스트 간 패킷의 양방향 교환은 세션 통신으로 구성됩니다. 방화벽 룰셋은 공용 인터넷에서 도착하는 패킷과 이에 대한 응답으로 시스템에서 생성되는 패킷을 모두 처리합니다. 각 TCP/IP 서비스는 해당 프로토콜과 수신 포트로 미리 정의됩니다. 특정 서비스를 대상으로 하는 패킷은 권한이 없는 포트를 사용하여 소스 주소에서 출발하여 대상 주소의 특정 서비스 포트를 대상으로 합니다. 위의 모든 매개변수를 선택 기준으로 사용하여 서비스를 통과시키거나 차단할 규칙을 만들 수 있습니다.
ru: Набор правил содержит группу правил, которые пропускают или блокируют пакеты на основе значений, содержащихся в пакете. Двунаправленный обмен пакетами между хостами составляет сеанс взаимодействия. Межсетевой экран обрабатывает как пакеты, поступающие из общедоступного Интернета, так и пакеты, генерируемые системой в ответ на них. Каждая служба TCP/IP имеет свой протокол и порт прослушивания. Пакеты, предназначенные для конкретной службы, идут из исходного адреса с использованием непривилегированного порта и направляются на конкретный порт службы на адресе назначения. Все вышеуказанные параметры могут быть использованы в качестве критериев выбора для создания правил, которые будут пропускать или блокировать службы.

source: To lookup unknown port numbers, refer to [.filename]#/etc/services#. Alternatively, visit http://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers[http://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers] and do a port number lookup to find the purpose of a particular port number.
ko: 알 수 없는 포트 번호를 조회하려면 [.filename]#/etc/services#를 참조하세요. 또는 http://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers[http://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers]를 방문하여 포트 번호 조회를 수행하여 특정 포트 번호의 용도를 찾을 수 있습니다.

source: Check out this link for http://web.archive.org/web/20150803024617/http://www.sans.org/security-resources/idfaq/oddports.php[port numbers used by Trojans].
ko: http://web.archive.org/web/20150803024617/http://www.sans.org/security-resources/idfaq/oddports.php[트로이 목마가 사용하는 포트 번호]는 이 링크에서 확인하세요.
ru: Ознакомьтесь с этой ссылкой для http://web.archive.org/web/20150803024617/http://www.sans.org/security-resources/idfaq/oddports.php[номеров портов, используемых троянами].

source: FTP has two modes: active mode and passive mode. The difference is in how the data channel is acquired. Passive mode is more secure as the data channel is acquired by the ordinal ftp session requester. For a good explanation of FTP and the different modes, see http://www.slacksite.com/other/ftp.html[http://www.slacksite.com/other/ftp.html].
ko: FTP에는 액티브 모드와 패시브 모드의 두 가지 모드가 있습니다. 데이터 채널을 획득하는 방식에 차이가 있습니다. 패시브 모드는 서수(ordinal) FTP 세션 요청자가 데이터 채널을 획득하므로 더 안전합니다. FTP 및 다양한 모드에 대한 자세한 설명은 http://www.slacksite.com/other/ftp.html[http://www.slacksite.com/other/ftp.html]를 참조하세요.
ru: FTP имеет два режима: активный режим и пассивный режим. Разница заключается в том, как устанавливается канал передачи данных. Пассивный режим более безопасен, так как канал передачи данных устанавливается инициатором сессии FTP. Для подробного объяснения работы FTP и различных режимов см. http://www.slacksite.com/other/ftp.html[http://www.slacksite.com/other/ftp.html].

source: A firewall ruleset can be either "exclusive" or "inclusive". An exclusive firewall allows all traffic through except for the traffic matching the ruleset. An inclusive firewall does the reverse as it only allows traffic matching the rules through and blocks everything else.
ko: 방화벽 규칙 집합은 “배타적”이거나 “포괄적”일 수 있습니다. 배타적 방화벽은 규칙 세트와 일치하는 트래픽을 제외한 모든 트래픽을 통과시킵니다. 포괄적 방화벽은 반대로 규칙과 일치하는 트래픽만 통과시키고 그 외의 모든 트래픽을 차단합니다.
ru: Набор правил межсетевого экрана может быть "исключающим" или "включающим". Исключающий межсетевой экран пропускает весь трафик, кроме трафика, соответствующего набору правил. Включающий межсетевой экран действует наоборот, пропуская только трафик, соответствующий правилам, и блокируя всё остальное.

source: An inclusive firewall offers better control of the outgoing traffic, making it a better choice for systems that offer services to the public Internet. It also controls the type of traffic originating from the public Internet that can gain access to a private network. All traffic that does not match the rules is blocked and logged. Inclusive firewalls are generally safer than exclusive firewalls because they significantly reduce the risk of allowing unwanted traffic.
ko: 포괄적인 방화벽은 아웃바운드 트래픽을 더 잘 제어할 수 있으므로 인터넷에 서비스를 제공하는 시스템에서 더 적합합니다. 또한 공용 인터넷에서 시작하여 사설 네트워크에 액세스할 수 있는 트래픽 유형도 제어합니다. 규칙과 일치하지 않는 모든 트래픽은 차단되고 기록됩니다. 포괄적 방화벽은 일반적으로 원치 않는 트래픽을 허용할 위험을 크게 줄이므로 배타적 방화벽보다 안전합니다.
ru: Включающий межсетевой экран обеспечивает лучший контроль исходящего трафика, что делает его предпочтительным выбором для систем, предоставляющих услуги в публичном Интернете. Он также контролирует тип трафика, исходящего из публичного Интернета, который может получить доступ к частной сети. Весь трафик, не соответствующий правилам, блокируется и регистрируется. Включающие межсетевые экраны, как правило, безопаснее исключающих, поскольку они значительно снижают риск пропуска нежелательного трафика.

source: Unless noted otherwise, all configuration and example rulesets in this chapter create inclusive firewall rulesets.
ko: 달리 명시되지 않는 한, 이 장의 모든 구성 및 예제 규칙 집합은 포괄적인 방화벽 규칙 집합을 생성합니다.
ru: Если не указано иное, все конфигурации и примеры наборов правил в этой главе создают включающие наборы правил для межсетевого экрана.

source: Security can be tightened further using a "stateful firewall". This type of firewall keeps track of open connections and only allows traffic which either matches an existing connection or opens a new, allowed connection.
ko: “상태분석형 방화벽(Stateful Firewall)”을 사용하여 보안을 더욱 강화할 수 있습니다. 이 유형의 방화벽은 열려 있는 연결을 추적하고 기존 연결과 일치하거나 허용된 새 연결을 여는 트래픽만 허용합니다.
ru: Безопасность можно дополнительно усилить с помощью "межсетевого экрана с отслеживанием состояния". Такой тип межсетевого экрана отслеживает активные соединения и разрешает только трафик, который соответствует существующему соединению или открывает новое, разрешённое соединение.

source: Stateful filtering treats traffic as a bi-directional exchange of packets comprising a session. When state is specified on a matching rule the firewall dynamically generates internal rules for each anticipated packet being exchanged during the session. It has sufficient matching capabilities to determine if a packet is valid for a session. Any packets that do not properly fit the session template are automatically rejected.
ko: 상태분석형 필터링은 트래픽을, 세션을 구성하는 패킷의 양방향 교환으로 취급합니다. 매칭 규칙에 상태가 지정되면 방화벽은 세션 중에 교환될 것으로 예상되는 각 패킷에 대한 내부 규칙을 동적으로 생성합니다. 방화벽은 패킷이 세션에 유효한지 판단할 수 있는 충분한 매칭 기능을 갖추고 있습니다. 세션 템플릿에 제대로 맞지 않는 패킷은 자동으로 거부됩니다.
ru: Фильтрация с отслеживанием состояния рассматривает трафик как двусторонний обмен пакетами, составляющими сеанс. Когда для соответствующего правила указано состояние, межсетевой экран динамически создает внутренние правила для каждого ожидаемого пакета, обмениваемого во время сеанса. Он обладает достаточными возможностями сопоставления, чтобы определить, является ли пакет допустимым для сеанса. Любые пакеты, которые не соответствуют шаблону сеанса, автоматически отклоняются.

source: When the session completes, it is removed from the dynamic state table.
ko: 세션이 완료되면 동적 상태 테이블에서 세션이 제거됩니다.
ru: Когда сеанс завершается, он удаляется из динамической таблицы состояний.

source: Stateful filtering allows one to focus on blocking/passing new sessions. If the new session is passed, all its subsequent packets are allowed automatically and any impostor packets are automatically rejected. If a new session is blocked, none of its subsequent packets are allowed. Stateful filtering provides advanced matching abilities capable of defending against the flood of different attack methods employed by attackers.
ko: 상태분석형 필터링을 사용하면 새 세션을 차단/통과시키는 데 집중할 수 있습니다. 새 세션이 통과되면 그 이후의 모든 패킷이 자동으로 허용되고 모든 가짜 패킷은 자동으로 거부됩니다. 새 세션이 차단되면 그 이후의 패킷은 모두 허용되지 않습니다. 상태분석형 필터링은 공격자가 사용하는 다양한 공격 방법의 홍수를 방어할 수 있는 고급 매칭 기능을 제공합니다.
ru: Фильтрация с сохранением состояния позволяет сосредоточиться на блокировке/пропускании новых сеансов. Если новый сеанс пропущен, все последующие его пакеты автоматически разрешаются, а любые поддельные пакеты автоматически отвергаются. Если новый сеанс заблокирован, ни один из его последующих пакетов не разрешается. Фильтрация с сохранением состояния предоставляет расширенные возможности сопоставления, способные защитить от потока различных методов атак, используемых злоумышленниками.

source: NAT stands for _Network Address Translation_. NAT function enables the private LAN behind the firewall to share a single ISP-assigned IP address, even if that address is dynamically assigned. NAT allows each computer in the LAN to have Internet access, without having to pay the ISP for multiple Internet accounts or IP addresses.
ko: NAT는 _네트워크 주소 변환(Network Address Translation)_의 약자입니다. NAT 기능을 사용하면 방화벽 뒤에 있는 개인 LAN이 동적으로 할당된 주소라도 ISP에서 할당된 단일 IP 주소를 공유할 수 있습니다. NAT를 사용하면 여러 인터넷 계정이나 IP 주소에 대해 ISP에 비용을 지불하지 않고도 LAN의 각 컴퓨터가 인터넷에 액세스할 수 있습니다.
ru: NAT означает _Network Address Translation_ (Преобразование сетевых адресов). Функция NAT позволяет частной локальной сети за межсетевым экраном использовать один IP-адрес, назначенный провайдером, даже если этот адрес динамический. NAT даёт возможность каждому компьютеру в локальной сети выходить в Интернет без необходимости оплачивать провайдеру несколько интернет-аккаунтов или IP-адресов.

source: NAT will automatically translate the private LAN IP address for each system on the LAN to the single public IP address as packets exit the firewall bound for the public Internet. It also performs the reverse translation for returning packets.
ko: NAT는 패킷이 방화벽을 빠져나와 공용 인터넷으로 향할 때 LAN의 각 시스템에 대한 개인 LAN IP 주소를 단일 공용 IP 주소로 자동 변환합니다. 또한 패킷을 반환하기 위해 역변환도 수행합니다.
ru: NAT автоматически преобразует частный IP-адрес LAN для каждой системы в локальной сети в единственный публичный IP-адрес, когда пакеты выходят за пределы межсетевого экрана, направляясь в публичный Интернет. Он также выполняет обратное преобразование для возвращающихся пакетов.

source: According to RFC 1918, the following IP address ranges are reserved for private networks which will never be routed directly to the public Internet, and therefore are available for use with NAT:
ko: RFC 1918에 따르면 다음 IP 주소 범위는 공용 인터넷으로 직접 라우팅되지 않는 사설 네트워크용으로 예약되어 있으며, 따라서 NAT와 함께 사용할 수 있습니다:
ru: Согласно RFC 1918, следующие диапазоны IP-адресов зарезервированы для частных сетей, которые никогда не маршрутизируются напрямую в публичный Интернет и, следовательно, могут использоваться с NAT:

source: When working with the firewall rules, be _very careful_. Some configurations _can lock the administrator out_ of the server. To be on the safe side, consider performing the initial firewall configuration from the local console rather than doing it remotely over ssh.
ko: 방화벽 규칙으로 작업할 때는 _매우 주의하세요_. 일부 구성은 관리자를 서버에서 _차단 할 수_ 있습니다. 안전을 위해 초기 방화벽 구성은 ssh를 통해 원격으로 수행하지 말고 로컬 콘솔에서 수행하는 것이 좋습니다.
ru: При работе с правилами межсетевого экрана будьте _очень осторожны_. Некоторые конфигурации _могут заблокировать администратора_ на сервере. Для безопасности рекомендуется выполнять первоначальную настройку межсетевого экрана с локальной консоли, а не удалённо через ssh.

source: Since FreeBSD 5.3, a ported version of OpenBSD's PF firewall has been included as an integrated part of the base system. PF is a complete, full-featured firewall that has optional support for ALTQ (Alternate Queuing), which provides Quality of Service (QoS).
ko: FreeBSD 5.3부터, OpenBSD의 PF 방화벽의 포팅된 버전이 기본 시스템의 통합된 부분으로 포함되었습니다. PF는 완전한 기능을 갖춘 방화벽으로, 서비스 품질(QoS)을 제공하는 ALTQ(대체 큐잉)를 선택적으로 지원합니다.
ru: Начиная с FreeBSD 5.3, портированная версия межсетевого экрана PF из OpenBSD включена в базовую систему как её неотъемлемая часть. PF — это полноценный и многофункциональный межсетевой экран с опциональной поддержкой ALTQ (Alternate Queuing), которая обеспечивает качество обслуживания (QoS).

source: The OpenBSD Project maintains the definitive reference for PF in the http://www.openbsd.org/faq/pf/[PF FAQ]. Peter Hansteen maintains a thorough PF tutorial at http://home.nuug.no/\~peter/pf/[http://home.nuug.no/~peter/pf/].
ko: OpenBSD 프로젝트는 http://www.openbsd.org/faq/pf/[PF FAQ]에서 PF에 대한 완전한 참고자료를 제공하고 있습니다. 피터 한스틴(Peter Hansteen)은 http://home.nuug.no/\~peter/pf/[http://home.nuug.no/~peter/pf/]에서 PF에 대한 자세한 튜토리얼을 관리하고 있습니다.
ru: Проект OpenBSD содержит каноническое справочное издание по PF в http://www.openbsd.org/faq/pf/[FAQ по PF]. Питер Ханстин ведет подробный учебник по PF на http://home.nuug.no/\~peter/pf/[http://home.nuug.no/~peter/pf/].

source: When reading the http://www.openbsd.org/faq/pf/[PF FAQ], keep in mind that FreeBSD's version of PF has diverged substantially from the upstream OpenBSD version over the years. Not all features work the same way on FreeBSD as they do in OpenBSD and vice versa.
ko: http://www.openbsd.org/faq/pf/[PF FAQ]를 읽을 때, FreeBSD의 PF 버전은 수년에 걸쳐 업스트림 OpenBSD 버전과 상당히 달라졌다는 점을 염두에 두세요. 모든 기능이 FreeBSD에서 OpenBSD와 동일한 방식으로 작동하는 것은 아니며 그 반대의 경우도 마찬가지입니다.
ru: При чтении http://www.openbsd.org/faq/pf/[FAQ по PF] учитывайте, что версия PF в FreeBSD значительно отличается от оригинальной версии OpenBSD за прошедшие годы. Не все функции работают одинаково в FreeBSD и OpenBSD, и наоборот.

source: The {freebsd-pf} is a good place to ask questions about configuring and running the PF firewall. Check the mailing list archives before asking a question as it may have already been answered.
ko: {freebsd-pf}는 PF 방화벽 구성 및 실행에 관한 질문을 하기에 좋은 곳입니다. 이미 답변이 있을 수 있으므로 질문하기 전에 메일링 리스트 아카이브를 확인하시기 바랍니다.
ru: `{freebsd-pf}` — хорошее место для вопросов о настройке и работе PF межсетевого экрана. Перед тем как задать вопрос, проверьте архивы списка рассылки — возможно, ответ уже был дан.

source: This section of the Handbook focuses on PF as it pertains to FreeBSD. It demonstrates how to enable PF and ALTQ. It also provides several examples for creating rulesets on a FreeBSD system.
ko: 핸드북의 이 섹션은 FreeBSD와 관련된 PF에 초점을 맞추고 있습니다. PF와 ALTQ를 활성화하는 방법을 설명합니다. 또한 FreeBSD 시스템에서 규칙 집합을 생성하기 위한 몇 가지 예제도 제공합니다.
ru: Эта часть Руководства посвящена PF в контексте FreeBSD. В ней показано, как включить PF и ALTQ, а также приведены несколько примеров создания наборов правил в системе FreeBSD.

source: Enabling PF
ko: PF 활성화하기
ru: Включение PF

source: To use PF, its kernel module must be first loaded. This section describes the entries that can be added to [.filename]#/etc/rc.conf# to enable PF.
ko: PF를 사용하려면 먼저 해당 커널 모듈을 로드해야 합니다. 이 섹션에서는 PF를 활성화하기 위해 [.filename]#/etc/rc.conf#에 추가할 수 있는 항목에 대해 설명합니다.
ru: Для использования PF необходимо сначала загрузить его модуль ядра. В этом разделе описаны записи, которые можно добавить в [.filename]#/etc/rc.conf# для включения PF.

source: Start by adding `pf_enable=yes` to [.filename]#/etc/rc.conf#:
ko: [.filename]#/etc/rc.conf#에 `pf_enable=yes`를 추가하여 시작하세요:
ru: Начните с добавления `pf_enable=yes` в [.filename]#/etc/rc.conf#:

source: Additional options, described in man:pfctl[8], can be passed to PF when it is started. Add or change this entry in [.filename]#/etc/rc.conf# and specify any required flags between the two quotes (`""`):
ko: man:pfctl[8]에 설명된 추가 옵션은 PF가 시작될 때 PF에 전달할 수 있습니다. 이 항목을 [.filename]#/etc/rc.conf#에서 추가하거나 변경하고 두 따옴표(`””`) 사이에 필요한 플래그를 지정하세요:
ru: Дополнительные параметры, описанные в man:pfctl[8], могут быть переданы в PF при его запуске. Добавьте или измените эту запись в [.filename]#/etc/rc.conf# и укажите необходимые флаги между кавычками (`""`):
