Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: When a session is established, data is communicated using randomly selected ports.
ko: 세션이 설정되면 무작위로 선택된 포트를 사용하여 데이터가 통신됩니다.
ru: Когда сеанс установлен, данные передаются с использованием случайно выбранных портов.

source: All of these points present security challenges, even before considering any potential security weaknesses in client or server software. More secure alternatives for file transfer exist, such as man:sftp[1] or man:scp[1], which both feature authentication and data transfer over encrypted connections.
ko: 클라이언트 또는 서버 소프트웨어의 잠재적인 보안 취약점을 고려하기 전에도 이러한 모든 점은 보안 문제를 야기합니다. 암호화된 연결을 통한 인증 및 데이터 전송 기능을 모두 갖춘 man:sftp[1] 또는 man:scp[1]와 같은 보다 안전한 파일 전송 대안이 존재합니다.
ru: Все эти моменты представляют собой проблемы безопасности, даже без учёта потенциальных уязвимостей в клиентском или серверном программном обеспечении. Более безопасные альтернативы для передачи файлов существуют, например, man:sftp[1] или man:scp[1], которые обеспечивают аутентификацию и передачу данных через зашифрованные соединения.

source: For those situations when FTP is required, PF provides redirection of FTP traffic to a small proxy program called man:ftp-proxy[8], which is included in the base system of FreeBSD. The role of the proxy is to dynamically insert and delete rules in the ruleset, using a set of anchors, to correctly handle FTP traffic.
ko: FTP가 필요한 상황을 위해, PF는 FreeBSD의 기본 시스템에 포함되어 있는 man:ftp-proxy[8]라는 작은 프록시 프로그램으로 FTP 트래픽을 리디렉션합니다. 프록시의 역할은 일련의 앵커를 사용하여 규칙 집합에 규칙을 동적으로 삽입 및 삭제하여 FTP 트래픽을 올바르게 처리하는 것입니다.
ru: Для случаев, когда требуется FTP, PF предоставляет возможность перенаправления FTP-трафика на небольшую прокси-программу под названием man:ftp-proxy[8], которая включена в базовую систему FreeBSD. Роль прокси заключается в динамическом добавлении и удалении правил в наборе правил, используя набор якорей, для корректной обработки FTP-трафика.

source: To enable the FTP proxy, add this line to [.filename]#/etc/rc.conf#:
ko: FTP 프록시를 사용하려면 [.filename]#/etc/rc.conf#에 이 줄을 추가합니다:
ru: Чтобы включить FTP-прокси, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: Then start the proxy by running:
ko: 그런 다음 프록시를 실행하여 시작하세요:
ru: Затем запустите прокси, выполнив:

source: For a basic configuration, three elements need to be added to [.filename]#/etc/pf.conf#. First, the anchors which the proxy will use to insert the rules it generates for the FTP sessions:
ko: 기본 구성의 경우 [.filename]#/etc/pf.conf#에 세 가지 요소를 추가해야 합니다. 첫째, 프록시가 FTP 세션에 대해 생성하는 규칙을 삽입하는 데 사용할 앵커입니다:
ru: Для базовой конфигурации необходимо добавить три элемента в [.filename]#/etc/pf.conf#. Во-первых, якоря, которые прокси будет использовать для вставки правил, генерируемых для FTP-сессий:

source: Second, a pass rule is needed to allow FTP traffic in to the proxy.
ko: 둘째, 프록시로 들어오는 FTP 트래픽을 허용하려면 통과 규칙이 필요합니다.
ru: Во-вторых, необходимо правило pass, чтобы разрешить FTP-трафик к прокси.

source: Third, redirection and NAT rules need to be defined before the filtering rules. Insert this `rdr` rule immediately after the `nat` rule:
ko: 셋째, 리디렉션 및 NAT 규칙은 필터링 규칙보다 먼저 정의해야 합니다. 이 `rdr` 규칙을 `nat` 규칙 바로 뒤에 삽입하세요:
ru: Третье, правила перенаправления и NAT должны быть определены до правил фильтрации. Вставьте это правило `rdr` сразу после правила `nat`:

source: Finally, allow the redirected traffic to pass:
ko: 마지막으로 리디렉션된 트래픽이 통과할 수 있도록 허용합니다:
ru: Наконец, разрешите перенаправленному трафику проходить:

source: where `$proxy` expands to the address the proxy daemon is bound to.
ko: 여기서 `$proxy`는 프록시 데몬이 바인딩된 주소로 확장됩니다.
ru: где `$proxy` раскрывается в адрес, к которому привязан демон прокси.

source: Save [.filename]#/etc/pf.conf#, load the new rules, and verify from a client that FTP connections are working:
ko: [.filename]#/etc/pf.conf#을 저장하고 새 규칙을 로드한 다음 클라이언트에서 FTP 연결이 작동하는지 확인합니다:
ru: Сохраните [.filename]#/etc/pf.conf#, загрузите новые правила и проверьте с клиента, что FTP-подключения работают:

source: This example covers a basic setup where the clients in the local network need to contact FTP servers elsewhere. This basic configuration should work well with most combinations of FTP clients and servers. As shown in man:ftp-proxy[8], the proxy's behavior can be changed in various ways by adding options to the `ftpproxy_flags=` line. Some clients or servers may have specific quirks that must be compensated for in the configuration, or there may be a need to integrate the proxy in specific ways such as assigning FTP traffic to a specific queue.
ko: 이 예에서는 로컬 네트워크의 클라이언트가 다른 곳의 FTP 서버에 연결해야 하는 기본 설정에 대해 설명합니다. 이 기본 구성은 대부분의 FTP 클라이언트와 서버 조합에서 잘 작동합니다. man:ftp-proxy[8]에 표시된 것처럼 `ftpproxy_flags=` 줄에 옵션을 추가하여 프록시 동작을 다양한 방식으로 변경할 수 있습니다. 일부 클라이언트 또는 서버에는 구성에서 보완해야 하는 몇가지 단점이 있거나 특정 대기열에 FTP 트래픽을 할당하는 등, 특정 방식으로 프록시를 통합해야 할 필요가 있을 수 있습니다.
ru: Этот пример описывает базовую настройку, когда клиенты в локальной сети должны обращаться к FTP-серверам в других местах. Данная базовая конфигурация должна хорошо работать с большинством комбинаций FTP-клиентов и серверов. Как показано в man:ftp-proxy[8], поведение прокси можно изменить различными способами, добавляя параметры в строку `ftpproxy_flags=`. Некоторые клиенты или серверы могут иметь специфические особенности, которые необходимо учитывать в конфигурации, или может возникнуть необходимость интегрировать прокси определённым образом, например, назначить FTP-трафик в определённую очередь.

source: For ways to run an FTP server protected by PF and man:ftp-proxy[8], configure a separate `ftp-proxy` in reverse mode, using `-R`, on a separate port with its own redirecting pass rule.
ko: PF 및 man:ftp-proxy[8]로 보호되는 FTP 서버를 실행하는 방법은 자체 리디렉션 통과 규칙이 있는 별도의 포트에 `-R`을 사용하여 역방향 모드에서 별도의 `ftp-proxy`를 구성합니다.
ru: Для способов запуска FTP-сервера, защищённого PF и man:ftp-proxy[8], настройте отдельный `ftp-proxy` в обратном режиме с использованием `-R` на отдельном порту с собственным правилом перенаправления pass.

source: Managing ICMP
ko: ICMP 관리하기
ru: Управление ICMP

source: Many of the tools used for debugging or troubleshooting a TCP/IP network rely on the Internet Control Message Protocol (ICMP), which was designed specifically with debugging in mind.
ko: TCP/IP 네트워크의 디버깅 또는 문제 해결에 사용되는 많은 도구는 디버깅을 염두에 두고 특별히 설계된 인터넷 제어 메시지 프로토콜(ICMP)에 의존합니다.
ru: Многие инструменты, используемые для отладки или устранения неполадок в сети TCP/IP, основаны на протоколе ICMP (Internet Control Message Protocol), который был специально разработан для целей отладки.

source: The ICMP protocol sends and receives _control messages_ between hosts and gateways, mainly to provide feedback to a sender about any unusual or difficult conditions enroute to the target host. Routers use ICMP to negotiate packet sizes and other transmission parameters in a process often referred to as _path MTU discovery_.
ko: ICMP 프로토콜은 호스트와 게이트웨이 간에 _제어 메시지_를 송수신하며, 주로 대상 호스트로 전송되는 도중 비정상적이거나 어려운 조건에 대한 피드백을 발신자에게 제공하기 위해 사용됩니다. 라우터는 ICMP를 사용하여 패킷 크기 및 기타 전송 매개변수를 협상하는데, 이를 흔히 _경로 MTU 검색 (Path MTU discorvery)_이라고 합니다.
ru: Протокол ICMP отправляет и получает _управляющие сообщения_ между хостами и шлюзами, в основном для предоставления отправителю обратной связи о любых необычных или сложных условиях на пути к целевому хосту. Маршрутизаторы используют ICMP для согласования размеров пакетов и других параметров передачи в процессе, часто называемом _обнаружением MTU пути_.

source: From a firewall perspective, some ICMP control messages are vulnerable to known attack vectors. Also, letting all diagnostic traffic pass unconditionally makes debugging easier, but it also makes it easier for others to extract information about the network. For these reasons, the following rule may not be optimal:
ko: 방화벽 관점에서 볼 때, 일부 ICMP 제어 메시지는 알려진 공격 벡터에 취약합니다. 또한 모든 진단 트래픽을 무조건 통과시키면 디버깅이 더 쉬워지지만 다른 사람이 네트워크에 대한 정보를 더 쉽게 추출할 수 있습니다. 이러한 이유로 다음 규칙은 최적이 아닐 수 있습니다:
ru: С точки зрения межсетевого экрана, некоторые управляющие ICMP-сообщения уязвимы к известным векторам атак. Кроме того, безусловный пропуск всего диагностического трафика упрощает отладку, но также облегчает для других получение информации о сети. По этим причинам следующее правило может быть неоптимальным:

source: One solution is to let all ICMP traffic from the local network through while stopping all probes from outside the network:
ko: 한 가지 해결책은 로컬 네트워크의 모든 ICMP 트래픽을 통과시키면서 네트워크 외부의 모든 프로브를 차단하는 것입니다:
ru: Одно из решений — пропускать весь ICMP-трафик из локальной сети, блокируя все запросы извне:

source: Additional options are available which demonstrate some of PF's flexibility. For example, rather than allowing all ICMP messages, one can specify the messages used by man:ping[8] and man:traceroute[8]. Start by defining a macro for that type of message:
ko: PF의 유연성을 보여주는 추가 옵션을 사용할 수 있습니다. 예를 들어, 모든 ICMP 메시지를 허용하는 대신 man:ping[8] 및 man:traceroute[8]에서 사용하는 메시지를 지정할 수 있습니다. 먼저 해당 메시지 유형에 대한 매크로를 정의합니다:
ru: Дополнительные параметры демонстрируют гибкость PF. Например, вместо разрешения всех ICMP-сообщений можно указать сообщения, используемые man:ping[8] и man:traceroute[8]. Начните с определения макроса для этого типа сообщения:

source: and a rule which uses the macro:
ko: 그리고 매크로를 사용할 규칙을 지정합니다:
ru: и правила, которое использует макрос:

source: If other types of ICMP packets are needed, expand `icmp_types` to a list of those packet types. Type `more /usr/src/sbin/pfctl/pfctl_parser.c` to see the list of ICMP message types supported by PF. Refer to http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml[http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml] for an explanation of each message type.
ko: 다른 유형의 ICMP 패킷이 필요한 경우 `icmp_types`를 확장하여 해당 패킷 유형 목록을 표시합니다. `more /usr/src/sbin/pfctl/pfctl_parser.c`를 입력하면 PF에서 지원하는 ICMP 메시지 유형 목록을 볼 수 있습니다. 각 메시지 유형에 대한 설명은 http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml[http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml]를 참조하세요.
ru: Если требуются другие типы ICMP-пакетов, расширьте `icmp_types` до списка этих типов пакетов. Введите `more /usr/src/sbin/pfctl/pfctl_parser.c`, чтобы увидеть список типов ICMP-сообщений, поддерживаемых PF. Дополнительные сведения о каждом типе сообщения можно найти по ссылке http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml[http://www.iana.org/assignments/icmp-parameters/icmp-parameters.xhtml].

source: Since Unix `traceroute` uses UDP by default, another rule is needed to allow Unix `traceroute`:
ko: 유닉스 `traceroute`는 기본적으로 UDP를 사용하므로 유닉스 `traceroute`를 허용하려면 다른 규칙이 필요합니다:
ru: Поскольку Unix `traceroute` по умолчанию использует UDP, требуется дополнительное правило для разрешения Unix `traceroute`:

source: Since `TRACERT.EXE` on Microsoft Windows systems uses ICMP echo request messages, only the first rule is needed to allow network traces from those systems. Unix `traceroute` can be instructed to use other protocols as well, and will use ICMP echo request messages if `-I` is used. Check the man:traceroute[8] man page for details.
ko: Microsoft Windows 시스템의 `TRACERT.EXE`는 ICMP 에코 요청 메시지를 사용하므로, 해당 시스템에서 네트워크 추적을 허용하려면 첫 번째 규칙만 필요합니다. 유닉스 `traceroute`는 다른 프로토콜도 사용하도록 지시할 수 있으며, `-I`가 사용되는 경우 ICMP 에코 요청 메시지를 사용합니다. 자세한 내용은 man:traceroute[8] 매뉴얼 페이지를 참조하세요.
ru: Поскольку `TRACERT.EXE` в системах Microsoft Windows использует сообщения запроса эхо-ответа ICMP, достаточно только первого правила, чтобы разрешить трассировку сети с этих систем. В Unix `traceroute` можно настроить на использование других протоколов, и он будет использовать сообщения запроса эхо-ответа ICMP, если указан параметр `-I`. Подробности смотрите на man:traceroute[8].

source: Path MTU Discovery
ko: 경로 MTU 검색 (Path MTU Discovery)
ru: Обнаружение MTU пути

source: Internet protocols are designed to be device independent, and one consequence of device independence is that the optimal packet size for a given connection cannot always be predicted reliably. The main constraint on packet size is the _Maximum Transmission Unit_ (MTU) which sets the upper limit on the packet size for an interface. Type `ifconfig` to view the MTUs for a system's network interfaces.
ko: 인터넷 프로토콜은 디바이스 독립적으로 설계되었으며, 디바이스 독립성의 결과는 특정 연결에 대한 최적의 패킷 크기를 항상 안정적으로 예측할 수 없다는 것입니다. 패킷 크기에 대한 주요 제약 조건은 인터페이스의 패킷 크기에 대한 상한을 설정하는 _최대 전송 단위_(Max Tranmission Unit, MTU)입니다. 시스템 네트워크 인터페이스의 MTU를 보려면 `ifconfig`를 입력하세요.
ru: Протоколы Интернета разработаны так, чтобы быть независимыми от устройств, и одним из следствий этой независимости является то, что оптимальный размер пакета для данного соединения не всегда может быть надежно предсказан. Основное ограничение на размер пакета — это _Maximum Transmission Unit_ (MTU), который устанавливает верхний предел размера пакета для интерфейса. Введите `ifconfig`, чтобы просмотреть MTU для сетевых интерфейсов системы.

source: TCP/IP uses a process known as path MTU discovery to determine the right packet size for a connection. This process sends packets of varying sizes with the "Do not fragment" flag set, expecting an ICMP return packet of "type 3, code 4" when the upper limit has been reached. Type 3 means "destination unreachable", and code 4 is short for "fragmentation needed, but the do-not-fragment flag is set". To allow path MTU discovery in order to support connections to other MTUs, add the `destination unreachable` type to the `icmp_types` macro:
ko: TCP/IP는 경로 MTU 검색이라는 프로세스를 사용하여 연결에 적합한 패킷 크기를 결정합니다. 이 프로세스는 상한에 도달하면 “type 3, code 4”의 ICMP 반환 패킷을 예상하여 “조각화 안 함(Do not fragment)” 플래그가 설정된 다양한 크기의 패킷을 전송합니다. Type 3는 “대상에 연결할 수 없음”을 의미하며 Code 4는 “조각화가 필요하지만 조각화 금지 플래그가 설정되어 있음”의 줄임말입니다. 다른 MTU에 대한 연결을 지원하기 위해 경로 MTU 검색을 허용하려면 ‘대상에 연결할 수 없음(destination unreachable)’ 유형을 `icmp_types` 매크로에 추가하세요:
ru: TCP/IP использует процесс, известный как обнаружение MTU пути, для определения правильного размера пакета для соединения. Этот процесс отправляет пакеты различного размера с установленным флагом "Не фрагментировать", ожидая возврата ICMP-пакета с "типом 3, кодом 4", когда достигнут верхний предел. Тип 3 означает "адресат недостижим", а код 4 является сокращением для "требуется фрагментация, но установлен флаг 'не фрагментировать'". Чтобы разрешить обнаружение MTU пути для поддержки соединений с другими MTU, добавьте тип `destination unreachable` в макрос `icmp_types`:

source: Since the pass rule already uses that macro, it does not need to be modified to support the new ICMP type:
ko: 통과 규칙은 이미 해당 매크로를 사용하고 있으므로 새 ICMP 유형을 지원하기 위해 수정할 필요가 없습니다:
ru: Поскольку правило `pass` уже использует этот макрос, его не нужно изменять для поддержки нового типа ICMP:

source: PF allows filtering on all variations of ICMP types and codes. The list of possible types and codes are documented in man:icmp[4] and man:icmp6[4].
ko: PF는 모든 변형 ICMP 유형과 코드에 대한 필터링을 허용합니다. 가능한 유형과 코드 목록은 man:icmp[4] 및 man:icmp6[4]에 문서화되어 있습니다.
ru: PF позволяет фильтрацию по всем вариантам типов и кодов ICMP. Список возможных типов и кодов документирован в man:icmp[4] и man:icmp6[4].

source: Using Tables
ko: 테이블 사용하기
ru: Использование таблиц

source: Some types of data are relevant to filtering and redirection at a given time, but their definition is too long to be included in the ruleset file. PF supports the use of tables, which are defined lists that can be manipulated without needing to reload the entire ruleset, and which can provide fast lookups. Table names are always enclosed within `< >`, like this:
ko: 일부 데이터 유형은 특정 시점에 필터링 및 리디렉션과 관련이 있지만, 그 정의가 너무 길어 규칙 집합 파일에 포함하기에는 무리가 있습니다. PF는 전체 규칙 집합을 다시 로드할 필요 없이, 변경 및 빠른 조회를 제공하는 테이블 사용을 지원합니다. 테이블 이름은 항상 다음과 같이 `< >`로 묶습니다:
ru: Некоторые типы данных важны для фильтрации и перенаправления в определенный момент времени, но их определение слишком длинное, чтобы включать его в файл набора правил. PF поддерживает использование таблиц — это определенные списки, которыми можно управлять без необходимости перезагружать весь набор правил, и которые обеспечивают быстрый поиск. Имена таблиц всегда заключаются в `< >`, например:

source: In this example, the `192.168.2.0/24` network is part of the table, except for the address `192.168.2.5`, which is excluded using the `!` operator. It is also possible to load tables from files where each item is on a separate line, as seen in this example [.filename]#/etc/clients#:
ko: 이 예에서 `192.168.2.0/24` 네트워크는 `!` 연산자를 사용하여 제외된 주소 `192.168.2.5`를 제외하고는 테이블의 일부입니다. 이 예제 [.filename]#/etc/clients#에서 볼 수 있듯이 각 항목이 별도의 줄에 있는 파일에서 테이블을 로드할 수도 있습니다:
ru: В этом примере сеть `192.168.2.0/24` является частью таблицы, за исключением адреса `192.168.2.5`, который исключен с помощью оператора `!`. Также можно загружать таблицы из файлов, где каждый элемент находится на отдельной строке, как показано в этом примере [.filename]#/etc/clients#:

source: To refer to the file, define the table like this:
ko: 파일을 참조하려면 다음과 같이 테이블을 정의합니다:
ru: Для обращения к файлу определите таблицу следующим образом:

source: Once the table is defined, it can be referenced by a rule:
ko: 테이블이 정의되면 규칙에서 참조할 수 있습니다:
ru: После определения таблицы на неё можно ссылаться в правиле:

source: A table's contents can be manipulated live, using `pfctl`. This example adds another network to the table:
ko: 테이블의 내용은 `pfctl`을 사용하여 실시간으로 조작할 수 있습니다. 이 예제는 테이블에 다른 네트워크를 추가합니다:
ru: Содержимое таблицы можно изменять в реальном времени с помощью `pfctl`. В этом примере добавляется ещё одна сеть в таблицу:

source: Note that any changes made this way will take affect now, making them ideal for testing, but will not survive a power failure or reboot. To make the changes permanent, modify the definition of the table in the ruleset or edit the file that the table refers to. One can maintain the on-disk copy of the table using a man:cron[8] job which dumps the table's contents to disk at regular intervals, using a command such as `pfctl -t clients -T show >/etc/clients`. Alternatively, [.filename]#/etc/clients# can be updated with the in-memory table contents:
ko: 이 방법으로 변경한 내용은 지금 바로 적용되므로 테스트에 적합하지만 정전이나 재부팅 시에는 적용되지 않습니다. 변경 사항을 영구적으로 적용하려면 규칙 집합에서 테이블의 정의를 수정하거나 테이블이 참조하는 파일을 편집하세요. 정기적으로 테이블의 내용을 디스크에 덤프하는 man:cron[8] 작업을 사용하여 테이블의 복사본을 유지 관리할 수 있으며, `pfctl -t clients -T show >/etc/clients`와 같은 명령을 사용할 수도 있습니다. 또는 [.filename]#/etc/clients#를 인메모리 테이블 내용으로 업데이트할 수 있습니다:
ru: Обратите внимание, что любые изменения, внесенные таким образом, вступят в силу немедленно, что делает их идеальными для тестирования, но они не сохранятся после отключения питания или перезагрузки. Чтобы сделать изменения постоянными, необходимо изменить определение таблицы в наборе правил или отредактировать файл, на который ссылается таблица. Можно поддерживать копию таблицы на диске с помощью задания man:cron[8], которое периодически сохраняет содержимое таблицы на диск, используя команду вида `pfctl -t clients -T show >/etc/clients`. Или [.filename]#/etc/clients# можно обновить содержимым таблицы из памяти:

source: Using Overload Tables to Protect SSH
ko: 과부하 테이블(Overload Table)을 사용하여 SSH 보호하기
ru: Использование таблиц превышения нагрузки для защиты SSH

source: Those who run SSH on an external interface have probably seen something like this in the authentication logs:
ko: 외부 인터페이스에서 SSH를 실행하는 사용자는 인증 로그에서 이와 같은 내용을 본 적이 있을 것입니다:
ru: Те, кто запускает SSH на внешнем интерфейсе, вероятно, видели что-то подобное в журналах аутентификации:

source: This is indicative of a brute force attack where somebody or some program is trying to discover the user name and password which will let them into the system.
ko: 이는 누군가 또는 어떤 프로그램이 사용자 이름과 비밀번호를 알아내어 시스템에 침입하려는 무차별 대입 공격(Brute force attack)을 나타냅니다.
ru: Это указывает на атаку методом грубой силы, когда кто-то или какая-то программа пытается подобрать имя пользователя и пароль, чтобы получить доступ к системе.

source: If external SSH access is needed for legitimate users, changing the default port used by SSH can offer some protection. However, PF provides a more elegant solution. Pass rules can contain limits on what connecting hosts can do and violators can be banished to a table of addresses which are denied some or all access. It is even possible to drop all existing connections from machines which overreach the limits.
ko: 합법적인 사용자를 위해 외부 SSH 액세스가 필요한 경우, SSH에서 사용하는 기본 포트를 변경하면 어느 정도 보호할 수 있습니다. 하지만 PF는 보다 우아한 솔루션을 제공합니다. 패스 규칙에는 연결 호스트가 수행할 수 있는 작업에 대한 제한이 포함될 수 있으며, 이를 위반하는 호스트는 일부 또는 모든 액세스가 거부되는 주소 테이블로 추방될 수 있습니다. 심지어 한도를 초과하는 컴퓨터에서 기존 연결을 모두 끊을 수도 있습니다.
ru: Если необходим внешний доступ по SSH для законных пользователей, изменение порта по умолчанию, используемого SSH, может обеспечить некоторую защиту. Однако PF предоставляет более элегантное решение. Правила `pass` могут содержать ограничения на действия подключающихся хостов, а нарушители могут быть заблокированы в таблице адресов, которым запрещён частичный или полный доступ. Также возможно разорвать все существующие соединения с машинами, которые превышают установленные ограничения.

source: To configure this, create this table in the tables section of the ruleset:
ko: 이를 구성하려면 규칙 집합의 테이블 섹션에서 다음 테이블을 만듭니다:
ru: Для настройки создайте следующую таблицу в разделе tables набора правил:

source: Then, somewhere early in the ruleset, add rules to block brute access while allowing legitimate access:
ko: 그런 다음 규칙 집합의 앞부분 어딘가에 합법적인 액세스는 허용하면서 무차별 액세스를 차단하는 규칙을 추가하세요:
ru: Затем, где-то в начале набора правил добавьте правила для блокировки перебора, разрешая при этом законный доступ:

source: The part in parentheses defines the limits and the numbers should be changed to meet local requirements. It can be read as follows:
ko: 괄호 안의 부분은 한도를 정의하며 로컬 네트워크 요구사항에 맞게 숫자를 변경해야 합니다. 다음과 같이 읽을 수 있습니다:
ru: Часть в скобках определяет ограничения, и числа должны быть изменены в соответствии с местными требованиями. Это можно прочитать следующим образом:

source: `max-src-conn` is the number of simultaneous connections allowed from one host.
ko: `max-src-conn`은 한 호스트에서 허용되는 동시 연결 수입니다.
ru: `max-src-conn` — это количество одновременных подключений, разрешённых с одного хоста.

source: `max-src-conn-rate` is the rate of new connections allowed from any single host (_15_) per number of seconds (_5_).
ko: `max-src-conn-rate`는 초(_5_) 당 단일 호스트(_15_)에서 허용되는 새 연결의 비율입니다.
ru: `max-src-conn-rate` — это частота новых соединений, разрешённых с любого отдельного хоста (_15_) за указанное количество секунд (_5_).

source: `overload <bruteforce>` means that any host which exceeds these limits gets its address added to the `bruteforce` table. The ruleset blocks all traffic from addresses in the `bruteforce` table.
ko: `overload <bruteforce>`는 이 제한을 초과하는 모든 호스트의 주소가 `bruteforce` 테이블에 추가됨을 의미합니다. 이 규칙 집합은 `bruteforce` 테이블에 있는 주소로부터의 모든 트래픽을 차단합니다.
ru: `overload <bruteforce>` означает, что любой хост, превышающий эти ограничения, добавляет свой адрес в таблицу `bruteforce`. Набор правил блокирует весь трафик с адресов, находящихся в таблице `bruteforce`.

source: Finally, `flush global` says that when a host reaches the limit, that all (`global`) of that host's connections will be terminated (`flush`).
ko: 마지막으로, `flush global`은 호스트가 한도에 도달하면 해당 호스트의 모든(‘global’) 연결이 종료(`flush`)되는 것을 말합니다.
ru: Наконец, `flush global` означает, что когда хост достигает лимита, все (`global`) соединения этого хоста будут разорваны (`flush`).

source: These rules will _not_ block slow bruteforcers, as described in http://home.nuug.no/\~peter/hailmary2013/[http://home.nuug.no/~peter/hailmary2013/].
ko: 이 규칙은 http://home.nuug.no/\~peter/hailmary2013/[http://home.nuug.no/~peter/hailmary2013/]에 설명된 것처럼 느린 bruteforce 공격을 _차단하지_ 않습니다.
ru: Эти правила _не_ заблокируют медленные брутфорсеры, как описано в http://home.nuug.no/\~peter/hailmary2013/[http://home.nuug.no/~peter/hailmary2013/].
