Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: Logging Firewall Messages
ko: 방화벽 메시지 기록하기
ru: Журналирование сообщений межсетевого экрана

source: Even with the logging facility enabled, IPFW will not generate any rule logging on its own. The firewall administrator decides which rules in the ruleset will be logged, and adds the `log` keyword to those rules. Normally only deny rules are logged. It is customary to duplicate the "ipfw default deny everything" rule with the `log` keyword included as the last rule in the ruleset. This way, it is possible to see all the packets that did not match any of the rules in the ruleset.
ko: 로깅 기능이 활성화되어 있어도 IPFW는 자체적으로 규칙 로그를 생성하지 않습니다. 방화벽 관리자는 규칙 집합에서 어떤 규칙을 기록할지 결정하고 해당 규칙에 `log` 키워드를 추가합니다. 일반적으로 거부 규칙만 기록됩니다. `log` 키워드를 규칙 집합의 마지막 규칙으로 포함되는 `ipfw default deny everything` 규칙에 복제하는 것이 일반적입니다. 이렇게 하면 규칙 집합의 규칙과 일치하지 않는 모든 패킷을 볼 수 있습니다.
ru: Даже при включенной функции журналирования, IPFW не будет самостоятельно генерировать записи о правилах. Администратор межсетевого экрана решает, какие правила в наборе правил будут записываться в журнал, и добавляет ключевое слово `log` к этим правилам. Обычно журналируются только правила с действием deny. Принято дублировать правило "ipfw default deny everything" с включенным ключевым словом `log` в качестве последнего правила в наборе. Таким образом, можно увидеть все пакеты, которые не соответствуют ни одному из правил в наборе.

source: Logging is a two edged sword. If one is not careful, an over abundance of log data or a DoS attack can fill the disk with log files. Log messages are not only written to syslogd, but also are displayed on the root console screen and soon become annoying.
ko: 로깅은 양날의 검입니다. 주의하지 않으면 로그 데이터가 지나치게 많거나 DoS 공격으로 인해 디스크가 로그 파일로 가득 찰 수 있습니다. 로그 메시지는 syslogd에 기록될 뿐만 아니라 루트 콘솔 화면에도 표시되어 곧 성가신 일이 됩니다.
ru: Журналирование — это обоюдоострый меч. Если не быть осторожным, переизбыток данных журналирования или атака типа DoS могут заполнить диск файлами журналов. Сообщения журнала записываются не только в syslogd, но и выводятся на корневую консоль, что быстро становится раздражающим.

source: The `IPFIREWALL_VERBOSE_LIMIT=5` kernel option limits the number of consecutive messages sent to man:syslogd[8], concerning the packet matching of a given rule. When this option is enabled in the kernel, the number of consecutive messages concerning a particular rule is capped at the number specified. There is nothing to be gained from 200 identical log messages. With this option set to five, five consecutive messages concerning a particular rule would be logged to syslogd and the remainder identical consecutive messages would be counted and posted to syslogd with a phrase like the following:
ko: `IPFIREWALL_VERBOSE_LIMIT=5` 커널 옵션은 지정된 규칙의 패킷 일치와 관련하여 man:syslogd[8]로 전송되는 연속 메시지 수를 제한합니다. 커널에서 이 옵션을 활성화하면 특정 규칙과 관련된 연속 메시지 수가 지정된 수로 제한됩니다. 200개의 동일한 로그 메시지로는 얻을 수 있는 것이 없습니다. 이 옵션을 5개로 설정하면 특정 규칙과 관련된 연속 메시지 5개가 syslogd에 기록되고 나머지 동일한 연속 메시지가 카운트되어 다음과 같은 문구와 함께 syslogd에 게시됩니다:
ru: Опция ядра `IPFIREWALL_VERBOSE_LIMIT=5` ограничивает количество последовательных сообщений, отправляемых в man:syslogd[8], касающихся совпадения пакетов с заданным правилом. Когда эта опция включена в ядре, количество последовательных сообщений, касающихся определённого правила, ограничивается указанным числом. Нет никакой пользы от 200 одинаковых сообщений в журнале. При установке этого параметра в пять, пять последовательных сообщений, касающихся определённого правила, будут записаны в syslogd, а оставшиеся идентичные последовательные сообщения будут подсчитаны и отправлены в syslogd с фразой, подобной следующей:

source: All logged packets messages are written by default to [.filename]#/var/log/security#, which is defined in [.filename]#/etc/syslog.conf#.
ko: 모든 로깅된 패킷 메시지는 기본적으로 [.filename]#/var/log/security#에 기록되며, 이는 [.filename]#/etc/syslog.conf#에 정의되어 있습니다.
ru: Все сообщения о зарегистрированных пакетах по умолчанию записываются в [.filename]#/var/log/security#, что определено в [.filename]#/etc/syslog.conf#.

source: Building a Rule Script
ko: 규칙 스크립트 작성하기
ru: Построение скрипта правил

source: Most experienced IPFW users create a file containing the rules and code them in a manner compatible with running them as a script. The major benefit of doing this is the firewall rules can be refreshed in mass without the need of rebooting the system to activate them. This method is convenient in testing new rules as the procedure can be executed as many times as needed. Being a script, symbolic substitution can be used for frequently used values to be substituted into multiple rules.
ko: 대부분의 숙련된 IPFW 사용자는 규칙이 포함된 파일을 만들고 이를 스크립트로 실행할 수 있는 방식으로 코딩합니다. 이렇게 하면 방화벽 규칙을 활성화하기 위해 시스템을 재부팅할 필요 없이 방화벽 규칙을 대량으로 새로 고칠 수 있다는 것이 가장 큰 장점입니다. 이 방법은 필요한 만큼 절차를 실행할 수 있으므로 새 규칙을 테스트할 때 편리합니다. 스크립트이기 때문에 자주 사용하는 값을 변수로 치환할 수 있습니다.
ru: Большинство опытных пользователей IPFW создают файл, содержащий правила, и оформляют их таким образом, чтобы их можно было запускать как скрипт. Основное преимущество этого подхода заключается в том, что правила межсетевого экрана можно обновлять массово без необходимости перезагрузки системы для их активации. Этот метод удобен при тестировании новых правил, так как процедуру можно выполнять столько раз, сколько потребуется. Будучи скриптом, можно использовать символические подстановки для часто используемых значений, которые будут заменяться в нескольких правилах.

source: This example script is compatible with the syntax used by the man:sh[1], man:csh[1], and man:tcsh[1] shells. Symbolic substitution fields are prefixed with a dollar sign ($). Symbolic fields do not have the $ prefix. The value to populate the symbolic field must be enclosed in double quotes ("").
ko: 이 예제 스크립트는 man:sh[1], man:csh[1] 및 man:tcsh[1] 셸에서 사용하는 구문과 호환됩니다. 변수 대체 필드 앞에는 달러 기호($)가 붙습니다. 변수 필드에는 $ 접두사가 없습니다. 변수 필드를 채울 값은 큰따옴표(“”)로 묶어야 합니다.
ru: Синтаксис примера, приведенного ниже, совместим с синтаксисом, используемым оболочками man:sh[1], man:csh[1] и man:tcsh[1]. Поля символьной подстановки (переменные — один из видов полей подстановки, прим. перев.) начинаются со знака доллара ($). Символьные поля не имеют префикса $. Значение для заполнения символьного поля должно быть заключено в двойные кавычки ("").

source: Start the rules file like this:
ko: 다음과 같이 규칙 파일을 시작하세요:
ru: Начните файл правил следующим образом:

source: The rules are not important as the focus of this example is how the symbolic substitution fields are populated.
ko: 이 예제에서는 기호 대체 필드가 채워지는 방식에 중점을 두므로 내용 자체는 중요하지 않습니다.
ru: Правила не важны, так как цель этого примера — показать, как заполняются поля символьной подстановки.

source: If the above example was in [.filename]#/etc/ipfw.rules#, the rules could be reloaded by the following command:
ko: 위의 예가 [.filename]#/etc/ipfw.rules#에 있었다면 다음 명령으로 규칙을 다시 로드할 수 있습니다:
ru: Если приведённый выше пример находится в [.filename]#/etc/ipfw.rules#, правила можно перезагрузить следующей командой:

source: [.filename]#/etc/ipfw.rules# can be located anywhere and the file can have any name.
ko: [.filename]#/etc/ipfw.rules#은 어디에나 위치할 수 있으며 파일 이름은 무엇이든 상관없습니다.
ru: [.filename]#/etc/ipfw.rules# может находиться в любом месте, и файл может иметь любое имя.

source: The same thing could be accomplished by running these commands by hand:
ko: 아래의 명령을 직접 실행해도 동일한 작업을 수행할 수 있습니다:
ru: То же самое можно выполнить вручную, запустив следующие команды:

source: IPFW Kernel Options
ko: IPFW 커널옵션
ru: Опции ядра для IPFW

source: In order to statically compile IPFW support into a custom kernel, refer to the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]. The following options are available for the custom kernel configuration file:
ko: 커스텀 커널에 정적으로 IPFW 지원을 컴파일하려면 crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성]의 지침을 참조하십시오. 커스텀 커널 구성 파일에 사용할 수 있는 옵션은 다음과 같습니다:
ru: Для статической компиляции поддержки IPFW в собственное ядро обратитесь к инструкциям в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]. В файле конфигурации собственного ядра доступны следующие параметры:

source: IPFW can be loaded as a kernel module: options above are built by default as modules or can be set at runtime using tunables.
ko: 위의 옵션은 기본적으로 모듈로 빌드되거나 튜너블을 사용하여 런타임에 설정할 수 있습니다.
ru: IPFW может быть загружен как модуль ядра: указанные выше параметры по умолчанию собираются как модули или могут быть установлены во время выполнения с помощью tunables.

source: IPFILTER, also known as IPF, is a cross-platform, open source firewall which has been ported to several operating systems, including FreeBSD, NetBSD, OpenBSD, and Solaris(TM).
ko: IPF라고도 하는 IPFILTER는 크로스 플랫폼 오픈 소스 방화벽으로, FreeBSD, NetBSD, OpenBSD, Solaris(TM) 등 여러 운영 체제에 포팅되어 있습니다.
ru: IPFILTER, также известный как IPF, представляет собой кроссплатформенный межсетевой экран с открытым исходным кодом, который был портирован на несколько операционных систем, включая FreeBSD, NetBSD, OpenBSD и Solaris(TM).

source: IPFILTER is a kernel-side firewall and NAT mechanism that can be controlled and monitored by userland programs. Firewall rules can be set or deleted using ipf, NAT rules can be set or deleted using ipnat, run-time statistics for the kernel parts of IPFILTER can be printed using ipfstat, and ipmon can be used to log IPFILTER actions to the system log files.
ko: IPFILTER는 사용자 프로그램에서 제어 및 모니터링할 수 있는 커널 측 방화벽 및 NAT 메커니즘입니다. 방화벽 규칙은 ipf를 사용하여 설정하거나 삭제할 수 있고, NAT 규칙은 ipnat를 사용하여 설정하거나 삭제할 수 있으며, IPFILTER의 커널 부분에 대한 런타임 통계는 ipfstat를 사용하여 인쇄할 수 있고, ipmon을 사용하여 시스템 로그 파일에 IPFILTER 동작을 기록할 수 있습니다.
ru: IPFILTER — это механизм межсетевого экрана и NAT на уровне ядра, которым можно управлять и отслеживать его работу с помощью пользовательских программ. Правила межсетевого экрана можно устанавливать или удалять с помощью `ipf`, правила NAT — с помощью `ipnat`, статистику работы ядерной части IPFILTER в реальном времени можно выводить с помощью `ipfstat`, а `ipmon` позволяет записывать действия IPFILTER в системные журналы.

source: IPF was originally written using a rule processing logic of "the last matching rule wins" and only used stateless rules. Since then, IPF has been enhanced to include the `quick` and `keep state` options.
ko: IPF는 원래 “마지막으로 일치하는 규칙이 승리”는 규칙 처리 로직을 사용하여 작성되었으며 상태 stateless 규칙만 사용했습니다. 그 이후로 IPF는 `quick` 및 `keep state` 옵션을 포함하도록 개선되었습니다.
ru: IPF изначально был написан с использованием логики обработки правил "последнее совпавшее правило побеждает" и использовал только правила без состояния. С тех пор IPF был улучшен и теперь включает опции `quick` и `keep state`.

source: The IPF FAQ is at http://www.phildev.net/ipf/index.html[http://www.phildev.net/ipf/index.html]. A searchable archive of the IPFilter mailing list is available at http://marc.info/?l=ipfilter[http://marc.info/?l=ipfilter].
ko: IPF FAQ는 http://www.phildev.net/ipf/index.html[http://www.phildev.net/ipf/index.html]에서 확인할 수 있습니다. IPFilter 메일링 리스트의 검색 가능한 아카이브는 http://marc.info/?l=ipfilter[http://marc.info/?l=ipfilter]에서 확인할 수 있습니다.
ru: Часто задаваемые вопросы по IPF находятся на сайте http://www.phildev.net/ipf/index.html[http://www.phildev.net/ipf/index.html]. Доступен поисковый архив списка рассылки IPFilter по адресу http://marc.info/?l=ipfilter[http://marc.info/?l=ipfilter].

source: This section of the Handbook focuses on IPF as it pertains to FreeBSD. It provides examples of rules that contain the `quick` and `keep state` options.
ko: 핸드북의 이 섹션에서는 FreeBSD와 관련된 IPF에 초점을 맞춥니다. 여기서는 `quick` 및 `keep state` 옵션이 포함된 규칙의 예를 제공합니다.
ru: Этот раздел Руководства посвящен IPF в контексте FreeBSD. В нем приведены примеры правил, содержащих опции `quick` и `keep state`.

source: Enabling IPF
ko: IPF 활성화하기
ru: Включение IPF

source: IPF is included in the basic FreeBSD install as a kernel loadable module, meaning that a custom kernel is not needed in order to enable IPF.
ko: IPF는 커널 로딩이 가능한 모듈로 기본 FreeBSD 설치에 포함되어 있으므로 IPF를 활성화하기 위해 커스텀 커널이 필요하지 않습니다.
ru: IPF включён в базовую установку FreeBSD в виде загружаемого модуля ядра, что означает, что для включения IPF не требуется создавать собственное ядро.

source: For users who prefer to statically compile IPF support into a custom kernel, refer to the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]. The following kernel options are available:
ko: 커스텀 커널에 IPF 지원을 정적으로 컴파일하는 것을 선호하는 사용자는 crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성하기]의 지침을 참조하십시오. 다음 커널 옵션을 사용할 수 있습니다:
ru: Для пользователей, которые предпочитают статически компилировать поддержку IPF в пользовательское ядро, обратитесь к инструкциям в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]. Доступны следующие параметры ядра:

source: where `options IPFILTER` enables support for IPFILTER, `options IPFILTER_LOG` enables IPF logging using the [.filename]#ipl# packet logging pseudo-device for every rule that has the `log` keyword, `IPFILTER_LOOKUP` enables IP pools in order to speed up IP lookups, and `options IPFILTER_DEFAULT_BLOCK` changes the default behavior so that any packet not matching a firewall `pass` rule gets blocked.
ko: 여기서 `options IPFILTER`는 IPFILTER 지원을 활성화하고, `options IPFILTER_LOG`는 `log` 키워드가 있는 모든 규칙에 대해 [.filename]#ipl# 패킷 로깅 의사 장치를 사용하여 IPF 로깅을 활성화하며, `IPFILTER_LOOKUP`은 IP 조회 속도를 높이기 위해 IP 풀을 사용하고, `options IPFILTER_DEFAULT_BLOCK`은 방화벽 `pass` 규칙에 맞지 않는 모든 패킷이 차단되도록 기본 동작을 변경합니다.
ru: где `options IPFILTER` включает поддержку IPFILTER, `options IPFILTER_LOG` включает журналирование IPF с использованием псевдоустройства [.filename]#ipl# для записи пакетов для каждого правила, содержащего ключевое слово `log`, `IPFILTER_LOOKUP` включает пулы IP для ускорения поиска IP, а `options IPFILTER_DEFAULT_BLOCK` изменяет поведение по умолчанию так, что любой пакет, не соответствующий правилу `pass` межсетевого экрана, блокируется.

source: To configure the system to enable IPF at boot time, add the following entries to [.filename]#/etc/rc.conf#. These entries will also enable logging and `default pass all`. To change the default policy to `block all` without compiling a custom kernel, remember to add a `block all` rule at the end of the ruleset.
ko: 부팅 시 IPF를 사용하도록 시스템을 구성하려면 [.filename]#/etc/rc.conf#에 다음 항목을 추가합니다. 이 항목은 로깅과 `default pass all`도 활성화합니다. 사용자 정의 커널을 컴파일하지 않고 기본 정책을 `block all`으로 변경하려면 규칙 집합 끝에 `block all` 규칙을 추가하는 것을 잊지 마세요.
ru: Для настройки системы на включение IPF при загрузке добавьте следующие записи в [.filename]#/etc/rc.conf#. Эти записи также включат журналирование и политику `default pass all`. Чтобы изменить политику по умолчанию на `block all` без компиляции пользовательского ядра, не забудьте добавить правило `block all` в конец набора правил.

source: If NAT functionality is needed, also add these lines:
ko: NAT 기능이 필요한 경우 다음 줄도 추가합니다:
ru: Если требуется функциональность NAT, также добавьте следующие строки:

source: Then, to start IPF now:
ko: 이제 IPF를 실행합니다:
ru: Затем, чтобы запустить IPF сейчас:

source: To load the firewall rules, specify the name of the ruleset file using `ipf`. The following command can be used to replace the currently running firewall rules:
ko: 방화벽 규칙을 로드하려면 `ipf`를 사용하여 규칙 집합 파일의 이름을 지정합니다. 다음 명령을 사용하여 현재 실행 중인 방화벽 규칙을 바꿀 수 있습니다:
ru: Для загрузки правил межсетевого экрана укажите имя файла набора правил, используя `ipf`. Следующая команда может быть использована для замены текущих работающих правил межсетевого экрана:

source: where `-Fa` flushes all the internal rules tables and `-f` specifies the file containing the rules to load.
ko: 여기서 `-Fa`는 모든 내부 규칙 테이블을 플러시하고 `-f`는 로드할 규칙이 포함된 파일을 지정합니다.
ru: где `-Fa` очищает все внутренние таблицы правил, а `-f` указывает файл, содержащий правила для загрузки.

source: This provides the ability to make changes to a custom ruleset and update the running firewall with a fresh copy of the rules without having to reboot the system. This method is convenient for testing new rules as the procedure can be executed as many times as needed.
ko: 이렇게 하면 시스템을 재부팅하지 않고도 사용자 지정 규칙 집합을 변경하고 실행 중인 방화벽을 규칙의 새 복사본으로 업데이트할 수 있습니다. 이 방법은 필요한 만큼 얼마든지 절차를 실행할 수 있으므로 새 규칙을 테스트할 때 편리합니다.
ru: Это предоставляет возможность вносить изменения в пользовательский набор правил и обновлять работающий межсетевой экран новой копией правил без необходимости перезагрузки системы. Этот метод удобен для тестирования новых правил, так как процедуру можно выполнять столько раз, сколько потребуется.

source: Refer to man:ipf[8] for details on the other flags available with this command.
ko: 이 명령으로 사용할 수 있는 다른 플래그에 대한 자세한 내용은 man:ipf[8]을 참조하세요.
ru: Обратитесь к man:ipf[8] для получения подробностей о других флагах, доступных с этой командой.

source: IPF Rule Syntax
ko: IPF 규칙 문법
ru: Синтаксис правил IPF

source: This section describes the IPF rule syntax used to create stateful rules. When creating rules, keep in mind that unless the `quick` keyword appears in a rule, every rule is read in order, with the _last matching rule_ being the one that is applied. This means that even if the first rule to match a packet is a `pass`, if there is a later matching rule that is a `block`, the packet will be dropped. Sample rulesets can be found in [.filename]#/usr/share/examples/ipfilter#.
ko: 이 섹션에서는 상태분석형(Stateful) 규칙을 만드는 데 사용되는 IPF 규칙 구문에 대해 설명합니다. 규칙을 만들 때, 규칙에 ‘quick’ 키워드가 나타나지 않는 한, 모든 규칙은 순서대로 읽혀지며, _마지막에 매칭되는 규칙_이 적용되는 규칙이라는 점에 유의하세요. 즉, 패킷을 일치시키는 첫 번째 규칙이 `pass`라 하더라도 나중에 일치하는 규칙이 `block`인 경우 패킷이 삭제됩니다. 샘플 규칙 세트는 [.filename]#/usr/share/examples/ipfilter#에서 찾을 수 있습니다.
ru: В этом разделе описывается синтаксис правил IPF, используемый для создания правил с состояниями. При создании правил следует помнить, что если в правиле не указано ключевое слово `quick`, каждое правило обрабатывается по порядку, и _последнее совпавшее правило_ будет применено. Это означает, что даже если первое совпавшее правило разрешает (`pass`), но далее есть совпадающее правило, которое запрещает (`block`), пакет будет отброшен. Примеры наборов правил можно найти в [.filename]#/usr/share/examples/ipfilter#.

source: When creating rules, a `+#+` character is used to mark the start of a comment and may appear at the end of a rule, to explain that rule's function, or on its own line. Any blank lines are ignored.
ko: 규칙을 만들 때 `+#+` 문자는 주석의 시작을 표시하는 데 사용되며, 규칙의 끝이나 해당 규칙의 기능을 설명하기 위해, 또는 그 자체 줄에 표시될 수 있습니다. 빈 줄은 무시됩니다.
ru: При создании правил символ `+#+` используется для обозначения начала комментария и может находиться в конце правила, чтобы пояснить его функцию, или на отдельной строке. Пустые строки игнорируются.

source: The keywords which are used in rules must be written in a specific order, from left to right. Some keywords are mandatory while others are optional. Some keywords have sub-options which may be keywords themselves and also include more sub-options. The keyword order is as follows, where the words shown in uppercase represent a variable and the words shown in lowercase must precede the variable that follows it:
ko: 규칙에 사용되는 키워드는 왼쪽에서 오른쪽으로 특정 순서로 작성해야 합니다. 일부 키워드는 필수인 반면 다른 키워드는 선택 사항입니다. 일부 키워드에는 키워드 자체가 될 수도 있고 더 많은 하위 옵션이 포함될 수도 있는 하위 옵션이 있습니다. 키워드 순서는 다음과 같으며, 대문자로 표시된 단어는 변수를 나타내고 소문자로 표시된 단어는 그 뒤에 오는 변수 앞에 와야 합니다:
ru: Ключевые слова, используемые в правилах, должны быть записаны в определенном порядке, слева направо. Некоторые ключевые слова являются обязательными, а другие — опциональными. Некоторые ключевые слова имеют подопции, которые могут сами быть ключевыми словами и включать дополнительные подопции. Порядок ключевых слов следующий, где слова, написанные в ВЕРХНЕМ РЕГИСТРЕ, представляют переменную, а слова, написанные в нижнем регистре, должны предшествовать следующей за ними переменной:

source: This section describes each of these keywords and their options. It is not an exhaustive list of every possible option. Refer to man:ipf[5] for a complete description of the rule syntax that can be used when creating IPF rules and examples for using each keyword.
ko: 이 섹션에서는 이러한 각 키워드와 해당 옵션에 대해 설명합니다. 가능한 모든 옵션의 전체 목록은 아닙니다. IPF 규칙을 만들 때 사용할 수 있는 규칙 구문과 각 키워드 사용 예제에 대한 자세한 설명은 man:ipf[5]를 참조하세요.
ru: В этом разделе описываются ключевые слова и их параметры. Это не исчерпывающий список всех возможных параметров. Полное описание синтаксиса правил, который можно использовать при создании правил IPF, а также примеры использования каждого ключевого слова приведены в man:ipf[5].

source: The action keyword indicates what to do with the packet if it matches that rule. Every rule _must_ have an action. The following actions are recognized:
ko: 액션 키워드는 해당 규칙과 일치하는 패킷이 있을 경우 수행할 작업을 나타냅니다. 모든 규칙에는 반드시 액션이 있어야 합니다. 다음과 같은 액션이 인식됩니다:
ru: Ключевое слово `action` указывает действие — что делать с пакетом, если он соответствует данному правилу. Каждое правило _должно_ иметь действие. Поддерживаются следующие действия:

source: `block`: drops the packet.
ko: `block`: 패킷을 폐기함.
ru: `block`: отбрасывает пакет.

source: `pass`: allows the packet.
ko: `pass`: 패킹의 통과를 허용함.
ru: `pass`: разрешает пакет.

source: `log`: generates a log record.
ko: `log`: 로그를 기록함.
ru: `log`: создает запись в журнале.

source: `count`: counts the number of packets and bytes which can provide an indication of how often a rule is used.
ko: `count`: 규칙이 얼마나 자주 사용되는지 지표로 사용할 수 있는 패킷과 바이트의 수를 계산함.
ru: `count`: подсчитывает количество пакетов и байтов, что может дать представление о том, как часто используется правило.

source: `auth`: queues the packet for further processing by another program.
ko: `auth`: 다른 프로그램에서 추가 처리를 위해 패킷을 대기열에 넣음.
ru: `auth`: ставит пакет в очередь для дальнейшей обработки другой программой.

source: `call`: provides access to functions built into IPF that allow more complex actions.
ko: `call`: 보다 복잡한 작업을 허용하는 IPF에 내장된 함수에 대한 액세스를 제공.
ru: `call`: предоставляет доступ к функциям, встроенным в IPF, которые позволяют выполнять более сложные действия.

source: `decapsulate`: removes any headers in order to process the contents of the packet.
ko: `decapsulate`: 패킷의 내용을 처리하기 위해 모든 헤더를 제거함.
ru: `decapsulate`: удаляет любые заголовки для обработки содержимого пакета.

source: Next, each rule must explicitly state the direction of traffic using one of these keywords:
ko: 다음으로, 각 규칙은 아래의 키워드 중 하나를 사용하여 트래픽의 방향을 명시적으로 지정해야 합니다:
ru: Далее, каждое правило должно явно указывать `direction ` — направление трафика с использованием одного из следующих ключевых слов:

source: `in`: the rule is applied against an inbound packet.
ko: `in`: 인바운드 패킷에 대해 규칙이 적용.
ru: `in`: правило применяется к входящему пакету.

source: `out`: the rule is applied against an outbound packet.
ko: `out`: 아웃바운드 패킷에 대해 규칙이 적용.
ru: `out`: правило применяется к исходящему пакету.

source: `all`: the rule applies to either direction.
ko: `all`: 양방향 모두 규칙이 적용.
ru: `all`: правило применяется в обоих направлениях.

source: If the system has multiple interfaces, the interface can be specified along with the direction. An example would be `in on fxp0`.
ko: 시스템에 여러 인터페이스가 있는 경우 방향과 함께 인터페이스를 지정할 수 있습니다. 예를 들어 `in on fxp0`이 있습니다.
ru: Если в системе несколько интерфейсов, можно указать интерфейс вместе с направлением. Примером может быть `in on fxp0`.

source: Options are optional. However, if multiple options are specified, they must be used in the order shown here.
ko: 옵션은 선택 사항입니다. 그러나 여러 옵션을 지정하는 경우 여기에 표시된 순서대로 사용해야 합니다.
ru: `options` — параметры необязательны. Однако, если указано несколько параметров, они должны использоваться в порядке, указанном здесь.

source: `log`: when performing the specified ACTION, the contents of the packet's headers will be written to the man:ipl[4] packet log pseudo-device.
ko: `log`: 지정된 ACTION을 수행할 때 패킷 헤더의 내용이 man:ipl[4] 패킷 로그 의사 장치에 기록됩니다.
ru: `log`: при выполнении указанного ДЕЙСТВИЯ содержимое заголовков пакета будет записано в псевдоустройство журнала пакетов man:ipl[4].
