Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: This example ruleset is intended mainly as an illustration. For example, if a generous number of connections in general are wanted, but the desire is to be more restrictive when it comes to ssh, supplement the rule above with something like the one below, early on in the rule set:
ko: 이 예제 규칙 집합은 주로 설명을 위한 것입니다. 예를 들어, 일반적으로 많은 수의 연결을 허용하고 싶지만 ssh에 대해서는 더 제한적으로 허용하고 싶은 경우 규칙 집합 앞부분에 위 규칙을 아래와 같이 보완합니다:
ru: Этот пример набора правил предназначен в основном для иллюстрации. Например, если требуется разрешить большое количество соединений в целом, но необходимо быть более строгим в отношении ssh, дополните приведенное выше правило чем-то вроде следующего, в начале набора правил:

source: *It May Not be Necessary to Block All Overloaders:* +
ko: *모든 오버로드를 차단할 필요는 없을 수도 있습니다:* +

source: It is worth noting that the overload mechanism is a general technique which does not apply exclusively to SSH, and it is not always optimal to entirely block all traffic from offenders.
ko: 과부하 메커니즘은 SSH에만 적용되는 것이 아닌 일반적인 기술이며, 공격자의 모든 트래픽을 완전히 차단하는 것이 항상 최선은 아니라는 점에 유의할 필요가 있습니다.
ru: Стоит отметить, что механизм превышения нагрузки — это общий метод, который применяется не только к SSH, и не всегда оптимально полностью блокировать весь трафик от нарушителей.

source: For example, an overload rule could be used to protect a mail service or a web service, and the overload table could be used in a rule to assign offenders to a queue with a minimal bandwidth allocation or to redirect to a specific web page.
ko: 예를 들어, 과부하 규칙을 사용하여 메일 서비스 또는 웹 서비스를 보호하고, 과부하 테이블을 규칙에 사용하여 최소 대역폭 할당으로 위반자를 대기열에 할당하거나 특정 웹 페이지로 리디렉션하는 데 사용할 수 있습니다.
ru: Например, правило превышения нагрузки может использоваться для защиты почтовой службы или веб-сервиса, а таблица превышения нагрузки может применяться в правиле для назначения нарушителей в очередь с минимальным выделением пропускной способности или для перенаправления на определённую веб-страницу.

source: Over time, tables will be filled by overload rules and their size will grow incrementally, taking up more memory. Sometimes an IP address that is blocked is a dynamically assigned one, which has since been assigned to a host who has a legitimate reason to communicate with hosts in the local network.
ko: 시간이 지남에 따라 테이블은 과부하 규칙에 의해 채워지고 크기가 점점 커져 더 많은 메모리를 차지하게 됩니다. 차단된 IP 주소는 로컬 네트워크의 호스트와 통신할 정당한 이유가 있는 호스트에 할당된 동적으로 할당된 주소인 경우도 있습니다.
ru: Со временем таблицы будут заполняться правилами превышения нагрузки, и их размер будет постепенно увеличиваться, занимая больше памяти. Иногда заблокированный IP-адрес оказывается динамически назначенным, который с тех пор был выделен хосту, имеющему законные основания для взаимодействия с хостами в локальной сети.

source: For situations like these, pfctl provides the ability to expire table entries. For example, this command will remove `<bruteforce>` table entries which have not been referenced for `86400` seconds:
ko: 이와 같은 상황에서 pfctl은 테이블 항목을 만료하는 기능을 제공합니다. 예를 들어, 이 명령은 `86400`초 동안 참조되지 않은 `<bruteforce>` 테이블 항목을 제거합니다:
ru: Для подобных ситуаций `pfctl` предоставляет возможность удалять записи из таблиц. Например, следующая команда удалит записи из таблицы `<bruteforce>`, к которым не было обращений в течение `86400` секунд:

source: Similar functionality is provided by package:security/expiretable[], which removes table entries which have not been accessed for a specified period of time.
ko: 지정된 기간 동안 액세스하지 않은 테이블 항목을 제거하는 package:security/expiretable[]도 비슷한 기능을 제공합니다.
ru: Аналогичную функциональность предоставляет пакет package:security/expiretable[], который удаляет записи таблицы, к которым не было обращений в течение указанного периода времени.

source: Once installed, expiretable can be run to remove `<bruteforce>` table entries older than a specified age. This example removes all entries older than 24 hours:
ko: 설치가 완료되면 expiretable을 실행하여 지정된 기간보다 오래된 `<bruteforce>` 테이블 항목을 제거할 수 있습니다. 이 예에서는 24시간이 지난 모든 항목을 제거합니다:
ru: После установки `expiretable` можно запустить для удаления записей из таблицы `<bruteforce>`, которые старше указанного времени. В этом примере удаляются все записи старше 24 часов:

source: Protecting Against SPAM
ko: 스팸으로부터 보호하기
ru: Защита от SPAM

source: Not to be confused with the spamd daemon which comes bundled with spamassassin, package:mail/spamd[] can be configured with PF to provide an outer defense against SPAM. This spamd hooks into the PF configuration using a set of redirections.
ko: 스팸어쌔신과 함께 번들로 제공되는 spamd 데몬과 혼동하지 않도록 패키지:mail/spamd[]를 PF로 구성하여 스팸에 대한 외부 방어 기능을 제공할 수 있습니다. 이 spamd는 일련의 리디렉션을 사용하여 PF 구성에 연결됩니다.
ru: package:mail/spamd[] можно настроить совместно с PF для обеспечения внешней защиты от SPAM (Не путайте его с демоном spamd, который поставляется вместе с spamassassin). Этот spamd интегрируется в конфигурацию PF с помощью набора перенаправлений.

source: Spammers tend to send a large number of messages, and SPAM is mainly sent from a few spammer friendly networks and a large number of hijacked machines, both of which are reported to _blocklists_ fairly quickly.
ko: 스팸 발송자는 대량의 메시지를 보내는 경향이 있으며, 스팸은 주로 스팸 발송자에게 우호적인 소수의 네트워크와 다수의 하이재킹된 컴퓨터에서 발송되기 때문에, 이 두 가지 모두 _차단 목록_에 상당히 빠르게 보고됩니다.
ru: Спамеры обычно рассылают большое количество сообщений, и СПАМ в основном отправляется из нескольких дружественных к спамерам сетей и множества взломанных машин, которые быстро попадают в _списки блокировки_.

source: When an SMTP connection from an address in a blocklist is received, spamd presents its banner and immediately switches to a mode where it answers SMTP traffic one byte at a time. This technique, which is intended to waste as much time as possible on the spammer's end, is called _tarpitting_. The specific implementation which uses one byte SMTP replies is often referred to as _stuttering_.
ko: 차단 목록에 있는 주소로부터 SMTP 연결이 수신되면 스팸 데몬(spamd)은 배너를 표시하고 즉시 한 번에 한 바이트씩 SMTP 트래픽에 응답하는 모드로 전환합니다. 스팸 발송자의 입장에서 최대한 많은 시간을 낭비하게 만드는 이 기법을 _타피팅(tarpitting)_이라고 합니다. 1바이트 SMTP 회신을 사용하는 특정 구현을 종종 _스터터링(stuttering)_이라고 합니다.
ru: Когда SMTP-соединение с адреса из блок-листа получено, spamd отображает свой баннер и немедленно переключается в режим, где он отвечает на SMTP-трафик по одному байту за раз. Эта техника, предназначенная для максимально возможной потери времени на стороне спамера, называется _тарпиттинг_ (tarpitting, намеренное замедление). Конкретная реализация, использующая однобайтовые SMTP-ответы, часто упоминается как _прерывистые ответы_ (stuttering, метод заикания).

source: This example demonstrates the basic procedure for setting up spamd with automatically updated blocklists. Refer to the man pages which are installed with package:mail/spamd[] for more information.
ko: 이 예는 자동으로 업데이트되는 차단 목록으로 스팸 차단을 설정하는 기본 절차를 보여 줍니다. 자세한 내용은 package:mail/spamd[]와 함께 설치되어 있는 매뉴얼 페이지를 참조하세요.
ru: В этом примере показана базовая процедура настройки spamd с автоматически обновляемыми списками блокировки. Для получения дополнительной информации обратитесь к руководствам, которые устанавливаются вместе с пакетом package:mail/spamd[].

source: Procedure: Configuring spamd
ko: 절차: spamd 구성하기
ru: Процедура: Настройка spamd

source: Install the package:mail/spamd[] package or port. To use spamd's greylisting features, man:fdescfs[5] must be mounted at [.filename]#/dev/fd#. Add the following line to [.filename]#/etc/fstab#:
ko: package:mail/spamd[] 패키지 또는 포트를 설치합니다. spamd의 그레이리스트 기능을 사용하려면 man:fdescfs[5]를 [.filename]#/dev/fd#에 마운트해야 합니다. 다음 줄을 [.filename]#/etc/fstab#에 추가합니다:
ru: Установите пакет package:mail/spamd[] или порт. Для использования функции серого списка (greylisting) в spamd, необходимо подключить man:fdescfs[5] в [.filename]#/dev/fd#. Добавьте следующую строку в [.filename]#/etc/fstab#:

source: Then, mount the filesystem:
ko: 그리고 나서 파일 시스템을 마운트합니다:
ru: Затем смонтируйте файловую систему:

source: Next, edit the PF ruleset to include:
ko: 다음으로, PF 규칙세트에 아래의 내용을 추가합니다:
ru: Далее отредактируйте набор правил PF, включив:

source: The two tables `<spamd>` and `<spamd-white>` are essential. SMTP traffic from an address listed in `<spamd>` but not in `<spamd-white>` is redirected to the spamd daemon listening at port 8025.
ko: 두 개의 테이블 `<spamd>`와 `<spamd-white>`는 필수입니다. `<spamd>`에 나열되어 있지만 `<spamd-white>`에 없는 주소로부터의 SMTP 트래픽은 포트 8025에서 수신 대기 중인 spamd 데몬으로 리디렉션됩니다.
ru: Две таблицы `<spamd>` и `<spamd-white>` являются обязательными. SMTP-трафик с адреса, указанного в `<spamd>`, но отсутствующего в `<spamd-white>`, перенаправляется к демону spamd, ожидающему на порту 8025.

source: The next step is to configure spamd in [.filename]#/usr/local/etc/spamd.conf# and to add some [.filename]#rc.conf# parameters.
ko: 다음 단계는 [.filename]#/usr/local/etc/spamd.conf#에서 spamd를 구성하고 [.filename]#rc.conf# 매개변수를 추가하는 것입니다.
ru: Следующий шаг — настроить spamd в [.filename]#/usr/local/etc/spamd.conf# и добавить параметры в [.filename]#rc.conf#.

source: The installation of package:mail/spamd[] includes a sample configuration file ([.filename]#/usr/local/etc/spamd.conf.sample#) and a man page for [.filename]#spamd.conf#. Refer to these for additional configuration options beyond those shown in this example.
ko: package:mail/spamd[] 설치에는 샘플 구성 파일([.filename]#/usr/local/etc/spamd.conf.sample#)과 [.filename]#spamd.conf#에 대한 매뉴얼 페이지가 포함되어 있습니다. 이 예제에 표시된 것 외에 추가 구성 옵션은 여기를 참조하세요.
ru: Установка пакета package:mail/spamd[] включает образец файла конфигурации ([.filename]#/usr/local/etc/spamd.conf.sample#) и man-страницу для [.filename]#spamd.conf#. Обратитесь к ним для получения дополнительных параметров конфигурации, помимо показанных в этом примере.

source: One of the first lines in the configuration file that does not begin with a `+#+` comment sign contains the block which defines the `all` list, which specifies the lists to use:
ko: 구성 파일의 첫 번째 줄 중 `+#+` 주석 기호로 시작하지 않는 줄에는 사용할 목록을 지정하는 `all` 목록을 정의하는 블록이 포함되어 있습니다:
ru: Одна из первых строк в файле конфигурации, которая не начинается с символа комментария `+#+`, содержит блок, определяющий список `all`, который указывает списки для использования:

source: This entry adds the desired blocklists, separated by colons (`:`). To use an allowlist to subtract addresses from a blocklist, add the name of the allowlist _immediately_ after the name of that blocklist. For example: `:blocklist:allowlist:`.
ko: 이 항목은 콜론(`:`)으로 구분하여 원하는 차단 목록을 추가합니다. 허용 목록을 사용하여 차단 목록에서 주소를 빼려면 해당 차단 목록의 이름 뒤에 허용 목록의 이름을 _즉시_ 추가합니다. 예: `:차단목록:허용목록:`.
ru: Эта запись добавляет желаемые списки блокировок, разделённые двоеточиями (`:`). Чтобы использовать список разрешений для исключения адресов из списка блокировок, добавьте имя списка разрешений _непосредственно_ после имени этого списка блокировок. Например: `:blocklist:allowlist:`.

source: This is followed by the specified blocklist's definition:
ko: 다음은 지정된 차단 목록의 정의입니다:
ru: За этим следует определение указанного списка блокировки:

source: where the first line is the name of the blocklist and the second line specifies the list type. The `msg` field contains the message to display to blocklisted senders during the SMTP dialogue. The `method` field specifies how spamd-setup fetches the list data; supported methods are `http`, `ftp`, from a `file` in a mounted file system, and via `exec` of an external program. Finally, the `file` field specifies the name of the file spamd expects to receive.
ko: 여기서 첫 번째 줄은 차단 목록의 이름이고 두 번째 줄은 목록 유형을 지정합니다. `msg` 필드에는 SMTP 대화 중에 차단 목록에 있는 발신자에게 표시할 메시지가 포함됩니다. `method` 필드는 스팸 설정에서 목록 데이터를 가져오는 방법을 지정합니다. 지원되는 메서드는 `http`, `ftp`, 마운트된 파일 시스템의 `file`에서, 외부 프로그램의 `exec`을 통해 가져오는 방법이 있습니다. 마지막으로, `file` 필드는 spamd가 수신할 것으로 예상되는 파일의 이름을 지정합니다.
ru: где первая строка — это имя списка блокировки, а вторая строка определяет тип списка. Поле `msg` содержит сообщение, которое будет отображаться заблокированным отправителям во время SMTP-диалога. Поле `method` указывает, каким образом spamd-setup получает данные списка; поддерживаемые методы — `http`, `ftp`, из `file` в смонтированной файловой системе и через `exec` внешней программы. Наконец, поле `file` определяет имя файла, который ожидает получить spamd.

source: The definition of the specified allowlist is similar, but omits the `msg` field since a message is not needed:
ko: 지정된 허용 목록의 정의는 비슷하지만 메시지가 필요하지 않으므로 `msg` 필드가 생략됩니다:
ru: Определение указанного разрешенного списка аналогично, но опускает поле `msg`, так как сообщение не требуется:

source: *Choose Data Sources with Care:* +
ko: *주의해서 원 자료를 선택하세요:* +

source: Using all the blocklists in the sample [.filename]#spamd.conf# will block large blocks of the Internet. Administrators need to edit the file to create an optimal configuration which uses applicable data sources and, when necessary, uses custom lists.
ko: 샘플 [.filename]#spamd.conf#에 있는 모든 차단 목록을 사용하면 대량의 인터넷 블록을 차단할 수 있습니다. 관리자는 파일을 편집하여 해당 데이터 소스를 사용하고 필요한 경우 사용자 지정 목록을 사용하는 최적의 구성을 만들어야 합니다.
ru: Использование всех блокирующих списков в примере [.filename]#spamd.conf# приведет к блокировке больших сегментов Интернета. Администраторам необходимо отредактировать файл, чтобы создать оптимальную конфигурацию, которая использует подходящие источники данных и, при необходимости, пользовательские списки.

source: Next, add this entry to [.filename]#/etc/rc.conf#. Additional flags are described in the man page specified by the comment:
ko: 그런 다음 [.filename]#/etc/rc.conf#에 다음 항목을 추가합니다. 추가 플래그는 주석으로 지정된 매뉴얼 페이지에 설명되어 있습니다:
ru: Далее добавьте эту запись в [.filename]#/etc/rc.conf#. Дополнительные флаги описаны в man-странице, указанной в комментарии:

source: When finished, reload the ruleset, start spamd by typing `service obspamd start`, and complete the configuration using `spamd-setup`. Finally, create a man:cron[8] job which calls `spamd-setup` to update the tables at reasonable intervals.
ko: 완료되면 규칙 집합을 다시 로드하고, `service obspamd start`를 입력하여 데몬을 시작한 후, `spamd-setup`을 사용하여 구성을 완료합니다. 마지막으로, `spamd-setup`을 호출하여 적절한 간격으로 테이블을 업데이트하는 man:cron[8] 작업을 생성합니다.
ru: После завершения перезагрузите набор правил, запустите spamd командой `service obspamd start` и завершите настройку с помощью `spamd-setup`. Наконец, создайте задание в man:cron[8], которое будет вызывать `spamd-setup` для обновления таблиц через разумные промежутки времени.

source: On a typical gateway in front of a mail server, hosts will soon start getting trapped within a few seconds to several minutes.
ko: 메일 서버 앞의 일반적인 게이트웨이에서는 호스트가 몇 초에서 몇 분 내에 걸리기 시작합니다.
ru: На типичном шлюзе перед почтовым сервером узлы начнут попадать в ловушку в течение от нескольких секунд до нескольких минут.

source: PF also supports _greylisting_, which temporarily rejects messages from unknown hosts with _45n_ codes. Messages from greylisted hosts which try again within a reasonable time are let through. Traffic from senders which are set up to behave within the limits set by RFC 1123 and RFC 2821 are immediately let through.
ko: PF는 _45n_ 코드가 포함된, 알 수 없는 호스트의 메시지를 일시적으로 거부하는 _그레이 리스트_ 기능도 지원합니다. 그레이 리스트에 등록된 호스트가 합리적인 시간 내에 다시 시도하는 메시지는 통과됩니다. RFC 1123 및 RFC 2821에 설정된 제한 내에서 동작하도록 설정된 발신자의 트래픽은 즉시 통과됩니다.
ru: PF также поддерживает _greylisting_, который временно отклоняет сообщения от неизвестных хостов с кодами _45n_. Сообщения от хостов, находящихся в greylisting, которые повторяют попытку в разумные сроки, пропускаются. Трафик от отправителей, настроенных на работу в пределах, установленных RFC 1123 и RFC 2821, пропускается сразу.

source: More information about greylisting as a technique can be found at the http://www.greylisting.org/[greylisting.org] web site. The most amazing thing about greylisting, apart from its simplicity, is that it still works. Spammers and malware writers have been very slow to adapt to bypass this technique.
ko: 그레이 리스팅 기법에 대한 자세한 내용은 http://www.greylisting.org/[greylisting.org] 웹 사이트에서 확인할 수 있습니다. 그레이 리스팅의 가장 놀라운 점은 단순함을 제외하면 여전히 작동한다는 것입니다. 스팸 발송자와 멀웨어 작성자는 이 기법을 우회하는 데 매우 느리게 적응해 왔습니다.
ru: Дополнительная информация о методе серых списков (greylisting) доступна на сайте http://www.greylisting.org/[greylisting.org]. Самое удивительное в серых списках, помимо их простоты, это то, что они до сих пор работают. Спамеры и авторы вредоносного ПО очень медленно адаптируются, чтобы обойти этот метод.

source: The basic procedure for configuring greylisting is as follows:
ko: 그레이 리스팅을 구성하는 기본 절차는 다음과 같습니다:
ru: Основная процедура настройки серого списка выглядит следующим образом:

source: Procedure: Configuring Greylisting
ko: 절차: 그레이리스트 구성하기
ru: Процедура: Настройка серого списка

source: Make sure that man:fdescfs[5] is mounted as described in Step 1 of the previous Procedure.
ko: 이전 절차의 1단계에 설명된 대로 man:fdescfs[5]가 마운트되었는지 확인합니다.
ru: Убедитесь, что man:fdescfs[5] смонтирован, как описано в Шаге 1 предыдущей процедуры.

source: To run spamd in greylisting mode, add this line to [.filename]#/etc/rc.conf#:
ko: 그레이리스트 모드에서 spamd를 실행하려면 [.filename]#/etc/rc.conf#에 이 줄을 추가하세요:
ru: Для запуска spamd в режиме серого списка добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: Refer to the spamd man page for descriptions of additional related parameters.
ko: 기타 관련 매개변수에 대한 설명은 spamd 매뉴얼 페이지를 참조하세요.
ru: Обратитесь к man-странице spamd для описания дополнительных параметров, относящихся к серым спискам.

source: To complete the greylisting setup:
ko: 그레이리스트 설정 완료하려면:
ru: Для завершения настройки серого списка:

source: Behind the scenes, the spamdb database tool and the spamlogd whitelist updater perform essential functions for the greylisting feature. spamdb is the administrator's main interface to managing the block, grey, and allow lists via the contents of the [.filename]#/var/db/spamdb# database.
ko: 배후에서 spamdb 데이터베이스 도구와 spamlogd 화이트리스트 업데이터는 그레이리스트 기능에 필수적인 기능을 수행합니다. spamdb는 [.filename]#/var/db/spamdb# 데이터베이스의 내용을 통해 차단, 그레이, 허용 목록을 관리하는 관리자의 기본 인터페이스입니다.
ru: За кулисами инструмент базы данных spamdb и обновляющий белый список spamlogd выполняют важные функции для механизма отложенной доставки. spamdb — это основной интерфейс администратора для управления списками блокировки, серого списка и списка с разрешениями через содержимое базы данных [.filename]#/var/db/spamdb#.

source: Network Hygiene
ko: 네트워크 위생
ru: Сетевая гигиена

source: This section describes how `block-policy`, `scrub`, and `antispoof` can be used to make the ruleset behave sanely.
ko: 이 섹션에서는 규칙 집합이 정상적으로 작동하도록 하기 위해 `block-policy`, `scrub`, `antispoof`를 사용하는 방법에 대해 설명합니다.
ru: В этом разделе описывается, как `block-policy`, `scrub` и `antispoof` могут быть использованы для обеспечения разумного поведения набора правил.

source: The `block-policy` is an option which can be set in the `options` part of the ruleset, which precedes the redirection and filtering rules. This option determines which feedback, if any, PF sends to hosts that are blocked by a rule. The option has two possible values: `drop` drops blocked packets with no feedback, and `return` returns a status code such as `Connection refused`.
ko: `block-policy`은 리디렉션 및 필터링 규칙 앞에 있는 규칙 집합의 `options` 부분에서 설정할 수 있습니다. 이 옵션은 PF가 규칙에 의해 차단된 호스트에 어떤 피드백(있는 경우)을 보낼지 결정합니다. 이 옵션에는 두 가지 가능한 값이 있습니다: `drop`은 피드백 없이 차단된 패킷을 삭제하고 `return`은 `Connection refused`와 같은 상태 코드를 반환합니다.
ru: `block-policy` — это опция, которую можно установить в разделе `options` набора правил, предшествующем правилам перенаправления и фильтрации. Эта опция определяет, какую обратную связь (если таковая имеется) PF отправляет хостам, заблокированным правилом. Опция имеет два возможных значения: `drop` отбрасывает заблокированные пакеты без ответа, а `return` возвращает код состояния, например `Connection refused`.

source: If not set, the default policy is `drop`. To change the `block-policy`, specify the desired value:
ko: 설정하지 않으면 기본 정책은 `drop`입니다. `block-policy`을 변경하려면 원하는 값을 지정합니다:
ru: Если не задано, политика по умолчанию — `drop`. Чтобы изменить `block-policy`, укажите желаемое значение:

source: In PF, `scrub` is a keyword which enables network packet normalization. This process reassembles fragmented packets and drops TCP packets that have invalid flag combinations. Enabling `scrub` provides a measure of protection against certain kinds of attacks based on incorrect handling of packet fragments. A number of options are available, but the simplest form is suitable for most configurations:
ko: PF에서 `scrub`은 네트워크 패킷 정규화를 가능하게 하는 키워드입니다. 이 프로세스는 조각난 패킷을 재조립하고 잘못된 플래그 조합을 가진 TCP 패킷을 삭제합니다. `scrub`을 활성화하면 패킷 조각의 잘못된 처리를 기반으로 하는 특정 종류의 공격에 대한 보호 수단을 제공합니다. 여러 가지 옵션을 사용할 수 있지만 가장 간단한 형태가 대부분의 구성에 적합합니다:
ru: В PF `scrub` — это ключевое слово, которое включает нормализацию сетевых пакетов. Этот процесс пересобирает фрагментированные пакеты и отбрасывает TCP-пакеты с недопустимыми комбинациями флагов. Включение `scrub` обеспечивает защиту от определённых видов атак, основанных на некорректной обработке фрагментов пакетов. Доступно несколько опций, но простейшая форма подходит для большинства конфигураций:

source: Some services, such as NFS, require specific fragment handling options. Refer to https://home.nuug.no/\~peter/pf/en/scrub.html[https://home.nuug.no/~peter/pf/en/scrub.html] for more information.
ko: NFS와 같은 일부 서비스에는 특정 조각 처리 옵션이 필요합니다. 자세한 내용은 https://home.nuug.no/\~peter/pf/en/scrub.html[https://home.nuug.no/~peter/pf/en/scrub.html]을 참조하세요.
ru: Некоторые службы, такие как NFS, требуют специальных параметров обработки фрагментов. Дополнительную информацию можно найти по ссылке https://home.nuug.no/~peter/pf/en/scrub.html[https://home.nuug.no/~peter/pf/en/scrub.html].

source: This example reassembles fragments, clears the "do not fragment" bit, and sets the maximum segment size to 1440 bytes:
ko: 이 예제에서는 조각을 재조립하고 “do not fragment” 비트를 지운 다음 최대 세그먼트 크기를 1440바이트로 설정합니다:
ru: Этот пример собирает фрагменты, сбрасывает бит "не фрагментировать" и устанавливает максимальный размер сегмента в 1440 байт:

source: The `antispoof` mechanism protects against activity from spoofed or forged IP addresses, mainly by blocking packets appearing on interfaces and in directions which are logically not possible.
ko: `antispoof`메커니즘은 주로 논리적으로 불가능한 방향을 가리키는 패킷을 차단하여 스푸핑 또는 위조된 IP 주소의 활동을 방지합니다.
ru: Механизм `antispoof` защищает от активности с подделанных или фальсифицированных IP-адресов, в основном блокируя пакеты, появляющиеся на интерфейсах и в направлениях, которые логически невозможны.

source: These rules weed out spoofed traffic coming in from the rest of the world as well as any spoofed packets which originate in the local network:
ko: 이러한 규칙은 로컬 네트워크에서 발생하는 스푸핑된 패킷뿐만 아니라 외부에서 들어오는 스푸핑된 트래픽을 걸러냅니다:
ru: Эти правила отсеивают поддельный трафик, поступающий из остального мира, а также любые поддельные пакеты, исходящие из локальной сети:

source: Handling Non-Routable Addresses
ko: 라우팅할 수 없는 주소 처리하기
ru: Обработка Немаршрутизируемых Адресов
