Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: The outbound rules are modified to replace the `allow` action with the `$skip` variable, indicating that rule processing will continue at rule `1000`. The seven `tcp` rules have been replaced by rule `125` as the `$good_tcpo` variable contains the seven allowed outbound ports.
ko: 아웃바운드 규칙은 규칙 `1000`에서 규칙 처리가 계속됨을 나타내는 `$skip` 변수로 `allow` 동작을 대체하도록 수정되었습니다. 7개의 `tcp` 규칙은 `$good_tcpo` 변수에 허용된 7개의 아웃바운드 포트가 포함되어 있으므로 규칙 `125`로 대체되었습니다.
ru: Правила для исходящего трафика изменены, чтобы заменить действие `allow` на переменную `$skip`, указывая, что обработка правил продолжится с правила `1000`. Семь правил для `tcp` заменены правилом `125`, так как переменная `$good_tcpo` содержит семь разрешённых исходящих портов.

source: Remember that IPFW's performance is largely determined by the number of rules present in the ruleset.
ko: IPFW의 성능은 규칙 집합에 존재하는 규칙의 수에 따라 크게 결정된다는 점을 기억하세요.
ru: Помните, что производительность IPFW в значительной степени определяется количеством правил в наборе правил межсетевого экрана.

source: The inbound rules remain the same, except for the very last rule which removes the `via $pif` in order to catch both inbound and outbound rules. The NAT rule must follow this last outbound rule, must have a higher number than that last rule, and the rule number must be referenced by the `skipto` action. In this ruleset, rule number `1000` handles passing all packets to our configured instance for NAT processing. The next rule allows any packet which has undergone NAT processing to pass.
ko: 인바운드 규칙은 인바운드 및 아웃바운드 규칙을 모두 잡기 위해 `via $pif`를 제거하는 맨 마지막 규칙을 제외하고는 동일하게 유지됩니다. NAT 규칙은 이 마지막 아웃바운드 규칙을 따라야 하며, 마지막 규칙보다 번호가 높아야 하고, 규칙 번호는 `skipto` 액션에서 참조해야 합니다. 이 규칙 집합에서 규칙 번호 `1000`은 NAT 처리를 위해 구성된 인스턴스로 모든 패킷을 전달하여 처리합니다. 다음 규칙은 NAT 처리를 거친 모든 패킷을 통과하도록 허용합니다.
ru: Правила для входящего трафика остаются такими же, за исключением самого последнего правила, в котором удаляется `via $pif`, чтобы охватить как входящие, так и исходящие правила. Правило NAT должно следовать за этим последним исходящим правилом, иметь номер выше, чем у последнего правила, и номер правила должен быть указан в действии `skipto`. В этом наборе правил правило номер `1000` обрабатывает передачу всех пакетов в настроенный экземпляр для обработки NAT. Следующее правило разрешает прохождение любого пакета, прошедшего обработку NAT.

source: In this example, rules `100`, `101`, `125`, `1000`, and `1001` control the address translation of the outbound and inbound packets so that the entries in the dynamic state table always register the private LANIP address.
ko: 이 예에서 규칙 `100`, `101`, `125`, `1000` 및 `1001`은 아웃바운드 및 인바운드 패킷의 주소 변환을 제어하여 동적 상태 테이블의 항목에 항상 개인 LANIP 주소가 등록되도록 합니다.
ru: В этом примере правила `100`, `101`, `125`, `1000` и `1001` управляют преобразованием адресов исходящих и входящих пакетов, чтобы записи в таблице динамического состояния всегда указывали на частный LANIP-адрес.

source: Consider an internal web browser which initializes a new outbound HTTP session over port 80. When the first outbound packet enters the firewall, it does not match rule `100` because it is headed out rather than in. It passes rule `101` because this is the first packet and it has not been posted to the dynamic state table yet. The packet finally matches rule `125` as it is outbound on an allowed port and has a source IP address from the internal LAN. On matching this rule, two actions take place. First, the `keep-state` action adds an entry to the dynamic state table and the specified action, `skipto rule 1000`, is executed. Next, the packet undergoes NAT and is sent out to the Internet. This packet makes its way to the destination web server, where a response packet is generated and sent back. This new packet enters the top of the ruleset. It matches rule `100` and has its destination IP address mapped back to the original internal address. It then is processed by the `check-state` rule, is found in the table as an existing session, and is released to the LAN.
ko: 포트 80을 통해 새로운 아웃바운드 HTTP 세션을 초기화하는 내부 웹 브라우저를 생각해 봅시다. 첫 번째 아웃바운드 패킷이 방화벽에 들어올 때, 이 패킷은 들어오는 방향이 아니라 나가는 방향이기 때문에 규칙 `100`과 일치하지 않습니다. 이 패킷은 첫 번째 패킷이고 아직 동적 상태 테이블에 게시되지 않았기 때문에 규칙 `101`을 통과합니다. 패킷은 허용된 포트에서 아웃바운드되고 내부 LAN의 소스 IP 주소를 가지고 있기 때문에 규칙 `125`와 최종적으로 일치합니다. 이 규칙과 일치하면 두 가지 작업이 수행됩니다. 먼저 `keep-state` 동작으로 동적 상태 테이블에 항목이 추가되고 지정된 동작인 `skipto rule 1000`이 실행됩니다. 다음으로 패킷이 NAT를 거쳐 인터넷으로 전송됩니다. 이 패킷은 대상 웹 서버로 이동하여 응답 패킷이 생성되어 다시 전송됩니다. 이 새 패킷은 규칙 세트의 맨 위에 들어갑니다. 이 패킷은 규칙 `100`과 일치하며 대상 IP 주소가 원래 내부 주소로 다시 매핑됩니다. 그런 다음 `check-state` 규칙에 의해 처리되고 테이블에서 기존 세션으로 발견되어 LAN으로 릴리스됩니다.
ru: Рассмотрим внутренний веб-браузер, который инициирует новый исходящий HTTP-сеанс через порт 80. Когда первый исходящий пакет попадает в межсетевой экран, он не соответствует правилу `100`, так как направлен наружу, а не внутрь. Он проходит правило `101`, так как это первый пакет и он ещё не был добавлен в таблицу динамического состояния. В итоге пакет соответствует правилу `125`, так как он исходящий на разрешённом порту и имеет исходный IP-адрес из внутренней LAN. При соответствии этому правилу выполняются два действия. Во-первых, действие `keep-state` добавляет запись в таблицу динамического состояния, и выполняется указанное действие `skipto rule 1000`. Затем пакет проходит NAT и отправляется в Интернет. Этот пакет достигает целевого веб-сервера, где генерируется и отправляется обратно ответный пакет. Этот новый пакет попадает в начало набора правил. Он соответствует правилу `100`, и его IP-адрес назначения преобразуется обратно в исходный внутренний адрес. Затем он обрабатывается правилом `check-state`, обнаруживается в таблице как существующий сеанс и передаётся в LAN.

source: On the inbound side, the ruleset has to deny bad packets and allow only authorized services. A packet which matches an inbound rule is posted to the dynamic state table and the packet is released to the LAN. The packet generated as a response is recognized by the `check-state` rule as belonging to an existing session. It is then sent to rule `1000` to undergo NAT before being released to the outbound interface.
ko: 인바운드 측에서 규칙 집합은 잘못된 패킷을 거부하고 승인된 서비스만 허용해야 합니다. 인바운드 규칙과 일치하는 패킷은 동적 상태 테이블에 게시되고 패킷은 LAN으로 릴리스됩니다. 응답으로 생성된 패킷은 `check-state` 규칙에 의해 기존 세션에 속한 것으로 인식됩니다. 그런 다음 `1000` 규칙으로 전송되어 NAT를 거친 후 아웃바운드 인터페이스로 릴리스됩니다.
ru: На входящей стороне набор правил должен блокировать плохие пакеты и разрешать только авторизованные сервисы. Пакет, соответствующий входящему правилу, помещается в таблицу динамического состояния и выпускается в локальную сеть. Пакет, сгенерированный в ответ, распознаётся правилом `check-state` как принадлежащий существующему сеансу. Затем он отправляется к правилу `1000` для выполнения NAT перед выпуском на исходящий интерфейс.

source: Transitioning from userland man:natd[8] to in-kernel NAT might appear seamless at first but there is small catch. When using the GENERIC kernel, IPFW will load the [.filename]#libalias.ko# kernel module, when `firewall_nat_enable` is enabled in [.filename]#/etc/rc.conf#. The [.filename]#libalias.ko# kernel module only provides basic NAT functionality, whereas the userland implementation man:natd[8] has all NAT functionality available in its userland library without any extra configuration. All functionality refers to the following kernel modules that can additionally be loaded when needed besides the standard [.filename]#libalias.ko# kernel module: [.filename]#alias_ftp.ko#, [.filename]#alias_bbt.ko#, [.filename]#skinny.ko#, [.filename]#irc.ko#, [.filename]#alias_pptp.ko# and [.filename]#alias_smedia.ko# using the `kld_list` directive in [.filename]#/etc/rc.conf#. If a custom kernel is used, the full functionality of the userland library can be compiled in, in the kernel, using the `options LIBALIAS`.
ko: 사용자 공간의 man:natd[8]에서 in-Kernel NAT로 전환하는 것은 처음에는 매끄럽게 보일 수 있지만 작은 문제가 있습니다. 기본 커널(GENERIC kernel)을 사용할 때, [.filename]#/etc/rc.conf#에서 `firewall_nat_enable`이 활성화되면 IPFW는 [.filename]#libalias.ko# 커널 모듈을 로드합니다. [.filename]#libalias.ko# 커널 모듈은 기본 NAT 기능만 제공하는 반면, 사용자 공간 구현 man:natd[8]는 추가 구성 없이 사용자 공간 라이브러리에서 모든 NAT 기능을 사용할 수 있습니다. 모든 기능은 표준 [.filename]#libalias.ko# 커널 모듈 외에 필요할 때 추가로 로드할 수 있는 다음 커널 모듈을 참조합니다: [.filename]#alias_ftp.ko#, [.filename]#alias_bbt.ko#, [.filename]#skinny.ko#, [.filename]#irc.ko#, [.filename]#alias_pptp.ko# 및 [.filename]#alias_smedia.ko#를 [.filename]#/etc/rc.conf#에서 `kld_list` 지시어를 사용하여 로드합니다. 커스텀 커널을 사용하는 경우 커널에서 `options LIBALIAS`를 사용하여 사용자 공간 라이브러리의 전체 기능을 컴파일할 수 있습니다.
ru: Переход от пользовательской реализации man:natd[8] к NAT в ядре может сначала показаться простым, но есть небольшой нюанс. При использовании GENERIC ядра IPFW загрузит модуль ядра [.filename]#libalias.ko#, когда в [.filename]#/etc/rc.conf# включена опция `firewall_nat_enable`. Модуль ядра [.filename]#libalias.ko# предоставляет только базовую функциональность NAT, в то время как пользовательская реализация man:natd[8] имеет все функции NAT в своей пользовательской библиотеке без дополнительной настройки. Под всей функциональностью подразумеваются следующие модули ядра, которые могут быть дополнительно загружены при необходимости, помимо стандартного модуля [.filename]#libalias.ko#: [.filename]#alias_ftp.ko#, [.filename]#alias_bbt.ko#, [.filename]#skinny.ko#, [.filename]#irc.ko#, [.filename]#alias_pptp.ko# и [.filename]#alias_smedia.ko# с использованием директивы `kld_list` в [.filename]#/etc/rc.conf#. Если используется собственное ядро, полная функциональность пользовательской библиотеки может быть встроена в ядро с помощью опции `options LIBALIAS`.

source: Port Redirection
ko: 포트 리디렉션
ru: Перенаправление портов

source: The drawback with NAT in general is that the LAN clients are not accessible from the Internet. Clients on the LAN can make outgoing connections to the world but cannot receive incoming ones. This presents a problem if trying to run Internet services on one of the LAN client machines. A simple way around this is to redirect selected Internet ports on the NAT providing machine to a LAN client.
ko: 일반적으로 NAT의 단점은 인터넷에서 LAN 클라이언트에 액세스할 수 없다는 것입니다. LAN의 클라이언트는 밖으로 나가는 연결은 할 수 있지만 들어오는 연결은 받을 수 없습니다. 이는 LAN 클라이언트 컴퓨터 중 하나에서 인터넷 서비스를 실행하려고 할 때 문제가 됩니다. 이 문제를 해결하는 간단한 방법은 NAT 제공 머신에서 선택한 인터넷 포트를 LAN 클라이언트로 리디렉션하는 것입니다.
ru: Недостаток NAT в целом заключается в том, что клиенты в локальной сети недоступны из Интернета. Клиенты в локальной сети могут устанавливать исходящие соединения с внешним миром, но не могут принимать входящие. Это создаёт проблему, если необходимо запустить интернет-сервисы на одной из машин-клиентов локальной сети. Простое решение этой проблемы — перенаправление определённых портов из Интернета на машине, предоставляющей NAT, к клиенту в локальной сети.

source: For example, an IRC server runs on client `A` and a web server runs on client `B`. For this to work properly, connections received on ports 6667 (IRC) and 80 (HTTP) must be redirected to the respective machines.
ko: 예를 들어, IRC 서버는 클라이언트 `A`에서 실행되고 웹 서버는 클라이언트 `B`에서 실행됩니다. 이 기능이 제대로 작동하려면 포트 6667(IRC)과 80(HTTP)에서 수신된 연결이 각 컴퓨터로 리디렉션되어야 합니다.
ru: Например, сервер IRC работает на клиенте `A`, а веб-сервер — на клиенте `B`. Для правильной работы соединения, полученные на портах 6667 (IRC) и 80 (HTTP), должны быть перенаправлены на соответствующие машины.

source: With in-kernel NAT all configuration is done in the NAT instance configuration. For a full list of options that an in-kernel NAT instance can use, consult man:ipfw[8]. The IPFW syntax follows the syntax of natd. The syntax for `redirect_port` is as follows:
ko: In-Kernel 를 사용하면 모든 구성이 NAT 인스턴스 구성에서 이루어집니다. In-Kernel NAT 인스턴스가 사용할 수 있는 전체 옵션 목록은 man:ipfw[8]를 참조하세요. IPFW 구문은 natd의 구문을 따릅니다. `redirect_port`의 구문은 다음과 같습니다:
ru: С встроенным в ядро NAT вся конфигурация выполняется в настройках экземпляра NAT. Полный список параметров, которые может использовать экземпляр встроенного в ядро NAT, приведен в man:ipfw[8]. Синтаксис IPFW соответствует синтаксису natd. Синтаксис для `redirect_port` выглядит следующим образом:

source: To configure the above example setup, the arguments should be:
ko: 위의 예제의 설정을 구성하려면 인수는 다음과 같아야 합니다:
ru: Для настройки приведённой выше конфигурации аргументы должны быть:

source: After adding these arguments to the configuration of NAT instance 1 in the above ruleset, the TCP ports will be port forwarded to the LAN client machines running the IRC and HTTP services.
ko: 위의 규칙 집합에서 NAT 인스턴스 1의 구성에 이러한 인수를 추가하면 TCP 포트가 IRC 및 HTTP 서비스를 실행하는 LAN 클라이언트 머신으로 포트 포워딩됩니다.
ru: После добавления этих аргументов в конфигурацию NAT-экземпляра 1 в приведенном выше наборе правил, TCP-порты будут проброшены на клиентские машины в локальной сети, на которых работают службы IRC и HTTP.

source: Port ranges over individual ports can be indicated with `redirect_port`. For example, _tcp 192.168.0.2:2000-3000 2000-3000_ would redirect all connections received on ports 2000 to 3000 to ports 2000 to 3000 on client `A`.
ko: 개별 포트에 대한 포트 범위는 `redirect_port`로 표시할 수 있습니다. 예를 들어 _tcp 192.168.0.2:2000-3000 2000-3000_은 포트 2000에서 3000으로 수신된 모든 연결을 클라이언트 `A`의 포트 2000에서 3000으로 리디렉션합니다.
ru: Диапазоны портов вместо отдельных портов могут быть указаны с помощью `redirect_port`. Например, _tcp 192.168.0.2:2000-3000 2000-3000_ перенаправит все соединения, полученные на портах с 2000 по 3000, на порты с 2000 по 3000 клиента `A`.

source: Address Redirection
ko: 주소 리디렉션
ru: Перенаправление адресов

source: Address redirection is useful if more than one IP address is available. Each LAN client can be assigned its own external IP address by man:ipfw[8], which will then rewrite outgoing packets from the LAN clients with the proper external IP address and redirects all traffic incoming on that particular IP address back to the specific LAN client. This is also known as static NAT. For example, if IP addresses `128.1.1.1`, `128.1.1.2`, and `128.1.1.3` are available, `128.1.1.1` can be used as the man:ipfw[8] machine's external IP address, while `128.1.1.2` and `128.1.1.3` are forwarded back to LAN clients `A` and `B`.
ko: 주소 리디렉션은 둘 이상의 IP 주소를 사용할 수 있는 경우에 유용합니다. 각 LAN 클라이언트는 man:ipfw[8]를 통해 자체 외부 IP 주소를 할당할 수 있으며, 이를 통해 LAN 클라이언트에서 보내는 패킷을 적절한 외부 IP 주소로 다시 작성하고 특정 IP 주소로 들어오는 모든 트래픽을 특정 LAN 클라이언트로 리디렉션합니다. 이를 정적 NAT(static NAT)라고도 합니다. 예를 들어, `128.1.1.1`, `128.1.1.2`, `128.1.1.3` IP 주소를 사용할 수 있는 경우, `128.1.1.1`은 man:ipfw[8] 컴퓨터의 외부 IP 주소로 사용할 수 있고 `128.1.1.2`와 `128.1.1.3`은 LAN 클라이언트 `A`와 `B`로 다시 포워딩합니다.
ru: Перенаправление адресов полезно, если доступно более одного IP-адреса. Каждому клиенту в локальной сети может быть назначен собственный внешний IP-адрес с помощью man:ipfw[8], который затем перезаписывает исходящие пакеты от клиентов локальной сети с соответствующим внешним IP-адресом и перенаправляет весь входящий трафик для этого конкретного IP-адреса обратно к определённому клиенту локальной сети. Это также известно как статический NAT. Например, если доступны IP-адреса `128.1.1.1`, `128.1.1.2` и `128.1.1.3`, то `128.1.1.1` может использоваться как внешний IP-адрес машины с man:ipfw[8], а `128.1.1.2` и `128.1.1.3` перенаправляются обратно клиентам `A` и `B` локальной сети.

source: The `redirect_addr` syntax is as below, where `localIP` is the internal IP address of the LAN client, and `publicIP` the external IP address corresponding to the LAN client.
ko: `redirect_addr` 구문은 아래와 같으며, 여기서 `localIP`는 LAN 클라이언트의 내부 IP 주소, `publicIP`는 LAN 클라이언트에 해당하는 외부 IP 주소입니다.
ru: Синтаксис `redirect_addr` приведён ниже, где `localIP` — это внутренний IP-адрес клиента в локальной сети, а `publicIP` — внешний IP-адрес, соответствующий клиенту в локальной сети.

source: In the example, the arguments would read:
ko: 이 예제에서 인수는 다음과 같습니다:
ru: В этом примере аргументы выглядели бы следующим образом:

source: Like `redirect_port`, these arguments are placed in a NAT instance configuration. With address redirection, there is no need for port redirection, as all data received on a particular IP address is redirected.
ko: `redirect_port`와 마찬가지로 이러한 인수는 NAT 인스턴스 구성에 위치합니다. 주소 리디렉션을 사용하면 특정 IP 주소로 수신되는 모든 데이터가 리디렉션되므로 포트 리디렉션이 필요하지 않습니다.
ru: Как и `redirect_port`, эти аргументы размещаются в конфигурации экземпляра NAT. При перенаправлении адреса нет необходимости в перенаправлении портов, так как перенаправляются все данные, полученные на определённый IP-адрес.

source: The external IP addresses on the man:ipfw[8] machine must be active and aliased to the external interface. Refer to man:rc.conf[5] for details.
ko: man:ipfw[8] 머신의 외부 IP 주소는 활성 상태여야 하며 외부 인터페이스에 앨리어싱되어야 합니다. 자세한 내용은 man:rc.conf[5]를 참조하세요.
ru: Внешние IP-адреса на машине с man:ipfw[8] должны быть активны и назначены как псевдонимы внешнему интерфейсу. Подробности см. в man:rc.conf[5].

source: Userspace NAT
ko: 사용자 공간 NAT
ru: Пользовательский NAT

source: Let us start with a statement: the userspace NAT implementation: man:natd[8], has more overhead than in-kernel NAT. For man:natd[8] to translate packets, the packets have to be copied from the kernel to userspace and back which brings in extra overhead that is not present with in-kernel NAT.
ko: 먼저 다음 문장부터 시작합시다: 사용자 공간 NAT 구현인 man:natd[8]는 In-kernel NAT보다 오버헤드가 더 많습니다. man:natd[8]가 패킷을 변환하려면 패킷을 커널에서 복사하고 다시 사용자 공간으로 복사해야 하므로 In-kernel NAT에는 없는 추가 오버헤드가 발생합니다.
ru: Начнем с утверждения: реализация NAT в пользовательском пространстве: man:natd[8], имеет больше накладных расходов, чем NAT в ядре. Для работы man:natd[8] по преобразованию пакетов, пакеты должны копироваться из ядра в пользовательское пространство и обратно, что создает дополнительные накладные расходы, отсутствующие при использовании NAT в ядре.

source: To enable the userpace NAT daemon man:natd[8] at boot time, the following is a minimum configuration in [.filename]#/etc/rc.conf#. Where `natd_interface` is set to the name of the NIC attached to the Internet. The man:rc[8] script of man:natd[8] will automatically check if a dynamic IP address is used and configure itself to handle that.
ko: 부팅 시 사용자 공간 NAT 데몬 man:natd[8]를 활성화하려면 [.filename]#/etc/rc.conf#에 최소 다음과 같은 구성을 지정해야 합니다. 여기서 `natd_interface`는 인터넷에 연결된 NIC의 이름으로 설정됩니다. man:natd[8]의 man:rc[8] 스크립트는 동적 IP 주소가 사용되는지 자동으로 확인하고 이를 처리하도록 자체 구성합니다.

source: In general, the above ruleset as explained for in-kernel NAT can also be used together with man:natd[8]. The exceptions are the configuration of the in-kernel NAT instance `(ipfw -q nat 1 config ...)` which is not needed together with reassemble rule 99 because its functionality is included in the `divert` action. Rule number 100 and 1000 will have to change sligthly as shown below.
ko: 일반적으로, In-kernel NAT에 대해 설명한 위의 규칙 집합은 man:natd[8]와 함께 사용할 수도 있습니다. 예외는 In-kernel NAT 인스턴스 `(ipfw -q nat 1 config …)`의 구성인데, 이 기능은 `divert` 액션에 포함되어 있기 때문에 재조립 규칙 99와 함께 사용할 필요가 없습니다. 규칙 번호 100과 1000은 아래와 같이 조금씩 변경해야 합니다.

source: To configure port or address redirection, a similar syntax as with in-kernel NAT is used. Although, now, instead of specifying the configuration in our ruleset script like with in-kernel NAT, configuration of man:natd[8] is best done in a configuration file. To do this, an extra flag must be passed via [.filename]#/etc/rc.conf# which specifies the path of the configuration file.
ko: 포트 또는 주소 리디렉션을 구성하려면 In-kernel NAT와 유사한 구문이 사용됩니다. 하지만 이제는 In-kernel NAT처럼 규칙 집합 스크립트에서 구성을 지정하는 대신 구성 파일에서 man:natd[8]를 구성하는 것이 가장 좋습니다. 이렇게 하려면 구성 파일의 경로를 지정하는 [.filename]#/etc/rc.conf#를 통해 추가 플래그를 전달해야 합니다.
ru: Для настройки перенаправления портов или адресов используется синтаксис, аналогичный NAT в ядре. Однако, в отличие от настройки в скрипте набора правил, как в случае с NAT в ядре, конфигурацию man:natd[8] лучше выполнять в конфигурационном файле. Для этого необходимо передать дополнительный флаг через [.filename]#/etc/rc.conf#, который указывает путь к конфигурационному файлу.

source: The specified file must contain a list of configuration options, one per line. For more information about the configuration file and possible variables, consult man:natd[8]. Below are two example entries, one per line:
ko: 지정된 파일에는 한 줄에 하나씩 구성 옵션 목록이 포함되어야 합니다. 구성 파일 및 사용 가능한 변수에 대한 자세한 내용은 man:natd[8]을 참조하세요. 다음은 한 줄에 하나씩 두 개의 예제 항목입니다:
ru: Указанный файл должен содержать список параметров конфигурации, по одному на строку. Для получения дополнительной информации о файле конфигурации и возможных переменных обратитесь к man:natd[8]. Ниже приведены два примера записей, по одному на строку:

source: The IPFW Command
ko: IPFW 명령어
ru: Команда IPFW

source: `ipfw` can be used to make manual, single rule additions or deletions to the active firewall while it is running. The problem with using this method is that all the changes are lost when the system reboots. It is recommended to instead write all the rules in a file and to use that file to load the rules at boot time and to replace the currently running firewall rules whenever that file changes.
ko: `ipfw`를 사용하여 활성 방화벽이 실행되는 동안 수동으로 단일 규칙을 추가하거나 삭제할 수 있습니다. 이 방법을 사용하면 시스템이 재부팅될 때 모든 변경 사항이 손실된다는 문제가 있습니다. 대신 모든 규칙을 파일에 작성하고 해당 파일을 사용하여 부팅 시 규칙을 로드하고 해당 파일이 변경될 때마다 현재 실행 중인 방화벽 규칙을 교체하는 것이 좋습니다.
ru: `ipfw` можно использовать для ручного добавления или удаления отдельных правил в активный межсетевой экран во время его работы. Проблема этого метода в том, что все изменения теряются при перезагрузке системы. Рекомендуется вместо этого записывать все правила в файл и использовать его для загрузки правил при запуске системы, а также для замены текущих правил межсетевого экрана при изменении этого файла.

source: `ipfw` is a useful way to display the running firewall rules to the console screen. The IPFW accounting facility dynamically creates a counter for each rule that counts each packet that matches the rule. During the process of testing a rule, listing the rule with its counter is one way to determine if the rule is functioning as expected.
ko: `ipfw`는 실행 중인 방화벽 규칙을 콘솔 화면에 표시하는 유용한 방법입니다. IPFW 계정 기능은 각 규칙에 대한 카운터를 동적으로 생성하여 규칙과 일치하는 각 패킷을 계산합니다. 규칙을 테스트하는 과정에서 카운터와 함께 규칙을 나열하는 것은 규칙이 예상대로 작동하는지 확인하는 한 가지 방법입니다.
ru: `ipfw` — это полезный способ отображения текущих правил межсетевого экрана на экране консоли. Возможность учёта IPFW динамически создаёт счётчик для каждого правила, который подсчитывает каждый пакет, соответствующий правилу. В процессе тестирования правила, вывод правила с его счётчиком — это один из способов определить, работает ли правило так, как ожидается.

source: To list all the running rules in sequence:
ko: 실행 중인 모든 규칙을 순서대로 나열하려면:
ru: Чтобы вывести список всех активных правил в порядке их применения:

source: To list all the running rules with a time stamp of when the last time the rule was matched:
ko: 실행 중인 모든 규칙을 규칙이 마지막으로 일치한 시간의 타임스탬프와 함께 나열하려면:
ru: Для вывода всех активных правил с отметкой времени последнего совпадения правила:

source: The next example lists accounting information and the packet count for matched rules along with the rules themselves. The first column is the rule number, followed by the number of matched packets and bytes, followed by the rule itself.
ko: 다음 예제에는 일치하는 규칙에 대한 계정 정보 및 패킷 수가 규칙 자체와 함께 나열되어 있습니다. 첫 번째 열은 규칙 번호이고, 그 다음에는 일치하는 패킷 수와 바이트 수, 그 다음에는 규칙 자체입니다.
ru: Следующий пример выводит информацию о сборе статистики и количество пакетов для совпавших правил вместе с самими правилами. Первый столбец — это номер правила, за которым следует количество совпавших пакетов и байтов, а затем само правило.

source: To list dynamic rules in addition to static rules:
ko: 정적 규칙과 함께 동적 규칙을 나열하려면:
ru: Для отображения динамических правил вместе со статическими:

source: To also show the expired dynamic rules:
ko: 만료된 동적 규칙도 표시하려면:
ru: Чтобы также показать истекшие динамические правила:

source: To zero the counters:
ko: 카운터를 초기화하려면:
ru: Для обнуления счетчиков:

source: To zero the counters for just the rule with number _NUM_:
ko: 숫자 _NUM_이 있는 규칙에 대해서만 카운터를 0으로 설정하려면:
ru: Обнулить счетчики только для правила с номером _NUM_:
