Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/firewalls/_index.po
Languages: ko, ru

source: All rules that follow the `[local]` section are treated as local rules (which is the default), applying to the local machine. When a `[remote]` section is encountered, all rules that follow it are handled as remote machine rules.
ko: `[local]` 섹션 뒤에 오는 모든 규칙은 로컬 규칙(기본값)으로 처리되어 로컬 머신에 적용됩니다. `[remote]` 섹션을 발견하면 그 뒤에 오는 모든 규칙은 원격 컴퓨터 규칙으로 처리됩니다.
ru: Все правила, следующие за разделом `[local]`, рассматриваются как локальные правила (что является значением по умолчанию) и применяются к локальной машине. При обнаружении раздела `[remote]` все последующие правила обрабатываются как правила для удалённых машин.

source: Seven fields separated by either tabs or spaces define a rule. The first four fields identify the traffic that should be blocklisted. The three fields that follow define backlistd's behavior. Wildcards are denoted as asterisks (`*`), matching anything in this field. The first field defines the location. In local rules, these are the network ports. The syntax for the location field is as follows:
ko: 탭 또는 공백으로 구분된 7개의 필드가 규칙을 정의합니다. 처음 4개의 필드는 차단 목록에 추가해야 하는 트래픽을 식별합니다. 그 뒤에 나오는 세 개의 필드는 backlistd의 동작을 정의합니다. 와일드카드는 별표(`*`)로 표시되며 이 필드에 있는 모든 항목과 일치합니다. 첫 번째 필드는 위치를 정의합니다. 로컬 규칙에서는 네트워크 포트입니다. 위치 필드의 구문은 다음과 같습니다:
ru: Семь полей, разделённых табуляцией или пробелами, определяют правило. Первые четыре поля идентифицируют трафик, который должен быть внесён в чёрный список. Следующие три поля определяют поведение backlistd. Подстановочные символы обозначаются звёздочками (`*`), которые соответствуют любому значению в данном поле. Первое поле определяет местоположение. В локальных правилах это сетевые порты. Синтаксис для поля местоположения следующий:

source: Addresses can be specified as IPv4 in numeric format or IPv6 in square brackets. An interface name like `_em0_` can also be used.
ko: 주소는 숫자 형식의 IPv4 또는 대괄호 안의 IPv6로 지정할 수 있습니다. `_em0_`와 같은 인터페이스 이름도 사용할 수 있습니다.
ru: Адреса могут быть указаны в виде IPv4 в числовом формате или IPv6 в квадратных скобках. Также можно использовать имя интерфейса, например `_em0_`.

source: The socket type is defined by the second field. TCP sockets are of type `stream`, whereas UDP is denoted as `dgram`. The example above uses TCP, since SSH is using that protocol.
ko: 소켓 유형은 두 번째 필드에 의해 정의됩니다. TCP 소켓은 `stream` 유형인 반면, UDP는 `dgram`으로 표시됩니다. 위의 예에서는 SSH가 해당 프로토콜을 사용하기 때문에 TCP를 사용합니다.
ru: Тип сокета определяется вторым полем. TCP-сокеты имеют тип `stream`, тогда как UDP обозначается как `dgram`. В приведённом выше примере используется TCP, так как SSH работает по этому протоколу.

source: A protocol can be used in the third field of a blacklistd rule. The following protocols can be used: `tcp`, `udp`, `tcp6`, `udp6`, or numeric. A wildcard, like in the example, is typically used to match all protocols unless there is a reason to distinguish traffic by a certain protocol.
ko: 프로토콜은 blacklistd 규칙의 세 번째 필드에 사용할 수 있습니다. 다음 프로토콜을 사용할 수 있습니다: `tcp`, `udp`, `tcp6`, `udp6` 또는 숫자. 예제에서와 같이 와일드카드는 특정 프로토콜로 트래픽을 구분할 이유가 없는 한 일반적으로 모든 프로토콜을 일치시키는 데 사용됩니다.
ru: Протокол может быть указан в третьем поле правила blacklistd. Доступны следующие протоколы: `tcp`, `udp`, `tcp6`, `udp6` или числовое значение. Подстановочный символ, как в примере, обычно используется для соответствия всем протоколам, если нет необходимости различать трафик по определённому протоколу.

source: In the fourth field, the effective user or owner of the daemon process that is reporting the event is defined. The username or UID can be used here, as well as a wildcard (see example rule above).
ko: 네 번째 필드에는 이벤트를 보고하는 데몬 프로세스의 유효 사용자 또는 소유자가 정의됩니다. 여기에는 와일드카드뿐만 아니라 사용자 이름 또는 UID도 사용할 수 있습니다(위의 규칙 예시 참조).
ru: В четвёртом поле определяется эффективный пользователь или владелец процесса демона, который сообщает о событии. Здесь можно использовать имя пользователя или UID, а также подстановочный знак (см. пример правила выше).

source: The packet filter rule name is declared by the fifth field, which starts the behavior part of the rule. By default, blacklistd puts all blocks under a pf anchor called `blacklistd` in [.filename]#pf.conf# like this:
ko: 패킷 필터 규칙 이름은 규칙의 동작 부분을 시작하는 다섯 번째 필드에서 선언됩니다. 기본적으로 blacklistd는 다음과 같이 모든 블록을 [.filename]#pf.conf#의 `blacklistd`라는 pf 앵커 아래에 배치합니다:
ru: Имя правила фильтра пакетов объявляется пятым полем, которое начинает поведенческую часть правила. По умолчанию, blacklistd помещает все блокировки в якорь pf под названием `blacklistd` в [.filename]#pf.conf# следующим образом:

source: For separate blocklists, an anchor name can be used in this field. In other cases, the wildcard will suffice. When a name starts with a hyphen (`-`) it means that an anchor with the default rule name prepended should be used. A modified example from the above using the hyphen would look like this:
ko: 별도의 차단 목록의 경우 이 필드에 앵커 이름을 사용할 수 있습니다. 다른 경우에는 와일드카드로 충분합니다. 이름이 하이픈(`-`)으로 시작하면 기본 규칙 이름이 앞에 붙은 앵커를 사용해야 한다는 의미입니다. 위의 예에서 하이픈을 사용하여 수정한 예는 다음과 같습니다:
ru: Для отдельных списков блокировки в этом поле можно использовать имя якоря. В остальных случаях подойдет подстановочный знак. Если имя начинается с дефиса (`-`), это означает, что следует использовать якорь с добавленным именем правила по умолчанию. Модифицированный пример из вышеприведенного с использованием дефиса будет выглядеть так:

source: With such a rule, any new blocklist rules are added to an anchor called `blacklistd-ssh`.
ko: 이러한 규칙을 사용하면 새 blocklist 규칙이 `blacklistd-ssh`라는 앵커에 추가됩니다.
ru: С таким правилом любые новые правила из списка блокировки добавляются к якорю с именем `blacklistd-ssh`.

source: To block whole subnets for a single rule violation, a `/` in the rule name can be used. This causes the remaining portion of the name to be interpreted as the mask to be applied to the address specified in the rule. For example, this rule would block every address adjoining `/24`.
ko: 단일 규칙 위반에 대해 전체 서브넷을 차단하려면 규칙 이름에 `/`를 사용할 수 있습니다. 이렇게 하면 이름의 나머지 부분이 규칙에 지정된 주소에 적용되는 마스크로 해석됩니다. 예를 들어, 이 규칙은 `/24`에 인접한 모든 주소를 차단합니다.
ru: Для блокировки целых подсетей за одно нарушение правила можно использовать символ `/` в имени правила. Это приводит к тому, что оставшаяся часть имени интерпретируется как маска, применяемая к адресу, указанному в правиле. Например, это правило заблокирует все адреса, входящие в подсеть `/24`.

source: It is important to specify the proper protocol here. IPv4 and IPv6 treat /24 differently, that is the reason why `*` cannot be used in the third field for this rule.
ko: 여기에 적절한 프로토콜을 지정하는 것이 중요합니다. IPv4와 IPv6는 /24를 다르게 처리하기 때문에 이 규칙의 세 번째 필드에 `*`를 사용할 수 없습니다.
ru: Здесь важно указать правильный протокол. IPv4 и IPv6 обрабатывают /24 по-разному, поэтому `*` нельзя использовать в третьем поле для этого правила.

source: This rule defines that if any one host in that network is misbehaving, everything else on that network will be blocked, too.
ko: 이 규칙은 해당 네트워크의 호스트 중 하나라도 잘못 동작하면 해당 네트워크의 다른 모든 호스트도 차단되도록 정의합니다.
ru: Это правило определяет, что если любой хост в этой сети ведёт себя неправильно, всё остальное в этой сети также будет заблокировано.

source: The sixth field, called `nfail`, sets the number of login failures required to blocklist the remote IP in question. When a wildcard is used at this position, it means that blocks will never happen. In the example rule above, a limit of three is defined meaning that after three attempts to log into SSH on one connection, the IP is blocked.
ko: 여섯 번째 필드인 ‘nfail’은 해당 원격 IP를 차단 목록에 올리는 데 필요한 로그인 실패 횟수를 설정합니다. 이 위치에 와일드카드를 사용하면 차단이 발생하지 않습니다. 위의 예제 규칙에서는 3번의 제한이 정의되어 있는데, 이는 한 연결에서 SSH 로그인을 세 번 시도하면 해당 IP가 차단된다는 의미입니다.
ru: Шестое поле, называемое `nfail`, устанавливает количество неудачных попыток входа, необходимых для внесения IP-адреса внешнего хоста в чёрный список. Если в этой позиции используется подстановочный знак, это означает, что блокировки никогда не будут происходить. В приведённом выше примере правила установлен лимит в три попытки, что означает, что после трёх попыток входа через SSH с одного соединения IP-адрес будет заблокирован.

source: The last field in a blacklistd rule definition specifies how long a host is blocklisted. The default unit is seconds, but suffixes like `m`, `h`, and `d` can also be specified for minutes, hours, and days, respectively.
ko: Blacklistd 규칙 정의의 마지막 필드는 호스트가 차단 목록에 포함되는 시간을 지정합니다. 기본 단위는 초이지만 `m`, `h`, `d`와 같은 접미사를 사용하여 각각 분, 시간, 일 단위로 지정할 수도 있습니다.
ru: Последнее поле в определении правила blacklistd указывает, как долго хост будет находиться в чёрном списке. По умолчанию единицей измерения являются секунды, но также можно указать суффиксы `m`, `h` и `d` для минут, часов и дней соответственно.

source: The example rule in its entirety means that after three times authenticating to SSH will result in a new PF block rule for that host. Rule matches are performed by first checking local rules one after another, from most specific to least specific. When a match occurs, the `remote` rules are applied and the name, `nfail`, and disable fields are changed by the `remote` rule that matched.
ko: 이 예제 규칙을 전체적으로 보면 SSH에 세 번 인증하면 해당 호스트에 대한 새로운 PF 차단 규칙이 적용됩니다. 규칙 일치는 먼저 로컬 규칙을 가장 구체적인 것부터 가장 덜 구체적인 것까지 차례로 확인하여 수행됩니다. 일치하는 규칙이 발생하면 `remote` 규칙이 적용되고 일치하는 `remote` 규칙에 의해 이름, `nfail` 및 비활성화 필드가 변경됩니다.
ru: Пример правила в полном объеме означает, что после трех попыток аутентификации по SSH будет создано новое правило блокировки PF для этого хоста. Совпадения правил проверяются путем последовательной проверки локальных правил от наиболее специфичных к наименее специфичным. Когда совпадение найдено, применяются правила `remote`, а поля `name`, `nfail` и `disable` изменяются в соответствии с совпавшим правилом `remote`.

source: Remote Rules
ko: 원격 규칙
ru: Правила remote

source: Remote rules are used to specify how blacklistd changes its behavior depending on the remote host currently being evaluated. Each field in a remote rule is the same as in a local rule. The only difference is in the way blacklistd is using them. To explain it, this example rule is used:
ko: 원격 규칙은 현재 평가 중인 원격 호스트에 따라 blacklistd가 동작방법을 변경하는데 사용됩니다. 원격 규칙의 각 필드는 로컬 규칙과 동일합니다. 유일한 차이점은 blacklistd가 이를 사용하는 방식입니다. 이를 설명하기 위해 다음 예제 규칙을 보세요:
ru: Удалённые правила используются для указания того, как blacklistd изменяет своё поведение в зависимости от удалённого хоста, который в данный момент оценивается. Каждое поле в удалённом правиле совпадает с таковым в локальном правиле. Единственное различие заключается в том, как blacklistd их использует. Для объяснения используется следующее примерное правило:

source: The address field can be an IP address (either v4 or v6), a port or both. This allows setting special rules for a specific remote address range like in this example. The fields for socket type, protocol and owner are identically interpreted as in the local rule.
ko: 주소 필드는 IP 주소(v4 또는 v6), 포트 또는 둘 다일 수 있습니다. 이를 통해 이 예제에서와 같이 특정 원격 주소 범위에 대한 특수 규칙을 설정할 수 있습니다. 소켓 유형, 프로토콜 및 소유자 필드는 로컬 규칙에서와 동일하게 해석됩니다.
ru: Поле `address` может содержать IP-адрес (как v4, так и v6), порт или оба варианта. Это позволяет задавать специальные правила для определённого диапазона удалённых адресов, как в этом примере. Поля для типа сокета, протокола и владельца интерпретируются так же, как в локальном правиле.

source: The name fields is different though: the equal sign (`=`) in a remote rule tells blacklistd to use the value from the matching local rule. It means that the firewall rule entry is taken and the `/25` prefix (a netmask of `255.255.255.128`) is added. When a connection from that address range is blocklisted, the entire subnet is affected. A PF anchor name can also be used here, in which case blacklistd will add rules for this address block to the anchor of that name. The default table is used when a wildcard is specified.
ko: 이름 필드는 다르지만 원격 규칙의 등호(`=`)는 일치하는 로컬 규칙의 값을 사용하도록 blacklistd에 지시합니다. 즉, 방화벽 규칙 항목을 가져와서 `/25` 접두사(넷마스크 `255.255.255.128`)를 추가합니다. 해당 주소 범위의 연결이 차단 목록에 추가되면 전체 서브넷이 영향을 받습니다. 여기에 PF 앵커 이름을 사용할 수도 있으며, 이 경우 blacklistd는 해당 이름의 앵커에 이 주소 블록에 대한 규칙을 추가합니다. 와일드카드가 지정되면 기본 테이블이 사용됩니다.
ru: Поле name отличается: знак равенства (`=`) в удаленном правиле указывает blacklistd использовать значение из соответствующего локального правила. Это означает, что запись правила межсетевого экрана берется, и добавляется префикс `/25` (маска сети `255.255.255.128`). Когда соединение из этого диапазона адресов попадает в черный список, затрагивается вся подсеть. Здесь также можно использовать имя якоря PF, и в этом случае blacklistd добавит правила для этого блока адресов в якорь с указанным именем. Если указана подстановка, используется таблица по умолчанию.

source: A custom number of failures in the `nfail` column can be defined for an address. This is useful for exceptions to a specific rule, to maybe allow someone a less strict application of rules or a bit more leniency in login tries. Blocking is disabled when an asterisk is used in this sixth field.
ko: `nfail` 열에 주소에 대한 사용자 지정 실패 횟수를 정의할 수 있습니다. 이는 특정 규칙에 대한 예외를 허용하거나 규칙을 덜 엄격하게 적용하거나 로그인 시도를 조금 더 관대하게 허용할 때 유용합니다. 이 여섯 번째 필드에 별표가 사용되면 차단이 비활성화됩니다.
ru: В столбце `nfail` можно задать произвольное количество неудачных попыток для адреса. Это полезно для исключений из конкретного правила, например, чтобы разрешить кому-то менее строгое применение правил или немного больше попыток входа. Блокировка отключается, если в шестом поле указана звёздочка.

source: Remote rules allow a stricter enforcement of limits on attempts to log in compared to attempts coming from a local network like an office.
ko: 원격 규칙을 사용하면 사무실과 같은 로컬 네트워크에서 발생하는 로그인 시도에 비해 로그인을 더 엄격하게 제한할 수 있습니다.
ru: Удаленные правила позволяют более строго ограничивать попытки входа по сравнению с попытками, поступающими из локальной сети, например, из офиса.

source: Blacklistd Client Configuration
ko: blacklistd 클라이언트 구성
ru: Конфигурация клиента blacklistd

source: There are a few software packages in FreeBSD that can utilize blacklistd's functionality. The two most prominent ones are man:ftpd[8] and man:sshd[8] to block excessive connection attempts. To activate blacklistd in the SSH daemon, add the following line to [.filename]#/etc/ssh/sshd_config#:
ko: FreeBSD에는 blacklistd의 기능을 활용할 수 있는 몇 가지 소프트웨어 패키지가 있습니다. 가장 눈에 띄는 두 패키지는 과도한 연결 시도를 차단하는 man:ftpd[8] 및 man:sshd[8]입니다. SSH 데몬에서 blacklistd를 활성화하려면 [.filename]#/etc/ssh/sshd_config#에 다음 줄을 추가합니다:
ru: В FreeBSD есть несколько программных пакетов, которые могут использовать функциональность blacklistd. Два наиболее заметных — это man:ftpd[8] и man:sshd[8], предназначенные для блокировки чрезмерных попыток подключения. Чтобы активировать blacklistd в демоне SSH, добавьте следующую строку в [.filename]#/etc/ssh/sshd_config#:

source: Restart sshd afterwards to make these changes take effect.
ko: 변경 사항을 적용하려면 나중에 sshd를 다시 시작하세요.
ru: Перезапустите sshd, чтобы изменения вступили в силу.

source: Blacklisting for man:ftpd[8] is enabled using `-B`, either in [.filename]#/etc/inetd.conf# or as a flag in [.filename]#/etc/rc.conf# like this:
ko: man:ftpd[8]에 대한 블랙리스트는 [.filename]#/etc/inetd.conf#에서 `-B`를 사용하거나 다음과 같이 [.filename]#/etc/rc.conf#에서 플래그로 사용합니다:
ru: Черный список для man:ftpd[8] включается с помощью `-B`, либо в [.filename]#/etc/inetd.conf#, либо как флаг в [.filename]#/etc/rc.conf# следующим образом:

source: That is all that is needed to make these programs talk to blacklistd.
ko: 프로그램이 blacklistd와 통신하는 데 필요한 것은 이것뿐입니다.
ru: Вот и всё, что требуется для настройки взаимодействия этих программ с blacklistd.

source: Blacklistd Management
ko: blacklistd 관리
ru: Управление blacklistd

source: Blacklistd provides the user with a management utility called man:blacklistctl[8]. It displays blocked addresses and networks that are blocklisted by the rules defined in man:blacklistd.conf[5]. To see the list of currently blocked hosts, use `dump` combined with `-b` like this.
ko: Blacklistd는 사용자에게 man:blacklistctl[8]이라는 관리 유틸리티를 제공합니다. 이 유틸리티는 man:blacklistd.conf[5]에 정의된 규칙에 따라 차단된 주소와 네트워크를 표시합니다. 현재 차단된 호스트 목록을 보려면 다음과 같이 `dump`와 `-b`를 결합하여 사용합니다.
ru: Blacklistd предоставляет пользователю утилиту управления под названием man:blacklistctl[8]. Она отображает заблокированные адреса и сети, которые внесены в список блокировки согласно правилам, определённым в man:blacklistd.conf[5]. Чтобы просмотреть список текущих заблокированных хостов, используйте команду `dump` с параметром `-b`, например.

source: This example shows that there were 6 out of three permitted attempts on port 22 coming from the address range `213.0.123.128/25`. There are more attempts listed than are allowed because SSH allows a client to try multiple logins on a single TCP connection. A connection that is currently going on is not stopped by blacklistd. The last connection attempt is listed in the `last access` column of the output.
ko: 이 예에서는 `213.0.123.128/25` 주소 범위에서 포트 22에 허용된 3번의 시도에 대해 6번의 시도가 있었음을 보여줍니다. 허용된 시도보다 더 많은 시도가 나열된 이유는 SSH를 사용하면 클라이언트가 단일 TCP 연결에서 여러 번 로그인을 시도할 수 있기 때문입니다. 현재 진행 중인 연결은 블랙리스트에 의해 중지되지 않습니다. 마지막 연결 시도는 출력의 `last access` 열에 나열됩니다.
ru: Этот пример показывает, что было 6 попыток из трёх разрешённых на порт 22, исходящих из диапазона адресов `213.0.123.128/25`. Количество попыток превышает разрешённое, потому что SSH позволяет клиенту выполнять несколько попыток входа в рамках одного TCP-соединения. Текущее соединение не прерывается blacklistd. Последняя попытка соединения указана в столбце `last access` вывода.

source: To see the remaining time that this host will be on the blocklist, add `-r` to the previous command.
ko: 이 호스트가 차단 목록에 남아있는 남은 시간을 확인하려면 이전 명령에 `-r`을 추가합니다.
ru: Чтобы увидеть оставшееся время, в течение которого этот хост будет в списке блокировки, добавьте `-r` к предыдущей команде.

source: In this example, there are 36s seconds left until this host will not be blocked any more.
ko: 이 예에서는 이 호스트가 더 이상 차단되지 않을 때까지 36초가 남았습니다.
ru: В этом примере осталось 36 секунд, пока этот хост не будет разблокирован.

source: Removing Hosts from the Block List
ko: Block List에서 호스트 제거하기
ru: Удаление узлов из списка блокировки

source: Sometimes it is necessary to remove a host from the block list before the remaining time expires. Unfortunately, there is no functionality in blacklistd to do that. However, it is possible to remove the address from the PF table using pfctl. For each blocked port, there is a child anchor inside the blacklistd anchor defined in [.filename]#/etc/pf.conf#. For example, if there is a child anchor for blocking port 22 it is called `blacklistd/22`. There is a table inside that child anchor that contains the blocked addresses. This table is called port followed by the port number. In this example, it would be called `port22`. With that information at hand, it is now possible to use man:pfctl[8] to display all addresses listed like this:
ko: 남은 시간이 만료되기 전에 차단 목록에서 호스트를 제거해야 하는 경우가 있습니다. 안타깝게도 블랙리스트에는 이를 수행할 수 있는 기능이 없습니다. 그러나 pfctl을 사용하여 PF 테이블에서 주소를 제거할 수 있습니다. 차단된 각 포트에 대해 [.filename]#/etc/pf.conf#에 정의된 blacklistd 앵커 내부에 하위 앵커가 있습니다. 예를 들어, 포트 22를 차단하는 자식 앵커가 있으면 `blacklistd/22`라고 합니다. 해당 하위 앵커 내부에는 차단된 주소가 포함된 테이블이 있습니다. 이 테이블은 포트 뒤에 포트 번호가 붙습니다. 이 예제에서는 `port22`라고 합니다. 이 정보가 있으면 이제 man:pfctl[8]을 사용하여 이와 같이 나열된 모든 주소를 표시할 수 있습니다:
ru: Иногда необходимо удалить узел из чёрного списка до истечения оставшегося времени. К сожалению, в blacklistd нет функциональности для этого. Однако можно удалить адрес из таблицы PF с помощью pfctl. Для каждого заблокированного порта существует дочерний якорь внутри якоря blacklistd, определённого в [.filename]#/etc/pf.conf#. Например, если есть дочерний якорь для блокировки порта 22, он называется `blacklistd/22`. Внутри этого дочернего якоря находится таблица, содержащая заблокированные адреса. Эта таблица называется port с указанием номера порта. В данном примере она будет называться `port22`. Имея эту информацию, можно использовать man:pfctl[8] для отображения всех перечисленных адресов следующим образом:

source: After identifying the address to be unblocked from the list, the following command removes it from the list:
ko: 목록에서 차단을 해제할 주소를 식별한 후 다음 명령을 실행하면 목록에서 해당 주소가 삭제됩니다:
ru: После определения адреса, который нужно разблокировать из списка, следующая команда удаляет его из списка:

source: The address is now removed from PF, but will still show up in the blacklistctl list, since it does not know about any changes made in PF. The entry in blacklistd's database will eventually expire and be removed from its output. The entry will be added again if the host is matching one of the block rules in blacklistd again.
ko: 이제 해당 주소는 PF에서 제거되었지만 PF에서 변경된 내용을 알지 못하므로 blacklistctl 목록에는 계속 표시됩니다. blacklistd의 데이터베이스 항목은 결국 만료되어 출력에서 제거됩니다. 호스트가 blacklistd의 차단 규칙 중 하나와 일치하는 경우 해당 항목이 다시 추가됩니다.
ru: Адрес теперь удалён из PF, но всё ещё будет отображаться в списке blacklistctl, так как он не знает о внесённых в PF изменениях. Запись в базе данных blacklistd со временем истечёт и будет удалена из вывода. Запись будет добавлена снова, если хост снова совпадёт с одним из правил блокировки в blacklistd.

source: Chapter 33. Firewalls
ru: Глава 33. Межсетевые экраны

source: To lookup unknown port numbers, refer to [.filename]#/etc/services#. Alternatively, visit https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers[https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers] and do a port number lookup to find the purpose of a particular port number.
ru: Для поиска неизвестных номеров портов обратитесь к [.filename]#/etc/services#. Или посетите https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers[https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers] и выполните поиск по номеру порта, чтобы узнать его назначение.

source: To control PF, use `pfctl`. crossref:firewalls[pfctl,Useful `pfctl` Options] summarizes some useful options to this command. Refer to man:pfctl[8] for a description of all available options:
ru: Для управления PF используйте `pfctl`. crossref:firewalls[pfctl,Полезные опции `pfctl`] содержит сводку полезных опций этой команды. За подробным описанием всех доступных опций обратитесь к man:pfctl[8]:

source: For those users who wish to statically compile IPFW support into a custom kernel, see crossref:firewalls[firewalls-ipfw-kernelconfig, IPFW Kernel Options].
ru: Для пользователей, которые хотят статически скомпилировать поддержку IPFW в собственном ядре, см. crossref:firewalls[firewalls-ipfw-kernelconfig, Параметры ядра IPFW].

source: In-kernel NAT
ru: NAT в ядре системы

source: To enable the userspace NAT daemon man:natd[8] at boot time, the following is a minimum configuration in [.filename]#/etc/rc.conf#. Where `natd_interface` is set to the name of the NIC attached to the Internet. The man:rc[8] script of man:natd[8] will automatically check if a dynamic IP address is used and configure itself to handle that.
ru: Для включения демона NAT в пользовательском пространстве man:natd[8] при загрузке, следующая минимальная конфигурация должна быть добавлена в [.filename]#/etc/rc.conf#. Параметр `natd_interface` должен быть установлен равным имени сетевого интерфейса, подключенного к Интернету. Скрипт man:rc[8] для man:natd[8] автоматически проверит, используется ли динамический IP-адрес, и настроит себя соответствующим образом.
