Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/mailing-list-faq/_index.po
Languages: es, id, ru

source: How to best use the mailing lists, such as how to help avoid frequently-repeated discussions
es: Cómo usar bien las listas de correo, por ejemplo cómo evitar discusiones que se repiten frecuentemente
id: Cara terbaik untuk menggunakan mailing list, seperti cara menghindari diskusi yang sering terulang
ru: Как оптимально использовать почтовые рассылки, в том числе как избежать часто повторяющихся обсуждений

source: Frequently Asked Questions About The FreeBSD Mailing Lists
es: Preguntas más frecuentes sobre las listas de correo de FreeBSD
id: Pertanyaan yang Sering Ditanyakan Tentang Mailing List FreeBSD
ru: Часто задаваемые вопросы по спискам рассылки FreeBSD

source: Abstract
es: Resumen
id: Abstrak
ru: Аннотация

source: This is the FAQ for the FreeBSD mailing lists. If you are interested in helping with this project, send email to the {freebsd-doc}. The latest version of this document is always available from the link:.[FreeBSD World Wide Web server]. It may also be downloaded as one large link:.[HTML] file with HTTP or as plain text, PostScript, PDF, etc. from the https://download.freebsd.org/doc/[FreeBSD FTP server]. You may also want to link:https://www.FreeBSD.org/search/[Search the FAQ].
es: Este es el FAQ de las listas de correo de FreeBSD. Si estás interesado en ayudar con este proyecto, manda un email a {freebsd-doc}. La última versión de este documento siempre está disponible en el link:.[servidor World Wide Web de FreeBSD]. También se puede descargar como un gran fichero link:.[HTML] por HTTP o como texto plano, PostScript, PDF, etc. desde https://download.freebsd.org/doc/[servidor FTP de FreeBSD].
id: Ini adalah pertanyaan yang sering ditanyakan untuk mailing list FreeBSD. Jika anda tertarik untuk membantu proyek ini, kirim email ke {freebsd-doc}. Versi terbaru dokumen ini selalu tersedia di link:.[Server World Wide Web FreeBSD]. Dokumen ini juga dapat didownload sebagai satu file link:.[HTML] yang besar dengan HTTP atau sebagai teks biasa, PostScript, PDF, dan lain-lain dari https://download.freebsd.org/doc/[Server FTP FreeBSD]. Anda juga mungkin ingin link:https://www.FreeBSD.org/search/[Mencari sesuatu di dokumen ini].
ru: Эта статья посвящена часто задаваемым вопросам (FAQ) по спискам рассылки FreeBSD. Если вы хотите помочь поддерживать данный документ, напишите письмо в {freebsd-doc}. Последняя версия данного документа доступна на link:.[WWW сервере FreeBSD]. Вы можете получить данную статью в виде одного большого link:.[HTML] файла, используя HTTP протокол или в виде простого текста, форматов PostScript, PDF, и других с https://download.freebsd.org/doc/[FTP сервера FreeBSD]. Возможно вы захотите link:https://www.FreeBSD.org/search/[Найти FAQ].

source: Introduction
es: Introducción
id: Pendahuluan
ru: Введение

source: As is usual with FAQs, this document aims to cover the most frequently asked questions concerning the FreeBSD mailing lists (and of course answer them!). Although originally intended to reduce bandwidth and avoid the same old questions being asked over and over again, FAQs have become recognized as valuable information resources.
es: Como es habitual en las FAQ, este documento pretende cubrir las preguntas más frecuentes relacionadas con las listas de correo de FreeBSD (¡y por supuesto, responderlas!). Aunque originalmente tenía la intención de reducir el ancho de banda y evitar que se hicieran las mismas preguntas una y otra vez, las FAQ han sido reconocidas como un recurso de información valioso.
id: Seperti biasanya dengan FAQ, dokumen ini bertujuan untuk mencakup pertanyaan-pertanyaan yang paling sering ditanyakan tentang mailing list FreeBSD (dan pasti akan menjawabnya!). Walaupun pada awalnya dimaksudkan untuk mengurangi bandwidth and menghindari pertanyaan yang sama ditanyakan berulang kali, FAQ telah dikenali sebagai sumber informasi yang berharga.
ru: Цель этого документа ответить на часто задаваемые вопросы, касающиеся списков рассылки FreeBSD. Хотя FAQ задумывались для снижения количества задаваемых повторяющихся вопросов, они стали восприниматься, как ценные источники информации.

source: This document attempts to represent a community consensus, and as such it can never really be __authoritative__. However, if you find technical errors within this document, or have suggestions about items that should be added, please either submit a PR, or email the {freebsd-doc}. Thanks.
es: Este documento intenta representar el consenso de la comunidad, y como tal nunca puede ser __una fuente de autoridad__. Sin embargo, si encuentras errores técnicos en este documento, o tienes sugerencias acerca de puntos que deberían ser añadidos, por favor, envía un PR, o email a {freebsd-doc}. Gracias.
id: Dokumen ini mencoba untuk mewakilkan konsensus komunitas, dan oleh karena itu tidak akan dapat menjadi __otoritatif__. Namun, jika anda menemukan kesalahan taknis di dalam dokumen ini, atau memiliki usulan tentang hal-hal yang perlu ditambahkan, mohon untuk mengirimkan problem report (PR), atau kirim email ke {freebsd-doc}. Terima kasih.
ru: Этот документ - попытка представить консенсус всего сообщества, и поэтому он не может считаться __официальным__. Если вы найдете технические неточности в данном документе или у вас есть предложения по добавлению новых пунктов, пожалуйста отправьте PR или напишите в {freebsd-doc}. Спасибо.

source: What is the purpose of the FreeBSD mailing lists?
es: ¿Cuál es el propósito de las listas de correo de FreeBSD?
id: Apa fungsi dari mailing list FreeBSD?
ru: Зачем вообще нужны списки рассылки по FreeBSD?

source: The FreeBSD mailing lists serve as the primary communication channels for the FreeBSD community, covering many different topic areas and communities of interest.
es: Las listas de correo de FreeBSD constituyen el canal principal de comunicación de la comunidad de FreeBSD, cubriendo varias áreas y comunidades de intereses diferentes.
id: Mailing list FreeBSD melayani sebagai cara komunikasi utama untuk komunitas FreeBSD, mencakup banyak topik dan komunitas-komunitas dengan kepentingan yang sama.
ru: Списки рассылки по FreeBSD служат, как первичное средство связи FreeBSD сообщества, они покрывают множество различных тем.

source: Who is the audience for the FreeBSD mailing lists?
es: ¿Quién es el público de las listas de correo de FreeBSD?
id: Siapa audience untuk mailing list FreeBSD?
ru: Кто пользуется этими списками рассылки?

source: This depends on charter of each individual list. Some lists are more oriented to developers; some are more oriented towards the FreeBSD community as a whole. Please see link:https://lists.FreeBSD.org/[this list] for the current summary.
es: Esto depende de cómo se constituya cada lista individual. Algunas listas están más orientadas hacia los desarrolladores; algunas están más orientadas hacia la comunidad de FreeBSD en su conjunto. Por favor, visita link:https://lists.FreeBSD.org/[esta lista] para ver un resumen actualizado.
id: Ini tergantung dengan kegunaan masing-masing mailing list. Beberapa mailing list lebih berorientasi kepada pengembang perangkat lunak; beberapa mailing list lebih berorientasi kepada keseluruhan komunitas FreeBSD. Lihat https://lists.FreeBSD.org/[daftar ini] untuk ringkasan saat ini.
ru: Это зависит от регламента каждой конкретной рассылки. Некоторые списки больше ориентированы на разработчиков, некоторые - на всё сообщество FreeBSD в целом. Актуальную информацию смотрите по ссылке: link:https://lists.FreeBSD.org/[этот список].

source: Lists are English language, unless stated otherwise.
es: Las listas están en Inglés, a menos que se especifique lo contrario.
ru: В списках рассылки используется английский язык, если другой язык не указан явно.

source: Are the FreeBSD mailing lists open for anyone to participate?
es: ¿Las listas de correo de FreeBSD están abiertas para que cualquiera pueda participar?
id: Apakah mailing list FreeBSD terbuka untuk partisipasi siapa pun?
ru: Доступны ли списки рассылки по FreeBSD для каждого?

source: Again, this depends on charter of each individual list. Please read the charter of a mailing list before you post to it, and respect it when you post. This will help everyone to have a better experience with the lists.
es: Una vez más, esto depende del cometido oficial de cada lista en particular. Por favor, consulta el chárter (la declaración del cometido de las listas de correo) antes de enviar un correo a la lista y sigue la filosofía de dicha lista en los envíos que haga. Esto ayudará al resto de usuarios a sacar más provecho de la lista.
id: Lagi, ini tergantung kegunaan masing-masing mailing list. Mohon baca kegunaan sebuah mailing list sebelum anda memposting, dan menghprmatinya ketika anda memposting. Ini akan membantu semua orang untuk memiliki pengalaman yang lebih baik dengan mailing list FreeBSD.
ru: Повторюсь: это зависит от устава (правил) каждого конкретного списка рассылки. Пожалуйста, прочтите устав списка перед отправкой в него письма и соблюдайте его при каждом сообщении. Это способствует более комфортной работе со списками рассылки.

source: If after reading the above lists, you still do not know which mailing list to post a question to, you will probably want to post to freebsd-questions (but see below, first).
es: Si después de leer las listas anteriores todavía no has podido discernir a qué lista debes enviar tu pregunta, probablemente puedas enviar la consulta a la lista freebsd-questions (pero por favor lee más abajo antes de hacerlo).
id: Jika setelah membaca daftar mailing list di atas, anda masih tidak tahu mailing list dimana anda akan memposting pertanyaan, anda mungkin akan ingin memposting ke freebsd-questions (namun sebelumnya baca yang di bawah terlebih dahulu).
ru: Если после просмотра выше расположенного списка, вы до сих пор не знаете в какой список рассылки направить письмо, то вам наверняка подойдёт freebsd-questions (но прежде прочтите советы ниже).

source: Also note that the mailing lists have traditionally been open to postings from non-subscribers. This has been a deliberate choice, to help make joining the FreeBSD community an easier process, and to encourage open sharing of ideas. However, due to past abuse by some individuals, certain lists now have a policy where postings from non-subscribers must be manually screened to ensure that they are appropriate.
es: Ten en cuenta también que las listas de correo tradicionalmente han estado abiertas a la recepción de correo por parte de no subscriptores. Esta ha sido una elección deliberada, para hacer que unirse a la comunidad de FreeBSD sea un proceso más fácil y para fomentar el intercambio abierto de ideas. No obstante, debido a los abusos de envío masivo de correos por parte de algunos individuos, ciertas listas ahora tienen una política según la cual las publicaciones de no suscriptores deben seleccionarse manualmente para asegurarse de que sean apropiadas.
id: Juga diingat bahwa mailing list FreeBSD awalnya terbuka untuk posting dari non-subscriber. Ini adalah pilihan yang disengaja, untuk membantu membuat bergabung dengan komunitas FreeBSD proses yang lebih mudah, dan untuk mendorong berbagi ide secara terbuka. Namun, karena penyalahgunaan di masa lalu oleh beberapa individu, mailing list tertentu memiliki peraturan dimana posting dari non-subscriber harus disaring secara manual untuk memastikan mereka pantas.

source: How can I subscribe?
es: ¿Cómo puedo suscribirme?
id: Bagaimana saya subscribe?
ru: Как я могу подписаться?

source: You can use link:https://lists.FreeBSD.org/[the Mlmmj web interface] to subscribe to any of the public lists.
es: Puedes utilizar link:https://lists.FreeBSD.org/[el interfaz web de Mlmmj] para subscribirte a cualquiera de las listas públicas.
id: Anda dapat menggunakan link:https://lists.FreeBSD.org/[antarmuka web Mlmmj] untuk subscribe ke mailing list FreeBSD publik manapun.
ru: Вы можете использовать link:https://lists.FreeBSD.org/[web интерфейс Mlmmj] для подписки на любой из открытых списков рассылки.

source: How can I unsubscribe?
es: ¿Cómo puedo darme de baja?
id: Bagaimana saya unsubscribe?
ru: Как мне отписаться?

source: You can use the same interface as above; or, you can follow the instructions that are at the bottom of every mailing list message that is sent.
es: Puede utilizar exactamente la misma interfaz que en el caso anterior; o puede seguir las instrucciones que se añaden automáticamente al final de cualquier mensaje publicado en la lista.
id: Anda dapat menggunakan antarmuka yang sama dengan yang di atas; atau anda dapat mengikuti instruksi yang ada di bawah pesan yang terkirim di mailing list.
ru: Вы можете использовать вышеупомянутый интерфейс или следовать инструкциям, находящимся в конце каждого письма, отправленного в этот список рассылки.

source: Please do not send unsubscribe messages directly to the public lists themselves. First, this will not accomplish your goal, and second, it will irritate the existing subscribers, and you will probably get flamed. This is a classical mistake when using mailing lists; please try to avoid it.
es: Por favor, no envíes mensajes de baja directamente a la lista de correo. Primero, con esto no obtendrás tu objetivo, y en segundo lugar, irritarás a los subscriptores y probablemente serás increpado por ello. Se trata de un error bastante común cuando se comienza a utilizar listas de correo; por favor, intenta evitarlo.
id: Mohon untuk tidak mengirimkan pesan unsubscribe secara langsung ke mailing list publik. Pertama, ini tidak akan mencapai tujuan anda, dan kedua, ini akan mengganggu subscriber lain, dan anda mungkin akan di-flame. Ini adalah kesalahan klasik ketika menggunakan mailing list; mohon mencoba untuk menghindarinya.
ru: Пожалуйста, не посылайте письма с отказом от подписки в сами публичные списки. Во-первых, вы так не отпишитесь, а во-вторых, вызовете раздражение подписчиков, и вероятно получите неприятные высказывания в свой адрес. Это классическая ошибка при работе со списками рассылки; старайтесь не повторять её.

source: Are archives available?
es: ¿Están los archivos históricos disponibles?
id: Apakah arsip tersedia?
ru: Доступны ли архивы?

source: Yes. Threaded archives are available link:https://docs.FreeBSD.org/mail/[here]. You can also access https://lists.freebsd.org/pipermail[mailman archive] and link:https://lists.freebsd.org/archives[mlmmj archive] directly.
es: Sí. Hay disponibles archivos en formato de hilo de conversación link:https://docs.FreeBSD.org/mail/[aquí]. También puedes acceder al https://lists.freebsd.org/pipermail[archivo de mailman] y al link:https://lists.freebsd.org/archives[archivo de mlmmj] directamente.
id: Ya, arsip dengan thread tersedia link:https://docs.FreeBSD.org/mail/[disini]. Anda juga dapat mengakses https://lists.freebsd.org/pipermail[arsip mailman] dan link:https://lists.freebsd.org/archives[arsip mlmmj] secara langsung.

source: Are mailing lists available in a digest format?
es: ¿Las listas de correo están disponibles en un formato resumen (digest)?
id: Apakah mailing list tersedia dalam format digest?
ru: Доступны ли списки рассылки в дайджест формате?

source: Yes. See link:https://lists.FreeBSD.org/[the Mlmmj web interface].
es: Sí. Visita link:https://lists.FreeBSD.org/[el interfaz web de Mlmmj].
id: Ya. Lihat link:https://lists.FreeBSD.org/[antarmuka web Mlmmj].
ru: Да. Посмотрите link:https://lists.FreeBSD.org/[веб интерфейс Mlmmj].

source: Mailing List Etiquette
es: Normas de protocolo de las listas de correo
id: Etika dalam Mailing List
ru: Этикет списков рассылки

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Please make only appropriate postings, and follow common rules of etiquette.
es: La participación en listas de correo, al igual que en cualquier otra comunidad, requiere una base común para la comunicación. Por favor, haz únicamente preguntas o respuestas adecuadas y sigue las reglas de protocolo habituales.
id: Partisipasi dalam mailing list, seperti partisipasi dalam komunitas apapun, memerlukan cara umum untuk berkomunikasi. Mohon untuk hanya membuat posting yang pantas, dan ikuti aturan etika yang umum.
ru: Участие в любом списке рассылки, как и в любом другом сообществе требует общего базиса для общения. Пожалуйста, отправляйте только подходящие сообщения и следуйте общепринятым нормам этикета.

source: What should I do before I post?
es: ¿Qué debo hacer antes de enviar un correo?
id: Apa yang harus saya lakukan sebelum saya posting?
ru: Что я должен сделать перед отправлением письма?

source: You have already taken the most important step by reading this document. However, if you are new to FreeBSD, you may first need to familiarize yourself with the software, and all the social history around it, by reading the numerous link:https://www.FreeBSD.org/docs/books/[books and articles] that are available. Items of particular interest include the extref:{faq}[FreeBSD Frequently Asked Questions (FAQ)] document, the extref:{handbook}[FreeBSD Handbook], and the articles extref:{freebsd-questions-article}[How to get best results from the FreeBSD-questions mailing list], extref:{explaining-bsd}[Explaining BSD], and extref:{new-users}[FreeBSD First Steps].
es: Leyendo este documento ya has realizado el paso más importante. Sin embargo, si eres nuevo en FreeBSD, podrías necesitar primero familiarizarte con el software y con toda la historia social a su alrededor leyendo los numerosos link:https://www.FreeBSD.org/docs/books/[libros y artículos] que hay disponibles. Algunos elementos de especial interés incluyen el documento de he extref:{faq}[Preguntas Frecuentas de FreeBSD (FAQ)], el extref:{handbook}[manual de FreeBSD], y los artículos extref:{freebsd-questions-article}[Cómo obtener los mejores resultados de la lista de correo de FreeBSD-questions], extref:{explaining-bsd}[Explicando BSD], y extref:{new-users}[primeros pasos con FreeBSD].
id: Anda telah mengambil langkah yang paling penting dengan membaca dokumen ini. Namun, jika anda baru mengenal FreeBSD, anda pertama-tama harus membiasakan diri dengan perangkat lunaknya, dan semua sejarah sosial disekitarnya, dengan membaca banyak link:https://www.FreeBSD.org/docs/books/[buku dan artikel] yang tersedia. Hal yang penting untuk dibaca termasuk dokumen extref:{faq}[Pertanyaan yang Sering Ditanyakan (FAQ) Tentang FreeBSD], extref:{handbook}[Buku Pegangan FreeBSD], dan artikel extref:{freebsd-questions-article}[Cara mendapat hasil yang terbaik dari mailing list FreeBSD-questions], extref:{explaining-bsd}[Menjelaskan BSD], dan extref:{new-users}[Langkah-langkah Pertama FreeBSD].
ru: Вы уже сделали важный шаг, решив прочитать эту статью. Если вы новичок во FreeBSD, то сначала ознакомьтесь с программным обеспечением и связанной с нею документацией, включающей множество extref:https://www.FreeBSD.org/docs/[книг и статьей]. Могут быть интересными: extref:{faq}[Часто задаваемые вопросы по FreeBSD (FAQ)], extref:{handbook}[Руководство по FreeBSD], и статьи extref:{freebsd-questions-article}[Как работать со списком рассылки FreeBSD-questions с максимальной отдачей], extref:{explaining-bsd}[Что такое BSD], и extref:{new-users}[Пособие для новичков во FreeBSD].

source: It is always considered bad form to ask a question that is already answered in the above documents. This is not because the volunteers who work on this project are particularly mean people, but after a certain number of times answering the same questions over and over again, frustration begins to set in. This is particularly true if there is an existing answer to the question that is already available. Always keep in mind that almost all of the work done on FreeBSD is done by volunteers, and that we are only human.
es: Enviar una consulta sobre algo que ya está respondido en los documentos anteriores se considera malas formas. Esto no ocurre porque los voluntarios que colaboran en las listas sean personas especialmente susceptibles, sino porque después de un cierto tiempo respondiendo una y otra vez las mismas preguntas las personas comienzan a sentirse frustradas. Ten siempre en cuenta que casi todo el trabajo realizado en FreeBSD lo realizan voluntarios, y que simplemente somos humanos.
id: Bertanya tentang hal-hal yang sudah dijawab didalam dokumen-dokumen diatas dianggap sebagai hal yang buruk. Ini bukanlah karena para relawan yang bekerja dalam proyek ini adalah orang-orang yang kejam, tetapi setelah menjawab pertanyaan-pertanyaan yang sama berulang kali, frustrasi mulai terjadi. Hal ini terutama nyata jika sudah ada jawaban yang tersedia. Selalu ingat bahwa hampir semua pekerjaan yang dilakukan di FreeBSD dilakukan oleh relawan, dan kita hanyalah manusia.
ru: Считается дурным тоном задавать вопросы, на которые уже есть ответ в приведённых выше документах. Это не потому что добровольцы, работающие над данным проектом очень плохие люди, а после многократного ответа на одни и те же вопросы - раздражение берёт своё. Это особенно справедливо, если уже существует и доступен ответ на вопрос. Не забывайте, что вся работа по улучшению FreeBSD выполняется добровольцами, и что мы только люди.

source: What constitutes an inappropriate posting?
es: ¿Qué se considera un mensaje inapropiado?
id: Apa yang merupakan posting yang tidak pantas?
ru: Что считается несоответствующим письмом?

source: Postings must be in accordance with the charter of the mailing list.
es: Las publicaciones deben seguir el charter de la lista de correo.
id: Posting harus sesuai dengan kegunaan sebuah mailing list.
ru: Письма должны соответствовать уставу списка рассылки.

source: Personal attacks are discouraged. As good net-citizens, we should try to hold ourselves to high standards of behavior.
es: Por favor, evita los ataques personales. Como buenos ciudadanos de la red, debemos tratar de mantenernos en unos altos estándares de comportamiento.
id: Serangan secara pribadi sebaiknya tidak dilakukan. Sebagai warganet yang baik, kita harus mencoba untuk menahan diri pada standar perilaku yang tinggi.
ru: Личные нападки недопустимы. Как ответственные участники сетевого сообщества, мы должны придерживаться высоких стандартов поведения.

source: Spam is not allowed, ever. The mailing lists are actively processed to ban offenders to this rule.
es: No se permite el spam, en ningún caso. Las listas de correo se procesan constantemente para asegurarse del cumplimiento de esta regla.
id: Spam tidak diperbolehkan, dan tidak akan pernah diperbolehkan. Mailing list diproses secara aktif untuk melarang pelanggar aturan ini.
ru: Спам не разрешён. Нарушители данного правила будут забаненны.

source: What is considered proper etiquette when posting to the mailing lists?
es: ¿Qué se considera como una norma de etiqueta apropiada cuando se envían correos a las listas?
id: Apa yang dianggap etika yang layak ketika posting ke mailing list?
ru: Что считается хорошим этикетом при посылке писем в списки рассылки?

source: Please wrap lines at 75 characters, since not everyone uses fancy GUI mail reading programs.
es: Por favor ajusta todas las líneas a 75 caracteres, ya que no todo el mundo utiliza programas de correo con interfaces gráficas avanzadas.
id: Mohon wrap baris di 75 karakter, karena tidak semua orang menggunakan program pembaca email GUI yang mewah.
ru: Пожалуйста, составляйте строки длиной примерно в 75 символов, так как не каждый использует модную почтовую программу с графическим интерфейсом.
