Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/mailing-list-faq/_index.po
Languages: es, id, ru

source: Please respect the fact that bandwidth is not infinite. Not everyone reads email through high-speed connections, so if your posting involves something like the content of [.filename]#config.log# or an extensive stack trace, please consider putting that information up on a website somewhere and just provide a URL to it. Remember, too, that these postings will be archived indefinitely, so huge postings will simply inflate the size of the archives long after their purpose has expired.
es: Por favor, ten presente el hecho de que el ancho de banda no es un recurso infinito. No todo el mundo lee el correo electrónico a través de conexiones de alta velocidad, de forma que si tus mensajes contienen adjuntos tales como el contenido del fichero [.filename]#config.log# o un amplio volcado de la pila, considera colocar esa información en un sitio web y proporciona solo la URL. Recuerda, también, que estas publicaciones se archivarán indefinidamente, por lo que las publicaciones enormes aumentarán el tamaño de los archivos mucho después de que su propósito haya expirado.
id: Mohon menghormati fakta bahwa bandwidth tidak tak terhingga. Tidak semua orang membaca email melalui koneksi internet berkecepatan tinggi, jadi jika posting anda melibatkan sesuatu seperti isi dari [.filename]#config.log# atau jejak stack yang sangat besar, pertimbangkan untuk menguploadnya di sebuah website dan sediakan URL untuk website itu. Ingat juga bahwa posting ini akan diarsipkan tanpa batas waktu, jadi posting besar akan membuat ukuran arsip jadi lebih besar lama setelah fungsinya berakhir.
ru: Пожалуйста, обращайте внимание на тот факт, что пропускная способность ограничена. Не каждый читает почту через высокоскоростное соединение. Если вы отправляете содержимое какого-нибудь файла, например [.filename]#config.log# или объёмную трассировку стека, то, пожалуйста, размещайте его на каком-нибудь веб-сайте и присылайте просто ссылку на него. Помните, что такие сообщения будут заархивированны, и это просто добавит ненужные байты к архиву.

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. Do not underestimate the effect that a poorly formatted mail message has, and not just on the FreeBSD mailing lists. Your mail message is all that people see of you, and if it is poorly formatted, badly spelled, full of errors, and/or has lots of exclamation points, it will give people a poor impression of you.
es: Formatea tu mensaje de forma que sea legible, y, ¡¡¡¡¡POR FAVOR NO GRITES!!!!! No subestimes el efecto que tiene un mensaje de correo mal formateado, y no solo en las listas de correo de FreeBSD. Tu mensaje de correo es todo lo que la gente ve de ti, y si está mal formateado, mal escrito, lleno de errores y/o tiene muchos signos de exclamación, darás a la gente una mala impresión.
id: Format pesan anda sehingga dapat dibaca, dan MOHON JANGAN BERTERIAK!!!!!. Jangan meremehkan efek dari pesan email yang tidak diformat dengan baik, dan tidak hanya di mailing list FreeBSD. Pesan email anda adalah semua yang orang lain lihat terhadap anda, dan jika itu tidak diformat dengan baik, tidak dieja dengan baik, penuh kesalahan, dan/atau memiliki banyak tanda seru, itu akan memberi orang lain kesan yang buruk terhadap anda.
ru: Оформляйте ваше сообщение, чтобы оно было читабельно и ПОЖАЛУЙСТА, НЕ КРИЧИТЕ!!!!!. Не упускайте из виду эффект, которое производит плохо отформатированное письмо, причём не только в списках рассылки FreeBSD. Ваше сообщение будет просмотрено другими людьми, и если оно плохо отформатировано, имеет множество ошибок и/или восклицательных знаков, то это создаст нехорошее впечатление о вас.

source: Please use an appropriate human language for a particular mailing list. Many non-English mailing lists are link:https://www.FreeBSD.org/community/mailinglists/[available].
es: Por favor utiliza el idioma apropiado para cada lista de correo particular. Hay link:https://www.FreeBSD.org/community/mailinglists/[disponibles] muchas listas de correo de habla no inglesa.
id: Mohon gunakan bahasa manusia yang pantas untuk sebuah mailing list. Banyak mailing list yang tidak berbahasa Inggris link:https://www.FreeBSD.org/community/mailinglists/[tersedia].
ru: Пожалуйста, используйте подходящий язык общения для конкретного списка рассылки. link:https://www.FreeBSD.org/community/mailinglists/[ Существует] много не англоязычных рассылок.

source: For the ones that are not, we do appreciate that many people do not speak English as their first language, and we try to make allowances for that. It is considered particularly poor form to criticize non-native speakers for spelling or grammatical errors. FreeBSD has an excellent track record in this regard; please, help us to uphold that tradition.
es: Para las que no lo son, sabemos que muchas personas no hablan inglés como primer idioma, y tratamos de hacer concesiones. Criticar a hablantes de inglés no nativos por una gramática pobre o errores en su escritura se consideran (muy) malos modos. FreeBSD posee un excelente bagaje en este tema; por favor ayúdanos a mantener esta tradición.
id: Untuk orang-orang yang tidak berbahasa Inggris, kami menghargai bahwa banyak orang tidak berbahasa Inggris sebagai bahasa utama mereka, dan kami mencoba untuk menerimanya. Mengkritik orang-orang yang tidak berbahasa Inggris sebagai bahasa utama mereka untuk kesalahan pengejaan atau kesalahan tata bahasa dianggap sebagai hal yang buruk. FreeBSD memiliki rekam jejak yang sangat baik dalam hal ini; Mohon bantu kami untuk menegakkan tradisi itu.
ru: Мы понимаем, что для многих английский не родной язык и поэтому мы пытаемся сделать некие пособия. Считается плохим тоном критиковать людей не говорящих по-английски за лексические и грамматические ошибки. FreeBSD имеет отличные продвижения в этом отношении. Пожалуйста, помогайте сохранять нам эту традицию.

source: Please use a standards-compliant Mail User Agent (MUA). A lot of badly formatted messages come from http://www.lemis.com/grog/email/email.php[bad mailers or badly configured mailers]. The following mailers are known to send out badly formatted messages without you finding out about them:
es: Por favor utiliza Mail User Agents (MUA) que siguen los estándares. Muchos mensajes mal formateados vienen de http://www.lemis.com/grog/email/email.php[malos programas de correo o programas de correo mal configurados]. Los siguientes programas de correo son conocidos por enviar mensajes mal formateados sin que te des cuenta:
id: Mohon gunakan Mail User Agent (MUA) yang sesuai standar. Banyak pesan yang tidak diformat dengan baik datang dari http://www.lemis.com/grog/email/email.php[pengirim email yang buruk atau pengirim email yang tidak dikonfigurasi dengan baik]. Pengirim email berikut ini diketahui mengirimkan pesan yang tidak diformat dengan baik tanpa anda mengetahui tentangnya:
ru: Пожалуйста, используйте совместимый со стандартами почтовый клиент (MUA). Много плохо отформатированных сообщений исходят от http://www.lemis.com/grog/email/email.php[неправильно работающих или плохо сконфигурированных почтовых клиентов]. Известно, что следующие почтовые программы могут посылать неправильно отформатированные сообщения без вашего ведома:

source: Try not to use MIME: a lot of people use mailers which do not get on very well with MIME.
es: Intenta no utilizar MIME: mucha gente utiliza aplicaciones de correo que no se llevan muy bien con MIME.
id: Coba untuk tidak menggunakan MIME: banyak orang menggunakan pengirim email yang tidak berfungsi dengan baik dengan MIME.
ru: Постарайтесь не использовать MIME: многие используют программы, которые не очень хорошо работают с MIME.

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people on these mailing lists get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume that they missed it and not bother to look.
es: Asegúrate de que su hora y zona horaria están configuradas correctamente. Esto puede parecer un poco estúpido a primera vista, ya que tu mensaje será recibido, pero muchas de las personas en estas listas de correo reciben varios cientos de mensajes al día. Frecuentemente, ordenan los mensajes entrantes por asunto y por fecha, y si tu mensaje no aparece antes de la primera respuesta, pueden asumir que lo pasaron por alto y no molestarse en mirar.
id: Pastikan waktu dan zona waktu diatur dengan benar. Ini mungkin terlihat konyol, karena pesan anda tetap sampai, tapi banyak orang di mailing list mendapat beberapa ratus pesan setiap hari. Seringkali mereka menyortir pesan yang datang berdasarkan subjek dan berdasarkan tanggal, dan jika pesan anda tidak sampai sebelum jawaban yang pertama, mereka mungkin akan berasumsi mereka melewatkannya dan tidak akan repot-repot membacanya.
ru: Проверьте правильность настроек времени и временной зоны. Это может выглядеть немножко глупо, потому что ваши сообщения все равно будут доставляться, однако многие люди получают несколько сотен сообщений в день. Зачастую они сортируют входящие сообщения по теме и дате, и если ваше сообщение не будет предшествовать первому ответу, то они могут предположить, что оно потерялось и даже не взглянут на него.

source: A lot of the information you need to supply is the output of programs, such as man:dmesg[8], or console messages, which usually appear in [.filename]#/var/log/messages#. Do not try to copy this information by typing it in again; not only it is a real pain, but you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like `dmesg`, redirect the output to a file and include that. For example,
es: Mucha de la información que tienes que proporcionar es la salida de algunos programas, como man:dmesg[8], o mensajes de consola que normalmente aparecen en [.filename]#/var/log/messages#. No intentes copiar esta información escribiéndola de nuevo; es un verdadero dolor y estás destinado a cometer un error. Para enviar el contenido de ficheros de log, haz una copia del fichero y utiliza un editor para dejar sólo la información relevante, o corta y pega en tu mensaje. Para la salida de programas como man:dmesg[8], redirecciona la salida a un fichero e inclúyelo. Por ejemplo,
id: Sebagian besar informasi yang anda harus sediakan adalah keluaran dari program, seperti man:dmesg[8], atau pesan dari konsol, yang biasanya muncul di [.filename]#/var/log/messages#. Jangan coba untuk menyalin informasi ini dengan mengetikkannya kembali; bukan hanya karena itu sangat sulit, tapi anda mungkin saja akan membuat kesalahan. Untuk mengirimkan isi dari file log, buatlah salinan dari file log itu dan gunakan editor untuk memangkas informasi untuk memuat hanya yang relevan, atau cut-and-paste ke pesan anda. Untuk keluaran program seperti `dmesg`, arahkan keluarannya kedalam sebuah file dan masukkan file itu kedalam pesan anda. Contohnya,
ru: Основной объем информации, который вы должны предоставить, представляет собой вывод программ, таких, как man:dmesg[8], или консольные сообщения, которые обычно появляются в файле [.filename]#/var/log/messages#. Не пытайтесь скопировать эту информацию, набрав ее снова; это действительно трудно, и здесь легко сделать ошибку. Чтобы послать содержимое файлов протоколов, сделайте копию файла и воспользуйтесь редактором для того, чтобы обрезать информацию, оставив только относящуюся к делу, либо скопируйте и вставьте текст в ваше сообщение. В случае вывода программ, таких, как `dmesg`, перенаправьте вывод в файл и включите его в письмо. Например,

source: This redirects the information to the file [.filename]#/tmp/dmesg.out#.
es: Esto redirige la información al fichero [.filename]#/tmp/dmesg.out#.
id: Ini mengarahkan informasi kedalam file [.filename]#/tmp/dmesg.out#.
ru: Эта команда перенаправляет информацию в файл [.filename]#/tmp/dmesg.out#.

source: When using cut-and-paste, please be aware that some such operations badly mangle their messages. This is of particular concern when posting contents of [.filename]#Makefiles#, where `tab` is a significant character. This is a very common, and very annoying, problem with submissions to the link:https://www.FreeBSD.org/support/[Problem Reports database]. [.filename]#Makefiles# with tabs changed to either spaces, or the annoying `=3B` escape sequence, create a great deal of aggravation for committers.
es: Cuando uses copia y pega, por favor ten en cuenta que muchas de esas operaciones entremezclan los mensajes. Esto es especialmente importante cuando se postea contenido de [.filename]#Makefiles#, donde `tab` es un carácter con significado. Este es un problema muy común, y muy molesto, con los envíos a la link:https://www.FreeBSD.org/support/[base de datos de Reportes de Error]. [.filename]#Makefiles# con los tabs cambiados por espacios, o la molesta secuencia de escape `=3B`, es muy exasperante para los committers.
id: Ketika menggunakan cut-and-paste, perlu diketahui bahwa beberapa operasi semacam ini merusak pesan mereka. Ini menjadi perhatian khusus ketika memposting isi dari [.filename]#Makefile#, dimana `tab` adalah karakter yang signifikan. Ini adalah masalah yang sangat umum, dan sangat mengganggu dengan laporan yang dikirimkan kepada link:https://www.FreeBSD.org/support/[Problem Reports database]. [.filename]#Makefile# dengan tab diganti menjadi spasi, atau escape sequence `=3B` yang sangat mengganggu, sangat membuat jengkel commiters.
ru: При использовании операций копирования и вставки учтите, что некоторые такие операции отрицательно сказываются на формате строк. Особенно это стоит учесть при посылке содержимого файлов [.filename]#Makefile#, где `tab` является важным символом. Это довольно часто встречающаяся проблема в link:https://www.FreeBSD.org/support/[ базе данных сообщений об ошибках]. В [.filename]#Makefile# символы tab меняются на пробелы, или раздражающие `=3B` escape последовательности.

source: What are the special etiquette consideration when replying to an existing posting on the mailing lists?
es: ¿Cuáles son las consideraciones especiales de etiqueta cuando se responde a un mensaje en las listas de correo?
id: Apa saja etika khusus untuk dipertimbangkan ketika membalas sebuah posting di mailing list?
ru: Каких правил этикета стоит придерживаться при ответе на уже существующее сообщение?

source: Please include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
es: Por favor incluye el texto del mensaje original que considere relevante. Recórtalo al mínimo, pero no exageres. Cualquier otra persona que no leyó el mensaje original debería ser capaz de entender de qué se estás hablando.
id: Mohon memasukkan teks yang relevan dari pesan aslinya. Pangkas hingga minimal, tapi jangan dipangkas terlalu banyak. Orang yang tidak membaca pesan aslinya seharusnya tetap bisa memahami apa yang anda bicarakan.
ru: Пожалуйста, включайте относящийся к теме текст из исходного письма. Сокращайте его до минимума, но не переусердствуйте. Любой, кто не читал исходное сообщение должен суметь понять о чём идёт речь.

source: This is especially important for postings of the type "yes, I see this too", where the initial posting was dozens or hundreds of lines.
es: Esto es particularmente importante en el caso de envíos del estilo de "sí, yo también veo esto", donde el mensaje original formado por cientos de líneas no aparece.
id: Ini penting terutama untuk posting seperti "ya, saya juga melihatnya", dimana posting asilnya memiliki lusinan atau ratusan baris.
ru: Это особенно важно для ответов в стиле «Да, я это тоже вижу», где исходное сообщение составляло сотни строчек.

source: Use some technique to identify which text came from the original message, and which text you add. A common convention is to prepend "`>`" to the original message. Leaving white space after the "`>`" and leaving empty lines between your text and the original text both make the result more readable.
es: Usa alguna técnica para identificar qué texto venía del mensaje original y cual has añadido tú. Una convención habitual es utilizar como prefijo "` >`" en el mensaje original. Dejar un espacio entre el "` >`" y dejando líneas en blanco entre tu texto y el texto original, hace que el resultado sea más legible.
id: Gunakan teknik untuk mengidentifikasi teks yang mana yang datang dari pesan asli, dan teks yang mana yang anda tambahkan. Metode yang umum digunakan adalah menambahkan "`>`" di awal setiap baris pada pesan asli. Menambahkan sebuah spasi setelah "`>`" dan menambahkan baris kosong diantara teks anda dan teks asli membuat hasilnya lebih mudah dibaca.
ru: Отделяйте текст исходного сообщения от текста, добавляемого вами. Чаще всего строчки исходного сообщения предваряются "`>`" и пробелом. Отделяйте ваш текст от текста исходного сообщения пустыми строчками. Эти правила помогут сделать ваши сообщения более читабельными.

source: Please ensure that the attributions of the text you are quoting is correct. People can become offended if you attribute words to them that they themselves did not write.
es: Asegúrate de que las atribuciones del texto que estás citando son correctas. Las personas pueden ofenderse si les atribuye palabras que ellos mismos no escribieron.
id: Pastikan atribusi pada teks yang anda kutip benar. Orang-orang dapat tersinggung jika anda mengatribusi kata-kata kepada mereka yang mereka sendiri tidak tulis.
ru: Пожалуйста, убедитесь в корректном указании авторства текста, который вы цитируйте. Люди могут обидеться, если вы приписываете им слова, которые они не писали.

source: Please do not `top post`. By this, we mean that if you are replying to a message, please put your replies after the text that you copy in your reply.
es: Por favor no hagas `top post`. Con esto, nos referimos a que se respondes a un mensaje, por favor pongas tus respuestas después del texto que copias en tu respuesta.
id: Mohon untuk tidak `top post`. Maksudnya, jika anda membalas sebuah pesan, tulis balasan anda setelah teks yang anda kutip dalam balasan anda.
ru: Пожалуйста, не пишите `ответ в начале письма`. Это значит, что при ответе на сообщения вставляйте ваши ответы в конец, после текста, копируемого из исходного сообщения.

source: A: Because it reverses the logical flow of conversation.
es: R: Porque invierte el flujo lógico de la conversación.
id: A: Karena itu membalik alur komunikasi yang logis.
ru: Ответ: Потому что это не соответствует логическому ходу обсуждения.

source: Q: Why is top posting frowned upon?
es: P: ¿Por qué el top posting está mal visto?
id: Q: Mengapa top posting tidak disukai?
ru: Вопрос: Чем плох ответ в начале письма?

source: (Thanks to Randy Bush for the joke.)
es: (Gracias a Randy Bush por la broma.)
id: (Terima kasih kepada Randy Bush untuk candaannya.)
ru: (Спасибо Рэнди Бушу (Randy Bush) за шутку.)

source: Recurring Topics On The Mailing Lists
es: Temas recurrentes en las listas de correo
id: Topik Berulang di Mailing List
ru: Повторяющиеся темы в списках рассылки

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Many of the mailing lists presuppose a knowledge of the Project's history. In particular, there are certain topics that seem to regularly occur to newcomers to the community. It is the responsibility of each poster to ensure that their postings do not fall into one of these categories. By doing so, you will help the mailing lists to stay on-topic, and probably save yourself being flamed in the process.
es: La participación en las listas de correo, así como la participación en cualquier otra comunidad, se basa en una serie de normas básicas para posibilitar la comunicación. Muchas de las listas de correo presuponen un conocimiento de la historia del proyecto. En particular, existen ciertos temas que suelen aparecer regularmente a los recién llegados a la comunidad. Es responsabilidad de cada participante comprobar que sus mensajes no caen en alguna de estas categorías. Al hacerlo, ayudará a mantener a la lista en el tema, y probablemente se salve de ser atacado en el proceso.
id: Partisipasi dalam mailing list, seperti partisipasi dalam komunitas apapun, memerlukan cara umum untuk komunikasi. Banyak mailing list FreeBSD yang menganggap anda memiliki pengetahun tentang sejarah proyek FreeBSD. Khususnya beberapa topik yang secara teratur terjadi pada pendatang baru komunitas. Adalah tanggung jawab setiap poster untuk memastikan posting mereka tidak masuk dalam salah satu kategori ini. Dengan demikian, anda akan membantu mailing list untuk tetap pada topik, dan mungkin menyelamatkan anda dari di-flame dalam proses.
ru: Участие в списках рассылки, как и участие в любом сообществе требует общего базиса для общения. Большое количество рассылок предполагают знание истории Проекта. В частности, существует несколько тем обсуждения, которые возникают у новичков. Обязанность каждого участника не создавать дискуссии на эти темы, тем самым помочь спискам рассылки не отрываться от обсуждаемых тем и обезопасить себя от разгорячённых бесед.

source: The best method to avoid this is to familiarize yourself with the http://docs.FreeBSD.org/mail/[mailing list archives], to help yourself understand the background of what has gone before. In this, the https://www.FreeBSD.org/search/#mailinglists[mailing list search interface] is invaluable. (If that method does not yield useful results, please supplement it with a search with your favorite major search engine).
es: El mejor método para evitar esto consiste en familiarizarse con los http://docs.FreeBSD.org/mail/[archivos de las listas de correo], así sabrás qué temas se han tratado con anterioridad. En este aspecto resulta de gran valor https://www.FreeBSD.org/search/#mailinglists[la interfaz de búsqueda] de la lista de correo. (Si ese método no produce resultados útiles, complétalo con una búsqueda en tu motor de búsqueda principal favorito).
id: Metode terbaik untuk mencegah ini adalah dengan membiasakan diri dengan http://docs.FreeBSD.org/mail/[arsip mailing list], untuk membantu anda memahami latar belakang tentang apa yang telah terjadi sebelumnya. Dalam hal ini, https://www.FreeBSD.org/search/#mailinglists[antarmuka pencarian mailing list] tak ternilai. (Jika metode itu tidak menghasilkan hasil yang berguna, mohon tambahkan dengan pencarian menggunakan mesin pencari besar favorit anda).
ru: Лучший способ предотвратить это - ознакомиться с http://docs.FreeBSD.org/mail/[архивами списков рассылки], чтобы понять, что происходило до этого. В этом случае, незаменимым окажется https://www.FreeBSD.org/search/#mailinglists[ интерфейс поиска по спискам рассылки]. (Если этот способ не принёс результатов, воспользуйтесь вашей любимой поисковой системой).
