Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/mailing-list-faq/_index.po
Languages: es, id, ru

source: By familiarizing yourself with the archives, not only will you learn what topics have been discussed before, but also how discussion tends to proceed on that list, who the participants are, and who the target audience is. These are always good things to know before you post to any mailing list, not just a FreeBSD mailing list.
es: Si te familiarizas con los archivos históricos, no solo sabrás qué temas se han tratado anteriormente, también aprenderás cómo se produce la discusión en la lista, quiénes son los participantes y quién es el público objetivo. Estos puntos conviene conocerlos antes de preguntar en cualquier lista de correo, no solo en las de FreeBSD.
id: Dengan membiasakan diri dengan arsip mailing list, anda tidak hanya akan mempelajari topik apa saja yang telah didiskusikan sebelumnya, tapi juga bagaimana diskusi biasanya bejalan dalam list itu, siapa pesertanya, dan siapa audiencenya. Ini selalu menjadi hal-lah yang baik untuk diketahuj sebelun anda memposting ke mailing list apapun, tidak hanya mailing list FreeBSD.
ru: Познакомившись с архивами, вы не только будете знать, какие темы обсуждались до этого, но также узнаете, какие тенденции общения существуют в данной рассылке, кто является участниками и какова конечная аудитория. Эти вещи довольно хорошо знать перед отправкой письма в любую рассылку, и это касается не только списков рассылки FreeBSD.

source: There is no doubt that the archives are quite extensive, and some questions recur more often than others, sometimes as followups where the subject line no longer accurately reflects the new content. Nevertheless, the burden is on you, the poster, to do your homework to help avoid these recurring topics.
es: No hay duda de que los archivos son bastante extensos, y algunas preguntas se repiten con más frecuencia que otras, algunas veces camufladas dentro de hilos donde la línea del asunto no refleja precisamente el nuevo contenido del mensaje. Sin embargo tú, quien envía el mensaje, eres responsable de evitar que se produzcan temas recurrentes.
id: Tidak diragukan lagi bahwa arsip mailing list FreeBSD cukup ekstensif, dan beberapa pertanyaan diulang lebih sering dari yang lain, terkadang sebagai followup dimana baris subjek tidak lagi mencerminkan konten yang baru. Bagaimanapun juga, bebannya ada di anda, poster, untuk melakukan pekerjaan anda untuk menghindari topik yang diulang ini.
ru: Безусловно, архивы весьма обширны, и некоторые вопросы возникают чаще других, иногда в виде цепочек ответов, где заголовок письма уже не отражает содержание обсуждения. Тем не менее, ваша задача как автора — провести предварительную работу, чтобы по возможности избежать этих часто возникающих тем.

source: What Is A "Bikeshed"?
es: ¿Qué es un "Bikeshed"?
id: Apa itu "Bikeshed"?
ru: Что такое велосипедный навес ("Bikeshed")?

source: Literally, a `bikeshed` is a small outdoor shelter into which one may store one's two-wheeled form of transportation. However, in FreeBSD parlance, the term refers to topics that are simple enough that (nearly) anyone can offer an opinion about, and often (nearly) everyone does. The genesis of this term is explained in more detail extref:{faq}[in this document, bikeshed-painting]. You simply must have a working knowledge of this concept before posting to any FreeBSD mailing list.
es: Literalmente, un `bikeshed` es una pequeña caseta exterior en la cual uno almacena una forma de trasporte sobre dos ruedas. Sin embargo, en la jerga de FreeBSD, el término se refiere a temas que son suficientemente sencillos que (casi) cualquiera puede opinar sobre ellos y habitualmente (casi) todo el mundo lo hace. El nacimiento de este término se explica en más detalle en extref:{faq}[este documento, bikeshed-painting]. Simplemente tienes que saber algo sobre este concepto antes de enviar a cualquier lista de FreeBSD.
id: Secara harafiah, `bikeshed` adalah tempat berteduh luar ruangan dimana seseorang dapat menyimpan transportasi roda dua miliknya. Tetapi, di FreeBSD, istilah tersebut merujuk kepada topik yang (hampir) siapapun dapat memiliki opini tentangnya, dan seringkali (hampir) semua orang memiliki opini tentangnya. Asal-usul istilah ini dijelaskan dengan lebih detail extref:{faq}[dalam dokumen ini, bikeshed-painting]. Anda harus memiliki pengetahuan tentang konsep ini sebelum memposting ke mailing list FreeBSD apapun.
ru: В буквальном смысле `bikeshed` (сарай для велосипедов) - это небольшое уличное сооружение для хранения двухколёсного транспорта. Однако в терминологии FreeBSD это понятие относится к темам, достаточно простым для того, чтобы (почти) каждый мог высказать своё мнение, и зачастую (почти) каждый это делает. Детали происхождения данного термина более подробно рассмотрены extref:{faq}[здесь, bikeshed-painting]. У вас должно иметься представление о данном понятии перед отправкой письма в любой список рассылки FreeBSD.

source: More generally, a bikeshed is a topic that will tend to generate immediate meta-discussions and flames if you have not read up on their past history.
es: De una forma más general, un bikeshed es un asunto que tiende a generar meta-discusiones y ataques si no se han leído las discusiones anteriores.
id: Lebih umumnya, bikeshed adalah topik yang cenderung segera menghasilkan diskusi lain dan flame jika anda tidak membaca tentang sejarahnya.

source: Please help us to keep the mailing lists as useful for as many people as possible by avoiding bikesheds whenever you can. Thanks.
es: Por favor, colabora en el mantenimiento de las listas de correo evitando los bikesheds siempre que puedas. Gracias.
id: Mohon bantu kami menjaga agar mailing list FreeBSD seberguna mungkin bagi sebanyak mungkin orang dengan menghindari bikeshed kapanpun anda bisa. Terima kasih.
ru: Пожалуйста, помогайте сохранять списки рассылки настолько полезными для многих людей, насколько это возможно путём предотвращения bikeshed. Спасибо.

source: Acknowledgments
es: Reconocimientos
id: Credits
ru: Благодарности

source: Original author of most of the material on mailing list etiquette, taken from the article on extref:{freebsd-questions-article}[How to get best results from the FreeBSD-questions mailing list].
es: Autor original de la mayor parte del material sobre etiqueta en las listas de correo, recogido del artículo sobre extref:{freebsd-questions-article}[Cómo obtener los mejores resultados de la lista de correo de FreeBSD-questions].
id: Penulis sebagin besar materi tentang etika mailing list, diambil dari artikel extref:{freebsd-questions-article}[Cara mendapatkan hasil terbaik dari mailing list FreeBSD].
ru: Первоначальный автор большинства материала по этикету списков рассылки, взятого из статьи extref:{freebsd-questions-article}[Как работать со списком рассылки FreeBSD-questions с максимальной отдачей].

source: Creation of the rough draft of this FAQ.
es: Por la creación del borrador inicial de estas FAQ.
id: Penulis draf kasar FAQ ini.
ru: Создание черновой версии данного FAQ.

source: Note that you must subscribe to a mailing list before you can post. You can elect to subscribe without receiving messages posted to the mailing list.
ru: Обратите внимание, что для отправки сообщений в список рассылки необходимо быть его подписчиком. Вы можете оформить подписку, не получая сообщения, которые в него отправляются.

source: Yes. Threaded archives with all e-mails since 1994 are available link:https://mail-archive.freebsd.org/mail/[here]. You can also access https://lists.freebsd.org/pipermail[mailman archive] and link:https://lists.freebsd.org/archives[mlmmj archive] directly.
ru: Да. Архивы со всеми письмами с 1994 года доступны link:https://mail-archive.freebsd.org/mail/[здесь]. Вот ссылки на https://lists.freebsd.org/pipermail[архив mailman] и link:https://lists.freebsd.org/archives[архив mlmmj].

source: More generally, a bikeshed is a topic that will tend to generate immediate meta-discussions and flames if you have not read up on their history.
ru: Bikeshed - это тема разговора, которая будет иметь тенденцию порождать немедленные мета-дискуссии и флэйм.
