<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
         
        $FreeBSD$
	Original revision: 1.15
-->  

<chapter id="hardware">
  <title>Compatibilit&eacute; mat&eacute;rielle</title>

  <sect1>
    <title>Quels sont les types de disques durs support&eacute;s par FreeBSD&nbsp;?</title>

    <para>FreeBSD supporte les disques EIDE et SCSI (pour les contr&ocirc;leurs 
      compatibles, voir la section suivante), ainsi que tous les disques 
      utilisant l'interface originale "Western Digital" (MFM, RLL, ESDI 
      et bien s&ucirc;r IDE). 
      Quelques contr&ocirc;leurs ESDI utilisant des interfaces propri&eacute;taires
      peuvent ne pas marcher: utilisez les interfaces WD1002/3/6/7 et leurs
      clones.</para>
  </sect1>

  <sect1>
    <title>Quels sont les contr&ocirc;leurs SCSI support&eacute;s&nbsp;?</title>

    <para>Voir la liste compl&egrave;te dans le
      <ulink url="&url.handbook;install.html#INSTALL-HW">Handbook</ulink>.</para>
  </sect1>

  <sect1>
    <title>Quels sont les lecteurs CD-ROM support&eacute;s par FreeBSD&nbsp;?</title>

    <para>N'importe quel lecteur SCSI connect&eacute; &agrave; un contr&ocirc;leur support&eacute;
      est support&eacute;.</para>

    <para>Les interfaces CD-ROM propri&eacute;taires suivantes sont aussi support&eacute;es:
      <itemizedlist>
        <listitem><para>Mitsumi LU002 (8 bits), LU005 (16 bits) et FX001D
          (16 bits double vitesse).</para></listitem>
        <listitem><para>Sony CDU 31/33A</para></listitem>
        <listitem><para>CD-ROM Sound Blaster Non-SCSI</para></listitem>
        <listitem><para>CD-ROM Matsushita/Panasonic</para></listitem>
        <listitem><para>CD-ROM ATAPI compatible IDE</para></listitem>
      </itemizedlist>
    </para>

    <para>Toutes les cartes non-SCSI sont connues pour &ecirc;tre extr&ecirc;mement lentes 
      par rapport aux lecteurs SCSI, et certains CDROM ATAPI peuvent ne pas 
      &ecirc;tre pris en charge.</para>

    <para>A partir de la version 2.2, le CD-ROM FreeBSD de Walnut Creek
      permet de d&eacute;marrer directement FreeBSD depuis le CD.</para>
  </sect1>

  <sect1>
    <title>Est-ce que FreeBSD supporte les lecteurs ZIP&nbsp;?</title>

    <para>FreeBSD supporte bien s&ucirc;r les lecteurs ZIP SCSI de base
      &nbsp;-&nbsp;<foreignphrase>out of the box</foreignphrase>.
      Les lecteurs ZIP ne peuvent &ecirc;tre r&eacute;gl&eacute;s que pour marcher sur les cibles 
      SCSI d'adresse 5 ou 6, mais si le BIOS de votre adaptateur SCSI h&ocirc;te
      le permet, vous pourrez m&ecirc;me d&eacute;marrer &agrave; partir du ZIP. 
      Je ne sais pas quel adaptateur SCSI h&ocirc;te vous permet de d&eacute;marrer
      depuis des cibles autres que 0 ou 1... regardez votre documentation
      (et dites moi si cela marche pour vous).</para>

    <para>Les ZIP ATAPI (IDE) sont pris en charge par FreeBSD 2.2.6 
      ainsi que par les versions ult&eacute;rieures.</para>

    <para>FreeBSD 3.0-STABLE contient le support pour lecteur ZIP
      sur port parall&egrave;le, mais pour cela, vous aurez &agrave; construire 
      un nouveau noyau avec support pour ppbus (Parallel Port Bus) 
      afin d'utiliser le ZIP. 
      Prendre le fichier de configuration LINT comme exemple.</para>

    <para>Regarder aussi cette note traitant <link linkend="jaz">des
      disques amovibles</link>, ainsi que celle sur <link linkend="disklabel">
      le 'formatage'</link>.</para>
  </sect1>

  <sect1>
    <title>Est-ce que FreeBSD supporte JAZ, EZ et autres disques amovibles&nbsp;?</title>

    <para>A part la version IDE du lecteur EZ, ce sont tous des 
      p&eacute;riph&eacute;riques SCSI, alors pour FreeBSD, ils sont consid&eacute;r&eacute;s comme des 
      disques SCSI, et le lecteur IDE EZ est consid&eacute;r&eacute; comme un lecteur IDE.
    </para>

    <para><anchor id="jaz">Je ne suis pas s&ucirc;r que FreeBSD supporte
      correctemement un changement de media en cours de fonctionnement. 
      Vous devrez bien s&ucirc;r d&eacute;monter le lecteur avant l'&eacute;change, et vous
      assurer que les unit&eacute;s externes soient allum&eacute;es pendant le d&eacute;marrage
      du syst&egrave;me de sorte que FreeBSD puisse les voir.</para>
  </sect1>

  <sect1>
    <title> Quelles sont les cartes s&eacute;ries multi-ports prises en charge par FreeBSD&nbsp;?</title>

    <para>Une liste est disponible &agrave; la section 
      <ulink url="&url.handbook;install.html#INSTALL-HW">p&eacute;riph&eacute;riques divers
      </ulink> du handbook.</para>

    <para>A notre connaissance, certaines cartes clone sans marque
      sont connues pour fonctionner, en particulier celles qui se disent
      &ecirc;tre compatibles AST.</para>

    <para>Regarder la page de manuel 
      <ulink url="http://www.freebsd.org/cgi/man.cgi?sio">sio</ulink> pour
      plus d'informations sur la configuration de telles cartes.</para>
  </sect1>

  <sect1>
    <title>J'ai une souris bus inhabituelle. Comment la configurer&nbsp;?</title>

    <para>FreeBSD supporte les souris bus et les souris bus InPort de 
      constructeurs tels que Microsoft, Logitech et ATI. Le contr&ocirc;leur du bus
      est compil&eacute; dans le noyau GENERIC par d&eacute;faut. Si vous construisez un noyau
      personalis&eacute; avec le contr&ocirc;leur de souris bus, assurez-vous d'avoir bien
      mis la ligne suivante dans le fichier de configuration du noyau&nbsp;:

      <programlisting>
device mse0 at isa? port 0x23c tty irq5 vector mseintr
      </programlisting>
    </para>

    <para>La souris bus vient souvent avec une interface d&eacute;di&eacute;e.
      Cela vous permet de mettre une adresse de port et un num&eacute;ro 
      d'IRQ autres que ceux donn&eacute;s ci-dessus.
      Reportez-vous au manuel de votre souris et &agrave; la page de manuel
      <ulink url="http://www.freebsd.org/cgi/man.cgi?mse">mse</ulink>
      pour plus d'informations.</para>
  </sect1>

  <sect1>
    <title id="ps2mouse">Comment utiliser ma souris PS/2 (``port souris'' ou ``clavier'')&nbsp;?</title>

    <para>Si vous utilisez une version de FreeBSD post-2.2.5, le pilote 
      n&eacute;cessaire, psm, est inclu et activ&eacute; dans le noyau. 
      Le noyau devrait d&eacute;tecter votre souris PS/2 au moment du d&eacute;marrage.</para>

    <para>Si vous utilisez une version pr&eacute;c&eacute;dente mais assez r&eacute;cente de 
      FreeBSD (2.1.x ou mieux), alors vous pouvez simplement l'activer
      dans le menu de configuration du noyau &agrave; l'installation, ou plus tard 
      avec -c &agrave; l'invite du d&eacute;marrage (boot). Il est d&eacute;sactiv&eacute; par d&eacute;faut, 
      c'est pourquoi vous aurez &agrave; l'activer explicitement.</para>

    <para>Si vous utilisez une version plus ancienne du noyau, alors 
      vous aurez &agrave; ajouter la ligne suivante dans la configuration 
      de votre noyau, et compiler un nouveau noyau&nbsp;:

      <programlisting>
device psm0 at isa? port "IO_KBD" conflicts tty irq 12 vector psmintr
      </programlisting>
    </para>

    <para>Voir la <ulink url="&url.handbook;kernelconfig.html">section du
      Handbook sur la configuration du noyau</ulink> si vous n'avez aucune
      exp&eacute;rience dans la construction d'un noyau.</para>

    <para>Un fois que vous aurez un noyau d&eacute;tectant correctement psm0 au 
      moment du d&eacute;marrage, assurez vous qu'une entr&eacute;e pour psm0 existe bien
      dans /dev. Vous pouvez le faire en tapant&nbsp;:

      <programlisting>
cd /dev; sh MAKEDEV psm0
      </programlisting>
    </para>

    <para>une fois loggu&eacute; sous root.</para>
  </sect1>

  <sect1>
    <title id="moused">Puis-je utiliser ma souris en dehors de X Window&nbsp;?</title>

    <para>Si vous utilisez le pilote de console par d&eacute;faut, syscons, vous
      pourrez utiliser un curseur souris dans les consoles texte pour couper 
      et coller du texte.
      Lancer le d&eacute;mon (de gestion de la) souris&nbsp;: moused, et d&eacute;clencher
      le curseur de souris dans la console virtuelle.

      <programlisting>
moused -p /dev/xxxx -t yyyy 
vidcontrol -m on
      </programlisting>
    </para>

    <para>O&ugrave; <filename>xxxx</filename> est le nom du p&eacute;riph&eacute;rique souris et 
      <filename>yyyy</filename> le type de protocole pour la souris. 
      Voir la page de manuel
      <ulink url="http://www.freebsd.org/cgi/man.cgi?moused">moused</ulink> 
      pour les types de protocoles support&eacute;s.</para>

    <para> Peut-&ecirc;tre pr&eacute;f&eacute;rez-vous lancer le d&eacute;mon g&eacute;rant la souris au 
      moment du d&eacute;marrage du syst&egrave;me. 
      Dans la version 2.2.1, positionnez les variables suivantes dans
      <filename>/etc/sysconfig</filename>.

      <programlisting>
mousedtype="yyyy"
mousedport="xxxx"
mousedflags=""
      </programlisting>

      Dans les versions 2.2.2 et plus, positionnez les variables 
      suivantes dans <filename>/etc/rc.conf</filename>.

      <programlisting>
moused_type="yyyy"
moused_port="xxxx"
moused_flags=""
      </programlisting>

      A partir de la version 2.2.6 de FreeBSD, le d&eacute;mon souris 
      est capable de d&eacute;terminer le type de protocole appropri&eacute; 
      automatiquement &agrave; moins que votre souris s&eacute;rie ne soit d'un mod&egrave;le 
      relativement ancien.
      Sp&eacute;cifiez ``<filename>auto</filename>'' comme protocole pour activer la
      d&eacute;tection automatique.</para>

    <para>Quand le d&eacute;mon souris tourne, l'acc&egrave;s &agrave; la souris doit &ecirc;tre
      coordonn&eacute; entre le d&eacute;mon souris et les autres programmes 
      comme X-Window. Se r&eacute;f&eacute;rer &agrave; <link linkend="x-and-moused">une autre
      section</link> de ce document.</para>
  </sect1>

  <sect1>
    <title>Comment puis-je couper et coller du texte avec ma souris dans ma console texte&nbsp;?</title>

    <para>Une fois que vous aurez r&eacute;ussi &agrave; lancer le d&eacute;mon souris 
      (voir <link linkend="moused">section pr&eacute;c&eacute;dente</link>), appuyez
      en le maintenant sur le bouton 1 (bouton de gauche) et d&eacute;placez la
      souris afin de s&eacute;lectionner une partie du texte. Puis, appuyez
      (clicquez) sur le bouton 2 (bouton du milieu) ou bouton 3 (bouton
      de droite) pour le coller &agrave; l'endroit du curseur texte.</para>

    <para>Dans les versions 2.2.6 et plus, un clic sur le bouton 2 collera
      le texte. Un clic sur le bouton droit ``&eacute;tendra'' la partie de 
      texte s&eacute;lectionn&eacute;. 
      Si votre souris n'a pas de bouton du milieu, vous
      pouvez l'&eacute;muler ou red&eacute;finir les boutons en utilisant les 
      options de la souris. Se reporter &agrave; la page de r&eacute;f&eacute;rence
      <ulink url="http://www.freebsd.org/cgi/man.cgi?moused">moused</ulink>
      pour plus de d&eacute;tails.</para>
  </sect1>

  <sect1>
    <title>Ma souris a une roulette et des boutons &eacute;sot&eacute;riques. Puis-je les utiliser sous FreeBSD&nbsp;?</title>

    <para> Malheureusement, la r&eacute;ponse est: ``C&agrave; d&eacute;pend''. 
      Ces souris avec des fonctionnalit&eacute;s suppl&eacute;mentaires ont 
      besoin de pilotes sp&eacute;ciaux dans la majorit&eacute; des cas. 
      Alors, &agrave; moins que le pilote de la souris ou que le
      programme utilisateur ait un support sp&eacute;cifique pour cette 
      souris, la souris se comportera comme une souris standard 2 ou 3 
      boutons.</para>
  </sect1>

  <sect1>
    <title>Comment utiliser la souris/trackball/touchpad de mon portable&nbsp;?  </title>

    <para>Se r&eacute;f&eacute;rer &agrave; <link linkend="ps2mouse">la r&eacute;ponse &agrave; la question
      pr&eacute;c&eacute;dente,</link> ainsi qu'&agrave; cette section sur <link linkend="pao">
      les ordinateurs portables</link>.</para>
  </sect1>

  <sect1>
    <title>Quels types de lecteurs de bandes sont support&eacute;s&nbsp;?</title>

    <para> FreeBSD supporte les lecteurs de bandes magn&eacute;tique SCSI, 
      QIC-36 (avec une interface QIC-02) et QIC-40/80 (bas&eacute;s sur
      l'interface Floppy).
      Ceci inclut les lecteurs 8-mm (connus sous le nom d'Exabyte) et
      lecteurs DAT. Les lecteurs QIC-40/80 sont connus pour &ecirc;tre lents.</para>

    <para>Parmi les premiers lecteurs 8-mm, quelques-uns ne sont pas tout &agrave;
      fait compatibles SCSI-2, et peuvent de ce fait ne pas tr&egrave;s bien 
      marcher avec FreeBSD.</para>
  </sect1>

  <sect1>
    <title>FreeBSD supporte-t-il les changeurs de bandes&nbsp;?</title>

    <para>FreeBSD 2.2 g&egrave;re les changeurs SCSI en utilisant le p&eacute;riph&eacute;rique 
      <ulink url="http://www.freebsd.org/cgi/man.cgi?ch(4)">ch</ulink> ainsi
      que la commande
      <ulink url="http://www.freebsd.org/cgi/man.cgi?chio" >chio</ulink>.
      Pour avoir plus de d&eacute;tails sur le contr&ocirc;le du changeur, lisez la page du
      manuel <ulink url="http://www.freebsd.org/cgi/man.cgi?chio" >chio</ulink>.
    </para>

    <para>Si vous n'utilisez pas
      <ulink url="http://www.freebsd.org/cgi/ports.cgi?amanda">AMANDA</ulink>
      ou un autre produit qui g&egrave;re d&eacute;j&agrave; les changeurs, 
      souvenez-vous qu'ils ne savent que d&eacute;placer une bande d'un 
      point &agrave; un autre. Par cons&eacute;quent, vous devrez garder une 
      trace de l'emplacement dans lequel une bande est mise, ainsi que celui
      o&ugrave; la bande courante devra revenir.</para>
  </sect1>

  <sect1>
    <title>Quelles sont les cartes son support&eacute;es par FreeBSD&nbsp;?</title>

    <para>FreeBSD prend en charge les cartes son: SoundBlaster, 
      SoundBlaster Pro, SoundBlaster 16, Pro Audio Spectrum 16, 
      AdLib et Gravis UltraSound. 
      Il y a aussi un support limit&eacute; pour les cartes MPU-401 et
      compatible MIDI.
      Les cartes conformes aux sp&eacute;cifications Microsoft Sound System 
      sont aussi support&eacute;es par l'interm&eacute;diaire du pilote pcm.</para>

    <note>
      <para>Ceci n'est valable que pour les sons!
        Ce pilote ne supporte pas les CD-ROMs, SCSI ou joysticks sur
        ces cartes, except&eacute; pour la SoundBlaster. 
        L'interface SCSI SoundBlaster et quelques CD-ROM non-SCSI sont
        aussi support&eacute;s.
        Mais vous ne pourrez pas d&eacute;marrer depuis ces p&eacute;riph&eacute;riques.</para>
    </note>
  </sect1>

  <sect1>
    <title>Quels sont les cartes r&eacute;seau support&eacute;es par FreeBSD&nbsp;?</title>

    <para>Regarder la section <ulink url="&url.handbook;install.html#INSTALL-HW">
      cartes &eacute;thernet</ulink> du handbook pour une liste compl&egrave;te.</para>
  </sect1>

  <sect1>
    <title>Je n'ai pas de coprocesseur arithm&eacute;tique. Est-ce un probl&egrave;me&nbsp?</title>

    <note>
      <para>Cela ne touche que ceux qui ont un 386/486SX/486SLC -
        toutes les autres machines en ont d&eacute;j&agrave; un int&eacute;gr&eacute; dans la CPU.</para>
    </note>

    <para>En r&egrave;gle g&eacute;n&eacute;rale, il n'y a pas d'inconv&eacute;nient, mais il 
      existe des circonstances dans lesquelles cela peut causer
      des probl&egrave;mes aussi bien au niveau des performances qu'au niveau de la
      pr&eacute;cision du code d'&eacute;mulation arithm&eacute;tique (voir la section
      <link linkend="emul">sur l'&eacute;mulation FP</link>).
      En particulier, le dessin de courbes sous X sera TRES lent. 
      Il est hautement recommand&eacute; d'acheter un coprocesseur arithm&eacute;tique&nbsp;: 
      c'est quand m&ecirc;me mieux avec&nbsp;!</para>

    <note>
      <para>Certains coprocesseurs math&eacute;matiques sont meilleurs que d'autres.
        Cela nous peine de le dire, mais personne n'a jamais &eacute;t&eacute; licenci&eacute;
        pour avoir achet&eacute; de l'Intel. 
        A moins que d'&ecirc;tre s&ucirc;r qu'ils fonctionnent avec FreeBSD,
        m&eacute;fiez-vous des clones&nbsp;!</para>
    </note>
  </sect1>

  <sect1>
    <title>Quels autres p&eacute;riph&eacute;riques la version 2.X supporte-t-elle&nbsp;?</title>
    <para>Lire le <ulink url="&url.handbook;install.html#INSTALL-HW">Handbook</ulink>
      pour obtenir la liste des p&eacute;riph&eacute;riques support&eacute;s.</para>
  </sect1>

  <sect1>
    <title>FreeBSD supporte-t-il le gestionnaire d'&eacute;nergie de mon portable&nbsp;?</title>

    <para>FreeBSD supporte l'APM sur certaines machines. 
      Regardez dans le fichier de configuration du noyau
      <filename>LINT</filename>, et cherchez le mot-clef 
      <ulink url="http://www.freebsd.org/cgi/man.cgi?apm">APM</ulink>.</para>
  </sect1>

  <sect1>
    <title>Solutions de contournement pour des probl&egrave;mes mat&eacute;riels particuliers.</title>

    <para>Cette section traite de solutions de contournement pour des
      probl&egrave;mes rencontr&eacute;s par nos utilisateurs sur certains mat&eacute;riels
      particuliers.</para>
    <sect2>
      <title>Les syst&egrave;mes Micron sont suspendus au moment du d&eacute;marrage.</title>

      <para> Certaines cartes m&egrave;res Micron ont des impl&eacute;mentations
        non-conformes de PCI BIOS, ce qui peut poser des probl&egrave;mes
        lorsque FreeBSD d&eacute;marre car les p&eacute;riph&eacute;riques PCI ne sont pas
        configur&eacute;s &agrave; l'adresse annonc&eacute;e.</para>

      <para>D&eacute;sactivez l'option "Syst&egrave;me d'exploitation Plug and Play"
        dans le BIOS pour contourner ce probl&egrave;me.
        Des compl&eacute;ments d'informations peuvent &ecirc;tre trouv&eacute;s &agrave;
        <ulink url="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron">"http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron"</ulink>
      </para>
    </sect2>
  </sect1>

  <sect1>
    <title>J'ai un nouveau contr&ocirc;leur Adaptec, et FreeBSD ne le reconnait pas.</title>

    <para> Les nouvelles puces de la s&eacute;rie Adaptec AIC789x sont support&eacute;es 
      dans le cadre du CAM SCSI qui d&eacute;marre avec la 3.0.
      Des patches pour la version 2.2-STABLE sont disponibles &agrave;
      <ulink url="ftp://ftp.freebsd.org/pub/FreeBSD/cam/" >
      ftp://ftp.freebsd.org/pub/FreeBSD/cam/ </ulink>
      Une disquette d'amorce avec CAM est disponible &agrave;
      <ulink url="http://www.freebsd.org/~abial/cam-boot/">
      http://www.freebsd.org/~abial/cam-boot/</ulink>.
      Dans les deux cas, lisez le fichier README avant toute chose.</para>
  </sect1>

  <sect1>
    <title>J'ai un modem interne plug'n play, et FreeBSD ne le reconnait pas.</title>

    <para>Vous devez ajouter l'ID PnP du modem &agrave; la liste des ID PnP dans
      le pilote s&eacute;rie.
      Pour activer le support Plug & Play, il faut compiler un nouveau 
      noyau avec <filename>controller pnp0</filename> dans le fichier de
      configuration, puis red&eacute;marrer le syst&egrave;me. Le noyau affichera alors
      l'ID PnP de tous les p&eacute;riph&eacute;riques qu'il trouvera. 
      Copier alors l'ID PnP du modem dans le tableau de
      <filename>/sys/i386/isa/sio.c</filename>, vers la ligne 1200.    
      Cherchez la cha&icirc;ne de caract&egrave;re "SUP1310" dans la structure 
      "siopnp_ids[]"  pour trouver le tableau. 
      Construire &agrave; nouveau le noyau, installer, red&eacute;marrer, et votre 
      modem devrait &ecirc;tre reconnu.</para>

    <para>Vous pouvez configurer manuellement les p&eacute;riph&eacute;riques PnP en 
      utilisant la commande `pnp' &agrave; la configuration au moment du d&eacute;marrage, 
      avec une commande du style&nbsp;:

      <programlisting>
pnp 1 0 enable os irq0 3 drq0 0 port0 0x2f8
      </programlisting>
      pour afficher le modem.</para>
  </sect1>

  <sect1>
    <title>Comment puis-je obtenir l'invite de commande ``boot:'' sur la console s&eacute;rie&nbsp;?</title>

    <para>
      <itemizedlist>
        <listitem><para>
          Construire un noyau avec <filename>options COMCONSOLE</filename>.
        </para></listitem>
        <listitem><para>
          Cr&eacute;er un fichier /boot.config avec pour seul contenu
          <filename>-P</filename> 
        </para></listitem>
        <listitem><para>
          D&eacute;connecter le clavier du syst&egrave;me.
        </para></listitem>
      </itemizedlist>
    </para>

    <para>Redardez <filename>/usr/src/sys/i386/boot/biosboot/README.serial
      </filename> pour plus d'informations.</para>
  </sect1>

  <sect1>
    <title>Pourquoi ma carte r&eacute;seau 3Com PCI ne marche pas avec mon Micron&nbsp;?</title>

    <para>Certaines cartes m&egrave;res Micron ont une impl&eacute;mentation non-conforme 
      du BIOS PCI qui ne configure pas les p&eacute;riph&eacute;riques PCI &agrave; l'adresse 
      annonc&eacute;e.
      Cela cause des probl&egrave;mes quand FreeBSD d&eacute;marre.</para>

    <para> Pour contourner ce probl&egrave;me, d&eacute;sactiver l'option "Syst&egrave;me
      d'exploitation Plug and Play" dans le BIOS.</para>

    <para>Pour plus d'informations sur ce probl&egrave;me, allez voir &agrave; l'URL:
      <ulink url="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron">
       http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron </ulink>
    </para>
  </sect1>

  <sect1>
    <title>FreeBSD supporte-t-il les Multiprocesseurs Sym&eacute;triques (SMP)&nbsp;?</title>

    <para>SMP n'est support&eacute; que dans la version 3.0-STABLE et les versions
      suivantes.</para>
  </sect1>

</chapter>
