<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
         
        $FreeBSD$
        Original revision: n.nn
-->

<chapter id="install">
    <title>Installation</title>

    <sect1>
      <title>Quels fichiers t&eacute;l&eacute;charger pour installer FreeBSD&nbsp;?</title>

      <para> Vous n'avez g&eacute;n&eacute;ralement besoin que d'une image-disque, le
fichier <filename path="floppies/boot.flp">floppies/boot.flp</filename>, que vous copiez sur 
une disquette 1.44 Mo et qui permet de d&eacute;marrer pour
pouvoir t&eacute;l&eacute;charger le reste (l'installation prend en
charge votre connexion TCP/IP, votre lecteur de bandes, CDROM, disquettes, partitions DOS, tout ce
est n&eacute;cessaire pour le reste de l'installation).</para>


      <para>Si vous avez besoin de t&eacute;l&eacute;charger la distribution par
vous m&ecirc;me (pour une installation depuis une partition DOS par
exemple), voici quels sont les fichiers &agrave; r&eacute;cup&eacute;rer:
<itemizedlist>
	  <listitem>
	    <para> Tout le r&eacute;pertoire <filename path="bin/*">bin</filename></para>
	  </listitem>
	  <listitem>
	    <para> Tout le r&eacute;pertoire <filename
path="manpages/*">manpages</filename></para>
	    </listitem>
	  <listitem>
	    <para> Tout le r&eacute;pertoire <filename path="compat*">compat</filename></para>
	  </listitem>
	  <listitem>
	    <para> Tout le r&eacute;pertoire <filename path="doc/*">doc</filename></para>
	  </listitem>
	  <listitem>
	    <para> Tous les fichiers <filename
path="src/ssys.*">src/ssys.*</filename></para>
	    </listitem>
	</itemizedlist>
      </para>

      <para>Vous trouverez les instructions compl&egrave;tes pour cette proc&eacute;dure et un peu 
plus au sujet de l'installation en g&eacute;n&eacute;ral dans la section <ulink url="../handbook/install.html">
installation de FreeBSD</ulink> du manuel.</para>
    </sect1>



    <sect1>
      <title>A l'aide&nbsp;! L'image-disque de d&eacute;marrage ne tient pas sur une seule disquette&nbsp;!</title>

      <para> Une disquette 3,5 pouces (1.44 Mo) peut contenir jusqu'&agrave;
1474560 octets de donn&eacute;es. La taille du fichier image est exactement 
1474560 octets.</para>

      <para>Les erreurs courantes concernant la cr&eacute;ation de la
disquette de d&eacute;marrage sont les suivantes&nbsp;:
<itemizedlist>
	  <listitem>
	    <para> Vous n'avez pas t&eacute;l&eacute;charg&eacute; l'image-disque en mode
<command>binary</command> en utilisant FTP</para>

	    <para>Certains clients FTP mettent par d&eacute;faut le transfert en mode
<emphasis>ASCII</emphasis>, et essayent de changer le 
caract&egrave;re de fin de ligne re&ccedil;u pour  correspondre aux conventions utilis&eacute;es 
par le syst&egrave;me client. Cela alt&egrave;re presque in&eacute;vitablement le fichier 
image. V&eacute;rifiez la taille du fichier image t&eacute;l&eacute;charg&eacute;: si elle n'est pas
<emphasis>exactement </emphasis> la m&ecirc;me que sur le
serveur, alors le processus de t&eacute;l&eacute;chargement est suspect.</para>

<para>Une solution simple&nbsp;: tapez <command>binary</command> &agrave; l'invite FTP, 
apr&egrave;s la connexion sur le serveur et avant le d&eacute;marrage du 
t&eacute;l&eacute;chargement de l'image.</para>
	  </listitem>
	  <listitem>

	    <para> Vous avez utilis&eacute; la commande DOS
<command>copy</command> (ou une commande &eacute;quivalente) pour transf&eacute;rer
l'image de d&eacute;marrage sur la disquette.</para>

	    <para> Les programmes comme <command>copy</command> ne
fonctionnent pas correctement avec les images, car ils ne
peuvent cr&eacute;er une disquette de d&eacute;marrage. L'image est le contenu exact de la disquette, 
piste &agrave; piste, et ne peut &ecirc;tre
copi&eacute;e sur la disquette comme un fichier normal. Vous devez la transf&eacute;rer sur la
disquette en mode brut {raw} en utilisant les outils de bas niveau {low-level} <command>fdimage</command> 
ou <command>rawrite</command>. Ces outils sont d&eacute;crits dans la section <ulink
url="../handbook/install.html">installation de FreeBSD</ulink> du manuel.</para>
	  </listitem>
	</itemizedlist></para>
    </sect1>


    <sect1>
      <title>O&ugrave; sont les instructions pour installer FreeBSD&nbsp;?</title>

      <para>Les instructions d'installation de FreeBSD se
trouvent dans la section <ulink url="../handbook/install.html">
installation de FreeBSD</ulink> du manuel.
</para>
    </sect1>


    <sect1>
      <title>De quoi ai-je besoin pour faire tourner FreeBSD&nbsp;?</title>

      <para> Vous avez besoin d'un PC 386 ou mieux, avec 5Mo ou plus de m&eacute;moire vive (RAM) 
et au moins 60Mo de disque dur. Il suffit d'une carte graphique MDA, 
mais pour utiliser X11R6, une carte video VGA ou mieux est n&eacute;cessaire.</para>
      <para>Voir aussi la section <ulink url="hardware.html">
compatibilit&eacute; mat&eacute;rielle</ulink>.</para>
    </sect1>



    <sect1>
      <title>Je n'ai que 4Mo de m&eacute;moire vive. Puis-je installer FreeBSD&nbsp;?</title>

      <para> FreeBSD 2.1.7 est la derni&egrave;re version de FreeBSD que l'on
peut installer sur des syst&egrave;mes avec 4Mo de m&eacute;moire
vive. Les nouvelles versions de FreeBSD, comme la version 2.2, ont
besoin d'au moins 5Mo de m&eacute;moire vive pour &ecirc;tre install&eacute;es sur un nouveau syst&egrave;me.</para>

      <para>Toutes les versions de FreeBSD, y compris la version 3.0,
peuvent fonctionner avec 4Mo de m&eacute;moire
vive, mais ne peuvent pas ex&eacute;cuter le programme d'installation en 4Mo.
 Vous pouvez ajouter de la m&eacute;moire vive suppl&eacute;mentaire pour le processus 
d'installation, si vous voulez, et quand le syst&egrave;me 
fonctionne, revenir &agrave; 4Mo. Ou vous pouvez placer votre disque sur un syst&egrave;me
disposant de plus de 4Mo, effectuer l'installation et l'&eacute;changer &agrave; nouveau.</para>

      <para>Il y a malgr&eacute; tout des situations dans lesquelles
FreeBSD 2.1.7 ne peut s'installer avec 4Mo. Pour &ecirc;tre exact&nbsp;: cette
version de n'installe pas avec 640Ko de m&eacute;moire de base et 3Mo de
m&eacute;moire &eacute;tendue. Si votre carte m&egrave;re peut 
r&eacute;allouer quelques blocs m&eacute;moire <quote>perdue</quote>
hors de la r&eacute;gion entre 640Ko et 1Mo alors vous pourrez installer FreeBSD
2.1.7</para>

      <para> Regardez dans la configuration de votre BIOS
si vous disposez d'un option <quote>remap</quote>. Si oui, activez la. Vous devez
aussi d&eacute;sactiver la copie miroir de la m&eacute;moire ROM.</para> 

      <para>Il est plus simple d'augmenter la m&eacute;moire vive &agrave; plus de
4Mo pour l'installation, construire un noyau contenant juste les options dont vous avez
besoin, puis revenir &agrave; une configuration avec 4Mo.</para>

      <para>Vous pouvez dans le pire des cas, installer la version
2.0.5 et effectuer une mise &agrave; jour de votre syst&egrave;me en version
2.1.7 avec l'option <option>upgrade</option> du programme d'installation de la 2.1.7.</para>

      <para>Apr&egrave;s l'installation, si vous construisez un noyau sur mesure, 
cela tournera sans probl&egrave;me avc 4Mo. Certaines personnes
ont m&ecirc;me r&eacute;ussi a d&eacute;marrer sur un syst&egrave;me disposant de 2Mo de m&eacute;moire
vive (bien s&ucirc;r le syst&egrave;me fut compl&eacute;tement inutilisable&nbsp;:-)).</para>
    </sect1>
    
    <sect1>
      <title>Comment cr&eacute;er ma  propre disquette d'installation&nbsp;?</title>

      <para>Actuellement il n'y a pas de solution pour cr&eacute;er *juste*
une disquette d'installation personnalis&eacute;e. Vous devez cr&eacute;er une
distribution compl&egrave;te, qui contiendra votre disquette
d'installation. Le code se trouvant dans
<filename>/usr/src/release/floppies/Makefile</filename> peut 
laisser supposer que vous pouvez cr&eacute;er votre disquette,
mais ce n'est pas le cas actuellement.</para>

      <para>Pour cr&eacute;er votre propre version, suivez les instructions
se trouvant <ulink url="custrel">l&agrave;</ulink>.</para>
    </sect1>


    <sect1>
      <title>Puis-je avoir plus d'un syst&egrave;me d'exploitation sur mon PC&nbsp;?</title>

      <para>Voyez la page du tutoriel sur la <ulink
url="&url.tutorials;multios/index.html">cohabitation de plusieurs syst&egrave;mes d'exploitation</ulink>.</para>
    </sect1>



    <sect1>
      <title>Est-ce que Windows 95 peut coexister avec FreeBSD&nbsp;? </title>

      <para> Installez en premier Windows 95, puis FreeBSD. Le
gestionnaire de d&eacute;marrage de FreeBSD, vous permet de d&eacute;marrer 
indiff&eacute;remment sous Windows 95 ou FreeBSD. Si vous installez Windows 95 en second, 
il surchargera votre gestionnaire de d&eacute;marrage sans m&ecirc;me 
poser une question. Si cela arrive, voir la section suivante.</para>

    </sect1>

    <sect1>
      <title>Windows 95 a effac&eacute; mon gestionnaire de d&eacute;marrage&nbsp;! Comment le r&eacute;cup&eacute;rer&nbsp;?</title>

      <para> Vous pouvez r&eacute;-installer le gestionnaire de d&eacute;marrage de
FreeBSD de deux mani&egrave;res&nbsp:

<itemizedlist>
	  <listitem>
	    <para>Sous DOS, allez dans le r&eacute;pertoire
<filename>tools</filename> de votre distribution FreeBSD et
cherchez un programme <filename>bootinst.exe</filename>. Il
vous l'ex&eacute;cutez ainsi:</para>

<informalexample>
<screen>
c:\tools>bootinst.exe boot.bin
</screen>
</informalexample>



	    <para> et le gestionnaire de d&eacute;marrage sera
r&eacute;-install&eacute;</para>
	  </listitem>

	  <listitem>
	    <para>D&eacute;marrez &agrave; nouveau sous FreeBSD avec la disquette
de d&eacute;marrage et allez dans le menu <literal>Custom installation</literal>.
Choisissez <literal>Partition</literal> S&eacute;lectionnez le disque devant contenir 
le gestionnaire de d&eacute;marrage (probablement le premier)  et
quand vous arrivez dans l'&eacute;diteur de partition, la premi&egrave;re chose &agrave; faire 
(c'est &agrave; dire n'effectuer aucun changement) s&eacute;lectionnez <literal>(W)rite</literal>. Vous serez 
interrog&eacute; pour confirmation, r&eacute;pondez <literal>yes</literal>, et quand vous obtenez 
le menu de s&eacute;lection du gestionnaire de 
d&eacute;marrage, assurez vous de bien s&eacute;lectionner <literal>Boot manager</literal>. Cela
re-&eacute;crit le gestionnaire de d&eacute;marrage sur le disque. Ensuite
quittez le programme d'installation et red&eacute;marrez &agrave; partir du disque dur normalement.</para>
	  </listitem>
	</itemizedlist>
</para>
    </sect1>



    <sect1>
      <title>Peut-on installer FreeBSD sur un disque comportant des secteurs d&eacute;fectueux&nbsp;?</title>

      <para>La gestion des secteurs d&eacute;fectueux (voir la commande <ulink
url="http://www.freebsd.org/cgi/man.cgi?bad144">bad144</ulink>) de
FreeBSD n'est pas fiable &agrave; 100%&nbsp;; il serait plus juste de dire
que si vous disposez d'un disque IDE ou ESDI avec &eacute;normement de <ForeignPhrase>bad
blocks</ForeignPhrase>, alors FreeBSD n'est pas 
pour vous&nbsp;! En fait FreeBSD tourne sur des centaines de syst&egrave;mes &agrave; base de disques IDE, il vaut
mieux essayer avant de vous d&eacute;courager.</para>

      <para>Si vous avez un disque SCSI comportant des secteurs d&eacute;fectueux,
voyez <ulink url="#awre">cette r&eacute;ponse</ulink></para>
    </sect1>


    <sect1>
      <title>Il se passe des choses &eacute;tranges lorsque je d&eacute;marre depuis la disquette d'installation&nbsp;!</title>
    
  <para>Si vous d&eacute;tectez des choses comme&nbsp;: un blocage de la
machine, un red&eacute;marrage inopin&eacute; de votre syst&egrave;me avec la disquette
d'installation, posez vous les 3 questions suivantes&nbsp:</para>

      <para><orderedlist>
	  <listitem>
	    <para>Avez-vous utilis&eacute; une disquette neuve, sans erreurs
(pr&eacute;f&eacute;rez une disquette sortie de la bo&icirc;te plut&ocirc;t qu'une disquette provenant
du dernier magazine oubli&eacute; sous votre lit depuis trois ans)&nbsp;?</para> 
	  </listitem>
	  <listitem>
	    <para>Avez vous t&eacute;l&eacute;charg&eacute; l'image en mode binaire (ne 
vous offusquez pas, m&ecirc;me les meilleurs d'entre nous, 
ont t&eacute;l&eacute;charg&eacute; des fichiers en mode ASCII au moins une fois)&nbsp;? </para>
	  </listitem>
	  <listitem>
	    <para>Si vous utilisez des syst&egrave;mes d'exploitation r&eacute;cents
comme Windows 95 ou Windows NT, avez vous arr&eacute;t&eacute; le syst&egrave;me et 
red&eacute;marr&eacute; en DOS simple et honn&ecirc;te&nbsp;? Il semble que ces syst&egrave;mes peuvent interf&eacute;rer 
avec des programmes
qui &eacute;crivent directement sur le mat&eacute;riel, comme c'est le cas des programmes de 
cr&eacute;ation de disquette&nbsp;; m&ecirc;me en l'ex&eacute;cutant dans une fen&ecirc;tre DOS 
de windows cela peut causer ces probl&egrave;mes.</para>
	  </listitem>
	</orderedlist></para>

      <para>Certaines informations mentionnant que Netscape
pose des probl&egrave;mes en t&eacute;l&eacute;chargeant l'image de la disquette de
d&eacute;marrage, donc utilisez un client FTP diff&eacute;rent si vous
pouvez.</para>
    </sect1>


     <sect1>
      <title>Je n'arrive pas &agrave; installer &agrave; partir de la bande</title>

      <para>Si vous installez la version 2.1.7R &agrave; partir d'une 
bande, vous devez cr&eacute;er la bande en utilisant un facteur de blocage de
10 (5120 octets). Le facteur de blocage par d&eacute;faut de <filename>tar</filename> est 20 (10240
octets), et les bandes cr&eacute;es en utilisant cette valeur par d&eacute;faut 
ne peuvent pas &ecirc;tre utilis&eacute;es pour installer la
version 2.1.7R&nbsp;; avec ce type de bande vous obtiendrez une erreur disant
que la taille des enregistrements est trop grande.</para>
    </sect1>


    <sect1>
      <title>Connecter deux syst&egrave;mes FreeBSD par les ports parall&egrave;le (PLIP)</title>
<para>Trouvez un c&acirc;ble "laplink". V&eacute;rifiez que les deux ordinateurs
ont un noyau avec le support de pilote <filename>lpt</filename>.</para>

	<programlisting>

      $ dmesg | grep lp
      lpt0 at 0x378-0x37f irq 7 on isa
      lpt0: Interrupt-driven port
      lp0: TCP/IP capable interface
	</programlisting>

<para>Installez le c&acirc;ble "laplink" sur les ports parall&egrave;lle.</para>

<para>Configurez les param&egrave;tres de l'interface r&eacute;seau pour
lp0 des deux c&ocirc;t&eacute;s en tant que <username>root</username>.</para>

<para>Par exemple, si vous voulez connecter l'ordinateur max avec moritz&nbsp:</para>

	<programlisting>
                 max <-----> moritz
IP Address    10.0.0.1      10.0.0.2
	</programlisting>

<para> sur max, d&eacute;marrez&nbsp: </para>


	<programlisting>
	# ifconfig lp0 10.0.0.1 10.0.0.2
	</programlisting>

<para> sur moritz, d&eacute;marrez&nbsp: </para>


	<programlisting>
	# ifconfig lp0 10.0.0.2 10.0.0.1
	</programlisting>

<para>C'est tout&nbsp! Lisez aussi les manpages 
<citerefentry><refentrytitle>lp</refentrytitle><manvolnum>4</manvolnum></citerefentry> and 
<citerefentry><refentrytitle>lpt</refentrytitle><manvolnum>4</manvolnum></citerefentry>.</para>


<para>Vous devez aussi ajouter les deux adresse dans <filename>/etc/hosts</filename>&nbsp;:</para>


	<programlisting>
     127.0.0.1               localhost.my.domain localhost 
     10.0.0.1                max.my.domain max
     10.0.0.2                moritz.my.domain moritz
	</programlisting>

<para>Pour v&eacute;rifier le bon fonctionnement faire&nbsp;:</para>

<para>sur max&nbsp;:</para>


	<programlisting>
$ ifconfig lp0
lp0: flags=8851&lt;UP,POINTOPOINT,RUNNING,SIMPLEX,MULTICAST&gt; mtu 1500
        inet 10.0.0.1 --> 10.0.0.2 netmask 0xff000000 


$ netstat -r
Routing tables

Internet:
Destination        Gateway            Flags     Refs     Use     Netif Expire
moritz               max              UH          4   127592       lp0


$ ping -c 4 moritz
PING moritz (10.0.0.2): 56 data bytes
64 bytes from 10.0.0.2: icmp_seq=0 ttl=255 time=2.774 ms
64 bytes from 10.0.0.2: icmp_seq=1 ttl=255 time=2.530 ms
64 bytes from 10.0.0.2: icmp_seq=2 ttl=255 time=2.556 ms
64 bytes from 10.0.0.2: icmp_seq=3 ttl=255 time=2.714 ms

--- moritz ping statistics ---
4 packets transmitted, 4 packets received, 0% packet loss
round-trip min/avg/max/stddev = 2.530/2.643/2.774/0.103 ms

	</programlisting>

    </sect1>


    <sect1>
      <title>Peut-on effectuer une installation par le port parall&egrave;le (PLIP)</title>

      <para> Connectez les deux ordinateurs avec un cable parall&egrave;le "Laplink"</para>
      <figure>
	<title>Cable parall&egrave;le</title>
<informalexample>
<screen>
             +----------------------------------------+ 
             |A-name A-End   B-End   Descr.  Port/Bit | 
             +----------------------------------------+ 
             |DATA0  2       15      Data    0/0x01   | 
             |-ERROR 15      2               1/0x08   | 
             +----------------------------------------+ 
             |DATA1  3       13      Data    0/0x02   | 
             |+SLCT  13      3               1/0x10   | 
             +----------------------------------------+ 
             |DATA2  4       12      Data    0/0x04   | 
             |+PE    12      4               1/0x20   | 
             +----------------------------------------+ 
             |DATA3  5       10      Strobe  0/0x08   | 
             |-ACK   10      5               1/0x40   | 
             +----------------------------------------+ 
             |DATA4  6       11      Data    0/0x10   | 
             |BUSY   11      6               1/0x80   | 
             +----------------------------------------+ 
             |GND    18-25   18-25   GND -            | 
             +----------------------------------------+ 
</screen>
</informalexample>
	</figure>

      <para>Voir aussi <ulink url="#pao">cette note</ulink> sur la page de FreeBSD pour les portables</para>
    </sect1>


    <sect1>
      <title id="geometry">Quelle g&eacute;om&eacute;trie dois-je utiliser pour un disque&nbsp;?</title>

      <para>(Par le mot "g&eacute;om&eacute;trie" d'un disque, nous pensons aux
nombres de cylindres, t&ecirc;tes et secteurs par pistes sur un disque&nbsp;- Nous
dirons par la suite C/H/S. C'est de cette fa&ccedil;on que le BIOS des PC
arrive &agrave; &eacute;crire ou lire une zone du disque).</para>

      <para>Cela peut pr&eacute;ter &agrave; confusion pour diff&eacute;rentes raisons.
Premi&egrave;rement, la <emphasis>g&eacute;om&eacute;trie physique</emphasis> d'un disque
SCSI ne veut rien dire, de la fa&ccedil;on dont FreeBSD utilise les blocs
disques. En fait, on ne peut parler de <quote>la</quote> g&eacute;om&eacute;trie physique,
la densit&eacute; des secteurs variant sur le disque -ce que les
fabricants appellent la <quote>vraie</quote> g&eacute;om&eacute;trie physique, c'est la g&eacute;om&eacute;trie
qu'ils ont d&eacute;t&eacute;rmin&eacute;, pour avoir le moins d'espace perdu.
Pour les disques IDE, FreeBSD voit en terme de C/H/S, mais tous les
disques r&eacute;cents convertissent cela en blocs eux-m&ecirc;mes.</para>

      <para>Tout cela est, en fait, la <emphasis>g&eacute;om&eacute;trie logique
</emphasis>&nbsp; la r&eacute;ponse que le BIOS re&ccedil;oit lorsqu'il demande <quote>quelle
est votre g&eacute;om&eacute;trie&nbsp;?</quote> et qu'il utilise pour acc&eacute;der au disque. Comme
FreeBSD utilise le BIOS pour d&eacute;marrer, il est tr&egrave;s important qu'elle
soit juste. En particulier, si vous avez plus d'un syst&egrave;me
d'exploitation sur votre disque, ils doivent &ecirc;tre d'accord
sur la g&eacute;om&eacute;trie, sinon vous rencontrerez de graves probl&egrave;mes
au d&eacute;marrage du syst&egrave;me.</para>

      <para>Pour les disques SCSI, la g&eacute;om&eacute;trie &agrave; utiliser d&eacute;pend
du support de translation &eacute;tendu activ&eacute; sur votre contr&ocirc;leur
(ou encore appel&eacute; <quote>support pour les disques DOS &gt;1Go</quote> ou
similaire). S'il n'est pas activ&eacute;, utilisez N cylindres, 64
t&ecirc;tes et 32 secteurs par pistes, ou 'N' est la capacit&eacute; du disque en
Mo. Par exemple, pour un disque de 2Go vous devez utiliser 2048
cylindres, 64 t&ecirc;tes et 32 secteurs par piste.</para>

      <para>Si cette option est active (c'est le cas la plupart du temps
pour permettre de passer outre certaines limitations de MSDOS) et que
le disque a une capacit&eacute; de plus de 1Go, utilisez M cylindres, 63 t&ecirc;tes
(et *pas* 64), et 255 secteurs par piste, o&ugrave; M correspond &agrave; la capacit&eacute;
en Mo divis&eacute; par 7.844238 (!). Donc, en prenant un disque de 2Go nous
obtenons 261 cylindres, 63 t&ecirc;tes et 255 secteurs par piste.</para>

      <para>Si vous n'&ecirc;tes pas s&ucirc;r de point, ou si
FreeBSD n'arrive pas &agrave; d&eacute;tecter la g&eacute;om&eacute;trie correctement au moment de
l'installation, la fa&ccedil;on la plus simple de faire, est de cr&eacute;er
une petite partition DOS sur le disque. La g&eacute;om&eacute;trie correcte sera alors
d&eacute;tect&eacute;e (et vous pourrez toujours retirer la partition DOS dans
l'&eacute;diteur de partitions si vous ne voulez pas la garder ou conservez la 
pour la programmation de cartes r&eacute;seau).</para>

      <para>Une autre solution est d'utiliser un outil disponible librement distribu&eacute; avec
FreeBSD appel&eacute; <filename>pfdisk.exe</filename> (il se trouve dans
le r&eacute;pertoire <filename>tools</filename> du CDROM de FreeBSD ou sur
les sites ftp), qui permet de voir quelle g&eacute;om&eacute;trie utilisent les
autres syst&egrave;mes sur ce disque. Vous pourrrez ensuite
entrer cette g&eacute;om&eacute;trie dans l'&eacute;diteur de partitions.</para>
    </sect1>


    <sect1>
      <title>Y a-t-il des restrictions sur la fa&ccedil;on de partitionner le disque&nbsp;?</title>
    
  <para>Oui. Vous devez vous assurer que la partition
<quote><filename>/</filename></quote> <quote><filename>{root}</filename></quote> se trouve dans les 1024 premiers cylindres,
pour permettre au BIOS de trouver le noyau. (Notez que c'est une
limitation d&ucirc;e au BIOS des PC et non pas &agrave; FreeBSD).</para>

      <para>Dans le cas d'une disque SCSI, cela implique que la
partition <quote><filename>/</filename></quote> <quote><filename>{root}</filename></quote> soit dans les 1024 premiers Mo (ou
dans les 4096 premiers si la translation est en place - voir la
question pr&eacute;c&eacute;dente). Pour un disque IDE, il faut qu'elle se trouve
dans les 504 premiers Mo.</para>
    </sect1>



    <sect1>
      <title>A propos des gestionnaires de disque&nbsp;? Ou bien, j'ai un disque de grande capacit&eacute;&nbsp!</title>
    
      <para>FreeBSD reconnait le gestionnaire "Ontrack Disk Manager" et le tol&egrave;re.
Les autres gestionnaires de disque ne sont pas support&eacute;s.</para>
      
      <para>Si vous voulez utiliser le disque uniquement avec FreeBSD, 
vous n'avez pas besoin de gestionnaire de disque. Configurez
simplement le disque pour utiliser le maximum de place reconnue par le 
BIOS (la plupart du temps 504Mo), et FreeBSD trouvera de lui m&ecirc;me la
capacit&eacute; de votre disque. Si vous utilisez un vieux disque avec 
un controlleur MFM, vous devrez donner explicitement &agrave; FreeBSD le
nombre de cylindres &agrave; utiliser.</para>
      
      <para>Si vous voulez utiliser le disque avec FreeBSD et un autre
syst&egrave;me d'exploitation, vous n'aurez pas besoin d'un gestionnaire de
disque: assurez vous que la partition de d&eacute;marrage de FreeBSD et
les tranches pour les autres syst&egrave;mes d'exploitation se trouvent dans
les 1024 premiers cylindres. Si vous &ecirc;tes prudent, une partition de d&eacute;marrage de 20Mo doit
suffire.</para>
    </sect1>


    <sect1>
      <title id="missingos">Lors du d&eacute;marrage de FreeBSD j'obtiens "Missing Operating System"</title>
      <para>C'est le sympt&ocirc;me classique o&ugrave; FreeBSD et DOS, ou un autre
syst&egrave;me d'exploitation, sont en conflit &agrave; propos de la <anchor
id="geometry2"> g&eacute;om&eacute;trie du disque. Vous devez alors
r&eacute;installer FreeBSD, en faisant attention &agrave; toutes les informations
qui vous sont pr&eacute;sent&eacute;es.</para>
      
      </sect1>

    <sect1>
      <title>Je ne peux pas aller plus loin que le message `F?' du gestionnaire de d&eacute;marrage.</title>
      <para>Ceci est un autre sympt&ocirc;me du probl&egrave;me d&eacute;crit &agrave; la
question pr&eacute;c&eacute;dente. La g&eacute;om&eacute;trie trouv&eacute;e par le BIOS et celle de
FreeBSD ne sont pas les m&ecirc;mes. Si votre contr&ocirc;leur ou votre
BIOS supporte la translation de cylindres (souvent indiqu&eacute;e comme "Support des disques >1Go"), 
essayez de changer les
param&egrave;tres et r&eacute;installez FreeBSD.</para>
      </sect1>
    
    <sect1>
      <title id="bigram">Je dispose de plus de 16Mo de RAM. Est-ce que cela peut poser un probl&egrave;me&nbsp;?</title>
      <para>Mis &agrave; part les probl&egrave;mes de performances, non. FreeBSD 2.X
inclus des <quote>bounce buffers</quote> permettant &agrave; votre bus principal d'acc&eacute;der
&agrave; plus de 16Mo de m&eacute;moire. (Notez que cela n'est vrai que pour les
p&eacute;riph&eacute;riques ISA, et quelques p&eacute;riph&eacute;riques EISA 
ou VLB).</para>
      
      <para>Voyez aussi la section parlant des ordinateurs
<ulink url="#reallybigram">plus de 64Mo de RAM</ulink>, si vous avez autant de m&eacute;moire, ou si vous
utilisez un ordinateur Compaq ou un autre BIOS qui donne de mauvaises
informations sur la m&eacute;moire disponible.</para>
    </sect1>

    <sect1>
      <title>Dois-je installer tous les sources&nbsp;?</title>

      <para>La plupart du temps, non. Malgr&eacute; tout, nous vous
conseillons fortement d'installer, au minimum, les sources de
base (<filename>sbase</filename>) ainsi que les sources du noyau
(<filename>ssys</filename>). Il n'y a rien dans le syst&egrave;me qui
n&eacute;cessite la pr&eacute;sence des sources, sauf si vous d&eacute;sirez <ulink
url="http://www.freebsd.org/cgi/man.cgi?config">reconfigurer</ulink>
le noyau du syst&egrave;me. A l'exception du noyau, notre structure de
compilation est faite pour vous permettre de visualiser les sources
(m&ecirc;me en lecture seule) et de construire alors de nouveaux
binaires. (En raison de la restriction des sources du noyau, nous vous
recommandons de monter les sources ailleurs que dans
<filename>/usr/src</filename> en cr&eacute;eant les liens symboliques
appropri&eacute;s permettant de dupliquer la structure compl&egrave;te des
sources).</para>

      <para>En ayant les sources &agrave; votre disposition et en sachant
comment l'on construit un syst&egrave;me avec, cela  permettra d'avoir une fa&ccedil;on
tr&egrave;s simple pour mettre &agrave; jour votre syst&egrave;me vers les prochaines
versions de FreeBSD.</para>
      
      <para>Pour n'installer qu'une partie des sources, utilisez le menu <literal>
Custom</literal> quand vous &ecirc;tes dans le menu
<literal>Distributions</literal> du programme d'installation. Le script
<filename>src/install.sh</filename> peut installer aussi certains &eacute;l&eacute;ments des
sources, en fonction des arguments que vous lui passez.</para>
      
      </sect1>

    <sect1>
      <title>Suis-je oblig&eacute; de construire un nouveau noyau&nbsp;?</title>

      <para>Construire un nouveau noyau, &eacute;tait encore, il y a quelque
temps, une &eacute;tape &agrave; peu pr&egrave;s obligatoire apr&egrave;s l'installation de FreeBSD, mais les
nouvelles versions ont b&eacute;n&eacute;fici&eacute; d'un utilitaire de configuration du
noyau plus sympathique. Au d&eacute;marrage de FreeBSD et apr&egrave;s l'invite de d&eacute;marrage
(<prompt>boot:</prompt>) utilisez le param&egrave;tre <option>-c</option> et vous aurez alors acc&egrave;s au
menu de configuration visuel, qui vous permet de configurer les
param&egrave;tres de la plupart des cartes ISA.</para>

<para>Il est encore recommand&eacute; construire un nouveau noyau
contenant juste les pilotes dont avez besoin, seulement pour
&eacute;conomiser un peu de RAM, mais ce n'est plus une exigence stricte pour la 
plupart des syst&egrave;mes.</para>

      </sect1>
    <sect1>
      <title>Je r&eacute;side en dehors des Etats-Unis. Puis-je utiliser le DES&nbsp;?</title>
      <para>Si la m&eacute;thode de cryptage <emphasis>DES</emphasis> ne vous est pas absolument n&eacute;cessaire, alors vous
pouvez utiliser le syst&egrave;me de cryptage fourni par d&eacute;faut avec FreeBSD
et qui vous apporte une bien meilleure s&eacute;curit&eacute;, sans aucune
restriction d'exportation. Le cryptage des mots de passe par d&eacute;faut de FreeBSD 2.0 est
maintenant bas&eacute; sur <emphasis>MD5</emphasis>, qui est plus difficile &agrave; casser que <emphasis>DES</emphasis>, avec un
outil automatis&eacute; en raison de sa forte demande en temps de calcul, et qui
permet aussi d'utiliser des mots de passe plus longs. La seule raison
pour laquelle vous ne pouvez pas utiliser le cryptage bas&eacute; sur
<emphasis>MD5</emphasis> est, si vous d&eacute;sirez utiliser la
m&ecirc;me entr&eacute;e du fichier des mots de passe sur des syst&egrave;mes FreeBSD et
non-FreeBSD.</para>
      <para>Comme l'algorithme de cryptage <emphasis>DES</emphasis> ne peut pas &ecirc;tre
l&eacute;galement export&eacute; en dehors des Etats-Unis, tout utilisateur non
am&eacute;ricain ne doit pas t&eacute;l&eacute;charger les logiciels l'incluant (se
trouvant dans le r&eacute;pertoire <filename>sec</filename> des sites FTP
am&eacute;ricains)</para>
      <para>Il y a cependant une librairie de remplacement disponible,
libcrypt, bas&eacute;e sur des sources &eacute;crit en Australie par David Burren.
Le code est maintenant disponible sur certains sites ftp miroirs en
dehors des Etats-Unis. Les sources, ainsi que les binaires des
programmes l'utilisant peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;s sur les sites ftp
suivants:</para>
      <para><itemizedlist>
	  <listitem>
	    <para>Afrique du Sud:
<itemizedlist>
		<listitem>
		  <para>ftp://ftp.internat.freebsd.org/pub/FreeBSD</para>
		</listitem>
		<listitem>
		  <para>ftp://storm.sea.uct.ac.za/pub/FreeBSD</para>
		</listitem>

	      </itemizedlist>
</para>
	  </listitem>
	  <listitem>
	    <para>Br&eacute;sil:
<itemizedlist>
		<listitem>
		  <para>ftp://ftp.iqm.unicamp.br/pub/FreeBSD</para>
		</listitem>
	      </itemizedlist>
</para>
	  </listitem>
	  <listitem>
	    <para>Finlande:
	    <itemizedlist>
	      <listitem>
		<para>ftp://nic.funet.fi/pub/unix/FreeBSD/eurocrypt</para>
	      </listitem>
	    </itemizedlist>
</para>
	  </listitem>
	</itemizedlist>
</para>
      <para>Cette distribution non-US peut &ecirc;tre directement utilis&eacute;e &agrave; la
place de la distribution am&eacute;ricaine. Ce paquetage s'installe de la m&ecirc;me
fa&ccedil;on que le paquetage am&eacute;ricain (regardez les notes d'installation du
paquetage pour plus de d&eacute;tails). Si vous d&eacute;sirez installer le cryptage
<emphasis>DES</emphasis>, vous devez l'installer le plus t&ocirc;t possible, avant l'installation
de tout autre logiciel.</para>
      <para>Les utilisateurs ne r&eacute;sidant pas aux Etats-Unis ne doivent
t&eacute;l&eacute;charger aucun programme de cryptage sur un site am&eacute;ricain. Cela
pourrait entrainer, pour les responsables du site depuis lequel le
logiciel est t&eacute;l&eacute;charg&eacute;, de graves probl&egrave;mes juridiques.</para>

      <para>Une distribution non-US de Kerberos est aussi en
cours de d&eacute;veloppement, et les versions courantes peuvent
g&eacute;n&eacute;ralement &ecirc;tre obtenues depuis un site FTP anonyme
<ulink url="ftp://braee.ru.ac.za">braae.ru.ac.za</ulink></para>

      <para>Il existe aussi une liste de messagerie discutant de tous les
logiciels non-US de cryptage. Pour plus d'informations,
envoyez un email contenant le mot "help" dans le corps du message &agrave;
<ulink
url="mailto:majordomo@braae.ru.ac.za">&lt;majordomo@braae.ru.ac.za&gt;</ulink></para>

    </sect1>

    <sect1>
      <title>La disquette de d&eacute;marrage se bloque sur le message "Probing Devices..."</title>
      <para> Si vous disposez d'un disque ZIP ou JAZ, retirez-le et
recommencez. La disquette d'installation a des probl&egrave;mes avec ce genre
de disque. Une fois le syst&egrave;me install&eacute;, vous pouvez reconnecter le
disque. Si tout va bien ce probl&egrave;me sera fix&eacute; dans une version ult&eacute;rieure.</para>

    </sect1>

    <sect1>
      <title>J'obtiens le message "panic: cant mount root" lors du red&eacute;marrage de  mon syst&egrave;me apr&egrave;s l'installation.</title>

      <para>Cette erreur indique un conflit entre les blocs de
d&eacute;marrage du syst&egrave;me et la connaissance du noyau sur les disques.
Cette erreur arrive fr&eacute;quemment dans le cas d'un syst&egrave;me disposant de
deux disques IDE, avec chaque disque install&eacute; en ma&icirc;tre ou p&eacute;riph&eacute;rique unique sur des
contr&ocirc;leurs s&eacute;par&eacute;s, avec FreeBSD install&eacute; sur le contr&ocirc;leur IDE secondaire.
Le programme de d&eacute;marrage pense que le syst&egrave;me est install&eacute; sur wd1
(le second disque vu par le BIOS) alors que le noyau affecte wd2 au
premier disque du deuxi&egrave;me contr&ocirc;leur. Apr&egrave;s le test de tous les
p&eacute;riph&eacute;riques, le noyau essaye de <quote>monter</quote> ce que le programme de
d&eacute;marrage pense &ecirc;tre le disque de d&eacute;marrage, wd1, alors qu'il s'agit
en fait de wd2 et &eacute;choue.</para>

      <para>Pour r&eacute;soudre ce probl&egrave;me, effectuez les op&eacute;rations
suivantes&nbsp:
<itemizedlist >
	  <listitem>
	    <para>Au message de d&eacute;marrage tapez&nbsp:
<command>1:wd(2,a)kernel</command> puis Entr&eacute;e. Si le syst&egrave;me
d&eacute;marre, lancez la commande <command> echo "1:wd(2,a)kernel" >
/boot.config</command> pour affecter la bonne cha&icirc;ne de
d&eacute;marrage.</para>
	    
	  </listitem>
      <listitem>
	<para>D&eacute;placez le disque FreeBSD sur le controleur primaire,
les disques sont alors vus de fa&ccedil;on contigus.</para>
      </listitem>
      <listitem>
	<para><ulink url="../handbook/kernelconfig.html">Reconstruisez
un noyau</ulink> en modifiant les lignes de configuration wd pour avoir:

	<programlisting>
controller      wdc0    at isa? port "IO_WD1" bio irq 14 vector wdintr
disk            wd0     at wdc0 drive 0
# disk            wd1     at wdc0 drive 1 # comment out this line

controller      wdc1    at isa? port "IO_WD2" bio irq 15 vector wdintr
disk            wd1     at wdc1 drive 0 # change from wd2 to wd1
disk            wd2     at wdc1 drive 1 # change from wd3 to wd2

</programlisting>
	    Puis installez le nouveau noyau. Si vous avez d&eacute;plac&eacute; 
vos disques et vous voulez restaurer la configuration pr&eacute;c&eacute;dente, 
placez les disques dans la
configuration d&eacute;sir&eacute;e puis red&eacute;marrez. Votre syst&egrave;me doit d&eacute;marrer
correctement.</para>
      </listitem>
    </itemizedlist>
</para>
      
    </sect1>
    <sect1>
      <title>Quelles sont les limites m&eacute;moire&nbsp;? </title>

      <para>Pour la m&eacute;moire, la limite est (en th&eacute;orie) 4Go. 
Un essai a &eacute;t&eacute; fait avec un Go&nbsp;; vous ne pourrez probablement pas
acheter des PC i386 pouvant supporter plus que cela.</para>

    </sect1>
    <sect1>

<title>Quelles sont les tailles limites pour les syst&egrave;mes de fichiers 
FFS&nbsp;?</title>

<para>La taille maximum th&eacute;orique d'un syst&egrave;me de fichiers FFS est
de 8 t&eacute;raoctets (2G blocs) ou de 16To avec la taille de bloc par
d&eacute;faut de 8K. Il y a en pratique une limite logicielle &agrave; 
1 t&eacute;raoctet mais, avec quelques modifications, il est possible d'avoir
des syst&egrave;mes de fichiers de 4 t&eacute;raoctet (et il en existe).</para>

<para>La taille maximum d'un fichier FFS est d'environ 1G blocs (4To), quand
la taille de bloc est de 4K.</para>

	<programlisting>



                         taille de fichier maximum
                 -----------------------------------------
                 2.2.7    3.0
taille de bloc   -stable  -current  marche  devrait marcher
--------------   -------  --------  ------  ---------------
4K               4T-1       4T-1    4T-1    4+T
8K               32+G       8T-1    32+G    16T-1
16K              128+G      16T-1   128+G   32T-1
32K              512+G      32T-1   512+G   64T-1
64K              2048+G     64T-1   2048+G  128T-1

	</programlisting>

     

<para>Quand la taille du bloc est de 4K, l'adressage du bloc par indirection triple 
fonctionne et la limite devrait &ecirc;tre d&eacute;finie par le plus grand
num&eacute;ro de bloc qui peut &ecirc;tre repr&eacute;t&eacute; avec une
indirection triple (approximativement 1K^3 + 1K^2 + 1K), mais  la limite
effective est en fait donn&eacute;e par une valeur (erron&eacute;e) de
1G-1 pour le nombre de blocs maximum. Cette valeur devraite &ecirc;tre de 2G-1.
Il y a des bogues avec les blocs dont le num&eacute;ro est voisin de 2G-1, 
et ces blocs ne peuvent &ecirc;tre adress&eacute;s quand la taille du bloc est
de 4K. </para>

<para>Pour les tailles de blocs de 8K et plus, tout devrait &ecirc;tre limit&eacute;
par la valeur de 2G-1 pour les num&eacute;ros de blocs, mais l'est en fait par
la valeur maximum de 1G-1, hormis sous -stable, les blocs adress&eacute;s par
indirection triple ne peuvent &ecirc;tre atteints, la limite est donc 
donn&eacute;e par le plus grand num&eacute;ro de bloc qui peut &ecirc;tre
adress&eacute; par une double indirection (approximativement 
(taille du bloc/4)^2 + (taille du bloc/4)), et d&eacute;passer cette limite
sous -current peut poser des probl&egrave;mes. Utiliser la valeur correcte
de 2G-1 blocs posent &agrave; coup s&ucirc;r des probl&egrave;mes.</para>

    </sect1>
    <sect1>
  <title>Comment puis-je mettre des fichiers de 1To sur une disquette&nbsp;?</title>

<para>J'en ai plusieurs&nbsp;-&nbsp;virtuels&nbsp;-&nbsp;sur disquette&nbsp;:-). La taille
maximum d'un fichier n'a pas de lien &eacute;troit avec la dimension maximum
d'un disque. Un disque peut avoir jusqu'&agrave; un 1To. Il est 
fonctionnellement possible d'avoir un fichier plus grand que le disque.</para>

<para>L'exemple suivant cr&eacute;e un fichier de 8T-1 occupant 32K d'espace disque. 
(3 blocs indirects et 1 bloc de donn&eacute;es) sur une petite partition racine. Il 
faut pour cela une version de la commande <command>dd</command> qui fonctionne
sur de gros fichiers.</para>

	<programlisting>


ttyv0:bde@alphplex:/tmp/q> cat foo
df .
dd if=/dev/zero of=z bs=1 seek=`echo 2^43 - 2 | bc` count=1
ls -l z
du z
df .
ttyv0:bde@alphplex:/tmp/q> sh foo
Filesystem  1024-blocks     Used    Avail Capacity  Mounted on
/dev/sd0a         64479    27702    31619    47%    /
1+0 records in
1+0 records out
1 bytes transferred in 0.000187 secs (5346 bytes/sec)
-rw-r--r--  1 bde  bin  8796093022207 Sep  7 16:04 z
32	z
Filesystem  1024-blocks     Used    Avail Capacity  Mounted on
/dev/sd0a         64479    27734    31587    47%    /
ttyv0:bde@alphplex:/tmp/q> exit

	</programlisting>

<para>Bruce Evans, September 1998</para>

    </sect1>

  </chapter>
