<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
         
        $FreeBSD$
	Original revision: n.nn
-->              

  <chapter id="serial">
    <title>Communications par port s&eacute;rie</title>
    <para>Cette section comporte les r&eacute;ponses aux diff&eacute;rentes
questions sur la communication par port s&eacute;rie sur FreeBSD. Les
protocoles PPP et SLIP sont couverts dans la section R&eacute;seaux.</para>


    <sect1>
      <title>Comment savoir si FreeBSD a trouv&eacute; mes ports s&eacute;ries ?</title>
      <para> Lorsque FreeBSD d&eacute;marre, il recherche les ports s&eacute;rie sur 
votre machine qui sont configur&eacute;s dans le noyau. Vous pouvez voir ces
ports en regardant avec attention au moment du d&eacute;marrage les messages
affich&eacute;s, ou en lan&ccedil;ant la commande suivante:</para>
<para><programlisting>
dmesg | grep sio
</programlisting>
</para>
      <para>Lorsque votre syst&egrave;me a d&eacute;marr&eacute;. Voici quelques exemples
de l'affichage de la commande pr&eacute;c&eacute;dente.
<programlisting>
sio0 at 0x3f8-0x3ff irq 4 on isa
sio0: type 16550A 
sio1 at 0x2f8-0x2ff irq 3 on isa 
sio1: type 16550A
</programlisting>
Vous voyez alors apparaitre deux ports s&eacute;rie. Le premier se trouve &agrave;
l'adresse <filename>0x3f8</filename> sur l'IRQ 4 et est compos&eacute; d'une
puce de type 16550A. Le second est de meme type que le premier, mais
se trouve lui &agrave; l'adresse <filename>0x2f8</filename> sur l'IRQ 3. Les
cartes modems internes sont trait&eacute;s comme des ports s&eacute;rie -- sauf
qu'ils ont toujours un modem sur le port.
</para>

      <para>Le noyau <emphasis remap="tt">GENERIC</emphasis> comprends 
le support pour deux ports s&eacute;rie dont les adresses et les IRQ sont les 
memes que celles ci-dessus. Si ces valeurs ne vous conviennent pas, ou 
si vous avez des cartes modems additionnelles ou des cartes s&eacute;rie,
reconfigurez un noyau. Voyez la section sur la reconstruction d'un
noyau pour plus de d&eacute;tails.</para>
    </sect1>

    <sect1>
      <title>Comment savoir si FreeBSD a trouv&eacute; mes cartes modems</title>
      <para>R&eacute;f&eacute;rez vous &agrave; la section pr&eacute;c&eacute;dente </para>
    </sect1>

    <sect1>
      <title>Je viens de mettre &agrave; jour ma machine en 2.0.5 et mes <emphasis remap="tt"> tty0x</emphasis> ont diparus ! </title>
      <para>Ne vous inquitez pas, ils sont &eacute;t&eacute; remplac&eacute;s par les
devices <emphasis remap="tt">ttydX</emphasis>. Vous devrez donc
changer toutes vos anciennes configurations pour utiliser ces
devices.</para>
      </sect1>
    
    <sect1>
      <title>Comment acc&eacute;der aux ports s&eacute;rie sous FreeBSD ? </title>

      <para>Le troisi&egrave;me port s&eacute;rie <ulink
url="http://www.freebsd.org/cgi/man.cgi?sio">sio2 </ulink>(aussi
appel&eacute; COM3 sous DOS), s'appelle <emphasis remap="tt">
/dev/cuaa2</emphasis> en sortie, et <emphasis remap="tt">
/dev/ttyd2 </emphasis> en entr&eacute;e. Quelle est la diff&eacute;rence entre ces
deux classes de devices ?</para>

      <para>Vous devez utiliser <emphasis remap="tt"> ttydX
</emphasis> pour des appels sortants. Lorsque vous ouvrez <emphasis
remap="tt"> /dev/ttydX </emphasis> en mode bloquant, un processus
attend, sur le device <emphasis remap="tt"> cuaaX </emphasis>
correspondant, qu'il soit inactif, et attends alors de d&eacute;tecter la
porteuse sur la ligne. Lorsque vous ouvrez le port <emphasis
remap="tt"> cuaaX </emphasis>, un processus v&eacute;rifie d&eacute;j&agrave; que le port
<emphasis remap="tt"> ttydX </emphasis> correspondant est
disponible. Si le port est disponible, alors il se l'approprie depuis
le port <emphasis remap="tt"> ttydX </emphasis>. Le port <emphasis
remap="tt"> cuaaXX </emphasis> ne tient pas compte de la d&eacute;tection de
porteuse. Gra&ccedil;e a cette fonctionnalit&eacute; et un modem, vous pouvez avoir
des utilisateurs se logguant sur votre machine tout en vous laissant
appeller via le meme modem, c'est le syst&egrave;me qui se pr&eacute;ocupera de
g&eacute;rer les conflits.</para>

    </sect1>
    <sect1>
      <title>Comment activer le support pour les cartes s&eacute;ries multiports</title>
      <para>Encore une fois, reportez vous &agrave; la section sur la
	configuration du noyau. Pour une carte s&eacute;rie multiports placez 
	une ligne <ulink
	  url="http://www.freebsd.org/cgi/man.cgi?sio">sio</ulink>
	pour chaque port s&eacute;rie de la carte dans le fichier de
	configuration du noyau. Ne mettez pour une valeur l'irq et le
	vecteur d'adresse de la carte. Tous les ports de la cartes
	doivent partager la m&ecirc;me irq. Pour des raisons de
	coh&eacute;rence, sp&eacute;cifiez l'irq pour le dernier port. N'oubliez pas 
	d'ajouter l'option <emphasis remap="tt"> COM_MULTIPORT </emphasis>.	
      </para>
      <para>L'example suivant correspond &agrave; une carte s&eacute;rie 4ports AST
	sur l'irq 7</para>
      <programlisting>
options "COM_MULTIPORT" 
device sio4 at isa? port 0x2a0 tty flags 0x781 
device sio5 at isa? port 0x2a8 tty flags 0x781 
device sio6 at isa? port 0x2b0 tty flags 0x781 
device sio7 at isa? port 0x2b8 tty flags 0x781 irq 7 vector siointr 
</programlisting>

      <para>Les drapeaux (flags) indiquent que le port maitre &agrave; un
	nombre mineur de 7 (<emphasis remap="tt">0x700</emphasis>),
	que nous d&eacute;sirons afficher les diagnostics (<emphasis
	  remap="tt">0x080</emphasis>) et que tous les ports
	partagent la m&ecirc;me irq (<emphasis
	  remap="tt">0x001</emphasis>).
      </para>

    </sect1>

    <sect1>
      <title>Est-ce que FreeBSD sait g&eacute;rer les cartes s&eacute;ries multiports en partageant les IRQ ?</title>

      <para>Pas pour le moment. Vous devez utiliser une IRQ diff&eacute;rente 
pour chaque carte.</para>
      
    </sect1>

    <sect1>
      <title>Puis-je d&eacute;finir les param&egrave;tres par d&eacute;faut de la liaison s&eacute;rie pour un port?</title>

      <para>Les p&eacute;riph&eacute;riques <emphasis remap="tt"> ttydX </emphasis>
	(ou <emphasis remap="tt">cuaaX</emphasis>) sont des
	p&eacute;riph&eacute;riques normaux que vous pouvez ouvrir dans vos
	applications. Lorsqu'un processus ouvre le p&eacute;riph&eacute;rique, il
	utilise les param&egrave;tres par d&eacute;faut d'entr&eacute;es sorties de
	terminal. Vous pouvez voir ces param&egrave;tres en utilisant la
	commande:
      </para>
      <programlisting>
stty -a -f /dev/ttyd1 
      </programlisting>
      
      <para>Lorsque vous changez les param&egrave;tres du p&eacute;riph&eacute;rique, ces
	param&egrave;tres sont effectifs jusqu'au moment ou vous arreterez de 
	vous servir de ce p&eacute;riph&eacute;rique. S'il est ouvert de nouveau, il 
	reprendra les param&egrave;tres par d&eacute;faut. Pour changer les
	param&egrave;tres par d&eacute;faut , vous devez ouvrir le p&eacute;riph&eacute;rique et
	changer les param&egrave;tres de l'``&eacute;tat initial'' du
	p&eacute;riph&eacute;rique. Par exemple pour d&eacute;finit un mode <emphasis
	  remap="tt">LOCAL</emphasis>,  8bits et un controle de flux
	<emphasis remap="tt"> XON/XOFF </emphasis> par d&eacute;faut sur le
	ttyd5, voud devez :
	</para>
      <programlisting>
stty -f /dev/ttyd5 clocal cs8 ixon ixoff
</programlisting>

      <para>Le mailleur endroit pour effectuer ceci est le fichier de
	d&eacute;marrage <filename>/etc/rc.serial</filename>. Maintenant
	lorsqu'une application ovrira <emphasis remap="tt">
	  ttyd5</emphasis> elle obtiendra les valeurs ci-dessus.
      </para>
      <para>Vous pouvez empecher certaines valeurs d'etre modifi&eacute;es en 
	utilisant le fonction de ``lock'' du p&eacute;riph&eacute;rique. Par exemple 
	pour forcer la vitesse &agrave; 57600bauds sur <emphasis remap="tt">
	  ttyd5 </emphasis>:</para>
      <programlisting>
stty -f /dev/ttyd5 57600
      </programlisting>
      
      <para>Maintenant lorsqu'un programme ouvrira <emphasis
	  remap="tt">ttyd5</emphasis> et tentera de changer la vitesse 
	du port, il obtiendra toujours 57600 bauds.</para>
      <para> Bien sur, vous devez laisser la possibilit&eacute; de changer les 
	&eacute;tats initiaux et de lock que pour l'utilisateur root. Le
	script <ulink
	  url="http://www.freebsd.org/cgi/man.cgi?MAKEDEV"> MAKEDEV
	</ulink>  <emphasis remap="bf"> ne le fait pas </emphasis> par 
	d&eacute;faut lorsqu'il cr&eacute;e les noeuds.</para>
      
    </sect1>

    <sect1>
      <title>Comment mettre en place un login dialup sur mon modem?</title>
      <para>Vous voulez devenir fournisseur d'acc&egrave;s &agrave; l'Internet ?
	Pour commencer vous devez disposer de plus d'un modem pouvant 
	r&eacute;pondre automatiquement. Votre modem doit pouvoir detecter
une &eacute;mission de porteuse lorsque qu'elle se pr&eacute;sente et ne doit pas en 
d&eacute;tecter constemment. Il doit aussi etre capable de racrocher la ligne 
lorsqu'il d&eacute;tecte le passage de 1 &agrave; 0 du signal <emphasis
remap="tt">DTR</emphasis>. Il doit aussi utiliser un controle de flux
de type  <emphasis remap="tt"> RTS/CTS </emphasis> ou aucun controle
de flus. Enfin, il doit etre capable de n&eacute;gocier la vitesse de
transmission entre lui-m&ecirc;me et le modem distant tout en gardant
une vitesse constante vis &agrave; vis de l'ordinateur.</para>

      <para>Pour la plupart des modems comprennant les commande Hayes,
cette commande met en place les bonnes valeurs et les enregistre en
m&eacute;moire morte:</para>
      <programlisting>
AT &amp;C1 &amp;D3 &amp;K3 &amp;Q6 S0=1 &amp;W
</programlisting>

      <para>Voyez la section sur l'envoi direct de commandes AT, pour
savoir comment les mettre en place sans avoir besoin de lancer un
&eacute;mulateur de terminal sous MS-DOS.</para> 

      <para>Ensuite cr&eacute;ez une entr&eacute;e dans <ulink
url="http://www.freebsd.org/cgi/man.cgi?ttys"> /etc/ttys </ulink> pour
 le modem. Ce fichier comporte tous les ports sur lesquels le syst&egrave;me
d'exploitation attend des commandes de login. Ajoutez une ligne
ressemblant &agrave; celle ci:
</para>
      <programlisting>
 ttyd1 "/usr/libexec/getty std.57600" dialup on insecure
</programlisting>

      <para>Cette ligne indique que sur le deuxi&egrave;me port s&eacute;rie
(<emphasis remap="tt">/dev/ttyd1</emphasis>) est attach&eacute; un modem
dialoguant &agrave; 57600 bauds sans parit&eacute; (<emphasis
remap="tt">std.57600</emphasis>) se  trouvant dans le fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?gettytab"> /etc/gettytab
</ulink>). Le type de terminal est ``dialup''. Le port est ``on'' et
``insecure'' -- ce qui veut dire que les logins sous root ne sont pas
autoris&eacute;s sur ce port. Pour utiliser d'autres ports en entr&eacute;e,
utilisez les autres entr&eacute;es <emphasis remap="tt"> ttydX </emphasis>.
</para>
      
      <para>Il est d'usage courant d'utiliser ``dialup'' comme type de
terminal. Beaucoup d'utilisateurs affichent un prompt dans leur
.profile ou .login si le type de terminal est ``dialup''. L'exemple
ci-dessus affecte au port le mode ``insecure''. Pour passer root, vous
 devez donc vous logguer en temps qu'utilisateur ordinaire et utiliser
la commande <ulink url="http://www.freebsd.org/cgi/man.cgi?su"> su
</ulink> pour devenir <emphasis remap="tt">root</emphasis>. Si vous
d&eacute;finissez le port en tant que ``secure'', alors vous pourrez vous
logguer sous <emphasis remap="tt">root </emphasis> directement.</para>

      <para>Apr&egrave;s avoir effectu&eacute; les modifications au fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?ttys"> /etc/ttys </ulink>,
vous devez envoyer un signal <emphasis remap="tt"> HUP </emphasis> au
processus <ulink url="http://www.freebsd.org/cgi/man.cgi?init" > init
</ulink>
</para>

<programlisting>
 kill -HUP 1
</programlisting>

      <para> Cela force le processus init &agrave; relire le fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?ttys"> /etc/ttys</ulink>. Le
processus init d&eacute;marrera donc des processus getty sur tous les ports
marqu&eacute;s comme <quote>on</quote>. Vous pouvez alors v&eacute;rifiez que le login est
possible sur le port en tapant :
</para>
<programlisting>
ps -ax | grep '[t]tyd1'
</programlisting>
      
      <para>Et vous devez voir apparaitre quelque chose comme
ceci:</para>
<programlisting>
747 ??  I      0:00.04 /usr/libexec/getty std.57600 ttyd1
</programlisting>

    </sect1>
     <sect1> 
      <title>Comment connecter un terminal sur mon syst&egrave;me FreeBSD?</title>

      <para>Si vous utilisez un autre ordinateur en tant que terminal, 
vous devez vous procurer un cable null modem pour relier les deux
ports s&eacute;rie. Si vous utilisez un vrai terminal (de type WYSE-50), suivez
les instructions du manuel</para>

      <para>Ensuite, modifez <ulink
url="http://www.freebsd.org/cgi/man.cgi?ttys"> /etc/ttys</ulink> comme 
expliqu&eacute; &agrave; la section pr&eacute;cedente. Par exemple, pour un terminal
WYSE-50 connect&eacute; sur le 5&egrave;me port s&eacute;rie, utilisez une entr&eacute;e
ressemblant &agrave; la suivante:</para>
      
<programlisting>
ttyd4 "/usr/libexec/getty std.38400" wyse50 on secure
</programlisting>

      <para>Cet exemple assume que le port
<filename>/dev/ttyd4</filename> est connect&eacute; sur un terminal wyse50 &agrave;
la vitesse de 38400 bauds sans parit&eacute; (<emphasis
remap="tt">std.38400</emphasis> se trouvant dans le fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?gettytab">/etc/gettytab</ulink>) 
et les logins root sont permis (mot cl&eacute; secure)</para>

    </sect1>
    
    <sect1>
      <title>Pourquoi ne puis-je pas executer <filename>tip</filename> ou <filename>cu</filename>?</title>
      
      <para>Sur votre syst&egrave;me, les programmes <ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink> et <ulink
url="http://www.freebsd.org/cgi/man.cgi?cu">cu</ulink> ne sont
probablement executable que par l'utilisateur <ulink
url="http://www.freebsd.org/cgi/man.cgi?uucp">uucp</ulink> et par le
groupe <filename>dialer</filename>. Le groupe
<filename>dialer</filename> vous permet de controler qui
a acc&egrave;s &agrave; votre modem ainsi qu'aux syst&egrave;mes distants. Ajoutez vous
dans ce groupe pour pouvoir utiliser ces commandes.</para>

      <para>Sinon, vous pouvez autoriser tous les utilisateurs de
votre syst&egrave;me &agrave; utiliser les programmes <filename>tip</filename> et
<filename>cu</filename> en tapant:</para>

<programlisting>
# chmod 4511 /usr/bin/cu
# chmod 4511 /usr/bin/tip
</programlisting>

    </sect1>

    <sect1>
      <title>Mon modem Hayes n'est pas support&eacute;; que dois-je faire ?</title>
      <para>Pour l'instant la page de manuel de <ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink> n'est pas &agrave;
jour. Il existe un support g&eacute;n&eacute;rique des commandes Hayes int&eacute;gr&eacute; dans le
programme. Il suffit de mettre la ligne suivante
<filename>ar=hayes</filename> dans votre fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink></para>

      <para>Le gestionnaire Hayes ne sait pas reconnaitre les
fonctions avanc&eacute;es des nouveaux modems. Des messages comme
<filename>BUSY, NO DIALTONE, CONNECT 115200</filename> ne sont pas
reconnus. Vous devez absolument d&eacute;sactiver ces messages lorsque vous
utilisez <ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink> (en tapant
<filename>ATX0&amp;W</filename>).</para>
      
      <para>De plus le timeout de <filename>tip</filename> est de 60
secondes. Votre modem doit absolument utiliser une valeur plus faible, 
sinon <filename>tip</filename> pensera qu'il y a un probl&egrave;me de
communication. Essayez la commande
<filename>ATS7=45&amp;W</filename></para>

      <para>Le version de <filename>tip</filename> livr&eacute;e ne comporte
pas toutes ces fonctionnalit&eacute;s. La solution est d'&eacute;diter le fichier
<filename>tipconf.h</filename> se trouvant dans le r&eacute;pertoire
<filename>/usr/src/usr.bin/tip/tip</filename>. Bien sur cela n&eacute;cessite 
que vous ayez install&eacute; les sources.</para>
      <para>Remplacez alors la ligne <filename>#define HAYES
0</filename> par <filename>#define HAYES 1</filename>. Puis tapez
<filename>make</filename> et <filename>make install</filename>. Tout
doit marcher correctement apr&egrave;s cela.</para>

    </sect1>
    <sect1>
      <title>Comment faire pour entrer certaines commandes AT ?</title>
      <para>Cr&eacute;ez une entr&eacute;e de type <filename>direct</filename> dans
votre fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink>.
Par exemple, si votre modem est attach&eacute; sur le premier port  s&eacute;rie,
<filename>/dev/cuaa0</filename>, ajoutez la ligne suivante:
</para>
<programlisting>
cuaa0:dv=/dev/cuaa0:br#19200:pa=none
</programlisting>
      
      <para>Utilisez le taux maximum, de transfert de votre modem,
pour la fonctionnalit&eacute;e br. Ensuite tapez <ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip cuaa0</ulink> et vous 
serez alors connect&eacute; sur votre modem.</para>

      <para>S'il n'existe pas de fichier
<filename>/dev/cuaa0</filename> sur votre syst&egrave;me, executez la
commande suivante:</para>

<programlisting>
# cd /dev
# ./MAKEDEV cuaa0
</programlisting>

      <para>Sinon utilisez la commande <filename>cu</filename> sous
root de la fa&ccedil;on suivante.</para>

<programlisting>
# cu -l``port'' -s``vitesse''
</programlisting>

      <para>Avec <quote>port</quote> le nom du port
s&eacute;rie(ex:<filename>/dev/cuaa0</filename>) et <quote>vitesse</quote>(la
vitesse maximum de votre
modem)(ex:<filename>57600</filename>). Lorsque vous avez entrer les
commandes AT apropri&eacute;es, tapez <filename>~.</filename> pour quitter</para>
      
   </sect1>
    <sect1>
      <title>Le symbole <filename>@</filename> pour la fonctionnalit&eacute; pn ne marche pas!</title>

      <para>Le symbole <filename>@</filename> dans le num&eacute;ro de
t&eacute;l&eacute;phone demande &agrave; <filename>tip</filename> de regarder dans le 
fichier <ulink url="http://www.freebsd.org/cgi/man.cgi?phones(5)">
/etc/phones </ulink> pour trouver le num&eacute;ro apropri&eacute;. Mais le symbole
<filename>@</filename> est aussi un caract&egrave;re sp&eacute;cial pour le fichier
<ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink>.
Mettez un backslash devant pour qu'il soit correctement interpr&eacute;t&eacute;.</para>

<programlisting>
pn=\@
</programlisting>
      

    </sect1>

    <sect1>
      <title>Comment composer un num&eacute;ro de t&eacute;l&eacute;phone depuis la ligne de commande?</title>
      
      <para>Mettez une ligne
<quote><filename>generic</filename></quote> dans le fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink>.
Par exemple:</para>

<programlisting>
tip115200|Dial any phone number at 115200 bps:\ 
  :dv=/dev/cuaa0:br#115200:at=hayes:pa=none:du: 
tip57600|Dial any phone number at 57600 bps:\ 
  :dv=/dev/cuaa0:br#57600:at=hayes:pa=none:du:
</programlisting>

      <para>Vous pourrez alors utilisez la commande suivante
<quote><filename>tip -115200 5551234 </filename></quote>. Si vous
pr&eacute;ferez <ulink url="http://www.freebsd.org/cgi/man.cgi?cu">cu</ulink> 
&agrave; <ulink url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink>,
utilisez une ligne g&eacute;n&eacute;rique pour cu:</para>


<programlisting>
cu115200|Use cu to dial any number at 115200bps:\ 
  :dv=/dev/cuaa1:br#57600:at=hayes:pa=none:du: 
</programlisting>

      <para>et utilisez la commande <quote><filename>cu 5551234 -s
115200</filename></quote>.</para>

    </sect1>

    <sect1>
      <title>Dois-je sp&eacute;cifier la vitesse en bauds &agrave; chaque connexion</title>

      <para>Mettez une ligne <filename>tip1200</filename> ou
<filename>cu1200</filename>, mais mettez la vitesse que vous voulez
pour la fonctionnalit&eacute; br.<ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink> pense que la
vitesse par d&eacute;faut est de 1200 bauds, donc il cherche une entr&eacute;e
<quote><filename>tip1200</filename></quote>. Bien sur, vous n'etes pas
obligez d'utiliser cette vitesse.</para>

    </sect1>
    <sect1>
      <title>J'ai acc&egrave;s &agrave; plusieurs machines depuis mon serveur de terminal</title>
      <para>Plutot que d'attendre d'etre connect&eacute; et de taper la
commande <filename>CONNECT &lt;host&gt;</filename> chaque fois,
utilisez la fonctionnalit&eacute; <filename>cm</filename> de tip. Voyez, par
exemple, les entr&egrave;es suivantes du fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink>:</para>
<programlisting>
pain|pain.deep13.com|Forrester's machine:\ 
  :cm=CONNECT pain\n:tc=deep13: 
muffin|muffin.deep13.com|Frank's machine:\ 
  :cm=CONNECT muffin\n:tc=deep13: 
deep13:Gizmonics Institute terminal server:\ 
  :dv=/dev/cua02:br#38400:at=hayes:du:pa=none:pn=5551234: 
</programlisting>

      <para>Cela vous permet de taper directement <filename>tip
pain</filename> ou <filename>tip muffin</filename> pour vous connectez 
sur les machines pain ou muffin, et <filename>tip deep13</filename>
pour acc&eacute;der au serveur de terminaux.</para>

      </sect1>

    <sect1>
      <title>Est-ce que tip peut utiliser plusieurs num&eacute;ros de t&eacute;l&eacute;phones pour se connecter &agrave; un site?</title>

      <para>C'est un probl&egrave;me courant lorsqu'une universit&eacute; a
plusieurs lignes pour les modems et plusieurs milliers d'&eacute;tudiants qui 
les utilisent.</para>
      
      <para>Cr&eacute;ez une ligne pour votre universit&eacute; dans le fichier
<ulink
url="http://www.freebsd.org/cgi/man.cgi?remote">/etc/remote</ulink> 
et utilisez <filename>\@</filename> comme valeur pour la
fonctionnalit&eacute; <filename>pn</filename>.</para>
<programlisting>    
big-university:\ 
  :pn=\@:tc=dialout 
dialout:\ 
  :dv=/dev/cuaa3:br#9600:at=courier:du:pa=none: 
</programlisting>

      <para>Ensuite listez tous les num&eacute;ros de t&eacute;l&eacute;phones de l'universit&eacute;
dans le fichier <ulink
url="http://www.freebsd.org/cgi/man.cgi?phones">/etc/phones</ulink></para>
      
<programlisting>
big-university 5551111
big-university 5551112 
big-university 5551113 
big-university 5551114
</programlisting> 

      <para><ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink> essaiera
alors tous les num&eacute;ros de t&eacute;l&eacute;phones dans l'ordre de la liste puis
s'arretera. Si vous voulez qu'il r&eacute;essaye &agrave; l'infini, lancez
<filename>tip</filename> dans une boucle sans fin</para>
      
    </sect1>
    <sect1>
      <title>Pourquoi dois-je appuyer deux fois sur CTRL+P pour envoyer un CRTL+P?</title>

      <para>CTRL+P est le caract&egrave;re par d&eacute;faut pour <ulink
url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink>, pour lui
dire que le caract&egrave;re suivant est une donn&eacute;e brute. Vous pouvez
changez ce caract&egrave;re en n'importe quel autre en utilisant la s&eacute;quence
d'&eacute;chappement <filename>~s</filename>, qui &eacute;quivaut &agrave; <quote>set a
variable</quote>.</para>

      <para>Tapez
<quote><filename>~sforce=&lt;single-char&gt;</filename></quote> suivit 
d'un saut de ligne. <filename>&lt;single-char&gt;</filename>
correspondant &agrave; un simple caract&egrave;re.Si vous laissez
<filename>&lt;single-char&gt;</filename> vide, alors le caract&egrave;re de
``force'' est le caract&egrave;re nul, que vous pouvez obtenir par CTRL+2 ou
CTRL+SPACE. La meilleur valeur pour ce caract&egrave;re est SHIFT+CTRL+6, que 
je n'ai vu que utilis&eacute; que sur peu de terminaux.</para>

      <para>Vous pouvez affecter la valeur que vous voulez pour ce
caract&egrave;re en le sp&eacute;cifiant dans le fichier
<filename>&dollar;HOME/.tiprc</filename>:</para>

<programlisting>
force=&lt;single-char&gt;
</programlisting>
      
    </sect1>
    
    <sect1>
      <title>Tout d'un coup, tout ce que je tape est en majuscule?</title>

      <para>Vous devez avoir press&eacute; CTRL+A, le caract&egrave;re ``raise'' de
<ulink  url="http://www.freebsd.org/cgi/man.cgi?tip">tip</ulink>,
sp&eacute;cialement concus pour les gens n'ayant pas de caps-lock. Utilisez
comme auparavant, <filename>~s</filename>, et fixez la variable
<quote>raisechar</quote> a une valeur plus raisonnable. En fait, vous
pouvez le mettre &agrave; la meme valeur que le caract&egrave;re de ``force'', si
vous ne d&eacute;sirez jamais utiliser ces fonctionnalit&eacute;s.</para>
      
      <para>Voici un exemple de fichier <filename>.tiprc</filename>
pour les utilisateurs d'Emacs qui utilisent beaucoup CTRL+2 et
CTRL+A:</para>

<programlisting>
force=^^
raisechar=^^
</programlisting>
      
      <para>Le caract&egrave;re <filename>^^</filename> correspond &agrave; SHIFT+CTRL+6.</para>

    </sect1>

    <sect1>
      <title>Comment  effectuer des transferts de fichiers en utilisant <filename>tip</filename>?</title>

      <para>Si vous dialoguez avec un autre syst&egrave;me UNIX, vous pouvez
envoyer et recevoir des fichiers en utilisant la commande
<filename>~p</filename>(put) et <filename>~t</filename>(take). Ces
commandes utilisent les commandes <ulink
url="http://www.freebsd.org/cgi/man.cgi?cat">cat</ulink> et <ulink
url="http://www.freebsd.org/cgi/man.cgi?echo">echo</ulink> sur le
syst&egrave;me distant pour recevoir et envoyer les fichiers. La syntaxe de
ces commandes est:</para>

<programlisting>
~p &lt;fichier-local&gt; [&lt;fichier-distant&gt;]
~t &lt;fichier-distant&gt; [&lt;fichier-local&gt;] 
</programlisting>

      <para>Il n'y a aucun controle d'erreur, donc il vaut mieux
utiliser un autre protocol comme zmodem.</para>

    </sect1>

    <sect1>
      <title>Comment dialoguer en zmodem avec <filename>tip</filename>?</title>

      <para>Il faut, pour commencer, installer un des programmes
zmodem depuis les ports(un de ceux de la cat&eacute;gorie comms <ulink
url="http://www.freebsd.org/cgi/ports.cgi?^lrzsz">lrzsz</ulink> ou
<ulink url="http://www.freebsd.org/cgi/ports.cgi?^rzsz">rzsz</ulink>).
</para>
      
      <para>Pour recevoir un fichier, d&eacute;marrez le programme d'envoi
des donn&eacute;es sur le syst&egrave;me distant. Ensuite pressez entr&eacute;e puis tapez
<quote><filename>~C rz</filename></quote> (ou <quote><filename>~C
lrz</filename></quote> si vous avez install&eacute; lrzsz) pour recevoir le
fichier.</para>
      
      <para>Pour envoyer des fichiers, d&eacute;marrez le programme de
r&eacute;ception sur le syst&egrave;me distant. Ensuite tapez entr&eacute;e et tapez
<quote><filename>~C sz &lt;files&gt;</filename></quote>(ou
<quote><filename>~C lsz &lt;files&gt;</filename></quote>) pour envoyer 
le fichier.</para>
      </sect1>

    <sect1>
      <title> FreeBSD ne trouve pas mes ports s&eacute;ries, m&ecirc;me avec les bonnes valeurs de configuration . </title>
      <para>Certaines cartes m&egrave;res et les cartes comportant des Composants
UART Acer, ne sont pas reconnues correctement  par le programme de
d&eacute;tection de FreeBSD. Un patch est disponible &agrave; <ulink
url="http://www.lemis.com/serial-port-patch.html"> www.lemis.com
</ulink> pour r&eacute;soudre votre probl&egrave;me.</para>
      
    </sect1>   
    
  </chapter>

