<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
         
        $FreeBSD$
        Original revision: 1.9
--> 

<chapter id="troubleshoot">
  <title>R&eacute;solutions des incidents</title>

  <sect1 id ="awre">
    <title>J'ai des secteurs d&eacute;fectueux sur mon disque dur&nbsp;!</title>

    <para>Pour les disques SCSI, le disque devrait &ecirc;tre capable de r&eacute;allouer
      ceux-ci automatiquement. Quoiqu'il en soit, beaucoup de disques sont
      livr&eacute;s avec cette fonctionnalit&eacute; d&eacute;sactiv&eacute;e, pour une raison
      myst&eacute;rieuse...</para>

    <para>Pour l'activer, vous aurez &agrave; &eacute;diter le <foreignphrase>first device
      page mode</foreignphrase>, ce qui peut &ecirc;tre fait sur FreeBSD en tapant
      la commande (sous root)

      <programlisting>
	scsi -f /dev/rsd0c -m 1 -e -P 3
      </programlisting>
    </para>

    <para>et en changeant la valeur de AWRE et ARRE de 0 &agrave; 1&nbsp;:

      <programlisting>
	AWRE (Auto Write Reallocation Enbld):  1
	ARRE (Auto Read Reallocation Enbld):  1
      </programlisting>
    </para>

    <para>Les paragraphes suivants ont &eacute;t&eacute; soumis par
      <ulink url="mailto:tedm@toybox.placo.com">Ted Mittelstaedt</ulink>&nbsp;:
      </para>

    <para>Pour les disques IDE, le moindre secteur d&eacute;fectueux est habituellement
      un signe d'incident potentiel.
      Tous les disques IDE modernes sont livr&eacute;s avec la r&eacute;allocation des
      secteurs d&eacute;fectueux activ&eacute;e.
      Tous les fabriquants de disques durs IDE offrent aujourd'hui des
      garanties &eacute;tendues et remplaceront les disques poss&eacute;dant des secteurs
      d&eacute;fectueux.</para>

    <para>Si vous voulez toutefois essayer de r&eacute;cup&eacute;rer un disque IDE avec des
      secteurs d&eacute;fectueux, vous pouvez essayer de t&eacute;l&eacute;charger le programme de
      diagnostic du fabriquant de disque IDE et de le faire ex&eacute;cuter sur le
      disque. Quelquefois, ces programmes peuvent &ecirc;tre configur&eacute;s pour
      forcer l'&eacute;lectronique du disque &agrave; rebalayer le disque pour les secteurs
      d&eacute;fectueux et leur inhibition.</para>

    <para>Pour les disques ESDI, RLL et MFM, les secteurs d&eacute;fectueux font
      partie de la vie normale du disque et ne sont pas signes d'incidents,
      g&eacute;n&eacute;ralement. Avec un PC, la carte contr&ocirc;leur de disque et le BIOS
      prennent en charge la t&acirc;che d'inhibition des secteurs d&eacute;fectueux.
      C'est bien pour les syst&egrave;mes d'exploitation comme DOS qui
      utilisent le code du BIOS pour acc&eacute;der au disque. Toutefois,
      le driver de disque FreeBSD ne passe pas par le BIOS, aussi
      un m&eacute;canisme, <application>bad144</application>, existe pour remplacer
      cette fonctionnalit&eacute;.
      <application>bad144</application> ne fonctionne qu'avec le driver
      <devicename>wd</devicename>, il ne peut
      <emphasis remap="bf">pas</emphasis> &ecirc;tre utilis&eacute; avec le SCSI.
      <application>bad144</application> fonctionne en entrant tous les
      secteurs d&eacute;fectueux trouv&eacute;s dans un fichier sp&eacute;cial.</para>

    <para>Un inconv&eacute;nient avec <application>bad144</application>&nbsp;-&nbsp;
      le fichier sp&eacute;cial des secteurs d&eacute;fectueux est plac&eacute; sur la derni&egrave;re
      piste du disque.
      Comme ce fichier contient peut-&ecirc;tre une liste de secteurs dont l'un
      serait pr&egrave;s du d&eacute;but du disque, o&ugrave; le fichier noyau
      <filename>/kernel</filename> serait aussi localis&eacute;, il doit donc &ecirc;tre
      acc&eacute;ssible au progamme d'amorce (<foreignphrase>bootstrap</foreignphrase>)
      qui utilise les appels du BIOS pour lire le fichier du noyau.
      Cela signifie qu'un disque g&eacute;r&eacute; avec <application>bad144</application>
      ne peut d&eacute;passer 1024 cylindres, 16 t&ecirc;tes et 63 secteurs.
      Cela place une limite effective de 500Mo sur un disque qui est r&eacute;allou&eacute;
      avec <application>bad144</application>.</para>

    <para>Pour utiliser <application>bad144</application>, positionnez
      simplement le balayage des secteurs d&eacute;fectueux <foreignphrase>Bad
      Block</foreignphrase> &agrave; <foreignphrase>ON</foreignphrase> dans
      le menu <command>fdisk</command> de FreeBSD lors de l'installation
      initiale.
      Cela marche jusqu'&agrave; la version 2.2.7 de FreeBSD.
      Le disque doit avoir moins de 1024 cylindres.
      Il est g&eacute;n&eacute;ralement recommand&eacute; de laisser tourner pr&eacute;alablement le disque
      pendant plus de 4 heures avant cette op&eacute;ration, pour tenir compte de la
      dilatation thermique et des pistes errantes.</para>

    <para>Si le disque a plus de 1024 cylindres (comme un gros disque ESDI),
      le contr&ocirc;leur ESDI utilise un mode de translation sp&eacute;cial pour le
      faire fonctionner sous DOS.
      Le driver <devicename>wd</devicename> comprend ces modes de translation,
      <emphasis remap="bf">si</emphasis> vous entrez la g&eacute;om&eacute;trie "translat&eacute;e"
      avec la commande <command>set geometry</command> dans
      <command>fdisk</command>.
      De plus, vous ne devez <emphasis remap="bf">pas</emphasis> utiliser le
      mode <foreignphrase>dangerously dedicated</foreignphrase> de cr&eacute;ation
      d'une partition FreeBSD, parce qu'il ignore la g&eacute;om&eacute;trie.
      De plus, m&ecirc;me si <command>fdisk</command> va utiliser votre g&eacute;om&eacute;trie
      surcharg&eacute;e, il continue &agrave; conna&icirc;tre la vrai taille du disque
      et va tenter de cr&eacute;er une partition FreeBSD trop grande.
      Si la g&eacute;om&eacute;trie du disque est remplac&eacute;e par la g&eacute;om&eacute;trie
      translat&eacute;e, la partition <emphasis remap="bf">doit</emphasis>
      &ecirc;tre cr&eacute;&eacute;e manuellement avec le nombre de secteurs.</para>

    <para>Un truc rapide &agrave; utiliser est d'initialiser le gros disque
      ESDI avec le contr&ocirc;leur ESDI, le d&eacute;marrer avec un disque DOS
      et le formatter avec une partition DOS.
      Puis, d&eacute;marrez l'installation FreeBSD et dans le menu
      <command>fdisk</command>, lire depuis l'&eacute;cran et &eacute;crire &agrave; c&ocirc;t&eacute; la taille
      et le nombre de secteurs de la partition DOS.
      Puis, r&eacute;initilisez la g&eacute;om&eacute;trie comme celle de DOS en d&eacute;truisant
      la partition DOS et en cr&eacute;ant une partition FreeBSD
      <foreignphrase>cooperative</foreignphrase> avec la taille
      pr&eacute;c&eacute;demment not&eacute;e.
      Puis positionnez la partition pour &ecirc;tre amor&ccedil;able et autorisez
      le balayage des secteurs d&eacute;fectueux.
      Pendant l'installation r&eacute;elle, <command>bad144</command>
      passera en premier, avant la moindre cr&eacute;ation de syst&egrave;mes de
      fichiers (vous pouvez le voir avec un <command>Alt-F2</command>).
      S'il a le moindre probl&egrave;me pour cr&eacute;er le fichier des secteurs
      d&eacute;fectueux, vous avez initialis&eacute; une g&eacute;om&eacute;trie de disque trop
      grande&nbsp;-&nbsp;red&eacute;marrez le syst&egrave;me et recommencez tout
      depuis le d&eacute;but (y compris le repartitionnement et reformattage
      en DOS).</para>

    <para>Si la r&eacute;allocation est autoris&eacute;e et que vous voyez des
      secteurs d&eacute;fectueux, envisagez un remplacement du disque.
      Les secteurs d&eacute;fectueux ne feront que s'aggaver au fil du temps.</para>
  </sect1>

  <sect1>
    <title>FreeBSD ne reconnait pas ma carte EISA SCSI Bustek 742a&nbsp;!</title>

    <para>Cette information est sp&eacute;cifique &agrave; la 742a, mais peut aussi couvrir
      les autres cartes Buslogic (Bustek = Buslogic).</para>

    <para>Il y a 2 ``versions'' g&eacute;n&eacute;rales de la carte 742a.
      Ce sont les r&eacute;visions mat&eacute;rielles A-G et H&nbsp;-&nbsp;et plus. 
      La lettre de r&eacute;vision est plac&eacute;e apr&egrave;s le num&eacute;ro d'assemblage
      sur le bord de la carte.
      La 742a poss&egrave;de 2 puces ROM dessus, l'une est la puce BIOS et l'autre
      est la puce Firmware.
      Si FreeBSD ne fait pas attention &agrave; la version de la puce BIOS que vous
      avez, il le fait par contre pour la version de la puce Firmware.
      Buslogic vous enverra des ROMs de mise &agrave; jour si vous appelez leur support
      technique.
      Les puces BIOS et Firmware sont appari&eacute;es.
      Vous devez avoir la ROM Firmware la plus en cours dans votre carte
      d'adaptatation pour votre r&eacute;vision de mat&eacute;riel.</para>

    <para>Les cartes REV A-G ne peuvent recevoir que les versions de
      BIOS/Firmware 2.41/2.21.  
      Les cartes REV H&nbsp;-&nbsp;et plus peuvent accepter les plus r&eacute;cente
      versions de BIOS/Firmware 4.70/3.37. 
      La diff&eacute;rence entre ces jeux de firmware est que le 3.37 supporte
      l'allocation tournante (<foreignphrase>``round robin''</foreignphrase>).
      </para>

    <para>Les cartes Buslogic ont aussi un num&eacute;ro de s&eacute;rie inscrit. Si vous
      avez une vieille r&eacute;vision de carte, vous pouvez appeler le d&eacute;partement
      Buslogic RMA et leur donner le num&eacute;ro de s&eacute;rie afin d'essayer d'&eacute;changer
      celle-ci contre une r&eacute;vision plus r&eacute;cente.
      Si votre carte n'est pas trop vieille, il l'&eacute;changeront.</para>

    <para>FreeBSD 2.1 ne supporte que les versions firmware 2.21 et plus.
      Si vous avez une version Firmware plus vieille, votre carte ne sera
      pas reconnue comme une carte Buslogic.
      Elle peut malgr&eacute; tout &ecirc;tre reconnue comme une carte Adaptec 1540.
      La vieille carte firmware contient un mode ``&eacute;mulation'' AHA1540.
      Quoiqu'il en soit, ce n'est pas une bonne chose pour une carte EISA.
      </para>

    <para>Si vous avez une vieille r&eacute;vision de carte et que vous obtenez le
      firmware 2.21, vous aurez &agrave; v&eacute;rifier la position du cavalier
      (<foreignphrase>jumper</foreignphrase>) W1 &agrave; B-C&nbsp;; par d&eacute;faut,
      il est positionn&eacute; &agrave; A-B.</para>

    <para>Les cartes EISA 742q n'ont jamais eu le probl&egrave;me ``&gt;16Mo''
      mentionn&eacute; dans la section <ulink url="bigram">sur les machines &gt;16 Mo
      </ulink>.
      Ceci est un probl&egrave;me qui appara&icirc;t avec les cartes SCSI Buslogic
      Vesa-Local.</para>
  </sect1>
  <sect1>
    <title>Mon contr&ocirc;leur SCSI HP Netserver n'est pas d&eacute;tect&eacute;&nbsp;!</title>

    <para>C'est &agrave; la base un probl&egrave;me connu.
      Le contr&ocirc;leur SCSI-EISA int&eacute;gr&eacute; sur la carte m&egrave;re des machines HP
      Netserver occupe le slot EISA num&eacute;ro 11, aussi tous les ``vrais''
      slots EISA se retrouvent devant lui.
      Malheureusement, l'espace d'adressage pour les slots EISA &gt;= 10 se
      retrouve en conflit avec l'espace d'adressage assign&eacute; aux slots PCI, et
      l'auto-configuration de FreeBSD ne peut actuellement pas tr&egrave;s bien g&eacute;rer
      cette situation.</para>

    <para>Donc, pour le moment, le mieux que vous ayez &agrave; faire, est 
      de pr&eacute;tendre qu'il n'y a pas de conflit de plage d'adresse :-),
      en propulsant l'option du noyau <filename>EISA_SLOTS</filename>
      &agrave; la valeur 12.
      Configurez et compilez un noyau comme d&eacute;crit dans 
      <ulink url="&url.handbook;kernelconfig.html">le manuel de r&eacute;f&eacute;rence
      sur la configuration du noyau</ulink>.</para>

    <para>Bien s&ucirc;r, cela se pr&eacute;sente comme le probl&egrave;me bien connu de la poule et
      de l'oeuf lorsque l'on installe sur une telle machine. Afin de pouvoir
      contourner ce probl&egrave;me, un <foreignphrase>hack</foreignphrase> sp&eacute;cial
      est disponible au moment de la configuration utilisateur
      (<foreignphrase>UserConfig</foreignphrase>). Ne pas utiliser
      l'interface ``visual'', mais l'interface en mode texte. Tapez
      simplement&nbsp;:</para>

      <programlisting>
eisa 12
quit
      </programlisting>

    <para>au prompt, et installez le syst&egrave;me comme d'habitude. 
      Quoiqu'il en soit, il est recommand&eacute; de compiler et d'installer
      un noyau adapt&eacute;.</para>

    <para><ulink url="http://www.freebsd.org/cgi/man.cgi?dset">dset</ulink>
      comprend aussi maintenant qu'il faut sauver cette valeur.</para>

    <para>Heureusement, les versions futures auront une solution appropri&eacute;e
      &agrave; ce probl&egrave;me.</para>

    <note>
    <para>Vous ne pouvez pas utiliser un disque *dangereusement d&eacute;di&eacute;*
      (<foreignphrase>dangerously dedicated</foreignphrase>) avec un
      Netserver HP.
      Voir <ulink url="http://www.freebsd.org/cgi/man.cgi?dedicate">cette note
      </ulink> pour plus d'informations.</para></note>
  </sect1>
    <sect1>
      <title> Que se passe-t'il avec le contr&ocirc;leur CMD640 IDE controller?  </title>

      <para>
Il ne marche pas,  Il ne peut pas manipuler des commandes sur 
les deux canaux simultan&eacute;ment.
      </para>

      <para>
Il y a un d&eacute;tour disponible &agrave; pr&eacute;sent, et elle s'active automatiquement 
si votre syst&egrave;me utilise cette puce. Pour plus de d&eacute;tails, r&eacute;f&eacute;rez-vous &agrave;
la page de manuel du driver de dique (man 4 wd).
      </para>

      <para>
Si vous lancez d&eacute;j&agrave; FreeBSD 2.2.1 ou  2.2.2 avec un contr&ocirc;leur 
IDE CMD640 et que vous voulez utiliser le deuxi&egrave;me canal, construisez un
nouveau noyau avec les options <filename>options "CMD640"</filename> activ&eacute;.
Il est mis par d&eacute;faut pour FreeBSD 2.2.5 et plus.
      </para>
    </sect1>

    <sect1>
          <title> Je n'arr&ecirc;te pas de voir ``<filename>ed1: timeout</filename>''.  </title>

      <para>
Cela est g&eacute;n&eacute;ralement caus&eacute; par un conflit d'interruption (par exemple ,
2 cartes utilisant le m&ecirc;me IRQ). FreeBSD avant 2.0.5R &eacute;tait tol&eacute;rant et
fonctionnait m&ecirc;me en cas de conflit d'IRQ. Mais &agrave; partir du 2.0.5R, les
conflits ne sont plus tol&eacute;r&eacute;s.
Booter avec l'option -c et changer l'ed0/de0/... pour se conformer &agrave;
votre carte.
      </para>

      <para>
Si vous utilisez un connecteur BNC sur votre carte r&eacute;seau, vous pouvez
aussi voir des timeouts sur les p&eacute;riph&eacute;riques &agrave; cause de mauvaise
terminaison. Pour le v&eacute;rifier, attachez un terminateur directement au
NIC (sans c&acirc;ble) et regardez si les messages d'erreurs disparaissent.
      </para>

      <para>
Certaines cartes compatibles NE2000 donneront une telle erreur s'il n'y
a pas de liaison sur le port UTP ou si le cable est d&eacute;connect&eacute;.
      </para>
    </sect1>

    <sect1>
        <title> Quand je monte le CD-ROM, j'obtiens ``Incorrect super block''.  </title>

      <para>
Vous devez sp&eacute;cifier &agrave;
<ulink url="http://www.freebsd.org/cgi/man.cgi?mount"> mount </ulink>
le type de p&eacute;riph&eacute;rique que vous voulez monter. Par d&eacute;faut, 
<ulink url="http://www.freebsd.org/cgi/man.cgi?mount"> mount </ulink>
supposera que le syst&egrave;me de fichier est de type
``<filename>ufs</filename>''.
Vous pouvez vouloir monter un syst&egrave;me de fichier CDROM, et vous pouvez le
faire en sp&eacute;cifiant l'option ``<filename>-t cd9660</filename>'' &agrave; 
<ulink url="http://www.freebsd.org/cgi/man.cgi?mount"> mount </ulink>. 
Cela suppose &eacute;videmment que le CDROM contienne un syst&egrave;me de fichier
ISO 9660 , qui est celui qu'ont presque tous les CDROM.
Comme pour  le 1.1R, FreeBSD comprend automatiquement les extensions
Rock Ridge (nom long).
      </para>

      <para>
Par exemple, si vous voulez  monter le lecteur CDROM
``<filename>/dev/cd0c</filename>'', sous le r&eacute;pertoire <filename>/mnt</filename>, 
vous aurez &agrave; ex&eacute;cuter :

        <programlisting>
mount -t cd9660 /dev/cd0c /mnt
        </programlisting>
      </para>

      <para>
Bien noter que le nom du p&eacute;riph&eacute;rique (``<filename>/dev/cd0c</filename>'' 
de cet
exemple peut &ecirc;tre diff&eacute;rent suivant l'interface du CDROM.
Noter que l'option ``<filename>-t cd9660</filename>'' ne fait qu'ex&eacute;cuter la commande
``<filename>mount&lowbar;cd9660</filename>'', c'est ainsi que l'exmple pourrait &ecirc;tre
simplifi&eacute; en :

      <programlisting>
mount_cd9660 /dev/cd0c /mnt
      </programlisting>
      </para>
    </sect1>

    <sect1>
      <title> Quand je monte un CDROM, j'obtiens ``Device not configured''.  </title>

      <para>
Cela veut g&eacute;n&eacute;ralement dire qu'il n'y a pas de CDROM dans le lecteur de
CDROM, ou que le lecteur n'est pas visible du bus. Mettez un disque dans
le lecteur, et/ou v&eacute;rifiez son &eacute;tat ma&icirc;tre/esclave si c'est un IDE
(ATAPI). Cela peut prendre quelques secondes pour le lecteur CDROM pour
s'apercevoir qu'il y a un disque, alors, soyez patient.
      </para>

      <para>
De temps en temps, un lecteur CD-ROM SCSI peut &ecirc;tre manqu&eacute; car il n'a
pas eu assez de temps pour r&eacute;pondre &agrave; la r&eacute;initialisation du bus. Si
vous avez un lecteur CDROM SCSI, essayez d'ajouter la ligne suivante
dans votre fichier de configuration du noyau, et recompilez.
      </para>

      <programlisting>
options "SCSI_DELAY=15"
      </programlisting>
    </sect1>

    <sect1>
      <title> Mon imprimante est extr&ecirc;mement lente, que puis-je faire ?  </title>

      <para>
Si c'est du parall&egrave;le, et que le seul probl&egrave;me est qu'elle est
terriblement lente, essayez de positionner votre port imprimante 
en mode ``poller'':

        <programlisting>
lptcontrol -p
        </programlisting>
      </para>

      <para>
Certaines nouvelles imprimantes HP sont soup&ccedil;onn&eacute;es de ne pas fonctionner
correctement en mode interruption, apparemment, cela est d&ucirc; a certains
probl&egrave;me de timing (mais cela n'est pas encore exactement compris).
      </para>
    </sect1>

    <sect1>
      <title>Mes programmes se tuent souvent avec l'erreur ``Signal 11''.</title>
      <para>
Cela peut-&ecirc;tre caus&eacute; par du mauvais mat&eacute;riel (m&eacute;moire, carte m&egrave;re...).
Essayez de lancer un programme de test de m&eacute;moire sur votre PC. Notez
que m&ecirc;me si chaque programme de test de m&eacute;moire essayeront de vous dire
que tout va bien, il est possible que certaines rares zones de m&eacute;moire
passent tous les tests m&eacute;moires, mais &eacute;chouent pourtant durant certaines
conditions d'op&eacute;ration (comme pendant qu'un bus ma&icirc;trise l'acc&egrave;s direct
&agrave; la m&eacute;moire depuis un contr&ocirc;leur SCSI comme l'Adaptec 1542, quand vous 
chargez la m&eacute;moire en compilant le noyau, ou quand le syst&egrave;me tourne
dans des conditions tr&egrave;s critiques) 
      </para>

      <para>
La FAQ sur SIG11 (list&eacute;e ci-dessous) d&eacute;nonce les m&eacute;moires lentes comme
&eacute;tant le probl&egrave;me le plus courant. Augmentez le nombre d'&eacute;tats d'attente
dans votre configuration du BIOS ou r&eacute;cup&eacute;rez de la m&eacute;moire plus rapide.
      </para>

      <para>
Pour moi, la partie incrimin&eacute;e a &eacute;t&eacute; une mauvaise m&eacute;moire cache, ou un
mauvais contr&ocirc;leur cache. Essayez de d&eacute;sactiver le cache secondaire dans
la setup BIOS, et regardez si cela r&eacute;soud le probl&egrave;me.
      </para>

      <para>Il y a une FAQ plus d&eacute;taill&eacute;e sur 
<ulink url="http://www.bitwizard.nl/sig11/"> la FAQ du probl&egrave;me SIG11 </ulink>
      </para>
    </sect1>

    <sect1>
      <title> Quand je boote, l'&eacute;cran devient noir, et perd sa synchronisation </title>

      <para>
Ceci est un probl&egrave;me connu avec les cartes vid&eacute;o ATI Mach 64.
Le probl&egrave;me est que cette carte utilise l'adresse <filename>2e8</filename>, et que
le quatri&egrave;me port s&eacute;rie aussi. D&ucirc; &agrave; un bug (une fonctionnalit&eacute; ?) dans
le driver
<ulink url="http://www.freebsd.org/cgi/man.cgi?sio"> sio.c </ulink>, 
cela touchera ce port m&ecirc;me si vous n'avez pas ce quatri&egrave;me
port s&eacute;rie, et *m&ecirc;me* si vous d&eacute;sactives sio3 (le quatri&egrave;me 
port) qui utilise normalement cette adresse.
      </para>

      <para>Jusqu'&agrave; ce que ce bug soit fix&eacute;, vous pouvez utiliser cette astuce :

      <itemizedlist>
        <listitem><para>
Entrez <filename>-c</filename> &agrave; l'invite.  
(Cela mettra le noyau en mode configuration).
        </para></listitem>
        <listitem><para>D&eacute;sactivez <filename>sio0</filename>, 
        <filename>sio1</filename>, <filename>sio2</filename> and 
        <filename>sio3</filename> (tous).  
De cette mani&egrave;re, le driver sio ne sera pas activ&eacute;.
et donc plus de probl&egrave;mes.
        </para></listitem>
        <listitem><para>Tapez exit et continuez le rebootage.
        </para></listitem>
      </itemizedlist>
      </para>

      <para>
Si vous voulez pouvoir utiliser les ports s&eacute;ries, vous aurez &agrave; construire
un nouveau noyau avec les modifications suivantes : 

Dans <filename>/usr/src/sys/i386/isa/sio.c</filename> cherchez la seule occurence de
la cha&icirc;ne <filename>0x2e8</filename> et enlevez cette cha&icirc;ne et la virgule
pr&eacute;c&eacute;dente (gardez la virgule de liaison). Puis suivre la proc&eacute;dure
normale de la construction d'un nouveau noyau.
      </para>

      <para>
M&ecirc;me apr&egrave;s avoir appliqu&eacute; toutes ces astuces, vous pouvez trouver que X
Window ne marche pas correctement, Certaines nouvelles cartes vid&eacute;o 
ATI Mach 64 (notamment ATI Mach Xpression) ne marche pas avec la version
actuelle de <filename>XFree86</filename>; l'&eacute;cran devient noir quand vous d&eacute;marrez 
X Window, ou alors il marche avec des probl&egrave;mes &eacute;tranges. Vous pouvez
obtenir la version beta d'un nouveau serveur X qui marche mieux.
Regardez sur
<ulink url="http://www.xfree86.org"> le site XFree86 site </ulink>
et suivez les liens &agrave; la nouvelle beta release. R&eacute;cup&eacute;rez les fichiers
suivants :
      </para>

      <para>
          <filename>
AccelCards, BetaReport, Cards, Devices, FILES, README.ati,
README.FreeBSD, README.Mach64, RELNOTES, VGADriver.Doc,
X312BMa64.tgz
        </filename>
      </para>

      <para>
Remplacez les vieux fichiers avec ceux de la nouvelle version et
v&eacute;rifiez que vous lancez bien :
<ulink url="http://www.freebsd.org/cgi/man.cgi?manpath=xfree86&amp;query=xf86config"> xf86config </ulink>
&agrave; nouveau.
      </para>
    </sect1>

    <sect1>
      <title> J'ai 128 MB de RAM mais le syst&egrave;me n'en voit que 64 MB.  <!-- id="reallybigram">--> </title>

      <para>
D&ucirc;e &agrave; la fa&ccedil;on dont FreeBSD r&eacute;cup&egrave;re la taille de la m&eacute;moire depuis le
BIOS, il ne peut seulement d&eacute;tecter qu'une taille dont la valeur est
cod&eacute;e en kilo-octets par 16 bits (65535 Ko = 64MB) (ou moins... certains
BIOS tronque la taille de la m&eacute;moire &agrave; 16Mo).
Si vous avez plus de 64 Mo, FreeBSD tentera de le d&eacute;tecter, mais il se
peut que cette tentative &eacute;choue.
      </para>

      <para>
Pour contourner ce probl&egrave;me, vous devez utiliser l'option du noyau
donn&eacute;e ci-dessous. Il y a une mani&egrave;re de r&eacute;cup&eacute;rer les informations
compl&egrave;te de la m&eacute;moire depuis le BIOS, mais nous n'avons pas assez de
place sur les blocks de boot pour le faire. Un jour, quand le manque de
place sur les blocs de boots sera r&eacute;solu, nous utiliserons les
fonctions du BIOS &eacute;tendu pour r&eacute;cup&eacute;rer l'information compl&egrave;te sur la
m&eacute;moire... mais pour l'instant, nous utilisons cette option du noyau.

      <filename>
options "MAXMEM=&lt;n>"
      </filename>

O&ugrave; <filename>n</filename> est votre m&eacute;moire en KiloOctet. Pour une machine &agrave;
128Mo, vous pouvez utiliser <filename>131072</filename>.
      </para>
    </sect1>

    <sect1>
      <title> FreeBSD 2.0 panique avec ``kmem_map too small!'' </title>

      <para>
          <filename>Note : </filename>Le message peut aussi &ecirc;tre ``mb_map too small!''
      </para>

      <para>
La panique indique que le syst&egrave;me n'a plus de m&eacute;moire virtuelle pour les
buffers r&eacute;seau (sp&eacute;cialement mbuf clusters). Vous pouvez augmenter 
la quantit&eacute; de m&eacute;moire virtuelle disponible pour les clusters mbuf en
ajoutant :
      </para>

      <para>
      <filename>options "NMBCLUSTERS=&lt;n>"</filename>
      </para>

      <para>
dans votre configuration du kernel, o&ugrave; &lt;n&gt; est un nombre compris
entre 512 et 4096, suivant le nombre de connexions concurrentes TCP que
vous aurez &agrave; supporter. Je vous recommande d'utiliser 2048 - cela devrait
vous d&eacute;barasser compl&egrave;tement de cette panique.
Vous pouvez contr&ocirc;ler le nombre de clusters mbuf allou&eacute;/en cours
d'utilisation sur votre syst&egrave;me, avec
<ulink url="http://www.freebsd.org/cgi/man.cgi?netstat"> netstat -m </ulink>.  
La valeur par d&eacute;faut pour NMBCLUSTERS est 
      <filename>512 + MAXUSERS * 16/</filename>.
      </para>
    </sect1>

    <sect1>
      <title> ``CMAP busy panic'' au moment d'un reboot avec un nouveau noyau.  </title>

      <para>
La logique permettant de d&eacute;tecter un fichier obsol&egrave;te
      <filename>/var/db/kvm_*.db</filename> peut parfois &eacute;chouer et utiliser un fichier non
appropri&eacute; peut alors conduire &agrave; cette panique.
      </para>

      <para>Si cela arrive, rebooter en mode single-user et faites :
      </para>

      <programlisting>
rm /var/db/kvm_*.db
      </programlisting>
    </sect1>

    <sect1>
      <title>ahc0: brkadrint,  Illegal Host Access at seqaddr 0x0</title>
      <para>
C'est un conflit avec l'adaptateur h&ocirc;te Ultrastor SCSI. 
      </para>

      <para>
Durant la proc&eacute;dure de boot, entrez dans le menu de configuration du
noyau et d&eacute;sactivez 
<ulink url="http://www.freebsd.org/cgi/man.cgi?uha(4)"> uha0" </ulink>
qui est &agrave; la cause de ce probl&egrave;me.
      </para>
    </sect1>

    <sect1>
      <title>Sendmail me dit ``mail loops back to myself''</title>
      <para>
Cela est r&eacute;pondu dans la FAQ sendmail de la fa&ccedil;on suivante :
      </para>



      <programlisting>
* Je re&ccedil;ois des messages "Local configuration error" messages, comme:

553 relay.domain.net config error: mail loops back to myself
554 &#60;user&#64;domain.net&#62;... Local configuration error

Comment puis-je r&eacute;soudre ce probl&egrave;me ?

Vous avez demand&eacute; que les mails adress&eacute;s au domaine (par exemple domain.net)
soient dirig&eacute;s vers un h&ocirc;te sp&eacute;cifique (dans ce cas relay.domain.net) en
utilisant un enregistrement MX, mais la machine de relai ne s'est pas reconnu
lui-m&ecirc;me comme domain.net. Ajoutez domain.net &agrave; /etc/sendmail.cw
(si vous utilisez FEATURE(use_cw_file)) ou ajoutez "Cw domain.net" &agrave; 
/etc/sendmail.cf.
      </programlisting>



      <para>
La version actuelle de 
<ulink url="ftp://rtfm.mit.edu/pub/usenet/news.answers/mail/sendmail-faq"> la FAQ sendmail </ulink>
n'est plus maintenue avec la release sendmail.  Mais elle est de toute
fa&ccedil;on post&eacute;e r&eacute;guli&egrave;rement &agrave; :
<ulink url="news:comp.mail.sendmail"> comp.mail.sendmail </ulink>,
<ulink url="news:comp.mail.misc"> comp.mail.misc </ulink>,
<ulink url="news:comp.mail.smail"> comp.mail.smail </ulink>,
<ulink url="news:comp.answers"> comp.answers </ulink>, et
<ulink url="news:news.answers"> news.answers </ulink>.
Vous pouvez aussi en recevoir une copie par courrier &eacute;lectronique, en
envoyant un mail &agrave; :
<ulink url="mailto:mail-server@rtfm.mit.edu"> mail-server@rtfm.mit.edu </ulink>
avec la commande 
with the command "send usenet/news.answers/mail/sendmail-faq" 
comme corps de message.
      </para>
    </sect1>

    <sect1>
      <title> Les applications plein-&eacute;cran sur des machines distantes se comportent &eacute;trangement.  </title>
      <para>
La machine distante peut r&eacute;gler votre type de terminal &agrave; autre chose que
le type de terminal <filename>cons25</filename> utilis&eacute; par la console FreeBSD.
      </para>
      <para>
Il y a un certains nombres de contournement de ce probl&egrave;me :
      </para>
       <itemizedlist>
           <listitem><para>
Apr&egrave;s s'&ecirc;tre loggu&eacute; sur la machine distante, positionnez votre variable
d'environnement TERM &agrave; soit <filename>ansi</filename> soit <filename>sco</filename>.</para></listitem>
    <listitem><para>Utilisez localement un &eacute;mulateur VT100 comme 
<ulink url="http://www.freebsd.org/cgi/ports.cgi?screen">.  screen </ulink>
    <filename>screen</filename> permet la possibilit&eacute; de lancer plusieurs sessions
concurentes depuis un terminal.</para></listitem>
    <listitem><para>Installez l'entr&eacute;e <filename>cons25</filename> du terminal dans la base de donn&eacute;es
sur la machine distante.</para></listitem>
    <listitem><para>
fire up X et login vers la machine distante depuis un 
        <filename>xterm</filename>.
    </para></listitem>
       </itemizedlist>
    </sect1>

  </chapter>

