<!--
     Standard FreeBSD Documentation Project Legal Notice.

     The FreeBSD Documentation Project
     The FreeBSD Brazilian Portuguese Documentation Project

     Original revision: 1.4
     $FreeBSD$
-->

<legalnotice id="legalnotice">
  <para><emphasis>Vers&atilde;o Traduzida para Portugu&ecirc;s do
    Brasil</emphasis></para>

  <para>Esta &eacute; uma tradu&ccedil;&atilde;o n&atilde;o-oficial
    do Aviso Legal Padr&atilde;o do Projeto de Documenta&ccedil;&atilde;o
    do FreeBSD para o Portugu&ecirc;s do Brasil.  Ela n&atilde;o
    foi publicada pelo Projeto de Documenta&ccedil;&atilde;o do FreeBSD,
    e legalmente n&atilde;o representa os termos de
    distribui&ccedil;&atilde;o de documenta&ccedil;&atilde;o que
    utiliza o Aviso Legal Padr&atilde;o do Projeto de
    Documenta&ccedil;&atilde;o do FreeBSD -- somente o texto original
    do Aviso Legal Padr&atilde;o do Projeto de Documenta&ccedil;&atilde;o,
    em ingl&ecirc;s, faz isso.  Logo, a vers&atilde;o traduzida
    n&atilde;o deve ser utilizada como um aviso legal v&aacute;lido.
    Esperamos, contudo, que esta tradu&ccedil;&atilde;o ajude aos
    falantes de Portugu&ecirc;s do Brasil a entender melhor o Aviso
    Legal Padr&atilde;o do Projeto de Documenta&ccedil;&atilde;o
    do FreeBSD.</para>

  <para>SEMPRE verifique a vers&atilde;o em Ingl&ecirc;s mais recente
    do Aviso Legal Padr&atilde;o do Projeto de Documenta&ccedil;&atilde;o
    do FreeBSD na vers&atilde;o em Ingl&ecirc;s do Manual do
    FreeBSD.</para>

  <para>Redistribui&ccedil;&atilde;o e utiliza&ccedil;&atilde;o do
    c&oacute;digo fonte (SGML DocBook) ou formato 'compilado' (SGML,
    HTML, PDF, PostScript, RTF e assim por diante) com ou sem
    modifica&ccedil;&atilde;o, s&atilde;o permitidas contanto que
    as seguintes condi&ccedil;&otilde;es sejam cumpridas:</para>

  <orderedlist>
    <listitem>
      <para>As redistribui&ccedil;&otilde;es do c&oacute;digo fonte
        (SGML DocBook) devem reter o aviso de copyright acima, esta
	lista de condi&ccedil;&otilde;es e a seguinte nota de
	responsabilidade assim como as primeiras linhas deste arquivo
	n&atilde;o modificadas.</para>
    </listitem>

    <listitem>
      <para>As redistribui&ccedil;&otilde;es em forma compilada
        (transformada para outros DTDs, convertida para PDF,
        PostScript, RTF e outros formatos) devem reproduzir o aviso de
        copyright acima, esta lista de condi&ccedil;&otilde;es e a
        seguinte nota de responsabilidade na
        documenta&ccedil;&atilde;o e/ou outros materiais fornecidos
        com a distribui&ccedil;&atilde;o.</para>
    </listitem>
  </orderedlist>

  <important>
    <para>ESTA DOCUMENTA&Ccedil;&Atilde;O &Eacute; FORNECIDA PELO
      PROJETO DE DOCUMENTA&Ccedil;&Atilde;O DO FREEBSD "NO ESTADO" E
      QUAISQUER GARANTIAS EXPL&Iacute;CITAS OU IMPL&Iacute;CITAS,
      INCLUINDO, MAS N&Atilde;O LIMITADAS AS GARANTIAS
      IMPL&Iacute;CITAS DE COMERCIALIZA&Ccedil;&Atilde;O E A DE
      ADEQUA&Ccedil;&Atilde;O PARA UMA FINALIDADE PARTICULAR
      S&Atilde;O DESMENTIDAS.  EM NENHUM EVENTO O PROJETO DE
      DOCUMENTA&Ccedil;&Atilde;O DO FREEBSD PODER&Aacute; SER
      RESPONSABILIZADO POR QUAISQUER DANOS DIRETOS, INDIRETOS,
      INCIDENTAIS, ESPECIAIS, EXEMPLARES, OU CONSEQ&Uuml;ENTES (INCLUINDO,
      MAS N&Atilde;O LIMITADO A, OBTEN&Ccedil;&Atilde;O DE BENS OU
      SERVI&Ccedil;OS SUBSTITUTOS; PERDA DE USO, DE DADOS, OU DE
      LUCROS;  OU A INTERRUP&Ccedil;&Atilde;O DE NEG&Oacute;CIOS) DE
      QUALQUER FORMA CAUSADO E EM QUALQUER TEORIA DE RESPONSABILIDADE,
      SE EM CONTRATO, EM RESPONSABILIDADE ESTRITA, OU PROCESSUAL
      (PASS&Iacute;VEL DE PROCESSO, INCLUINDO NEGLIG&Ecirc;NCIA OU
      N&Atilde;O) LEVANTADA DE QUALQUER FORMA PELO USO DESTA
      DOCUMENTA&Ccedil;&Atilde;O, MESMO QUE AVISADO DA POSSIBILIDADE
      DE TAIS DANOS.</para>
  </important>

  <para><emphasis>English Version</emphasis></para>

  <para>This is an unofficial translation of the Standard FreeBSD
    Documentation Project Legal Notice into Brazilian Portuguese.
    It was not published by The FreeBSD Documentation Project, and
    does not legally state the distribution terms for documentation
    that uses the Standard FreeBSD Documentation Project Legal
    Notice -- only the original English text of the Standard FreeBSD
    Documentation Project Legal Notice does that.  Therefore, the
    translated version should not be used as a valid legal notice.
    However, we hope that this translation will help Brazilian
    Portuguese speakers understand the Standard FreeBSD Documentation
    Project Legal Notice better.</para>

  <para>Make sure to ALWAYS check the latest English version of the Standard
    FreeBSD Documentation Project Legal Notice in the English
    documentation version of the FreeBSD Handbook.</para>
  
  <para>Redistribution and use in source (SGML DocBook) and 'compiled'
    forms (SGML, HTML, PDF, PostScript, RTF and so forth) with or without
    modification, are permitted provided that the following conditions are
    met:</para>

  <orderedlist>
    <listitem>
      <para>Redistributions of source code (SGML DocBook) must retain the
        above copyright notice, this list of conditions and the following
        disclaimer as the first lines of this file unmodified.</para>
    </listitem>

    <listitem>
      <para>Redistributions in compiled form (transformed to other DTDs,
        converted to PDF, PostScript, RTF and other formats) must
        reproduce the above copyright notice, this list of conditions and
        the following disclaimer in the documentation and/or other
        materials provided with the distribution.</para>
    </listitem>
  </orderedlist>

  <important>
    <para>THIS DOCUMENTATION IS PROVIDED BY THE FREEBSD DOCUMENTATION 
      PROJECT "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, 
      BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND 
      FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL 
      THE FREEBSD DOCUMENTATION PROJECT BE LIABLE FOR ANY DIRECT, INDIRECT, 
      INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, 
      BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS 
      OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND 
      ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR 
      TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE 
      USE OF THIS DOCUMENTATION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
      DAMAGE.</para>
  </important>
</legalnotice>

