Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/linux-users/*.po
Languages: de_de, es_es, pt_br

# _
source: translator-credits
de_de: bhd@FreeBSD.org, 2016
es_es: Equipo de traducción de FreeBSD al Español Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Nilton José Rizzo, rizzo@rizzo.eng.br, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: FreeBSD Quickstart Guide for <trademark class="registered">Linux</trademark> Users
de_de: FreeBSD Anleitung für <trademark class="registered">Linux</trademark>-Benutzer
es_es: Guía de inicio rápido en FreeBSD para usuarios de <trademark class="registered">Linux</trademark>
pt_br: Guia rápido de FreeBSD para usuários de <trademark class="registered">Linux</trademark>

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
de_de: FreeBSD ist ein eingetragenes Warenzeichen der FreeBSD Foundation.

source: Linux is a registered trademark of Linus Torvalds.
de_de: Linux ist ein eingetragenes Warenzeichen von Linus Torvalds.

source: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, and Xeon are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries.
de_de: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, und Xeon sind eingetragene Warenzeichen der Intel Corporation oder ihrer Gesellschaften in den Vereinigten Staaten und in anderen Ländern.

source: Red Hat, RPM, are trademarks or registered trademarks of Red Hat, Inc. in the United States and other countries.
de_de: Red Hat, RPM, sind Warenzeichen oder eingetragene Warenzeichen von Red Hat, Inc. in den Vereinigten Staaten und in anderen Ländern.

source: UNIX is a registered trademark of The Open Group in the United States and other countries.
de_de: UNIX ist ein eingetragenes Warenzeichen der The Open Group in den Vereinigten Staaten und in anderen Ländern.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
de_de: Viele Produktbezeichnungen von Herstellern und Verkäufern sind Warenzeichen. Soweit dem FreeBSD Project das Warenzeichen bekannt ist, werden die in diesem Dokument vorkommenden Bezeichnungen mit dem Symbol <quote>™</quote> oder dem Symbol <quote>®</quote> gekennzeichnet.

source: This document is intended to quickly familiarize intermediate to advanced <trademark class="registered">Linux</trademark> users with the basics of FreeBSD.
de_de: Dieses Dokument soll <trademark class="registered">Linux</trademark>-Benutzer mit den Grundlagen von FreeBSD vertraut machen.
es_es: El objetivo de este documento es familiarizar rápidamente a los usuarios intermedios y avanzados de <trademark class="registered">Linux</trademark> con los conceptos básicos de FreeBSD.
pt_br: Este documento tem a intenção de familiarizar rapidamente usuários intermediários ou avançados do <trademark class="registered">Linux</trademark> com o básico do FreeBSD.

source: Introduction
de_de: Übersicht
es_es: Introducción
pt_br: Introdução

source: This document highlights some of the technical differences between FreeBSD and <trademark class="registered">Linux</trademark> so that intermediate to advanced <trademark class="registered">Linux</trademark> users can quickly familiarize themselves with the basics of FreeBSD.
de_de: Dieses Dokument beschreibt einige der technischen Unterschiede zwischen FreeBSD und <trademark class="registered">Linux</trademark>, damit sich <trademark class="registered">Linux</trademark>-Anwender schnell mit den Grundlagen von FreeBSD vertraut machen können.
es_es: Este documento destaca algunas de las diferencias técnicas entre FreeBSD y <trademark class="registered">Linux</trademark> para que los usuarios intermedios y avanzados de <trademark class="registered">Linux</trademark> puedan familiarizarse rápidamente con los conceptos básicos de FreeBSD.
pt_br: Esse documento destaca algumas diferenças técnicas entre o FreeBSD e o <trademark class="registered">Linux</trademark> para que os usuários intermediários ou avançados do <trademark class="registered">Linux</trademark> possam se familiarizar rapidamente com o básico do FreeBSD.

source: This document assumes that FreeBSD is already installed. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html"> Installing FreeBSD</link> chapter of the FreeBSD Handbook for help with the installation process.
de_de: Dieses Dokument geht davon aus, dass FreeBSD bereits installiert ist. Lesen Sie das Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/bsdinstall.html">Installation von FreeBSD</link> des FreeBSD-Handbuch für die Hilfe bei der Installation.
es_es: Este documento asume que FreeBSD ya está instalado. Consulte el capítulo <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/bsdinstall.html">Instalación de FreeBSD</link> del Manual de FreeBSD para obtener ayuda con el proceso de instalación.

source: Default Shell
de_de: Standard-Shell
es_es: Shell por defecto
pt_br: Shell Padrão

source: <trademark class="registered">Linux</trademark> users are often surprised to find that <application>Bash</application> is not the default shell in FreeBSD. In fact, <application>Bash</application> is not included in the default installation. Instead, FreeBSD uses <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> as the default root shell, and the <application>Bourne shell</application>-compatible <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> as the default user shell. <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> is very similar to <application>Bash</application> but with a much smaller feature-set. Generally shell scripts written for <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> will run in <application>Bash</application>, but the reverse is not always true.
de_de: <trademark class="registered">Linux</trademark>-Benutzer sind oft überrascht, dass <application>Bash</application> nicht die Standard-Shell in FreeBSD ist. Genau genommen ist <application>Bash</application> nicht einmal in der Standardinstallation enthalten. FreeBSD benutzt stattdessen <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> als Standard-Shell für root, sowie die <application>Bourne shell</application>-kompatible <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> als Standardshell für Benutzer. <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> ist der <application>Bash</application> sehr ähnlich, besitzt jedoch einen kleineren Funktionsumfang. In der Regel werden Skripte für die <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> auch mit der <application>Bash</application> laufen. Der umgekehrte Fall trifft jedoch meistens nicht zu.
es_es: Los usuarios de <trademark class="registered">Linux</trademark> a menudo se sorprenden al descubrir que <application>Bash</application> no es la shell por defecto en FreeBSD. De hecho, <application>Bash</application> no está incluido en la instalación predeterminada. En su lugar, FreeBSD utiliza <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> como shell predeterminada para el usuario root y <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> como shell compatible con <application>Bourne shell</application> por defecto. <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> es muy similar a <application>Bash</application> pero con un conjunto de características mucho más pequeño. Generalmente, los scripts escritos para <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> se ejecutarán en <application>Bash</application>, pero al contrario no siempre es así.
pt_br: Os usuários do <trademark class="registered">Linux</trademark> são geralmente surpreendidos quando descobrem que o <application>Bash</application> não é o shell padrão do FreeBSD. De fato, o <application>Bash</application> não é incluído na instalação padrão. Ao invés disto, o FreeBSD usa o <citerefentry><refentrytitle>tcsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> como shell padrão para o usuário root, e o <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, um shell compatível com o <application>Bourne shell</application>, como shell padrão para os demais usuários. O <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> é muito similar ao <application>Bash</application> mas com um conjunto de funcionalidades muito menor. Geralmente os scripts shell escritos para o <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> irão ser executados no <application>Bash</application>, mas o contrário não.

source: However, <application>Bash</application> and other shells are available for installation using the FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports.html">Packages and Ports Collection</link>.
de_de: <application>Bash</application> und weitere Shells können unter FreeBSD mit <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports.html">Paketen und der Ports-Sammlung</link> installiert werden.
es_es: Sin embargo, <application>Bash</application> y otras shells están disponibles para la instalación utilizando los <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/ports.html">paquetes de FreeBSD y la Colección de Ports</link>.
pt_br: Entretanto, o <application>Bash</application> e outros shells estão disponíveis para a instalação usando a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports.html">Coleção de Pacotes e a Árvore de Ports</link>.

source: After installing another shell, use <citerefentry><refentrytitle>chsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> to change a user's default shell. It is recommended that the <systemitem class="username">root</systemitem> user's default shell remain unchanged since shells which are not included in the base distribution are installed to <filename>/usr/local/bin</filename>. In the event of a problem, the file system where <filename>/usr/local/bin</filename> is located may not be mounted. In this case, <systemitem class="username">root</systemitem> would not have access to its default shell, preventing <systemitem class="username">root</systemitem> from logging in and fixing the problem.
de_de: Nachdem Sie eine andere Shell installiert haben, benutzen Sie <citerefentry><refentrytitle>chsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> um die Standard-Shell für einen Benutzer zu ändern. Es wird empfohlen, die Standard-Shell des Benutzers <systemitem class="username">root</systemitem> unverändert bleibt, da Shells, welche nicht im Basissystem enthalten sind, in <filename>/usr/local/bin</filename> installiert werden. Im Falle eines Problems ist vielleicht das Dateisystem, auf dem sich <filename>/usr/local/bin</filename> befindet, nicht eingehängt ist. In einem solchen Fall hätte der Benutzer <systemitem class="username">root</systemitem> keinen Zugriff auf die Standard-Shell, was ihn daran hindern würde, sich am System anzumelden und das Problem zu beheben.
es_es: Después de instalar otra shell, use <citerefentry><refentrytitle>chsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> para cambiar la shell predeterminada de un usuario. Se recomienda mantener la shell del usuario <systemitem class="username">root</systemitem>, ya que las shells que no están incluidas en el sistema base se instalan en <filename>/usr/local/bin</filename>. Si hay un problema, el sistema de archivos donde se encuentra <filename>/usr/local/bin</filename> podría no estar montado. En este caso, el usuario <systemitem class="username">root</systemitem> podría no tener acceso a su shell por defecto, impidiendo que el usuario <systemitem class="username">root</systemitem> inicie sesión y solucione el problema.
pt_br: Depois de instalar um novo shell, use o comando <citerefentry><refentrytitle>chsh</refentrytitle><manvolnum>1</manvolnum></citerefentry> para trocar o shell padrão do usuário. É recomendado que o shell padrão do usuário <systemitem class="username">root</systemitem> se mantenha inalterado uma vez que os shells que não fazem parte da base do sistema são instalados em <filename>/usr/local/bin</filename>. No caso de ocorrer algum problema com o sistema de arquivos onde o diretório <filename>/usr/local/bin</filename> está localizado e este não puder ser utilizado, o usuário <systemitem class="username">root</systemitem> poderá não ter acesso ao shell padrão, evitando que o usuário <systemitem class="username">root</systemitem> entre no sistema para corrigir o problema.

source: Packages and Ports: Adding Software in FreeBSD
de_de: Pakete und Ports: Installation von Software in FreeBSD
es_es: Paquetes y Ports: Instalar software en FreeBSD
pt_br: Coleção de Pacotes e Árvore de Ports: Instalando novos programas no FreeBSD

source: FreeBSD provides two methods for installing applications: binary packages and compiled ports. Each method has its own benefits:
de_de: FreeBSD bietet zwei Methoden zur Installation von Anwendungen: Binärpakete und kompilierte Ports. Jede Methode hat ihre eigenen Vorteile:
es_es: FreeBSD proporciona dos métodos para instalar aplicaciones: paquetes binarios y ports compilados. Cada método tiene sus propias ventajas:
pt_br: FreeBSD provê dois métodos para a instalação de novos aplicativos: pacotes binários e através da compilação do código fonte (Árvore de ports). Cada método tem seu benefício:

source: Binary Packages
de_de: Binärpakete
es_es: Paquetes binarios
pt_br: Pacotes Binários

source: Faster installation as compared to compiling large applications.
de_de: Schnellere Installation, insbesondere bei größeren Anwendungen.
es_es: Instalación más rápida comparado con la compilación de aplicaciones de gran tamaño.
pt_br: Instalação rápida quando comparada com a compilação de grandes aplicativos .

source: Does not require an understanding of how to compile software.
de_de: Es wird kein Verständnis darüber benötigt, wie Software kompiliert wird.
es_es: No es necesario saber cómo compilar software.
pt_br: Não há a necessidade de compreender como compilar um software.

source: No need to install a compiler.
de_de: Es muss kein Compiler installiert werden.
es_es: No es necesario instalar un compilador.
pt_br: Não é necessário a instalação de um compilador.

source: Ability to customize installation options.
de_de: Bieten die Möglichkeit, Installationsoptionen anzupassen.
es_es: Posibilidad de personalizar las opciones de instalación.
pt_br: Possibilidade de customizar as opções de instalação

source: Custom patches can be applied.
de_de: Eigene Korrekturen können angewendet werden.
es_es: Se pueden aplicar parches personalizados.
pt_br: Possibilidade de se aplicar patchs customizados

source: package
de_de: Paket
pt_br: Pacotes

source: If an application installation does not require any customization, installing the package is sufficient. Compile the port instead whenever an application requires customization of the default options. If needed, a custom package can be compiled from ports using <command>make</command> <_:buildtarget-1/>.
de_de: Wenn für die Installation der Anwendung keine Änderungen nötig sind, kann auch das Paket installiert werden. Kompilieren Sie den Port, wenn die Anwendung eine Änderung an den voreingestellten Optionen erfordert. In diesem Fall kann ein angepasstes Paket mit <command>make</command> <_:buildtarget-1/> erstellt werden.
es_es: Si la instalación de una aplicación no requiere de ninguna personalización, con la instalación del paquete es suficiente. Compile el port siempre que una aplicación requiera la personalización de las opciones predeterminadas. Si fuera necesario, se puede compilar un paquete personalizado desde los ports usando <command>make</command> <_:buildtarget-1/>.
pt_br: Se a instalação da aplicação não necessitar de opções customizadas, a instalação via pacotes é suficiente. Compile o port sempre que o aplicativo exigir a personalização das opções padrão. Se você necessita de pacotes customizados, você poderá obtê-los através da compilação a partir do ports utilizando o comando <command>make</command> <_:buildtarget-1/>.

source: A complete list of all available ports and packages can be found <link xlink:href="http://www.freebsd.org/ports/master-index.html">here</link>.
de_de: Eine vollständige Liste aller Ports und Pakete finden Sie <link xlink:href="http://www.freebsd.org/ports/master-index.html">hier</link>.

source: Packages
de_de: Pakete
es_es: Paquetes
pt_br: Pacotes

source: Packages are pre-compiled applications, the FreeBSD equivalents of <filename>.deb</filename> files on Debian/Ubuntu based systems and <filename>.rpm</filename> files on Red Hat/Fedora based systems. Packages are installed using <command>pkg</command>. For example, the following command installs <application>Apache 2.4</application>:
de_de: Pakete sind vorkompilierte Anwendungen, sozusagen FreeBSD-Äquivalente von <filename>.deb</filename>-Dateien unter Debian/Ubuntu basierten Systemen und <filename>.rpm</filename>-Dateien von Red Hat/Fedora basierten Systemen. Pakete werden mit <command>pkg</command> installiert. Das folgende Kommando installiert beispielsweise <application>Apache 2.4</application>:
es_es: Los paquetes son aplicaciones precompiladas, el equivalente de FreeBSD a los ficheros <filename>.deb</filename> en los sistemas basados en Debian/Ubuntu y a los ficheros <filename>.rpm</filename> en los sistemas basados en Red Hat/Fedora. Los paquetes se instalan usando <command>pkg</command>. Por ejemplo, el siguiente comando instala <application>Apache 2.4</application>:

source: For more information on packages refer to section 5.4 of the FreeBSD Handbook: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/pkgng-intro.html">Using pkgng for Binary Package Management</link>.
de_de: Weitere Informationen zu Paketen finden Sie im Abschnitt 4.4 des FreeBSD Handbuchs: <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/pkgng-intro.html">Benutzen von pkg zur Verwaltung von Binärpaketen</link>.
es_es: Para obtener más información sobre los paquetes, consulte la sección 5.4 del Manual de FreeBSD: <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/pkgng-intro.html">Uso de pkgng para la administración de paquetes binarios</link>.
pt_br: Para mais informações sobre pacotes, veja a seção 5.4 do Handbook do FreeBSD: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/pkgng-intro.html">Usando pkgng para gerenciar pacotes binários</link>.

source: The FreeBSD Ports Collection is a framework of <filename>Makefiles</filename> and patches specifically customized for installing applications from source on FreeBSD. When installing a port, the system will fetch the source code, apply any required patches, compile the code, and install the application and any required dependencies.
de_de: Die FreeBSD Ports-Sammlung ist ein Gerüst aus <filename>Makefiles</filename> und Korrekturen, um Anwendungen aus dem Quellcode unter FreeBSD zu installieren. Wenn Sie einen Port installieren, wird das System den Quellcode herunterladen, die benötigten Korrekturen anwenden, den Quellcode kompilieren und die Anwendung und die erforderlichen Abhängigkeiten installieren.
es_es: La Colección de Ports de FreeBSD es un framework de <filename>Makefiles</filename> y parches específicamente personalizados para instalar aplicaciones con su código fuente en FreeBSD. Al instalar un port, el sistema buscará el códifo fuente, aplicará los parches necesarios, compilará el código e instalará la aplicación y las dependencias necesarias.

source: The Ports Collection, sometimes referred to as the ports tree, can be installed to <filename>/usr/ports</filename> using <citerefentry><refentrytitle>portsnap</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Detailed instructions for installing the Ports Collection can be found in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">section 5.5</link> of the FreeBSD Handbook.
de_de: Die Ports-Sammlung, oder einfach Ports genannt, kann mit <citerefentry><refentrytitle>portsnap</refentrytitle><manvolnum>8</manvolnum></citerefentry> nach <filename>/usr/ports</filename> installiert werden.
es_es: La Colección de Ports, a veces llamada el árbol de ports, se puede instalar en <filename>/usr/ports</filename> utilizando <citerefentry><refentrytitle>portsnap</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Se pueden encontrar instrucciones detalladas para instalar la Colección de Ports en la <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/ports-using.html">sección 5.5</link> del Manual de FreeBSD.

source: To compile a port, change to the port's directory and start the build process. The following example installs <application>Apache 2.4</application> from the Ports Collection:
de_de: Um einen Port zu kompilieren, wechseln Sie in das Verzeichnis des Ports und starten Sie den Bau-Prozess. Das folgende Beispiel installiert <application>Apache 2.4</application> aus der Ports-Sammlung:
es_es: Para compilar un port, acceda al directorio del port e inicie el proceso de build. El siguiente ejemplo instala <application>Apache 2.4</application> de la colección de ports:
pt_br: Para compilar um port, mude para o diretório do port e inicie o processo de compilação. O exemplo abaixo instala o <application>Apache 2.4</application> através da Coleção de Ports:

source: A benefit of using ports to install software is the ability to customize the installation options. This example specifies that the <application>mod_ldap</application> module should also be installed:
de_de: Ein Vorteil von Ports bei der Installation von Software ist die Möglichkeit, die Installationsoptionen anzupassen. In diesem Beispiel wird spezifiziert, dass zusätzlich das Modul <application>mod_ldap</application> installiert werden soll:
es_es: El beneficio de usar ports para instalar software es la capacidad de personalizar las opciones de instalación. Este ejemplo especifica que el módulo <application>mod_ldap</application> también debe ser instalado:
pt_br: Um dos benefícios de usar a árvore de ports para realizar a instalação de um software é a possibilidade de customizar as opções de instalação. O exemplo a seguir, especifica que o módulo <application>mod_ldap</application> também deve ser instalado:

source: Refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Using the Ports Collection</link> for more information.
de_de: Lesen Sie <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports-using.html">Benutzen der Ports-Sammlung</link> für weitere Informationen.
es_es: Consulte <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/ports-using.html">Usando la Colección de Ports</link> para obtener más información.
pt_br: Veja <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Usando a Coleção de Ports</link> para mais informações.

source: System Startup
de_de: Systemstart
es_es: Inicio del sistema
pt_br: Inicialização do Sistema
