Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/linux-users/*.po
Languages: de_de, es_es, pt_br

source: Many <trademark class="registered">Linux</trademark> distributions use the SysV init system, whereas FreeBSD uses the traditional BSD-style <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Under the BSD-style <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, there are no run-levels and <filename>/etc/inittab</filename> does not exist. Instead, startup is controlled by <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> scripts. At system boot, <filename>/etc/rc</filename> reads <filename>/etc/rc.conf</filename> and <filename>/etc/defaults/rc.conf</filename> to determine which services are to be started. The specified services are then started by running the corresponding service initialization scripts located in <filename>/etc/rc.d/</filename> and <filename>/usr/local/etc/rc.d/</filename>. These scripts are similar to the scripts located in <filename>/etc/init.d/</filename> on <trademark class="registered">Linux</trademark> systems.
de_de: Viele <trademark class="registered">Linux</trademark>-Distributionen verwenden das SysV init System, während FreeBSD das traditionelle BSD-<citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzt. Unter BSD-<citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> gibt es keine Runlevel und <filename>/etc/inittab</filename> existiert auch nicht. Stattdessen wird der Systemstart von <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> Skripten gesteuert. Beim Systemstart liest <filename>/etc/rc</filename> <filename>/etc/rc.conf</filename> und <filename>/etc/rc.conf.local</filename> um herauszufinden welche Dienste gestartet werden müssen. Die jeweiligen Dienste werden dann gestartet, indem die entsprechenden Skripten in <filename>/etc/rc.d/</filename> und <filename>/usr/local/etc/rc.d/</filename> ausgeführt werden. Diese Skripte sind ähnlich wie die Skripte in <filename>/etc/init.d/</filename> unter <trademark class="registered">Linux</trademark>-Systemen.
es_es: Muchas distribuciones de <trademark class="registered">Linux</trademark> usan el sistema de inicio SysV, mientras que FreeBSD usa el tradicional BSD-style <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Con el BSD-style <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, no hay run-levels y <filename>/etc/inittab</filename> no existe. En su lugar, el inicio está controlado por scripts <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>. En el arranque del sistema, <filename>/etc/rc</filename> lee <filename>/etc/rc.conf</filename> y <filename>/etc/defaults/rc.conf</filename> para determinar qué servicios deben iniciarse. Los servicios especificados son iniciados ejecutando su correspondiente script de inicialización del servicio ubicado en <filename>/etc/rc.d/</filename> y <filename>/usr/local/etc/rc.d/</filename>. Estos scripts son similares a los scripts ubicados en <filename>/etc/init.d/</filename> en los sistemas <trademark class="registered">Linux</trademark>.
pt_br: Muitas distribuições <trademark class="registered">Linux</trademark> usam o sistema init do SysV, enquanto o FreeBSD usa o tradicional <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry> estilo BSD. Por utilizar este sistema <citerefentry><refentrytitle>init</refentrytitle><manvolnum>8</manvolnum></citerefentry>, não existe níveis diferenciados de execução e o arquivo <filename>/etc/inittab</filename> não existe. Ao invés disto, a inicialização é controlada por meio de scripts <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Na inicialização do sistema, o <filename>/etc/rc</filename> lê o arquivo <filename>/etc/rc.conf</filename> e o arquivo <filename>/etc/defaults/rc.conf</filename> para determinar quais são os serviços que devem ser inicializados. Os serviços especificados são inicializados pela execução de scripts de inicialização localizados em <filename>/etc/rc.d/</filename> e <filename>/usr/local/etc/rc.d/</filename>. Esses scripts são similares aos contidos no diretório <filename>/etc/init.d/</filename> dos sistemas <trademark class="registered">Linux</trademark>.

source: The scripts found in <filename>/etc/rc.d/</filename> are for applications that are part of the <quote>base</quote> system, such as <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and <citerefentry><refentrytitle>syslog</refentrytitle><manvolnum>3</manvolnum></citerefentry>. The scripts in <filename>/usr/local/etc/rc.d/</filename> are for user-installed applications such as <application>Apache</application> and <application>Squid</application>.
de_de: Die Skripte in <filename>/etc/rc.d/</filename> sind für Anwendungen aus dem <quote>Basissystem</quote>, wie beispielsweise <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, und <citerefentry><refentrytitle>syslog</refentrytitle><manvolnum>3</manvolnum></citerefentry>. Die Skripte in <filename>/usr/local/etc/rc.d/</filename> gehören zu den vom Benutzer installierten Anwendungen, wie zum Beispiel <application>Apache</application> und <application>Squid</application>.
es_es: Los scripts ubicados en <filename>/etc/rc.d/</filename> son para las aplicaciones que forman parte del sistema <quote>base</quote>, como <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, y <citerefentry><refentrytitle>syslog</refentrytitle><manvolnum>3</manvolnum></citerefentry>. Los scripts ubicados en <filename>/usr/local/etc/rc.d/</filename> son para aplicaciones instaladas por el usuario como <application>Apache</application> y <application>Squid</application>.
pt_br: Os scripts encontrados no diretório <filename>/etc/rc.d/</filename> fazem parte das aplicações da <quote>base</quote> do sistema, tais como <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, e <citerefentry><refentrytitle>syslog</refentrytitle><manvolnum>3</manvolnum></citerefentry>. Os scripts encontrados no diterório <filename>/usr/local/etc/rc.d/</filename> correspondem aos aplicativos instalados pelo usuário, como por exemplo: <application>Apache</application> e <application>Squid</application>.

source: Since FreeBSD is developed as a complete operating system, user-installed applications are not considered to be part of the <quote>base</quote> system. User-installed applications are generally installed using <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">Packages or Ports</link>. In order to keep them separate from the base system, user-installed applications are installed under <filename>/usr/local/</filename>. Therefore, user-installed binaries reside in <filename>/usr/local/bin/</filename>, configuration files are in <filename>/usr/local/etc/</filename>, and so on.
de_de: Da FreeBSD als komplettes Betriebssystem entwickelt wird, werden die vom Benutzer installierten Anwendungen nicht als Teil des <quote>Basissystems</quote> angesehen. Diese Anwendungen werden in der Regel als <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/ports-using.html">Pakete oder Ports</link> installiert. Um die Anwendungen vom Basissystem zu separieren, werden diese unterhalb von <filename>/usr/local/</filename> installiert. Die Binärdateien der installierten Anwendungen werden in <filename>/usr/local/bin/</filename> gespeichert, die Konfigurationsdateien in <filename>/usr/local/etc/</filename>, und so weiter.
es_es: Dado que FreeBSD se desarrolla como un sistema operativo completo, las aplicaciones instaladas por el usuario no se consideran parte del sistema <quote>base</quote>. Las aplicaciones instaladas por el usuario generalmente se instalan utilizando <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/ports-using.html">Paquetes o Ports</link>. Para mantenerlas separadas del sistema base, las aplicaciones instaladas por el usuario se instalan en <filename>/usr/local/</filename>. Por lo tanto, los binarios instalados por el usuario están ubicados en <filename>/usr/local/bin/</filename>, los archivos de configuración están en <filename>/usr/local/etc/</filename>, y así sucesivamente.
pt_br: Uma vez que o FreeBSD é desenvolvido como um sistema completo, aplicações instaladas pelos usuários não são consideradas parte do sistema <quote>base</quote>. As aplicações dos usuários são geralmente instaladas por meio <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">dos Pacotes Binários ou da Coleção de Ports</link>. Para mantê-los separados da base do sistema, eles são instalados sob o diretório <filename>/usr/local/</filename>. Portanto, os aplicativos binários instalados pelos usuários localizam-se em <filename>/usr/local/bin/</filename>, e os arquivos de configuração em <filename>/usr/local/etc/</filename>.

source: Services are enabled by adding an entry for the service in <filename>/etc/rc.conf</filename> . The system defaults are found in <filename>/etc/defaults/rc.conf</filename> and these default settings are overridden by settings in <filename>/etc/rc.conf</filename>. Refer to <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> for more information about the available entries. When installing additional applications, review the application's install message to determine how to enable any associated services.
de_de: Dienste werden über einen Eintrag in <filename>/etc/rc.conf</filename> aktiviert. Die Standardeinstellungen des Systems stehen in <filename>/etc/defaults/rc.conf</filename> und werden von den Einstellungen in <filename>/etc/rc.conf</filename> überschrieben. Lesen Sie <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> für weitere Informationen über die verfügbaren Einträge. Wenn Sie zusätzliche Anwendungen installieren, lesen Sie die Nachrichten um zu erfahren, wie Sie alle dazugehörigen Dienste aktivieren.
es_es: Los servicios se habilitan añadiendo una entrada para el servicio en <filename>/etc/rc.conf</filename>. Los valores predeterminados del sistema se encuentran en <filename>/etc/defaults/rc.conf</filename> y las configuraciones por defecto se sobreescriben con <filename>/etc/rc.conf</filename>. Consulte <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para obtener más información sobre las entradas disponibles. Al instalar aplicaciones adicionales, revise el mensaje de instalación para determinar cómo habilitar los servicios asociados.
pt_br: Os serviços são habilitados pela adição de uma entrada no arquivo <filename>/etc/rc.conf</filename> . As configurações padrões são encontradas no arquivo <filename>/etc/defaults/rc.conf</filename> e essas configurações padrões são sobre postas pelas configurações realizadas no arquivo <filename>/etc/rc.conf</filename>. Veja o manual do <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> para maiores informações sobre as entradas disponíveis. Quando você instalar aplicações adicionais, leia as mensagens de instalação da aplicação para determinar como habilitar os serviços associados a essa aplicação.

source: The following entries in <filename>/etc/rc.conf</filename> enable <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, enable <application>Apache 2.4</application>, and specify that <application>Apache</application> should be started with <acronym>SSL</acronym>.
de_de: Die folgenden Einträge in <filename>/etc/rc.conf</filename> aktivieren <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> sowie <application>Apache 2.4</application>, wobei <application>Apache</application> mit <acronym>SSL</acronym>-Unterstützung gestartet werden soll.
es_es: Las siguientes entradas en <filename>/etc/rc.conf</filename> activan <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, activan <application>Apache 2.4</application> y especifican que <application>Apache</application> debe iniciarse con <acronym>SSL</acronym>.
pt_br: As seguintes entradas no arquivo <filename>/etc/rc.conf</filename> habilitam o <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o <application>Apache 2.4</application>, e especifica que o <application>Apache</application> deve ser inicializado com <acronym>SSL</acronym> ativado.

source: Once a service has been enabled in <filename>/etc/rc.conf</filename>, it can be started without rebooting the system:
de_de: Sobald ein Dienst in <filename>/etc/rc.conf</filename> aktiviert ist, kann er ohne einen Neustart des Systems gestartet werden:
es_es: Una vez que un servicio ha sido activado en <filename>/etc/rc.conf</filename>, puede iniciarse sin reiniciar el sistema:
pt_br: Uma vez que o serviço tenha sido habilitado no arquivo <filename>/etc/rc.conf</filename>, ele pode ser inicializado sem a necessidade de uma reinicialização do sistema.

source: If a service has not been enabled, it can be started from the command line using <option>onestart</option>:
de_de: Wenn ein Dienst nicht aktiviert wurde, kann er auf der Kommandozeile mit <option>onestart</option> gestartet werden:
es_es: Si un servicio no ha sido activado, puede iniciarse desde la línea de comandos usando <option>onestart</option>:
pt_br: Se o serviço não tiver sido habilitado, ele poderá ser inicializado a partir da linha de comando usando a opção <option>onestart</option>:

source: Network Configuration
de_de: Netzwerkkonfiguration
es_es: Configuración de la red
pt_br: Configuração de Rede

source: Instead of a generic <emphasis>ethX</emphasis> identifier that <trademark class="registered">Linux</trademark> uses to identify a network interface, FreeBSD uses the driver name followed by a number. The following output from <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> shows two <trademark class="registered">Intel</trademark> Pro 1000 network interfaces (<filename>em0</filename> and <filename>em1</filename>):
de_de: Anstelle einer allgemeinen <emphasis>ethX</emphasis>-Kennzeichnung, die von <trademark class="registered">Linux</trademark> benutzt wird, um Netzwerkschnittstellen zu identifizieren, verwendet FreeBSD den Treibernamen gefolgt von einer Nummer. Die folgende Ausgabe von <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> zeigt zwei <trademark class="registered">Intel</trademark>Pro 1000 Netzwerkschnittstellen (<filename>em0</filename> und <filename>em1</filename>):
es_es: En lugar de un identificador genérico <emphasis>ethX</emphasis> como <trademark class="registered">Linux</trademark> utiliza para identificar una interfaz de red, FreeBSD usa el nombre del controlador seguido de un número. La salida de <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> muestra dos interfaces de red <trademark class="registered">Intel</trademark> Pro 1000 (<filename>em0</filename> y <filename>em1</filename>):

source: An <acronym>IP</acronym> address can be assigned to an interface using <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry>. To remain persistent across reboots, the <acronym>IP</acronym> configuration must be included in <filename>/etc/rc.conf</filename>. The following <filename>/etc/rc.conf</filename> entries specify the hostname, <acronym>IP</acronym> address, and default gateway:
de_de: Mit <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> kann einer Schnittstelle eine <acronym>IP</acronym>-Adresse zugeordnet werden. Damit diese nach einem Neustart erhalten bleibt, muss die <acronym>IP</acronym>-Konfiguration in <filename>/etc/rc.conf</filename> eingetragen werden. Die folgenden Einträge in <filename>/etc/rc.conf</filename> konfigurieren den Rechnernamen, die <acronym>IP</acronym>-Adresse und das Standard-Gateway:
es_es: Una dirección <acronym>IP</acronym> puede ser asignada a una interfaz usando <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Para que permanezca entre reinicios, la configuración <acronym>IP</acronym> debe ser incluida en <filename>/etc/rc.conf</filename>. Las siguientes entradas en <filename>/etc/rc.conf</filename> especifican el hostname, la dirección <acronym>IP</acronym>, y el gateway por defecto:
pt_br: Um endereço <acronym>IP</acronym> pode ser designado à uma interface utilizando o comando <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Para torna-lo definitivo e persistente entre as reinicializações, o endereço <acronym>IP</acronym> deve ser incluído no arquivo <filename>/etc/rc.conf</filename>. A seguinte entrada no arquivo <filename>/etc/rc.conf</filename> especifica o nome da máquina, o endereço <acronym>IP</acronym> e o gateway padrão da rede:

source: Use the following entries to instead configure an interface for <acronym>DHCP</acronym>:
de_de: Benutzen Sie die folgenden Einträge um die Schnittstelle über <acronym>DHCP</acronym> zu konfigurieren:
es_es: En su lugar, utilice las siguientes entradas para configurar una interfaz de red con <acronym>DHCP</acronym>:
pt_br: Use a seguinte entrada para configurar uma interface para obter sua configuração por meio do <acronym>DHCP</acronym>:

source: FreeBSD does not use <trademark class="registered">Linux</trademark> <application>IPTABLES</application> for its firewall. Instead, FreeBSD offers a choice of three kernel level firewalls:
de_de: FreeBSD verwendet nicht <trademark class="registered">Linux</trademark> <application>IPTABLES</application> als Firewall. Stattdessen hat der Benutzer unter FreeBSD die Wahl zwischen drei Firewalls, die auf Kernel-Ebene arbeiten:
es_es: FreeBSD no usa las <application>IPTABLES</application> de <trademark class="registered">Linux</trademark> para su firewall. En su lugar, FreeBSD ofrece tres firewalls a nivel del kernel:
pt_br: O sistema FreeBSD não utiliza o <trademark class="registered">Linux</trademark> <application>IPTABLES</application> como seu firewall, o FreeBSD oferece três tipos de firewall a nível de kernel:

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-pf.html">PF</link>
de_de: <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-pf.html">PF</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/firewalls-pf.html">PF</link>

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipf.html">IPFILTER</link>
de_de: <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-ipf.html">IPFILTER</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/firewalls-ipf.html">IPFILTER</link>

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/firewalls-ipfw.html">IPFW</link>
de_de: <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/firewalls-ipfw.html">IPFW</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/firewalls-ipfw.html">IPFW</link>

source: <application>PF</application> is developed by the OpenBSD project and ported to FreeBSD. <application>PF</application> was created as a replacement for <application>IPFILTER</application> and its syntax is similar to that of <application>IPFILTER</application>. <application>PF</application> can be paired with <citerefentry><refentrytitle>altq</refentrytitle><manvolnum>4</manvolnum></citerefentry> to provide <acronym>QoS</acronym> features.
de_de: <application>PF</application> wurde vom OpenBSD Projekt entwickelt und nach FreeBSD portiert. <application>PF</application> wurde als Ersatz für <application>IPFILTER</application> entwickelt und die Syntax ist der von <application>IPFILTER</application> sehr ähnlich. <application>PF</application> kann zusammen mit <citerefentry><refentrytitle>altq</refentrytitle><manvolnum>4</manvolnum></citerefentry> werden um <acronym>QoS</acronym>-Funktionen bereitzustellen.
es_es: <application>PF</application> está desarrollado por el proyecto OpenBSD y portado a FreeBSD. <application>PF</application> fue creado como un reemplazo para <application>IPFILTER</application> y su sintaxis es similar. <application>PF</application> se puede combinar con <citerefentry><refentrytitle>altq</refentrytitle><manvolnum>4</manvolnum></citerefentry> para proporcionar <acronym>QoS</acronym>.
pt_br: O <application>PF</application> é desenvolvido pelo projeto OpenBSD e portado para o FreeBSD. O <application>PF</application> foi criado para substituir o <application>IPFILTER</application> e sua sintaxe é similar ao <application>IPFILTER</application>. O <application>PF</application> pode ser utilizado em conjunto com <citerefentry><refentrytitle>altq</refentrytitle><manvolnum>4</manvolnum></citerefentry> para prover funcionalidade de <acronym>QoS</acronym>.

source: This sample <application>PF</application> entry allows inbound <application>SSH</application>:
de_de: Dieser beispielhafte <application>PF</application>-Eintrag erlaubt eingehende <application>SSH</application>-Verbindungen:
es_es: Este ejemplo de <application>PF</application> permite la entrada de tráfico <application>SSH</application>:
pt_br: O exemplo abaixo mostra uma regra do <application>PF</application> para permitir conexões de entrada do <application>SSH</application>:

source: <application>IPFILTER</application> is the firewall application developed by Darren Reed. It is not specific to FreeBSD and has been ported to several operating systems including NetBSD, OpenBSD, SunOS, HP/UX, and Solaris.
de_de: <application>IPFILTER</application> ist eine von Darren Reed entwickelte Firewall. Diese Firewall ist nicht FreeBSD-spezifisch und wurde bereits auf andere Betriebssysteme portiert, einschließlich NetBSD, OpenBSD, SunOS, HP/UX, und Solaris.
es_es: <application>IPFILTER</application> es el firewall desarrollado por Darren Reed. No es específico de FreeBSD y se ha portado a varios sistemas operativos, incluidos NetBSD, OpenBSD, SunOS, HP/UX y Solaris.
pt_br: O <application>IPFILTER</application> é uma aplicação de firewall desenvolvida por Darren Reed. Ela não é específica para o FreeBSD e foi portado para diversos sistemas operacionais, incluindo NetBSD, OpenBSD, SunOS, HP/UX, e Solaris.

source: The <application>IPFILTER</application> syntax to allow inbound <application>SSH</application> is:
de_de: Die Syntax für <application>IPFILTER</application> zum Erlauben von eingehenden <application>SSH</application>-Verbindungen lautet:
es_es: La sintaxis de <application>IPFILTER</application> para permitir la entrada de tráfico <application>SSH</application> es:
pt_br: A sintaxe do <application>IPFILTER</application> para permitir conexões de entrada do <application>SSH</application> é:
