Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/linux-users/*.po
Languages: de_de, es_es, pt_br

source: <application>IPFW</application> is the firewall developed and maintained by FreeBSD. It can be paired with <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> to provide traffic shaping capabilities and simulate different types of network connections.
de_de: Die Firewall <application>IPFW</application> wird von FreeBSD entwickelt und betreut. Sie kann zusammen mit <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> eingesetzt werden, um Traffic-Shaping zu realisieren und verschiedene Arten von Netzwerkverbindungen zu simulieren.
es_es: <application>IPFW</application> es el cortafuegos desarrollado y mantenido por FreeBSD. Se puede combinar con <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> para proporcionar traffic shaping y simular diferentes tipos de conexiones.
pt_br: O <application>IPFW</application> é o firewall desenvolvido e mantido pelo FreeBSD. Ele pode ser utilizado em conjunto com o <citerefentry><refentrytitle>dummynet</refentrytitle><manvolnum>4</manvolnum></citerefentry> para prover a funcionalidade de traffic shaping e simular diferentes tipos de conexões de rede.

source: The <application>IPFW</application> syntax to allow inbound <application>SSH</application> would be:
de_de: Die Syntax für <application>IPFW</application> zum Erlauben von eingehenden <application>SSH</application>-Verbindungen ist:
es_es: La sintaxis de <application>IPFW</application> para permitir la entrada de tráfico <application>SSH</application> sería:
pt_br: A sintaxe do <application>IPFW</application> para permitir conexões de entrada do <application>SSH</application> é:

source: Updating FreeBSD
de_de: FreeBSD aktualisieren
es_es: Actualizando FreeBSD
pt_br: Atualizando o FreeBSD

source: There are two methods for updating a FreeBSD system: from source or binary updates.
de_de: Es gibt zwei Methoden um ein FreeBSD-System zu aktualisieren: aus den Quellen oder über binäre Updates.
es_es: Hay dos métodos para actualizar un sistema FreeBSD: desde el código fuente o desde la actualización de los binarios.
pt_br: Existem dois métodos para realizar a atualização em um sistema FreeBSD: a partir do código fonte ou atualização binária.

source: Updating from source is the most involved update method, but offers the greatest amount of flexibility. The process involves synchronizing a local copy of the FreeBSD source code with the FreeBSD <application>Subversion</application> servers. Once the local source code is up-to-date, a new version of the kernel and userland can be compiled.
de_de: Die Aktualisierung aus den Quellen ist etwas komplexer, bietet aber das höchste Maß an Flexibilität. Dieser Prozess beinhaltet die Synchronisation der Quellen über einen <application>Subversion</application>-Server von FreeBSD. Sobald die lokale Kopie aktualisiert wurde, kann eine neue Version des Kernels und des Userlands kompiliert werden.
es_es: Actualizar desde código fuente es el método más complejo pero el que ofrece mayor flexibilidad. El proceso implica la sincronización de una copia local del código fuente de FreeBSD con los servidores <application>Subversion</application> de FreeBSD. Una vez actualizado el código fuente, puede compilar nuevas versiones del kernel y utilidades.
pt_br: Atualizar através do código fonte é a forma mais trabalhosa, mas ela oferece uma grande flexibilidade. O processo envolve a sincronização da cópia local do código fonte do FreeBSD com os servidores de <application>Subversion</application> do FreeBSD. Uma vez que o código fonte local esteja atualizado, uma nova versão do kernel e da userland poderão ser compiladas.

source: Binary updates are similar to using <command>yum</command> or <command>apt-get</command> to update a <trademark class="registered">Linux</trademark> system. In FreeBSD, <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry> can be used fetch new binary updates and install them. These updates can be scheduled using <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
de_de: Binäre Updates funktionieren in etwa so, als wenn Sie ein <trademark class="registered">Linux</trademark>-System mit <command>yum</command> oder <command>apt-get</command> aktualisieren. In FreeBSD können Sie <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry> benutzen, um binäre Updates herunterzuladen und zu installieren. Diese Updates können mit <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> zu festgelegten Zeitpunkten durchgeführt werden.
es_es: Las actualizaciones de los binarios son similares a usar <command>yum</command> o <command>apt-get</command> para actualizar un sistema <trademark class="registered">Linux</trademark>. En FreeBSD, <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry> puede usarse para obtener las nuevas actualizaciones de los binarios e instalarlas. Estas actualizaciones pueden ser programadas usando <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Atualização binária é similar ao uso do comando <command>yum</command> ou <command>apt-get</command> para atualizar um sistema <trademark class="registered">Linux</trademark>. No FreeBSD, o comando <citerefentry><refentrytitle>freebsd-update</refentrytitle><manvolnum>8</manvolnum></citerefentry> pode ser utilizado para buscar uma nova atualização binária e a instalá-la. Estas atualizações podem ser agendada usando o <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: When using <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> to schedule updates, use <command>freebsd-update cron</command> in the <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> to reduce the possibility of a large number of machines all pulling updates at the same time:
de_de: Wenn Sie <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> verwenden um Updates zu planen, benutzen Sie <command>freebsd-update cron</command> in der <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry>, um die Möglichkeit zu verringern, dass alle Maschinen die Updates zur gleichen Zeit laden:
es_es: Cuando use <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> para programar actualizaciones, use <command>freebsd-update cron</command> en <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> para reducir la posibilidad de que una gran cantidad de máquinas se actualicen al mismo tiempo:
pt_br: Quando utilizar o <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry> para agendar as atualizações, use o comando <command>freebsd-update cron</command> no arquivo <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> para reduzir a possibilidade de que um grande número de máquinas busquem a atualização ao mesmo tempo:

source: For more information on source and binary updates, refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading.html">the chapter on updating</link> in the FreeBSD Handbook.
de_de: Weitere Informationen über die Aktualisierung aus den Quellen und Binär-Updates finden Sie im Kapitel <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/updating-upgrading.html">FreeBSD aktualisieren</link> des FreeBSD Handbuchs.
es_es: Para obtener más información de las actualizaciones de código y binarias, consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/updating-upgrading.html">capítulo sobre la actualización</link> en el Manual de FreeBSD.
pt_br: Para maiores informações sobre a atualização por meio do código fonte ou dos updates binários, acesse o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading.html">capítulo sobre atualização</link> do Handbook do FreeBSD .

source: procfs: Gone But Not Forgotten
de_de: procfs: Verschwunden, aber nicht vergessen
es_es: procfs: Desaparecido pero no olvidado
pt_br: procfs: É passado, mas foi não esquecido

source: In some <trademark class="registered">Linux</trademark> distributions, one could look at <filename>/proc/sys/net/ipv4/ip_forward</filename> to determine if <acronym>IP</acronym> forwarding is enabled. In FreeBSD, <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> is instead used to view this and other system settings.
de_de: In einigen <trademark class="registered">Linux</trademark>-Distributionen kann man in <filename>/proc/sys/net/ipv4/ip_forward</filename> feststellen, ob <acronym>IP</acronym>-Weiterleitung aktiviert ist. In FreeBSD wird stattdessen <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> verwendet, um diese und andere Systemeinstellungen anzuzeigen.
es_es: En algunas distribuciones de <trademark class="registered">Linux</trademark>, puede consultar <filename>/proc/sys/net/ipv4/ip_forward</filename> para determinar si <acronym>IP</acronym> forwarding está habilitado. En FreeBSD, <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> se usa para ver esta y otras configuraciones del sistema.
pt_br: Em algumas distribuições do <trademark class="registered">Linux</trademark>, você pode consultar o <filename>/proc/sys/net/ipv4/ip_forward</filename> para verificar se o encaminhamento de <acronym>IP</acronym> está ou não abilitado. No FreeBSD, o comando <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> é utilizado para ver o status desta e também de outras variáveis do sistema.

source: For example, use the following to determine if <acronym>IP</acronym> forwarding is enabled on a FreeBSD system:
de_de: Auf einem FreeBSD-System kann der folgende Befehl benutzt werden, um festzustellen ob <acronym>IP</acronym>-Weiterleitung aktiviert ist:
es_es: Por ejemplo, utilice el siguiente comando para comprobar si <acronym>IP</acronym> forwarding está habilitado en FreeBSD:
pt_br: Por exemplo, use o seguinte comando para determinar se o encaminhamento de <acronym>IP</acronym> está ou não habilitado.

source: Use <option>-a</option> to list all the system settings:
de_de: Benutzen Sie <option>-a</option> um alle Einstellungen des Systems anzuzeigen:
es_es: Use <option>-a</option> para listar todos los ajustes del sistema:
pt_br: Use a opção <option>-a</option> para ver todas as variáveis do sistema:

source: If an application requires procfs, add the following entry to <filename>/etc/fstab</filename>:
de_de: Wenn eine Anwendung procfs benötigt, fügen Sie den folgenden Eintrag in <filename>/etc/fstab</filename> ein:
es_es: Si una aplicación necesita procfs, añada la siguiente línea a <filename>/etc/fstab</filename>:
pt_br: Se alguma aplicação necessitar do procfs, adicione a seguinte entrada no arquivo <filename>/etc/fstab</filename>:

source: Including <option>noauto</option> will prevent <filename>/proc</filename> from being automatically mounted at boot.
de_de: Die Option <option>noauto</option> verhindert, dass <filename>/proc</filename> beim Booten automatisch eingehängt wird.
es_es: Incluir <option>noauto</option> evitará que <filename>/proc</filename> se monte automáticamente en el arranque.
pt_br: Incluindo a opção <option>noauto</option> irá previnir que o <filename>/proc</filename> seja montado automaticamente durante a inicialização do sistema.

source: To mount the file system without rebooting:
de_de: Das Dateisystem kann ohne Neustart eingehängt werden:
es_es: Para montar el sistema de archivos sin reiniciar:
pt_br: Para montar o sistema de arquivos sem reinicializar:

source: Common Commands
de_de: Häufig verwendete Kommandos
es_es: Comandos comunes
pt_br: Comandos Comuns

source: Some common command equivalents are as follows:
de_de: Einige Kommando-Äquivalente sind wie folgt:
es_es: Algunos equivalentes de los comandos comunes son los siguientes:
pt_br: Alguns comandos comuns e equivalentes são os seguintes:

source: <trademark class="registered">Linux</trademark> command (Red Hat/Debian)
de_de: <trademark class="registered">Linux</trademark>-Kommando (Red Hat/Debian)
es_es: Comando <trademark class="registered">Linux</trademark> (Red Hat/Debian)

source: FreeBSD equivalent
de_de: FreeBSD Äquivalent
es_es: Equivalente en FreeBSD
pt_br: Equivalente no FreeBSD

source: Purpose
de_de: Aufgabe
es_es: Objetivo
pt_br: Propósito

source: <command>yum install <replaceable>package</replaceable></command> / <command>apt-get install <replaceable>package</replaceable></command>
de_de: <command>yum install <replaceable>Paket</replaceable></command> / <command>apt-get install <replaceable>Paket</replaceable></command>

source: <command>pkg install <replaceable>package</replaceable></command>
de_de: <command>pkg install <replaceable>Paket</replaceable></command>

source: Install package from remote repository
de_de: Paket aus einem entfernten Repository installieren.
es_es: Instalar el paquete desde el repositorio remoto
pt_br: Instalação de um pacote binário de um repositório remoto

source: <command>rpm -ivh <replaceable>package</replaceable></command> / <command>dpkg -i <replaceable>package</replaceable></command>
de_de: <command>rpm -ivh <replaceable>Paket</replaceable></command> / <command>dpkg -i <replaceable>Paket</replaceable></command>

source: <command>pkg add <replaceable>package</replaceable></command>
de_de: <command>pkg add <replaceable>Paket</replaceable></command>

source: Install local package
de_de: Ein lokales Paket installieren
es_es: Instalar un paquete local
pt_br: Instalação de um pacote local.

source: List installed packages
de_de: Installierte Paket anzeigen
es_es: Listar los paquetes instalados
pt_br: Listar os pacotes instalados (Pacotes binários e através da árvore de ports)

source: List <acronym>PCI</acronym> devices
de_de: <acronym>PCI</acronym>-Geräte anzeigen
es_es: Listar los dispositivos <acronym>PCI</acronym>
pt_br: Lista os dispositivos <acronym>PCI</acronym>

source: List loaded kernel modules
de_de: Geladene Kernelmodule anzeigen
es_es: Listar los módulos cargados en el kernel
pt_br: Lista os módulos do kernel que foram carregados

source: Load/Unload kernel modules
de_de: Kernelmodule laden/entladen
es_es: Cargar/Descargar módulos del kernel
pt_br: Carrega/Descarrega módulos do kernel.

source: Trace system calls
de_de: Systemaufrufe verfolgen
es_es: Rastrear llamadas al sistema
pt_br: Rastreia chamadas do sistema

source: Conclusion
de_de: Fazit
es_es: Conclusión
pt_br: Conclusão

source: This document has provided an overview of FreeBSD. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">FreeBSD Handbook</link> for more in-depth coverage of these topics as well as the many topics not covered by this document.
de_de: Dieses Dokument hat einen Überblick über FreeBSD geboten. Lesen Sie das <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/index.html">FreeBSD Handbuch</link> für eine tiefergehender Abdeckung dieses und weiterer Themen, welche nicht in diesem Dokument behandelt sind.
es_es: Este documento ha proporcionado una visión general de FreeBSD. Consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Manual de FreeBSD</link> para obtener una información más detallada de los temas tratados, así como otros muchos temas que no se han tratado en este documento.

source: A complete list of all available ports and packages can be found <link xlink:href="https://www.freebsd.org/ports/master-index.html">here</link>.
es_es: Una lista completa de todos los ports y paquetes disponibles se puede encontrar <link xlink:href="https://www.freebsd.org/ports/master-index.html">aquí</link>.
pt_br: A lista completa da árvore de ports e dos pacotes pode ser encontrada <link xlink:href="https://www.freebsd.org/ports/master-index.html">aqui</link>.

source: # enable SSHD sshd_enable="YES" # enable Apache with SSL apache24_enable="YES" apache24_flags="-DSSL"
es_es: # activa SSHD sshd_enable="YES" # activa Apache con SSL apache24_enable="YES" apache24_flags="-DSSL"

source: <year>2008</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>2008</year> <holder>Projeto de Documentação do FreeBSD</holder>

source: This document assumes that FreeBSD is already installed. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html"> Installing FreeBSD</link> chapter of the FreeBSD Handbook for help with the installation process.
pt_br: Este documento assume que o FreeBSD já está instalado. Acesse o link do capítulo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/bsdinstall.html"> Instalando o FreeBSD</link> no Handbook do FreeBSD para obter ajuda no processo de instalação.

source: Ports
pt_br: Árvore de Ports

source: Packages are pre-compiled applications, the FreeBSD equivalents of <filename>.deb</filename> files on Debian/Ubuntu based systems and <filename>.rpm</filename> files on Red Hat/Fedora based systems. Packages are installed using <command>pkg</command>. For example, the following command installs <application>Apache 2.4</application>:
pt_br: Pacotes são aplicações pré-compiladas, os equivalentes no FreeBSD aos arquivos <filename>.deb</filename> nos sistemas baseados no Debian/Ubuntu e aos arquivos <filename>.rpm</filename> nos sistemas baseados no Fedora/Red Hat. Pacotes são instalados através do comando <command>pkg</command>. Por exemplo, o comando a seguir instala o <application>Apache 2.4</application>:

source: The FreeBSD Ports Collection is a framework of <filename>Makefile</filename>s and patches specifically customized for installing applications from source on FreeBSD. When installing a port, the system will fetch the source code, apply any required patches, compile the code, and install the application and any required dependencies.
pt_br: A árvore de ports do FreeBSD é um framework de <filename>Makefile</filename>s e patches customizados especificamente para a instalação através do código fonte no FreeBSD. Quando um port é instalado, o sistema irá buscar o código fonte, aplicar qualquer patch que seja necessário, compilar o código, instalar a aplicação e qualquer outra dependência da qual ela necessite.

source: The Ports Collection, sometimes referred to as the ports tree, can be installed to <filename>/usr/ports</filename> using <citerefentry><refentrytitle>portsnap</refentrytitle><manvolnum>8</manvolnum></citerefentry> (if running FreeBSD 11.4 or 12.1) or Subversion (if running FreeBSD-CURRENT). Detailed instructions for installing the Ports Collection can be found in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">section 5.5</link> of the FreeBSD Handbook.
pt_br: A Coleção de Ports, algumas vezes referenciada como a árvore de ports, pode ser instalada em <filename>/usr/ports</filename> usando o comando <citerefentry><refentrytitle>portsnap</refentrytitle><manvolnum>8</manvolnum></citerefentry> (se estiver rodando FreeBSD 11.4 ou 12.1) ou Subversion (se estiver rodando FreeBSD-CURRENT). Instruções detalhadas para instalação da Coleção de Ports podem ser encontradas na <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports-using.html">seção 5.5</link> do Handbook do FreeBSD.

source: Instead of a generic <emphasis>ethX</emphasis> identifier that <trademark class="registered">Linux</trademark> uses to identify a network interface, FreeBSD uses the driver name followed by a number. The following output from <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> shows two <trademark class="registered">Intel</trademark> Pro 1000 network interfaces (<filename>em0</filename> and <filename>em1</filename>):
pt_br: Diferente da identificação genérica <emphasis>ethX</emphasis> usada pelo <trademark class="registered">Linux</trademark> para identificar a interface de rede, o FreeBSD usa o nome do driver seguido por um número. A seguinte saída do comando <citerefentry><refentrytitle>ifconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> mostra duas interfaces de rede <trademark class="registered">Intel</trademark> Pro 1000 (<filename>em0</filename> e <filename>em1</filename>):

source: <trademark class="registered">Linux</trademark> command (Red Hat/Debian)
pt_br: Comandos do <trademark class="registered">Linux</trademark> (Red Hat/Debian)

source: This document has provided an overview of FreeBSD. Refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">FreeBSD Handbook</link> for more in-depth coverage of these topics as well as the many topics not covered by this document.
pt_br: EEste documento forneceu uma visão geral do FreeBSD. Veja o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook do FreeBSD</link> para uma cobertura mais profunda desses tópicos, assim como outros não cobertos por este documento.
