Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/translations/_index.po
Languages: ru

source: FAQ about the translation process in the FreeBSD Documentation Project
ru: Часто задаваемые вопросы о процессе перевода в проекте документации FreeBSD

source: Chapter 8. Translations
ru: Глава 8. Переводы

source: Translations
ru: Переводы

source: This is the FAQ for people translating the FreeBSD documentation (FAQ, Handbook, tutorials, manual pages, and others) to different languages.
ru: Это FAQ для людей, занимающихся переводом документации FreeBSD (FAQ, Руководство, учебные пособия, man-страницы и другие) на различные языки.

source: It is _very_ heavily based on the translation FAQ from the FreeBSD German Documentation Project, originally written by Frank Gründer mailto:elwood@mc5sys.in-berlin.de[elwood@mc5sys.in-berlin.de] and translated back to English by Bernd Warken mailto:bwarken@mayn.de[bwarken@mayn.de].
ru: Он _очень_ сильно основан на FAQ по переводу из Немецкого проекта документации FreeBSD, изначально написанном Франком Грюндером mailto:elwood@mc5sys.in-berlin.de[elwood@mc5sys.in-berlin.de] и переведённом обратно на английский Берндом Варкеном mailto:bwarken@mayn.de[bwarken@mayn.de].

source: What do i18n and l10n mean?
ru: Что означают i18n и l10n?

source: i18n means internationalization and l10n means localization. They are just a convenient shorthand.
ru: i18n означает интернационализацию, а l10n — локализацию. Это просто удобные сокращения.

source: i18n can be read as "i" followed by 18 letters, followed by "n". Similarly, l10n is "l" followed by 10 letters, followed by "n".
ru: i18n можно прочитать как «i», за которым следует 18 букв, а затем «n». Аналогично, l10n — это «l», за которым следует 10 букв, а затем «n».

source: Is there a mailing list for translators?
ru: Существует ли рассылка для переводчиков?

source: Yes. Different translation groups have their own mailing lists. The https://www.freebsd.org/docproj/translations[list of translation projects] has more information about the mailing lists and web sites run by each translation project. In addition there is mailto:freebsd-translators@freebsd.org[freebsd-translators@freebsd.org] for general translation discussion.
ru: Да. Различные группы переводчиков имеют свои собственные списки рассылки. В https://www.freebsd.org/docproj/translations[списке проектов перевода] есть дополнительная информация о списках рассылки и веб-сайтах, которые поддерживаются каждым проектом перевода. Кроме того, существует mailto:freebsd-translators@freebsd.org[freebsd-translators@freebsd.org] для общих обсуждений, связанных с переводом.

source: Are more translators needed?
ru: Нужны дополнительные переводчики?

source: Yes. The more people that work on translation the faster it gets done, and the faster changes to the English documentation are mirrored in the translated documents.
ru: Да. Чем больше людей работает над переводом, тем быстрее он будет завершен, и тем быстрее изменения в англоязычной документации отразятся в переведенных документах.

source: You do not have to be a professional translator to be able to help.
ru: Вам не нужно быть профессиональным переводчиком, чтобы помочь.

source: What languages do I need to know?
ru: Какие языки мне нужно знать?

source: Ideally, you will have a good knowledge of written English, and obviously you will need to be fluent in the language you are translating to.
ru: В идеале вы должны хорошо знать письменный английский и, разумеется, свободно владеть языком, на который переводите.

source: English is not strictly necessary. For example, you could do a Hungarian translation of the FAQ from the Spanish translation.
ru: Английский язык не является строго обязательным. Например, можно сделать венгерский перевод FAQ из испанского перевода.

source: What software do I need to know?
ru: Какой софт нужно знать?

source: It is strongly recommended that you maintain a local copy of the FreeBSD Git repository (at least the documentation part). This can be done by running:
ru: Настоятельно рекомендуется поддерживать локальную копию репозитория FreeBSD Git (по крайней мере, документации). Это можно сделать, выполнив:

source: https://git.FreeBSD.org/[git.FreeBSD.org] is a public `git` server.
ru: https://git.FreeBSD.org/[git.FreeBSD.org] — это публичный `git` сервер.

source: This will require the package:git-lite[] package to be installed.
ru: Для этого потребуется установка пакета package:git-lite[] package.

source: You should be comfortable using git. This will allow you to see what has changed between different versions of the files that make up the documentation.
ru: Вы должны уверенно пользоваться git. Это позволит вам видеть, какие изменения были внесены между разными версиями файлов, из которых состоит документация.

source: For example, to view the differences between revisions `abff932fe8` and `2191c44469` of [.filename]#documentation/content/en/articles/committers-guide/_index.adoc#, run:
ru: Например, чтобы посмотреть различия между ревизиями `abff932fe8` и `2191c44469` файла [.filename]#documentation/content/en/articles/committers-guide/_index.adoc#, выполните:

source: Please see the complete explanation of using Git in FreeBSD in the extref:{handbook}mirrors[FreeBSD Handbook, git].
ru: Пожалуйста, ознакомьтесь с полным объяснением использования Git в FreeBSD в extref:{handbook}mirrors[Руководстве FreeBSD, git].

source: How do I find out who else might be translating to the same language?
ru: Как узнать, кто ещё, может быть, переводит на тот же язык?

source: The https://www.FreeBSD.org/docproj/translations/[Documentation Project translations page] lists the translation efforts that are currently known about. If others are already working on translating documentation to your language, please do not duplicate their efforts. Instead, contact them to see how you can help.
ru: https://www.FreeBSD.org/docproj/translations/[Страница переводов проекта документации] содержит список известных на данный момент переводческих инициатив. Если кто-то уже работает над переводом документации на ваш язык, пожалуйста, не дублируйте их усилия. Вместо этого свяжитесь с ними, чтобы узнать, как вы можете помочь.

source: If no one is listed on that page as translating for your language, then send a message to the {freebsd-doc} in case someone else is thinking of doing a translation, but has not announced it yet.
ru: Если на этой странице не указан переводчик для вашего языка, отправьте сообщение в список рассылки {freebsd-doc}, возможно, кто-то уже планирует сделать перевод, но еще не объявил об этом.

source: No one else is translating to my language. What do I do?
ru: Никто не переводит на мой язык. Что мне делать?

source: Congratulations, you have just started the "FreeBSD _your-language-here_ Documentation Translation Project". Welcome aboard.
ru: Поздравляем, вы только что запустили "Проект перевода документации FreeBSD на ваш язык". Добро пожаловать на борт.

source: First, decide whether or not you have got the time to spare. Since you are the only person working on your language at the moment it is going to be your responsibility to publicize your work and coordinate any volunteers that might want to help you.
ru: Сначала решите, есть ли у вас свободное время. Поскольку сейчас вы единственный, кто работает над вашим языком, вам придется взять на себя ответственность за рекламу своей работы и координацию добровольцев, которые, возможно, захотят вам помочь.

source: Write an email to the Documentation Project mailing list, announcing that you are going to translate the documentation, so the Documentation Project translations page can be maintained.
ru: Напишите письмо в рассылку проекта документации, объявив о том, что вы собираетесь переводить документацию, чтобы страница переводов проекта документации могла быть актуальной.

source: If there is already someone in your country providing FreeBSD mirroring services you should contact them and ask if you can have some webspace for your project, and possibly an email address or mailing list services.
ru: Если в вашей стране уже есть кто-то, предоставляющий услуги зеркалирования FreeBSD, вам следует связаться с ними и спросить, можете ли вы получить место для вашего проекта на их веб-сервере, а также, возможно, электронный адрес или услуги рассылки.

source: Then pick a document and start translating. It is best to start with something fairly small - either the FAQ, or one of the tutorials.
ru: Затем выберите документ и начните перевод. Лучше всего начать с чего-то относительно небольшого — например, с FAQ или одного из руководств.

source: I have translated some documentation, where do I send it?
ru: Я перевел часть документации, куда мне ее отправить?

source: That depends. If you are already working with a translation team (such as the Japanese team, or the German team) then they will have their own procedures for handling submitted documentation, and these will be outlined on their web pages.
ru: Это зависит от обстоятельств. Если вы уже работаете с командой переводчиков (например, с японской или немецкой командой), то у них есть свои процедуры обработки представленной документации, которые описаны на их веб-страницах.

source: If you are the only person working on a particular language (or you are responsible for a translation project and want to submit your changes back to the FreeBSD project) then you should send your translation to the FreeBSD project (see the next question).
ru: Если вы единственный, кто работает над конкретным языком (или вы отвечаете за проект перевода и хотите отправить свои изменения обратно в проект FreeBSD), то вам следует отправить свой перевод в проект FreeBSD (см. следующий вопрос).

source: I am the only person working on translating to this language, how do I submit my translation?
ru: Я единственный, кто работает над переводом на этот язык, как мне отправить свой перевод?

source: First, make sure your translation is organized properly. This means that it should drop into the existing documentation tree and build straight away.
ru: Во-первых, убедитесь, что ваш перевод правильно организован. Это означает, что он должен встраиваться в существующую структуру документации и сразу же собираться.

source: Directories below this are named according to the language code they are written in, as defined in ISO639 ([.filename]#/usr/share/misc/iso639# on a version of FreeBSD newer than 20th January 1999).
ru: Каталоги ниже этого уровня именуются в соответствии с языковыми кодами, на которых они написаны, как определено в ISO639 ([.filename]#/usr/share/misc/iso639# в версии FreeBSD новее 20 января 1999 года).

source: Hugo needs the language codes in lowercase. For example, instead of `pt_BR` Hugo uses `pt-br`.
ru: Hugo требует коды языков в нижнем регистре. Например, вместо `pt_BR` Hugo использует `pt-br`.

source: Currently, the FreeBSD documentation is stored in a top level directory called [.filename]#documentation/#. Directories below this are named according to the language code they are written in, as defined in ISO639 ([.filename]#/usr/share/misc/iso639# on a version of FreeBSD newer than 20th January 1999).
ru: В настоящее время документация FreeBSD хранится в корневом каталоге с названием [.filename]#documentation/#. Каталоги ниже него именуются согласно языковым кодам, на которых они написаны, как определено в ISO639 ([.filename]#/usr/share/misc/iso639# в версии FreeBSD новее 20 января 1999 года).

source: If your language can be encoded in different ways (for example, Chinese) then there should be directories below this, one for each encoding format you have provided.
ru: Если ваш язык может быть закодирован различными способами (например, китайский), то ниже должны находиться каталоги для каждого из предоставленных форматов кодировки.

source: Finally, you should have directories for each document.
ru: Наконец, у вас должны быть каталоги для каждого документа.

source: For example, a hypothetical Swedish translation might look like:
ru: Например, гипотетический перевод на шведский язык может выглядеть так:

source: `sv` is the name of the translation, in [.filename]#lang# form. Note the two Makefiles, which will be used to build the documentation.
ru: `sv` — это название перевода в форме [.filename]#lang#. Обратите внимание на два Makefile, которые будут использоваться для сборки документации.

source: Use git diff command to generate a diff and send it to the link:https://reviews.freebsd.org/[reviews system].
ru: Используйте команду `git diff` для создания diff и отправьте его в систему link:https://reviews.freebsd.org/[рецензирования].

source: You should use Bugzilla to link:https://bugs.freebsd.org/bugzilla/enter_bug.cgi[submit a report] indicating that you have submitted the documentation. It would be very helpful if you could get other people to look over your translation and double check it first, since it is unlikely that the person committing it will be fluent in the language.
ru: Вы должны использовать Bugzilla, чтобы link:https://bugs.freebsd.org/bugzilla/enter_bug.cgi[отправить отчёт], указав, что вы предоставили документацию. Было бы очень полезно, если бы другие люди проверили ваш перевод перед отправкой, так как маловероятно, что человек, который будет его применять, свободно владеет языком.

source: Someone (probably the Documentation Project Manager, currently {doceng}) will then take your translation and confirm that it builds. In particular, the following things will be looked at:
ru: Кто-то (скорее всего, руководитель проекта документации, в настоящее время {doceng}) проверит ваш перевод и убедится, что он собирается. В частности, будут проверены следующие моменты:

source: Does `make` in the [.filename]#root# directory work correctly?
ru: Работает ли `make` в директории [.filename]#root# корректно?

source: If there are any problems then whoever is looking at the submission will get back to you to work them out.
ru: Если возникнут проблемы, тот, кто будет рассматривать вашу заявку, свяжется с вами для их решения.

source: If there are no problems your translation will be committed as soon as possible.
ru: Если проблем не возникнет, ваш перевод будет включён как можно скорее.

source: Can I include language or country specific text in my translation?
ru: Можно ли включать в перевод текст, специфичный для языка или страны?

source: We would prefer that you did not.
ru: Мы бы предпочли, чтобы вы этого не делали.

source: For example, suppose that you are translating the Handbook to Korean, and want to include a section about retailers in Korea in your Handbook.
ru: Например, предположим, что вы переводите Handbook на корейский язык и хотите добавить раздел о розничных продавцах в Корее в ваш Handbook.

source: There is no real reason why that information should not be in the English (or German, or Spanish, or Japanese, or ...) versions as well. It is feasible that an English speaker in Korea might try to pick up a copy of FreeBSD whilst over there. It also helps increase FreeBSD's perceived presence around the globe, which is not a bad thing.
ru: Нет никаких реальных причин, по которым эта информация не должна быть в английской (или немецкой, или испанской, или японской, или...) версиях также. Вполне возможно, что англоговорящий человек в Корее попытается приобрести копию FreeBSD, находясь там. Это также помогает усилить воспринимаемое присутствие FreeBSD по всему миру, что не так уж и плохо.

source: If you have country specific information, please submit it as a change to the English Handbook (using Bugzilla) and then translate the change back to your language in the translated Handbook.
ru: Если у вас есть информация, специфичная для вашей страны, пожалуйста, отправьте её в виде изменения в англоязычное Руководство (через Bugzilla), а затем переведите это изменение обратно на ваш язык в локализованной версии Руководства.

source: Thanks.
ru: Спасибо.

source: Addressing the reader
ru: Обращение к читателю

source: In the English documents, the reader is addressed as "you", there is no formal/informal distinction as there is in some languages.
ru: В английских документах читатель обращается на «you», здесь нет различия между формальным и неформальным обращением, как в некоторых языках.

source: If you are translating to a language which does distinguish, use whichever form is typically used in other technical documentation in your language. If in doubt, use a mildly polite form.
ru: Если вы переводите на язык, где такое различие существует, используйте ту форму, которая обычно применяется в другой технической документации на вашем языке. Если сомневаетесь, используйте умеренно вежливую форму.

source: Do I need to include any additional information in my translations?
ru: Нужно ли включать какую-либо дополнительную информацию в мои переводы?

source: Yes.
ru: Да.

source: The header of the English version of each document will look something like this:
ru: Заголовок английской версии каждого документа будет выглядеть примерно так:

source: The exact boilerplate may change, but it will always include a $FreeBSD$ line and the phrase `The FreeBSD Documentation Project`. Note that the $FreeBSD$ part is expanded automatically by Git, so it should be empty (just `$FreeBSD$`) for new files.
ru: Точный шаблон может меняться, но он всегда будет включать строку `$FreeBSD$` и фразу `The FreeBSD Documentation Project`. Обратите внимание, что часть `$FreeBSD$` автоматически раскрывается Git, поэтому для новых файлов она должна быть пустой (просто `$FreeBSD$`).

source: Your translated documents should include their own FreeBSD line, and change the `FreeBSD Documentation Project` line to `The FreeBSD _language_ Documentation Project`.
ru: Документы, переведённые вами, должны включать собственную строку FreeBSD, а также изменять строку `FreeBSD Documentation Project` на `The FreeBSD_язык_Documentation Project`.

source: In addition, you should add a third line which indicates which revision of the English text this is based on.
ru: В дополнение, вы должны добавить третью строку, указывающую, на какую версию английского текста опирается перевод.

source: So, the Spanish version of this file might start:
ru: Итак, испанская версия этого файла может начинаться с:
