freebsd/freebsd-doc/ja_JP.eucJP/man/man5/acct.5
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)acct.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/acct.5,v 1.7.2.1 2001/03/06 19:08:18 ru Exp %
.\"
.\" $FreeBSD$
.\"
.\" WORD: account	アカウント[acct.5]
.\" WORD: accounting file	アカウンティングファイル[acct.5]
.\" WORD: structure	構造体(C言語の)[C]
.\"
.Dd June 5, 1993
.Dt ACCT 5
.Os
.Sh 名称
.Nm acct
.Nd 実行アカウントファイル
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/acct.h>
.Sh 解説
カーネルは、下記の
.Fa acct
情報構造を、全プロセスに対して管理します。
プロセスが終了すると、アカウンティングが有効になっている場合には、
カーネルは
.Xr acct 2
関数呼び出しを行い、アカウンティングファイルに記録を追加します。
.Bd -literal
/*
 * アカウンティング構造体; これらは、基底値 8 の 3 ビット指数部および
 * 13 ビット小数部の ``浮動小数点数'' である comp_t 型を使用します。
 * 単位は 1/AHZ 秒です。
 */
typedef u_short comp_t;

#define AC_COMM_LEN 16
struct acct {
	char	ac_comm[AC_COMM_LEN];  /* コマンド名 */
	comp_t	ac_utime;	/* ユーザ時間 */
	comp_t	ac_stime;	/* システム時間 */
	comp_t	ac_etime;	/* 経過時間 */
	time_t	ac_btime;	/* 開始時刻 */
	uid_t	ac_uid;		/* ユーザ ID */
	gid_t	ac_gid;		/* グループ ID */
	short	ac_mem;		/* 平均メモリ使用量 */
	comp_t	ac_io;		/* 入出力ブロック数 */
	dev_t	ac_tty;		/* 制御 tty */
#define	AFORK	0x01		/* fork したが exec されていない */
#define	ASU	0x02		/* スーパユーザ権限を使用した */
#define	ACOMPAT	0x04		/* 互換モードを使用した */
#define	ACORE	0x08		/* コアダンプした */
#define	AXSIG	0x10		/* シクナルにより kill された */
	char	ac_flag;	/* アカウンティングフラグ */
};

/*
 * 1/AHZ の粒度で、データは comp_t フィールドにエンコードされます。
 * 必ずしも周波数と同一となるとは限りません。
 */
#define	AHZ	64
.Ed
.Pp
終了したプロセスが
.Xr execve 2
により生成されたものだった場合、
実行されたファイルのファイル名 (最大 10 文字まで) が
.Fa ac_comm
フィールドに保存され、その状態は
.Fa ac_flag
の次のフラグの 1 つ以上を設定することにより保存されます:
.Dv AFORK ,
.Dv ASU ,
.Dv ACOMPAT ,
.Dv ACORE ,
.Dv ASIG
。
.Sh 関連項目
.Xr acct 2 ,
.Xr execve 2 ,
.Xr sa 8
.Sh 歴史
.Nm
ファイルフォーマットは
.At v7
から登場しました。
