freebsd/freebsd-doc/ja_JP.eucJP/man/man5/aliases.5
.\" Copyright (c) 1998-2000 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1983, 1997 Eric P. Allman.  All rights reserved.
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"     $Id: aliases.5,v 1.12 2003-04-13 21:18:23 horikawa Exp $
.\"
.\" WORD: alias	(名)別名(sendmail),エイリアス(csh)(動)エイリアスする(sendmail)[aliases.5,csh.1]
.\"
.\" $FreeBSD$
.TH ALIASES 5 "$Date: 2003-04-13 21:18:23 $"
.SH 名称
aliases
\- sendmail のためのエイリアスファイル
.SH 書式
.B aliases
.SH 解説
このファイルには、
sendmail
が使用する、ユーザ
ID
の別名を記述します。
このファイルは
/etc/mail
に置かれる、下記の形式の一連の行です。
.IP
name: addr_1, addr_2, addr_3, . . .
.PP
.I name
はエイリアスする名前、
.I addr_n
はその名前の別名です。
.I addr_n
は、別の別名、ローカルユーザ名、ローカルファイル名、コマンド、
インクルードファイル、外部アドレスのいずれかです。
.TP
.B ローカルユーザ名
username
.IP
username は、getpwnam(3) で使用可能であることが必要です。
.TP
.B ローカルファイル名
/path/name
.IP
フルパス名 (スラッシュ (/) で開始) で指定されたファイルに、
メッセージが追加されます。
.TP
.B コマンド
|command
.IP
コマンドはパイプシンボル (|) で開始し、メッセージを標準入力から受け取ります。
.TP
.B インクルードファイル
:include: /path/name
.IP
パス名にあるエイリアスが、
.I name
のエイリアスに追加されます。
.TP
.B E-Mail アドレス
user@domain
.IP
RFC 822 書式の e-mail アドレス。
.PP
空白ではじまる行は継続行です。
行を続ける別の方法として、改行の前にバックスラッシュを置く方法があります。
#
ではじまる行はコメントです。
.PP
エイリアスはローカル名でのみ適用されます。
ループは起りえません。
なぜなら、メッセージは同じ人に複数回送られないからです。
.PP
エイリアス適用後、ローカルかつ有効な受信者で
``.forward''
ファイルをホームディレクトリに持つ人のメッセージは、
このファイルに定義された一連のユーザに転送されます。
.PP
これは単なる生のデータファイルです;
実際のエイリアス情報は
newaliases(1)
プログラムを使用することにより、バイナリ形式でファイル
/etc/mail/aliases.db
に置かれます。aliases ファイルを更新したときには、その内容を反映させるために、
newaliases
コマンドを実行する必要があります。
.SH 関連項目
newaliases(1),
dbm(3),
dbopen(3),
sendmail(8)
.PP
.I
SENDMAIL Installation and Operation Guide.
.PP
.I
SENDMAIL An Internetwork Mail Router
.SH バグ
sendmail
を NEWDB サポート付きではなく DBM サポート付きでコンパイルした時には、
エイリアス 1 つがおよそ 1000 バイトまでの情報に限るという
dbm(3)
の制約が問題となるかもしれません。
このような場合に長いエイリアスを使用するためには ``連鎖'' を使用します;
これは別名の最後の名前をダミーの名前にし、
これを引続き別の別名として使用するというものです。
.SH 歴史
.B aliases
ファイルフォーマットは
4.0BSD
に登場しました。
