freebsd/freebsd-doc/ja_JP.eucJP/man/man5/auth.conf.5
.\" Copyright (c) 1998 Jordan Hubbard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, is permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice immediately at the beginning of the file, without modification,
.\"    this list of conditions, and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" %FreeBSD: src/lib/libutil/auth.conf.5,v 1.6 2002/04/16 10:15:51 ceri Exp %
.\"
.\" $FreeBSD$
.\"
.Dd October 7, 1998
.Dt AUTH.CONF 5
.Os
.Sh 名称
.Nm auth.conf
.Nd 認証ケーパビリティデータベース
.Sh 書式
.Pa /etc/auth.conf
.Sh 解説
.Nm
は、認証コード (現在のところもっとも有名なものとして
.Xr kerberos 5
があります) にとって重要な属性をいろいろ含んでいます。
この文書は
.Pa /etc/auth.conf
とともに今後、更新されてゆくことでしょう。なにせ、今できたばかりで、
進化中ですから。
.Sh 関連項目
.Xr auth_getval 3 ,
.Xr crypt 3
