freebsd/freebsd-doc/ja_JP.eucJP/man/man5/bootparams.5
.\"
.\" Copyright (c) 1994 Gordon W. Ross
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: Id: bootparams.5,v 1.2 1994/10/03 19:26:13 gwr Exp
.\" %FreeBSD: src/usr.sbin/bootparamd/bootparamd/bootparams.5,v 1.9.2.2 2001/01/24 12:24:28 ru Exp %
.\" jpman %Id: bootparams.5,v 1.3 1998/04/29 11:35:09 kuma Stab %
.\"
.Dd October 2, 1994
.Dt BOOTPARAMS 5
.Os
.Sh 名称
.Nm bootparams
.Nd ブートパラメータデータベース
.Sh 書式
.Nm /etc/bootparams
.Sh 解説
.Nm
ファイルは、
.Xr diskless 8
クライアントがネットワーク越しにブートする時に要求する、
ブートパラメータを指定します。
このサーバがサポートする各クライアントは、
.Nm
ファイル中に、
.Dq root
のパス名と (オプションで)
.Dq swap
領域のパス名を含むエントリを持つ必要があります。
.Pp
ファイル中の各行 (
.Ql #
から初まるコメント行以外) は、
クライアント名、
それに続いてクライアントの論理名にて要求するパス名から成ります。
行内部の要素は空白もしくはタブで区切られ、
バックスラッシュを使用すれば複数行を続けて使用することができます。
.Pp
例を以下に示します:
.Bd -literal -offset indent
dummy	root=host:/export/dummy/root \\
	swap=host:/export/dummy/swap \\
	dump=host:/export/dummy/swap
.Ed
.Pp
名前が
.Dq dummy
のクライアントが、自らの論理
.Dq root
のパス名を要求した時、
この
.Tn RPC
リクエストに対してパス名
.Dq Pa host:/export/dummy/root
が返答として与えられます。
.Dq host:
部分は必ず指定する必要があります。
.Sh 関連ファイル
.Bl -tag -width /etc/bootparams -compact
.It Pa /etc/bootparams
デフォルトの構成ファイル
.El
.Sh 関連項目
.Xr bootparamd 8 ,
.Xr diskless 8
