freebsd/freebsd-doc/ja_JP.eucJP/man/man5/devfs.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: devfs.5,v 1.2.2.2 1998/07/19 06:52:11 jkh Exp %
.\"
.\" jpman $Id: devfs.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.\"
.\" WORD: mount point	マウントポイント
.\" WORD: namespace	名前空間
.\"
.Dd December 14, 1996
.Dt devfs 5
.Os FreeBSD 2.2
.Sh 名称
.Nm devfs
.Nd デバイスファイルシステム
.Sh 書式
devfs	/devs	devfs rw 0 0
.Sh 解説
デバイスファイルシステム、または
.Nm devfs
は、グローバルファイルシステム名前空間において、
カーネルのデバイス名前空間へのアクセスを提供します。
伝統的なマウントポイントは
.Pa /devs
です。
.Pp
このファイルシステムは、ディレクトリ、リンク、シンボリックリンク、
デバイスを含みます。
それらの中には書き込み可能なものがあります。
chroot した環境では、
.Nm
を使用して新しい
.Pa /devs
マウントポイントを作成可能です。
.Sh 関連ファイル
.Bl -tag -width /devs/XXXX -compact
.It Pa /devs
通常の
.Nm 
マウントポイント
.El
.Sh 関連項目
.Xr mount_devfs 8
.Sh 歴史
.Nm 
ファイルシステムは、最初に
.Fx 2.0
に登場しました。
.Nm
マニュアルページは、最初に
.Fx 2.2
に登場しました。
.Sh 作者
.Nm
マニュアルページは、
.Xr mount_devfs 8
マニュアルページを元に、
.An Mike Pritchard Aq mpp@FreeBSD.org
が記述しました。
