freebsd/freebsd-doc/ja_JP.eucJP/man/man5/devfs.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/devfs.5,v 1.13 2002/12/12 17:25:57 ru Exp %
.\"
.\" $FreeBSD$
.\"
.\" WORD: provides access to		〜にアクセスするために用意されている
.\"
.Dd December 14, 1996
.Dt DEVFS 5
.Os
.Sh 名称
.Nm devfs
.Nd デバイスファイルシステム
.Sh 書式
devfs	/dev	devfs rw 0 0
.Sh 解説
デバイスファイルシステム
.Nm
は、
グローバルファイルシステムの名前空間の中から
カーネルデバイスの名前空間にアクセスするために用意されています。
慣習的なマウントポイントは
.Pa /dev
です。
.Pp
このファイルシステムには、ディレクトリ、リンク、シンボリックリンク、
デバイスが含まれており、書き込み可能なものもあります。
chroot された環境では、
.Nm
を使用して、新しく
.Pa /dev
マウントポイントを作成することが出来ます。
.Sh 関連ファイル
.Bl -tag -width /dev/XXXX -compact
.It Pa /dev
通常の
.Nm
のマウントポイント
.El
.Sh 関連項目
.Xr mount_devfs 8
.Sh 歴史
.Nm
ファイルシステムは
.Fx 2.0
に初めて登場しました。
.Nm
のマニュアルは
.Fx 2.2
に初めて登場しました。
.Sh 作者
.Nm
のマニュアルは、
.An Mike Pritchard Aq mpp@FreeBSD.org
によって、
.Xr mount_devfs 8
のマニュアルを基に書かれました。
