freebsd/freebsd-doc/ja_JP.eucJP/man/man5/dhcp-options.5
.\"	dhcp-options.5
.\"
.\" Copyright (c) 1995, 1996, 1997, 1998 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.\"
.\" Original Revision: 1.2
.\" jpman %Id: dhcp-options.5,v 1.4 1999/05/09 07:10:44 horikawa Stab %
.\" WORD: Dynamic Host Configuration Protocol	動的ホスト設定プロトコル
.\" WORD: Path MTU Discovery	パス MTU 発見
.\" WORD: Router Discovery	ルータ発見 [routed.8]
.\" WORD: Mask Discovery	マスク発見
.TH dhcpd-options 5
.SH 名称
dhcp-options - 動的ホスト構成プロトコルのオプション
.SH 解説
動的ホスト設定プロトコル (DHCP: Dynamic Host Configuration Protocol)
を使用することにより、クライアントは DHCP サーバから、
ネットワーク設定やネットワーク上で利用可能な様々なサービスについて記述している
.B オプション
を受け取ることができます。
.B dhcpd(8)
や
.B dhclient(8)
を設定するときに、オプションを宣言することが多いでしょう。
オプションを宣言する文法、
そして宣言可能なオプションの名前と書式を、ここに文書化しています。
.SH リファレンス: オプション文
.PP
常に DHCP \fIoption\fR 文は、
キーワード \fIoption\fR で開始し、単一のオプション名が続き、
オプションデータが続きます。
オプションの名前とデータの書式は後述します。
全 DHCP オプションを網羅的に指定する必要はありません。
クライアントに必要なオプションのみを指定する必要があります。
.PP
オプションデータには、次のように様々な書式があります:
.PP
.B ip-address
データタイプは、明示的な IP アドレス (例えば 239.254.197.10) または
ドメイン名 (例えば haagen.isc.org) のいずれかで指定可能です。
ドメイン名で指定する場合、
そのドメイン名を解決すると単一の IP アドレスになるようにしてください。
.PP
.B int32
データタイプは符号付き 32 ビット整数を指定します。
.B uint32
データタイプは符号無し 32 ビット整数を指定します。
.B int16
および
.B uint16
のデータタイプは、符号付きおよび符号無しの 16 ビット整数を指定します。
.B int8
および
.B uint8
のデータタイプは、符号付きおよび符号無しの 8 ビット整数を指定します。
符号無し 8 ビット整数は、オクテットと呼ばれることもあります。
.PP
.B string
データタイプは NVT ASCII 文字列を指定します。
文字列はダブルクォートで括る必要があります。
例えば domain-name オプションを指定する文法は
.nf
.sp 1
	option domain-name "isc.org";
.fi
となります。
.PP
.B flag
データタイプはブール値を指定します。
ブール値は真または偽のいずれかです
(オンまたはオフの方が分かりやすければ、こちらでもかまいません)。
.PP
.B data-string
データタイプは、ダブルクォートで括られる NVT ASCII 文字列か、
コロン区切りで 16 進数で指定されるオクテットの連続のいずれかを指定します。
例えば次のようになります:
.nf
.sp 1
	option dhcp-client-identifier "CLIENT-FOO";
または
	option dhcp-client-identifier 43:4c:49:45:54:2d:46:4f:4f;
.fi
.PP
次に示す様々なオプションに関する記述は、
DHCP オプションに関する最新の IETF ドラフト文書のものです。
名前が掲載されていないオプションは、
option-\fInnn\fR という名前で定義されているかもしれません。
\fInnn\fR はオプションコードの 10 進数表記です。
.\" \fInnn\fI は \fInnn\fR でしょう (horikawa@jp.freebsd.org 19990404)
これらのオプションには、
クォートで括った文字列か、
2 桁の 16 進数をコロンで区切ったオクテットの連続を、続けられます。
例えば次のようになります:
.PP
.nf
	option option-133 "my-option-133-text";
	option option-129 1:54:c9:2b:47;
.fi
.PP
dhcpd は、これらの未定義オプションコードの書式を知りませんので、
指定されたデータの正当性を保証するための確認は行いません。
.PP
標準オプションを示します:
.PP
.B option subnet-mask \fIip-address\fR\fB;\fR
.RS 0.25i
.PP
サブネットマスクオプションは、
RFC 950 に従って、クライアントのサブネットマスクを指定します。
スコープ中のどこにもサブネットマスクを指定しないと、
最終手段として、
アドレスを割り当てようとしているネットワークに対するサブネット宣言から、
dhcpd はサブネットマスクを使用します。これに対し、
アドレスを割り当てようとしているネットワークのスコープ中の
サブネットマスク宣言であれば
.I どのようなものであっても
、サブネット宣言におけるサブネットマスク指定に優先します。
.RE
.PP
.B option time-offset \fIint32\fR\fB;\fR
.RS 0.25i
.PP
time-offset オプションは、
協定世界時 (UTC) を基点として、
クライアントのサブネットのオフセットを秒で指定します。
.RE
.PP
.B option routers \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
routers オプションは、
クライアントのサブネット上にあるルータの IP アドレスのリストを指定します。
ルータは、優先されるものから順にリストしてください。
.RE
.PP
.B option time-servers \fIip-address\fR [, \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
time-server オプションは、
クライアントが利用可能な RFC 868 時刻サーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBien116-name-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
];
.RS 0.25i
.PP
ien116-name-servers オプションは、
クライアントが利用可能な IEN 116 ネームサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBdomain-name-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
domain-name-servers は、クライアントが利用可能な
ドメインネームシステム (STD 13, RFC 1035) ネームサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBlog-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
log-server オプションは、
クライアントが利用可能な MIT-LCS UDP ログサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBcookie-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
クッキーサーバオプションは、
クライアントが利用可能な RFC 865 クッキーサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBlpr-servers\fR \fIip-address \fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
LPR サーバオプションは、
クライアントが利用可能な RFC 1179 ラインプリンタサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBimpress-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
impress-server オプションは、
クライアントが利用可能な Imagen Impress サーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBresource-location-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な
RFC 887 リソースロケーションサーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBhost-name\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、クライアントの名前を指定します。
この名前は、
ローカルのドメイン名に適合してもしなくてもかまいせん
(domain-name オプションを使用してドメイン名を指定する方が良いです)。
文字集合の制約については RFC 1035 を参照してください。
クライアントマシンのホスト名が設定されていない場合 (すなわち
.B rc.conf(5)
で空文字列に設定されている場合)、
.B dhclient-script(8)
のみが本オプションを尊重します。
.RE
.PP
.B option \fBboot-size\fR \fIuint16\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアント用のデフォルトのブートイメージの長さを、
512 オクテットブロック数で指定します。
.RE
.PP
.B option \fBmerit-dump\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントがクラッシュするときに
クライアントのコアイメージがダンプされるファイルのパス名を指定します。
パスの書式は、NVT ASCII 文字集合の文字からなる文字列です。
.RE
.PP
.B option \fBdomain-name\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
ドメインネームシステムを使用してホスト名を解決するときに
クライアントが使用すべきドメイン名を指定します。
.RE
.PP
.B option \fBswap-server\fR \fIip-address\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、クライアントのスワップサーバの IP アドレスを指定します。
.RE
.PP
.B option \fBroot-path\fR \fIstring\fB;\fR\fR
.RS 0.25i
.PP
本オプションは、クライアントのルートディスクが含まれるパス名を指定します。
パスの書式は、NVT ASCII 文字集合の文字からなる文字列です。
.RE
.PP
.B option \fBip-forwarding\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
パケットをフォワードするように、
クライアントが自己の IP 層を設定すべきかを指定します。
値 0 は IP フォワードを無効にし、
値 1 は IP フォワードを有効にすることを意味します。
.RE
.PP
.B option \fBnon-local-source-routing\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
非ローカルな送信元経路指定 (non-local source route) を持つ
データグラムをフォワードするように、
クライアントが自己の IP 層を設定すべきかを指定します
(本項目については [4] の 3.3.5 節を参照してください)。
値 0 はそのようなデータグラムのフォワードを許可しないことを意味し、
値 1 はフォワード許可を意味します。
.RE
.PP
.B option \fBpolicy-filter\fR \fIip-address ip-address\fR [\fB,\fR \fIip-address ip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
非ローカルな送信元経路指定データグラムに対するポリシフィルタを指定します。
フィルタは、IP アドレスとマスクの組のリストからなり、
到着する送信元経路指定データグラム用のフィルタとなる、
宛先/マスクの組を指定します。
.PP
次ホップアドレスがフィルタのいずれにも適合しない送信元経路指定データグラムは、
クライアントが破棄すべきです。
.PP
更なる情報は STD 3 (RFC1122) を参照してください。
.RE
.PP
.B option \fBmax-dgram-reassembly\fR \fIuint16\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、クライアントが再組み立て準備をすべき、
最大データグラムサイズを指定します。
最小の正当値は 576 です。
.\" The minimum value legal value is 576.
.\" The minimum legal value is 576. かな (horikawa@jp.freebsd.org 19990404)
.RE
.PP
.B option \fBdefault-ip-ttl\fR \fIuint8;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが出力するデータグラムに使用すべき、
デフォルトの生存時間を指定します。
.RE
.PP
.B option \fBpath-mtu-aging-timeout\fR \fIuint32\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
RFC 1191 で定義される機構で発見されたパス MTU 値のエージングに使用する
タイムアウト (秒単位) を指定します。
.RE
.PP
.B option \fBpath-mtu-plateau-table\fR \fIuint16\fR [\fB,\fR \fIuint16\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、MTU サイズの表を指定します。
この表は、
RFC 1191 で定義される、パス MTU 発見 (Path MTU Discovery) 実施時に使用します。
表の書式は、最小から最大への順の、
16 ビット符号無し整数のリストです。
最小 MTU は 68 以上であることが必要です。
.RE
.PP
.B option \fBinterface-mtu\fR \fIuint16\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、このインタフェースに対して使用する MTU を指定します。
MTU に対する最小の正当値は 68 です。
.RE
.PP
.B option \fBall-subnets-local\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが接続されている IP ネットワークの全サブネットが使用する MTU が、
クライアントが直接接続されているサブネットの MTU と同じであると、
クライアントが仮定して良いかを指定します。
値 1 は、全サブネットは同一の MTU であることを意味します。
値 0 は、直接接続されているネットワークのサブネットには
より小さな MTU を持つものがあると、クライアントが仮定すべきことを意味します。
.RE
.PP
.B option \fBbroadcast-address\fR \fIip-address\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントのサブネットで使用されているブロードキャストアドレスを指定します。
正当なブロードキャストアドレスの値は、
STD 3 (RFC1122) の 3.2.1.3 節に記述されています。
.RE
.PP
.B option \fBperform-mask-discovery\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが ICMP を使用してサブネットマスク発見を実施すべきかを指定します。
値 0 は、クライアントはマスク発見を実施すべきでないことを意味します。
値 1 は、クライアントはマスク発見を実施すべきであることを意味します。
.RE
.PP
.B option \fBmask-supplier\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
ICMP を使用したサブネットマスク要求に対して、
クライアントが応答すべきかを指定します。
値 0 は、クライアントが応答すべきでないことを意味します。
値 1 は、クライアントが応答すべきであることを意味します。
.RE
.PP
.B option \fBrouter-discovery\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
RFC 1256 で定義されるルータ発見 (Router Discovery) 機構を使用して
ルータを請求すべきかを指定します。
値 0 は、クライアントはルータ発見を実施すべきでないことを意味します。
値 1 は、クライアントはルータ発見を実施すべきであることを意味します。
.RE
.PP
.B option \fBrouter-solicitation-address\fR \fIip-address\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントのルータ請求リクエスト送出先アドレスを指定します。
.RE
.PP
.B option \fBstatic-routes\fR \fIip-address ip-address\fR [\fB,\fR \fIip-address ip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが経路キャッシュに組み込むべき静的ルータのリストを指定します。
同じ宛先に対して複数のルータを指定すると、
優先度が低くなる順序でリストされます。
.PP
経路は IP アドレスの組のリストからなります。
最初のアドレスは宛先アドレスであり、
2 番目のアドレスは宛先に対するルータのアドレスです。
.PP
デフォルト経路 (0.0.0.0) は、静的経路に対しては不正な宛先です。
デフォルト経路を指定するには、
.B routers
オプションを使用してください。
.RE
.PP
.B option \fBtrailer-encapsulation\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
ARP プロトコル使用時に、
クライアントがトレイラ使用ネゴシエート (RFC 893 [14]) すべきかを指定します。
値 0 は、クライアントがトレイラ使用を試みるべきでないと意味します。
値 1 は、クライアントがトレイラ使用を試みるべきであると意味します。
.RE
.PP
.B option \fBarp-cache-timeout\fR \fIuint32\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、ARP キャッシュエントリのタイムアウトを秒単位で指定します。
.RE
.PP
.B option \fBieee802-3-encapsulation\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
インタフェースがイーサネットである場合に、
クライアントがイーサネットバージョン 2 (RFC 894) か、
IEEE 802.3 (RFC 1042) のカプセル化を使用すべきかを指定します。
値 0 は、クライアントは RFC 894 のカプセル化を使用すべきであると意味します。
値 1 は、クライアントは RFC 1042 のカプセル化を使用すべきであると意味します。
.RE
.PP
.B option \fBdefault-tcp-ttl\fR \fIuint8\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが TCP セグメントを送出するときに使用すべき、
デフォルトの TTL を指定します。最小値は 1 です。
.RE
.PP
.B option \fBtcp-keepalive-interval\fR \fIuint32\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントの TCP が
キープアライブ (keepalive) メッセージを TCP 接続上に送信する前に
待つべき間隔 (秒単位) を指定します。
時間は 32 ビット符号無し整数で指定します。
値 0 は、
アプリケーションが明示的に要求しなければ、
クライアントが接続上にキープアライブメッセージを生成すべきでないことを
意味します。
.RE
.PP
.B option \fBtcp-keepalive-garbage\fR \fIflag\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、古い実装との互換性のために、ゴミのオクテットと一緒に、
TCP キープアライブメッセージをクライアントが送るべきかを指定します。
値 0 は、ゴミのオクテットを送るべきでないことを意味します。
値 1 は、ゴミのオクテットを送るべきであることを意味します。
.RE
.PP
.B option \fBnis-domain\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、クライアントの NIS (Sun Network Information Services)
ドメインを指定します。
ドメインの書式は、NVT ASCII 文字集合の文字からなる文字列です。
.RE
.PP
.B option \fBnis-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な NIS サーバの IP アドレスを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBntp-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な NTP (RFC 1035) サーバの IP アドレスを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBnetbios-name-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
NetBIOS ネームサーバ (NBNS) オプションは、
RFC 1001/1002 の NBNS ネームサーバのリストを、
優先されるものから順に指定します。
現在では、NetBIOS Name Service は WINS と呼ばれることの方が多いです。 
netbios-name-servers オプションを使用して、WINS サーバを指定可能です。
.RE
.PP
.B option \fBnetbios-dd-server\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
NetBIOS データグラム配布サーバ (NBDD) オプションは、
RFC 1001/1002 の NBDD サーバのリストを、
優先されるものから順に指定します。
.RE
.PP
.B option \fBnetbios-node-type\fR \fIuint8\fR\fB;\fR
.RS 0.25i
.PP
NetBIOS ノードタイプオプションは、
設定可能な NetBIOS オーバ TCP/IP クライアントを、
RFC 1001/1002 に記述されているように設定します。
値は単一のオクテットとして指定され、
クライアントタイプを意味します。
.PP
使用可能なノードタイプは次の通りです:
.PP
.TP 5
.I 1
B ノード: ブロードキャスト - WINS 無し
.TP
.I 2
P ノード: ピア - WINS のみ
.TP
.I 4
M ノード: ミックス - ブロードキャスト後に WINS
.TP
.I 8
H ノード: ハイブリッド - WINS 後にブロードキャスト
.RE
.PP
.B option
.B netbios-scope
.I string\fB;\fR
.RS 0.25i
.PP
NetBIOS スコープオプションは、
RFC 1001/1002 に指定されるように、
クライアントの NetBIOS オーバ TCP/IP スコープパラメータを指定します。
文字集合の制約については RFC1001, RFC1002, RFC1035 を参照してください。
.RE
.PP
.B option \fBfont-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な X Window System フォントサーバを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBx-display-manager\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な X Window System Display Manager を実行している
システムのリストを指定します。
アドレスは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBdhcp-client-identifier\fR \fIdata-string\fR\fB;\fR
.RS 0.25i
.PP
本オプションを使って、ホスト宣言中で DHCP クライアント識別子を
指定することができます。これは、クライアント識別子に対する照合を
用いて、dhcpd がそのホストのレコードを発見できるようにするための
ものです。
.RE
.B option \fBnisplus-domain\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントの NIS+ ドメインの名前を指定します。
ドメインの書式は、NVT ASCII 文字集合の文字からなる文字列です。
.RE
.B option \fBnisplus-servers\fR \fIip-address\fR [\fB,\fR \fIip-address\fR...
]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能な NIS+ サーバを示す IP アドレスのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBtftp-server-name\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは TFTP サーバを指定し、
クライアントがサポートする場合には \fBserver-name\fR 宣言と同じ効果を持ちます。
BOOTP クライアントは、本オプションをサポートしないでしょう。
DHCP クライアントによってはサポートしているものがあり、
実際必須としているものがあります。
.RE
.PP
.B option \fBbootfile-name\fR \fIstring\fR\fB;\fR
.RS 0.25i
.PP
本オプションは、ブートストラップファイルを指定するために使用します。
クライアントにサポートされている場合、
\fBfilename\fR 宣言と同じ効果を持ちます。
DHCP クライアントによってはサポートするものがあり、
実際必須としているものがあります。
.RE
.PP
.B option \fBmobile-ip-home-agent\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
本オプションは、
クライアントが利用可能なモバイル IP ホームエージェントの IP アドレスのリストを
指定します。
エージェントは、優先されるものから順にリストしてください。
ただし、通常はエージェントは 1 つでしょう。
.RE
.PP
.B option \fBsmtp-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
SMTP サーバオプションは、
クライアントが利用可能な SMTP サーバのリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBpop-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
POP3 サーバオプションは、クライアントが利用可能な POP3 のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBnntp-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
NNTP サーバオプションは、クライアントが利用可能な NNTP のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBwww-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
WWW サーバオプションは、クライアントが利用可能な WWW のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBfinger-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
Finger サーバオプションは、
クライアントが利用可能な Finger のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBirc-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
IRC サーバオプションは、クライアントが利用可能な IRC のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBstreettalk-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
StreetTalk サーバオプションは、
クライアントが利用可能な StreetTalk のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.PP
.B option \fBstreetalk-directory-assistance-server\fR \fIip-address\fR [\fB,\fR
\fIip-address\fR... ]\fB;\fR
.RS 0.25i
.PP
StreetTalk Directory Assistance (STDA) サーバオプションは、
クライアントが利用可能な STDA のリストを指定します。
サーバは、優先されるものから順にリストしてください。
.RE
.SH 関連項目
dhcpd.conf(5), dhcpd.leases(5), dhclient.conf(5), dhcpd(8),
dhclient(8), RFC2132, RFC2131
.SH 作者
.B dhcpd(8)
は、Vixie Labs との契約のもとで、Ted Lemon <mellon@vix.com> が記述しました。
本プロジェクトの資金は、Internet Software Corporation が提供しました。
Internet Software Consortium に関する情報は、
.B http://www.isc.org/isc
にあります。
