freebsd/freebsd-doc/ja_JP.eucJP/man/man5/disktab.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)disktab.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/disktab.5,v 1.12 2003/05/08 00:14:48 trhodes Exp %
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt DISKTAB 5
.Os
.Sh 名称
.Nm disktab
.Nd ディスク記述ファイル
.Sh 書式
.In disklabel.h
.Sh 解説
.Nm
は、ディスクジオメトリとディスクパーティション特性を記述する
簡単なデータベースで、
.\"by the formatter(\c
.\"IR.Xr format 8 )
.\"to determine how to format the disk, and
ディスク上のディスクラベルを初期化する際に使われます。
フォーマットは
.Xr termcap 5
端末データベースと同様のパターンです。
.Nm
内のエントリは、たくさんの `:' で区切られたフィールドからなります。
各ディスクの最初のフィールドは `|' 文字で区切られていて、そのディスクの
名前を与えます。
最後の名前はディスクをディスクを識別する完全に長い名前でなければなりません。
.Pp
各エントリの省略可能なフィールドは次の通りです。
.Bl -column "indent" "boolx"
.It Sy "ID	型	解説"
.It "\&ty	str	ディスクの種類 (例えば removable, winchester)"
.It "\&dt	str	コントローラの種類 (例えば "
.Tn SMD , ESDI ,
フロッピ)
.It "\&ns	num	トラックあたりのセクタ数"
.It "\&nt	num	シリンダあたりのトラック数"
.It "\&nc	num	ディスク上の総シリンダ数"
.It "\&sc	num	シリンダあたりのセクタ数、デフォルトは nc*nt"
.It "\&su	num	ユニットあたりのセクタ数、デフォルトは sc*nc"
.It "\&se	num	バイト単位のセクタサイズ"
デフォルトは
.Dv DEV_BSIZE
.It "\&sf	bool	コントローラが bad144 スタイルのバッドセクタフォワードをサポートする"
.It "\&rm	num	回転スピード (rpm), デフォルトは 3600"
.It "\&sk	num	トラックあたりのセクタスキュー、デフォルトは 0"
.It "\&cs	num	シリンダあたりのセクタスキュー、デフォルトは 0"
.It "\&hs	num	ヘッドスイッチ時間 (usec), デフォルトは 0"
.It "\&ts	num	1 シリンダシーク時間 (usec), デフォルト 0"
.It "\&il	num	セクタインタリーブ (n:1), デフォルトは 1"
.It "\&d[0-4]	num	ドライブタイプ依存パラメータ"
.It "\&bs	num	ブートブロックサイズ、デフォルト"
.Dv BBSIZE
.It "\&b[0-1]	num	ブートブロックファイル名。"
.Xr bsdlabel 8
を参照
.It "\&sb	num	スーパブロックサイズ、デフォルト"
.Dv SBSIZE
.It "\&ba	num	パーティション `a' のブロックサイズ (bytes)"
.It "\&bd	num	パーティション `d' のブロックサイズ (bytes)"
.It "\&be	num	パーティション `e' のブロックサイズ (bytes)"
.It "\&bf	num	パーティション `f' のブロックサイズ (bytes)"
.It "\&bg	num	パーティション `g' のブロックサイズ (bytes)"
.It "\&bh	num	パーティション `h' のブロックサイズ (bytes)"
.It "\&fa	num	パーティション `a' のフラグメントサイズ (bytes)"
.It "\&fd	num	パーティション `d' のフラグメントサイズ (bytes)"
.It "\&fe	num	パーティション `e' のフラグメントサイズ (bytes)"
.It "\&ff	num	パーティション `f' のフラグメントサイズ (bytes)"
.It "\&fg	num	パーティション `g' のフラグメントサイズ (bytes)"
.It "\&fh	num	パーティション `h' のフラグメントサイズ (bytes)"
.It "\&oa	num	パーティション `a' のセクタ内オフセット"
.It "\&ob	num	パーティション `b' のセクタ内オフセット"
.It "\&oc	num	パーティション `c' のセクタ内オフセット"
.It "\&od	num	パーティション `d' のセクタ内オフセット"
.It "\&oe	num	パーティション `e' のセクタ内オフセット"
.It "\&of	num	パーティション `f' のセクタ内オフセット"
.It "\&og	num	パーティション `g' のセクタ内オフセット"
.It "\&oh	num	パーティション `h' のセクタ内オフセット"
.It "\&pa	num	パーティション `a' セクタサイズ"
.It "\&pb	num	パーティション `b' セクタサイズ"
.It "\&pc	num	パーティション `c' セクタサイズ"
.It "\&pd	num	パーティション `d' セクタサイズ"
.It "\&pe	num	パーティション `e' セクタサイズ"
.It "\&pf	num	パーティション `f' セクタサイズ"
.It "\&pg	num	パーティション `g' セクタサイズ"
.It "\&ph	num	パーティション `h' セクタサイズ"
.It "\&ta	str	パーティション `a' のパーティションタイプ"
.Pf ( Bx 4.2
ファイルシステム, スワップ他)
.It "\&tb	str	パーティション `b のパーティションタイプ"
.It "\&tc	str	パーティション `c のパーティションタイプ"
.It "\&td	str	パーティション `d のパーティションタイプ"
.It "\&te	str	パーティション `e のパーティションタイプ"
.It "\&tf	str	パーティション `f のパーティションタイプ"
.It "\&tg	str	パーティション `g のパーティションタイプ"
.It "\&th	str	パーティション `h のパーティションタイプ"
.El
.Sh 関連ファイル
.Bl -tag -width /etc/disktab -compact
.It Pa /etc/disktab
.El
.Sh 関連項目
.Xr getdiskbyname 3 ,
.Xr disklabel 5 ,
.Xr disklabel 8 ,
.Xr newfs 8
.Sh 歴史
.Nm
この記述ファイルは
.Bx 4.2
から登場しました。
