freebsd/freebsd-doc/ja_JP.eucJP/man/man5/dm.conf.5
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" WORD: configuration file	設定ファイル
.\" %FreeBSD: src/games/dm/dm.conf.5,v 1.3 1999/08/27 23:29:00 peter Exp %
.\" WORD: day of the week	曜日
.\"
.\"     @(#)dm.conf.5	8.1 (Berkeley) 5/31/93
.\" jpman %Id: dm.conf.5,v 1.3 1998/07/30 15:23:17 horikawa Stab %
.\"
.Dd May 31, 1993
.Dt DM.CONF 5
.Os BSD 4.2
.Sh 名称
.Nm dm.conf
.Nd \&dm 設定ファイル
.Sh 解説
.Xr dm.conf
ファイルは
.Xr \&dm 8
プログラムの設定ファイルです。
このファイルは ``badtty'', ``game'', ``time'' の 3 個のキーワードの
どれか1つから始まる行で構成されます。その他の行は全て無視されます。
.Pp
キーワード ``badtty'' の後にリストされた全ての tty 上では、
ゲームで遊ぶことができません。
エントリは空白文字で区切られた2個のフィールドからなります。
その 2 つは文字列 ``badtty'' と
.Xr ttyname 3
の戻り値となる tty 名です。
例えば、uucp ダイヤルアウト用の ``tty19'' を、ゲームに
用いられないようにするためには、以下のようにします。
.Bd -literal -offset indent
badtty	/dev/tty19
.Ed
.Pp
キーワード ``time'' の後に、日付/時間の組み合わせをリストすると、その時間帯は
ゲームがすべて禁止されます。
このエントリは空白文字で区切られた 4 個のフィールドからなります。
その 4 つは文字列 ``time'' と省略なしの曜日、ゲームをしてはいけない時間帯
の始まりと終わりを示します。
時間のフィールドは 0 時から始まる 24 時間制で表します。
例えば、以下のエントリは、月曜日には午前 8 時以前と午後 5 時以降のみに
ゲームで遊ぶことを許可するものです。
.Bd -literal -offset indent
time		Monday	8	17
.Ed
.Pp
キーワード ``game'' の後に何らかのゲームをリストすると、
特定のゲームのためにパラメータをセットします。
このエントリは空白文字で区切られた 5 個のフィールドからなります。
その 5 つはキーワード ``game''、ゲームの名前、ゲームで遊ぶことが許される
ロードアベレージの最大値、ケームで遊ぶことが許されるときの最大ユーザ数、
ゲームが実行されるときの優先度です。
これらのフィールドはすべて、数字以外の文字で始めることができ、
その場合はそのフィールドに基づいたゲームの制限や優先度が課せられない
結果になります。
ゲーム "default" は他のどこにもリストされていないゲーム全ての設定を
制御するもので、ファイル内の最後の ``game'' エントリである必要があります。
優先度は負の値にすることはできません。
例えば以下のエントリは、ゲーム ``hack'' に対しては、
システムのユーザが 10 人以下でロードアベレージが 5 以下であるときのみ許可し、
その他の全てのゲームにはシステムのユーザが 15 人以下であるとき常に許可する
制限を課します。
.Bd -literal -offset indent
game		hack		5	10	*
game		default	*	15	*
.Ed
.Sh 関連ファイル
.Bl -tag -width /etc/dm.conf -compact
.It Pa /etc/dm.conf
.Xr \&dm 8
設定ファイル
.El
.Sh 関連項目
.Xr setpriority 2 ,
.Xr ttyname 3 ,
.Xr dm 8

