freebsd/freebsd-doc/ja_JP.eucJP/man/man5/drivers.conf.5
.\" Copyright (c) 2002 Murray Stokely <murray@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/drivers.conf.5,v 1.3.2.1 2002/04/02 09:12:57 murray Exp %
.\"
.\" $FreeBSD$
.\"
.\"WORD:moving kernel module 移動カーネルモジュール
.Dd March 23, 2002
.Dt DRIVERS.CONF 5
.Os
.Sh 名称
.Nm drivers.conf
.Nd "ブートフロッピのドライバ設定ファイル"
.Sh 解説
.Nm
はリリースの構築処理で使用されます。
.Fx
のリリースには 2 つのインストールフロッピがあります。
1 つ目のフロッピイメージ
.Pa kern.flp
は静的にリンクされたカーネルを含んでいます。
2 つ目のフロッピイメージ
.Pa mfsroot.flp
には、
.Xr sysinstall 8
と、インストールに不可欠なコマンド群と、ブートカーネルを補うカーネルモジュール
を含んでいます。
一度システムがブートすると、msfroot フロッピの
.Pa /stand/modules
ディレクトリにあるモジュールが自動的に
.Xr sysinstall 8
によってロードされます。
.Pp
.Pa /usr/src/release/${arch}/drivers.conf
ファイルにはブートカーネルからは省略され、msfroot フロッピ上の
カーネルモジュールとしてインストールされるドライバのリストが含まれています。
それぞれのドライバは行ごとに区切られ、それぞれの行中の項目は
タブまたはスペースで区切られています。
.Pp
1 番目の項目
.Ar driver
はカーネル設定ファイル中のドライバ名です。
これは、ブートフロッピのカーネル設定ファイルから、
mfsroot フロッピ上のモジュールとして含まれる
ドライバを取り除くために、
.Pa driver-remove.pl
で使われます。
.Pp
2 番目の項目
.Ar filename
は関連付けられたカーネルモジュール名です (
.Pa .ko
拡張子を除く)。
.Pp
3 番目の項目
.Ar floppy
は、どのフロッピディスクがそのカーネルモジュールを含むのかを明示します。
現在は、2 という値だけが有効です
(通常は
.Pa mfsroot.flp )
。
将来、3 枚目の
.Dq "driver floppy"
が追加されるかもしれません。
.Pp
4 番目の項目
.Ar type
はドライバの種別をあらわします。
この項目は現在は利用されません。
.Pp
5 番目の項目
.Ar description
はそのデバイスドライバの簡単な説明です。
.Sh 関連ファイル
.Bl -tag -compact
.It Pa /usr/src/release/Makefile
.It Pa /usr/src/release/${arch}/drivers.conf
.It Pa /usr/src/release/scripts/driver-copy2.pl
.It Pa /usr/src/release/scripts/driver-remove.pl
.El
.Sh 関連項目
.Xr release 7 ,
.Xr kldload 8 ,
.Xr sysinstall 8
.Rs
.%T "FreeBSD リリースエンジニアリング"
.%O http://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/releng/
.Re
.Sh 歴史
.Nm
ファイルは
.Fx 4.5
で登場しました。
.Sh 作者
.An -nosplit
.An 細川　達己　Aq hosokawa@FreeBSD.org
が初めて mfsroot インストーラフロッピイメージに、
カーネルモジュールを移動させることを可能にしました。
このマニュアルページは
.An Murray Stokely Aq murray@FreeBSD.org
が書きました。
