freebsd/freebsd-doc/ja_JP.eucJP/man/man5/editrc.5
.\"	%NetBSD: editrc.5,v 1.4 1997/04/24 20:20:31 christos Exp %
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This file was contributed to The NetBSD Foundation by Luke Mewburn.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libedit/editrc.5,v 1.5.2.3 2001/07/22 12:07:11 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/editrc.5,v 1.6 2001/05/14 01:09:27 horikawa Exp $
.Dd January 11, 1997
.Os BSD 4.4
.Dt EDITRC 5
.Sh 名称
.Nm editrc
.Nd editline ライブラリの設定ファイル
.Sh 書式
.Nm
.Sh 解説
.Nm
は
.Xr editline 3
ライブラリで使用されている様々な設定を定義します。
.Pp
それぞれの行のフォーマットは、
.Dl prog:command [arg [...]]
または
.Dl command [arg [...]]
のどちらかです。
.Pp
.Ar command
は
.Xr editline 3
の組み込みコマンドのうちの 1 つです。
より詳しい情報は
.Sx 組み込みコマンド
を参照してください。
.Pp
.Ar prog
はプログラムが
.Xr editline 3
をセットアップするために
.Xr el_init 3
を呼び出す時に定義したプログラム名の文字列で、
通常は
.Va argv[0]
です。
.Ar command
は
.Ar prog
にマッチする全てのプログラムに対しても実行されます。
.Pp
.Ar prog
は
.Xr regex 3
形式の正規表現であってもよく、その場合
.Ar command
はその正規表現にマッチする全てのプログラムに対して実行されます。
.Sh 組み込みコマンド
.Nm editline
ライブラリはいくつかの組み込みコマンドがあり、行編集とヒストリ機能操作の
方法に作用します。
これらは
.Xr tcsh 1
シェルに存在する似た名前の組み込みコマンドに基づいています。
.Pp
以下の組み込みコマンドが利用可能です。
.Bl -tag -width 4n
.It Ic bind Xo
.Op Fl a
.Op Fl e
.Op Fl k
.Op Fl l
.Op Fl r
.Op Fl s
.Op Fl v
.Op Ar key Op Ar command
.Xc
オプション無しでは、全ての割り当てられたキーと、
それぞれが割り当てられた編集コマンドを表示します。
もし
.Ar key
が与えられたら、
.Ar key
に対する割り当てを示します。
もし
.Ar key command
が与えられたら、
.Ar command
を
.Ar key
に割り当てます。
含まれるオプションは、
.Bl -tag -width 4n
.It Fl e
全てのキーを GNU Emacs の標準に似た割り当てに割り当てます。
.It Fl v
全てのキーを
.Xr vi 1
の標準に似た割り当てに割り当てます。
.It Fl a
.Xr vi 1
モードのもう 1 つ (コマンドモード) のキーマップにおける
キー割り当てを表示または変更します。
.It Fl k
.Ar key
は矢印記号キー名、
.Sq up ,
.Sq down ,
.Sq left
または
.Sq right
のうちの 1 つ、として解釈されます。
.It Fl l
全ての編集コマンドとそれぞれの短い説明を表示します。
.It Fl r
キーの割り当てを削除します。
.It Fl s
.Ar command
は文字列リテラルとして扱われ、
.Ar key
がタイプされた時に端末入力として扱われます。
.Ar command
中の割り当てられたキーは、それ自身が再解釈され、
これは 10 レベルの解釈まで継続されます。
.El
.Pp
.Ar key
と
.Ar command
は
.Sm off
.Sq No ^ Ar character
.Sm on
.Po
例えば
.Sq ^A
.Pc
形式のコントロール文字と、
以下のバックスラッシュ付きのエスケープシーケンスを含むことができます。
.Pp
.Bl -tag -compact -offset indent -width 4n
.It Ic \ea
ベル
.It Ic \eb
バックスペース
.It Ic \ee
エスケープ
.It Ic \ef
フォームフィード
.It Ic \en
改行
.It Ic \er
キャリッジリターン
.It Ic \et
(水平) タブ
.It Ic \ev
垂直タブ
.Sm off
.It Sy \e Ar nnn
.Sm on
8 進数
.Ar nnn
で表される ASCII 文字
.El
.Pp
.Sq \e
は、次の文字に特別な意味があるならば、それを無効化します。
特に、
.Sq \e
と
.Sq ^
の特別な意味を無効化します。
.It Ic echotc Xo
.Op Fl sv
.Ar arg
.Ar ...
.Xc
.Ar arg Ar ...
で与えられた端末能力を実行します。
もし
.Ar arg
が
.Sq baud ,
.Sq cols ,
.Sq lines ,
.Sq rows ,
.Sq meta ,
.Sq tabs
であればその能力の値が表示されます。
.Dq yes
または
.Dq no
は、端末がその能力を持つのか持たないのかを表します。
.Pp
.Fl s
を指定すると存在しない能力に対してエラーを起こすのではなく、
空の文字列を返します。
.Fl v
を指定するとメッセージを冗長に表示します。
.It Ic history
ヒストリを表示します。
.It Ic telltc
全ての端末能力の値を表示します。
.Pf ( Xr termcap 5
参照)。
.It Ic settc Ar cap Ar val
.Xr termcap 5 で定義された端末能力
.Ar cap
を
.Ar val
に設定します。
正しさのチェックは行なわれません。
.It Ic setty Xo
.Op Fl a
.Op Fl d
.Op Fl q
.Op Fl x
.Op Ar +mode
.Op Ar -mode
.Op Ar mode
.Xc
.Nm
がどの tty モードの変更をユーザに許可しないかを制御します。
.Fl d ,
.Fl q ,
.Fl x
は
.Ic setty
に対してそれぞれ
.Sq edit ,
.Sq quote ,
.Sq execute
tty モードセットにおいて働くことを示します。
デフォルトでは
.Fl x
です。
.Pp
他の引数がなければ、
.Ic setty
は選択されたセットにおいて何が on
.Po
.Sq +mode
.Pc
または off
.Po
.Sq -mode
.Pc
に固定されているかを表示します。
.Fl a
は設定に関わらず選択されたセットにおける全ての tty モードを表示します。
.Ar +mode ,
.Ar -mode ,
.Ar mode ,
は選択されたセットにおいて
.Ar mode
を on または off に固定すること、あるいは
.Ar mode
の制御を行なわないことを指定します。
.El
.Sh 関連項目
.Xr editline 3 ,
.Xr regex 3 ,
.Xr termcap 5
.Sh 作者
.An -nosplit
.Nm editline
ライブラリは
.An Christos Zoulas
によって書かれ、このマニュアルは
いくつかの節は
.Xr tcsh 1
に影響されて、
.An Luke Mewburn
によって書かれました。
