freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ethers.5
.\" Copyright (c) 1995
.\"	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/ethers.5,v 1.8.2.2 2000/12/14 12:14:31 ru Exp %
.\" jpman %Id: ethers.5,v 1.3 1998/04/29 11:33:25 kuma Stab %
.\"
.\" WORD: Internetworking	インターネット
.\" WORD: fully-qualified-host-name	完全な形でのホスト名
.\"
.Dd April 12, 1995
.Dt ETHERS 5
.Os FreeBSD
.Sh 名称
.Nm ethers
.Nd イーサネットアドレスのデータベース
.Sh 解説
.Nm
データベースは、
インターネット上のホストの既知の 48 ビットイーサネットアドレスを格納します。
データは
.Pa /etc/ethers
と呼ばれるファイルに次のフォーマットで格納されます:
.Bd -unfilled -offset indent
.Pa イーサネットアドレス 完全な形でのホスト名
.Ed
.Pp
項目は任意個の空白文字やタブ文字で区切ります。
行頭の ``#'' は行末まで続くコメントの開始を表します。
行頭に ``+'' があると、
.Xr ethers 3
ライブラリ関数は、
.Pa /etc/ethers
ファイルのデータだけでなく、
.Xr NIS 4
の
.Pa ethers.byname
と
.Pa ethers.byaddr
のマップのデータも使用します。
.Pp
イーサネットアドレスは
.Tn ASCII
形式で "x:x:x:x:x:x" と表記されます。ここで、
.Ar x
は 0x00 から 0xFF までの 16 進数です。
アドレス値はネットワークオーダである必要があります。
.Pa /etc/ethers
データベースで指定するホスト名は、
.Xr hosts 5
ファイルのエントリに対応する必要があります。
.Pp
標準 C ライブラリの
.Fn ether_line
関数を使用して、
.Pa /etc/ethers
データベースの各行を、個々のコンポーネントに分割可能です:
バイナリのイーサネットアドレスは
.Pa ether_addr
構造として、ホスト名は文字列として格納されます。
.Sh 関連ファイル
.Bl -tag -width /etc/services -compact
.It Pa /etc/ethers
.Nm
ファイルは
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr ethers 3 ,
.Xr yp 4
.Sh 歴史
.Nm
フォーマットは SunOS 4.1.x で使用されている形式を元にしています。

