freebsd/freebsd-doc/ja_JP.eucJP/man/man5/exports.5
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)exports.5	8.3 (Berkeley) 3/29/95
.\" %FreeBSD: src/usr.sbin/mountd/exports.5,v 1.24 2004/01/01 00:59:58 obrien Exp %
.\"
.\" $FreeBSD$
.\"
.Dd March 29, 1995
.Dt EXPORTS 5
.Os
.Sh 名称
.Nm exports
.Nd
.Tn NFS
マウント要求に対するリモートマウントポイントを定義する
.Sh 書式
.Nm
.Sh 解説
.Nm
ファイルは
.Tn NFS
サーバの指定 1 つについて
.Tn NFS
マウントプロトコルに対するリモートマウントポイントを指定します。
.%T "Network File System Protocol Specification" ,
RFC1094, Appendix A
および
.%T "NFS: Network File System Version 3 Specification" ,
Appendix I
を参照してください。
.Pp
.Nm
ファイルの各行 (# で始まる注釈行以外) は、1 つ以上のホスト向けに、
1 つのローカルサーバファイルシステム内の
マウントポイント (複数) とエクスポートフラグを指定します。
長い行は一番最後の行以外の行をバックスラッシュ
.Pq Ql \e
で終らせると複数の行に分割することができます。
あるホストは、
サーバの各ローカルファイルシステムに関して唯 1 度だけ指定可能です。
また他の全てのホストに適用されるデフォルトエントリは、
各サーバファイルシステムに関して唯 1 つだけ指定できます。
後者は ``世界'' に対しそのファイルシステムを公開することになるので、
そのファイルシステムが公の情報を含むときにのみ用いるべきです。
.Pp
マウントエントリ内の最初の欄 (複数) には、
対応するクライアント (複数) がマウント可能である
サーバファイルシステム内ディレクトリパス (複数) を指定します。
この指定には 2 つの形式があります。
最初の指定形式は、
全マウントポイントのリストであり、
絶対ディレクトリパスを空白で区切ったものです。
次の指定形式は、そのファイルシステムのルートパス名に続いて
.Fl alldirs
フラグを指定するものです。この形式は、そのファイルシステム内の任意の点を
ホスト (複数) がマウントすることを可能にします。
.Xr mountd 8
で
.Fl r
オプションを用いれば、任意の点には通常ファイルを含むことができます。
パス名中には、シンボリックリンクを含んではなりませんし、また "." または ".."
を含んではなりません。
1 つのファイルシステムに対するマウントポイントを複数指定することが可能であり、
それぞれ異ったホストとエクスポートオプションの組を指定することができます。
.Pp
行の 2 番目の部分には、そのファイルシステムがホストの組にどのように
エクスポートされているかを指定します。
オプションフラグは、
そのファイルシステムを読み取り専用でエクスポートしているのか
それとも読み書き可でエクスポートしているのかを指定したり、
クライアントの UID がサーバ上のユーザ資格にどのように
マップされているのかを指定します。
.Pp
エクスポートオプションは以下のとおりです。
.Pp
.Sm off
.Fl maproot No = Sy user
.Sm on
指定されたユーザの資格を、root によるリモートアクセスに対して使用します。
その資格には、ローカルマシン上でユーザが属する全てのグループを含みます (
.Xr id 1
参照)。ユーザは名前または数字です。
.Pp
.Sm off
.Fl maproot No = Sy user:group1:group2:...
.Sm on
コロンによって区切られたリストは、
root によるリモートアクセスに対して使用する正確な資格を指定するために
使用します。
リストの要素は名前または数字です。
グループを含まない資格をユーザに関する完全な資格と区別するためには、
user: を使用すべきであることに注意してください。
.Pp
.Sm off
.Fl mapall No = Sy user
.Sm on
または
.Sm off
.Fl mapall No = Sy user:group1:group2:...
.Sm on
.Fl maproot
と同じ指定方法で、
(root を含む) 全てのクライアントの UID に対するマッピングを指定します。
.Pp
.Fl r
オプションは
.Fl maproot
と同じ意味です。
これは古い export ファイル形式と互換性を保つために用意されました。
.Pp
.Fl maproot
および
.Fl mapall
オプションのない場合には、
root によるリモートアクセスは -2:-2 という資格を用いることになります。
その他の全てのユーザはそれぞれのリモート資格にマップされます。
.Fl maproot
オプションを指定すると、root によるリモートアクセスは -2:-2 の代りに
指定した資格にマップされます。
.Fl mapall
オプションを指定すると、root を含む全てのユーザはそれら自身の資格の代りに
指定した資格にマップされます。
.Pp
.Fl ro
オプションは、ファイルシステムが読み取り専用としてエクスポートされることを
指定します (デフォルトは読み書き可)。
.Fl o
オプションは
.Fl ro
と同じ意味です。
これは古い export ファイル形式と互換性を保つために用意されました。
.Pp
仕様 (RFC 2054 と RFC 2055) に厳密に従う
.Tn WebNFS
エクスポートは
.Fl public
フラグにて実現されます。
しかしながら、このフラグ自身は、ファイルシステム中の全ファイルに対して
読み書きアクセスを与えますが、予約ポートを必要としませんし、
uid のマッピングも行いません。
これは仕様を満すためだけに提供されており、通常は使用すべきではありません。
.Tn WebNFS
エクスポートのためには、
.Fl webnfs
フラグを使用します。これは
.Fl public ,
.Sm off
.Fl mapall No = Sy nobody ,
.Sm on
.Fl ro
を意味します。
.Pp
.Sm off
.Fl index No = Sy file
.Sm on
オプションを使用して、パブリックファイルハンドル
.Pq Tn WebNFS
を使用してディレクトリが検索された時にハンドルが返される
ファイルを指定できます。
これは URL の動作のまねをします。
.Fl index
オプションが指定されないと、通常通りディレクトリファイルハンドルが返されます。
.Fl index
オプションは
.Fl public
または
.Fl webnfs
フラグと組み合わせたときのみ意味があります。
.Pp
.Fl quiet
オプションを指定すると、
.Pa /etc/exports
中の変な行に関する syslog への診断出力の一部を抑制します。
既知のあり得る問題による五月蝿いエラーメッセージを避けるのに有用です
(後述の
.Sx 使用例
参照)。
.Pp
行の 3 番目の部分には、その行が適用されるホストの組を指定します。
この組は 3 つの方法で指定できます。
最初の方法はホスト名 (複数) を空白で区切って並べる方法です。
(名前の代りに、標準的なインターネット ``ドット'' アドレスを用いることも
できます)。2 番目の方法はネットグループファイル (
.Xr netgroup 5
参照) の中で定義した ``netgroup'' を指定する方法です。
3 番目の方法は、 1 つのネットワークとネットワークマスクを用いることにより、
1 つのインターネットサブネットワークを指定する方法です。
これは、
そのサブネットワーク内のアドレスを持つ全てのホストの組として定義されます。
この最後の方法はカーネルのオーバヘッドを低く押えられるため、
1 つの管理サブネット内の多くのクライアントを
エクスポートの行が参照する場合に推奨されます。
.Pp
最初の 2 つの指定方法では、単に空白で区切られた名前 (複数) を並べて指定します。
全ての名前は、まずそれらが ``netgroup'' 名であるかチェックされ、
そうでなければホスト名であると仮定されます。
ホスト名に完全ドメイン指定をすれば、
ネットグループと同じ名前を持つホストの問題を通常避けることができます。
3 番目の指定方法は、
.Sm off
.Fl network No = Sy netname
.Sm on
フラグとオプションの
.Sm off
.Fl mask No = Sy netmask
.Sm on
フラグによって指定します。マスクが指定されないと、そのネットワーククラス
(A, B, C のどれかです。
.Xr inet 4
を参照してください) に対するマスクとなります。
後述の
.Sx 使用例
参照。
.Pp
.Xr mountd 8
ユーティリティに
.Nm
ファイルを再度読み取らせるためには、
ハングアップシグナルを次のように送ります:
.Bd -literal -offset indent
kill -s HUP `cat /var/run/mountd.pid`
.Ed
.Pp
.Dv SIGHUP
の送信後に
.Xr syslogd 8
出力を確認して、
.Nm
ファイル中の解析エラーを
.Xr mountd 8
が記録したかどうか見てください。
.Sh 関連ファイル
.Bl -tag -width /etc/exports -compact
.It Pa /etc/exports
デフォルトのリモートマウントポイントファイル
.El
.Sh 使用例
.Bd -literal -offset indent
/usr /usr/local -maproot=0:10 friends
/usr -maproot=daemon grumpy.cis.uoguelph.ca 131.104.48.16
/usr -ro -mapall=nobody
/u -maproot=bin: -network 131.104.48 -mask 255.255.255.0
/u2 -maproot=root friends
/u2 -alldirs -network cis-net -mask cis-mask
/cdrom -alldirs,quiet,ro -network 192.168.33.0 -mask 255.255.255.0
.Ed
.Pp
.Sy /usr ,
.Sy /u ,
.Sy /u2
がローカルファイルシステムマウントポイントとすると、上の例は以下を指定します:
.Pp
.Sy /usr
はネットグループファイルで指定されるホスト群
.Em friends
にエクスポートされ、
この際ユーザはそれぞれのリモート資格にマップされ、
root は UID 0 およびグループ 10 にマップされます。
このファイルシステムは読み書き可でエクスポートされ、
``friends'' 内のホストは /usr と /usr/local のどちらもマウントできます。
このファイルシステムは
.Em 131.104.48.16
および
.Em grumpy.cis.uoguelph.ca
にエクスポートされ、
この際ユーザはそれぞれのリモート資格にマップされ、
root は ``daemon'' に結び付けられたユーザおよびグループにマップされます。
このファイルシステムは残りの世界へ読み出しのみでエクスポートされ、
この際全てのユーザは ``nobody'' に結び付けられたユーザおよびグループに
マップされます。
.Pp
.Sy /u
はサブネットワーク
.Em 131.104.48
上の全てのホストにエクスポートされ、
この際 root は ``bin'' の UID にマップされてグループアクセスを持ちません。
.Pp
.Sy /u2
は ``friends'' 中のホストにエクスポートされ、
その際 root は ``root'' に結び付けられた UID とグループにマップされます。
このファイルシステムは ``cis-net'' ネットワーク上の全てのホストへ
エクスポートされ、
この際 /u2 内のどんなディレクトリへもマウントを許します。
.Pp
サブディレクトリを含む
.Sy /cdrom
を根とするファイルシステムが、
ネットワーク 192.168.33.0/24 へ読み取り専用でエクスポートされます。
.Sy /cdrom
は CD-ROM デバイスの慣習的なマウントポイントですので、
現在 CD-ROM メディアがマウントされていないとこのエクスポートは失敗します。
何故なら、この行には
.Fl alldirs
があるため、ルートファイルシステムのサブディレクトリがエクスポート
されようとするのですが、これは許可されていないからです。
.Fl quiet
オプションは、通常は syslog に記録されてしまう
この条件のエラーメッセージを抑制します。
CD-ROM がマウントされると、
.Xr mount 8
は
.Xr mountd 8
にこの状況を通知し、
.Sy /cdrom
ファイルシステムが意図通りにエクスポートされます。
.Fl alldirs
オプションを使用しないと、エクスポートは常に成功することに注意してください。
この場合、
.Sy /cdrom
下に CD-ROM メディアがマウントされていなくても、
ルートファイルシステム中の (通常は空の) ディレクトリ
.Sy /cdrom
をエクスポートします。
.Sh 関連ファイル
.Bl -tag -width /etc/exports -compact
.It Pa /etc/exports
デフォルトリモートマウントポイントファイル
.El
.Sh 関連項目
.Xr netgroup 5 ,
.Xr mountd 8 ,
.Xr nfsd 8 ,
.Xr showmount 8
.Sh バグ
エクスポートオプションは、
カーネル内ではローカルマウントポイントに結び付けられます。
ローカルサーバマウントポイントのサブディレクトリでエクスポートされたものに、
エクスポートオプションの矛盾があってはいけません。
同じファイルシステム内の全てのエクスポートされたディレクトリは、
木を下る順に隣り合った行で指定されることが推奨されます。
ネットグループ名と同じ名前のホスト名は指定できません。
完全ドメイン指定でホスト名を指定すれば通常は問題ありません。
