freebsd/freebsd-doc/ja_JP.eucJP/man/man5/fbtab.5
.\"
.\" %FreeBSD: src/share/man/man5/fbtab.5,v 1.6.2.2 2000/12/14 12:14:31 ru Exp %
.\"
.\" $FreeBSD$
.\"
.\" WORD: permission	パーミッション
.\" WORD: device	デバイス(/dev 下のデバイスファイル関連のもの)
.\" WORD: comment	コメント
.\" WORD: whitespace	空白
.\" WORD: ownership	所有権(ファイルの)
.\"
.Dd August 22, 1994
.Dt FBTAB 5
.Os FreeBSD 2.0
.Sh 名称
.Nm fbtab
.Nd ログイン時にデバイスの保護状態を変更する
.Sh 解説
.Nm
ファイルには、
単一デバイス・複数デバイスのリスト・それらのパーミッション
の 3 つを指定する行が複数個格納されます。
コメントは # から開始し、行末まで続きます。
.Pp
空行もしくはコメントのみの行は無視されます。
.Pp
他の行は空白で区切られる次の 3 フィールドからなります:
ログインデバイス (/dev/ttyv0)・8 進数でのパーミッション値 (0600)・
そして ":" で区切ったデバイスリスト (/dev/console) です。
デバイス名は全て絶対パスで記述します。
\&"/*" で終るパスは "." と ".." 以外の全ディレクトリエントリを参照します。
.Pp
tty 引数 (相対パス) がログインデバイス名 (絶対パス) にマッチする場合、
\&":" 区切りでリストされるデバイスのパーミッションが
第 2 フィールドで指定される値に設定され、
所有者が UID と GID 引数の値に設定されます。
.Sh 関連ファイル
.Bl -tag -width /etc/fbtab -compact
.It Pa /etc/fbtab
.Nm
ファイルは
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr login 1 ,
.Xr getty 8
.Sh 作者
.An Guido van Rooij
