freebsd/freebsd-doc/ja_JP.eucJP/man/man5/finger.conf.5
.\"Copyright (c) 2000 Mark Knight <markk@knigma.org>
.\"All rights reserved.
.\"
.\"Redistribution and use in source and binary forms, with or without
.\"modification, are permitted provided that the following conditions
.\"are met:
.\"1. Redistributions of source code must retain the above copyright
.\"   notice, this list of conditions and the following disclaimer.
.\"2. Redistributions in binary form must reproduce the above copyright
.\"   notice, this list of conditions and the following disclaimer in the
.\"   documentation and/or other materials provided with the distribution.
.\"
.\"THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\"ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\"IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\"ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\"FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\"DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\"OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\"HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\"LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\"OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\"SUCH DAMAGE.
.\"
.\"%FreeBSD: src/usr.bin/finger/finger.conf.5,v 1.4 2000/08/25 22:22:04 brian Exp %
.\"
.\" $FreeBSD$
.Dd August 16, 2000
.Dt FINGER.CONF 5
.Os
.Sh 名称
.Nm finger.conf
.Nd
.Xr finger 1
エイリアス設定ファイル
.Sh 解説
オプションの
.Nm
ファイルは、ローカルおよびネットワーク上のユーザからの finger 対象となりうる
別名を提供するために使用します。
あるユーザのログイン名がそのユーザが好んで使っているメールアドレスと
同一ではない場合、あるいは、finger できるログイン名に仮想のものを
提供したい場合などに有効でしょう。
.Pp
``#'' で始まる行はコメントです。
その他の行には、コロンで区切られたエイリアス名とターゲット名が
含まれていなくてはなりません。
ターゲット名はユーザ、他のエイリアスへの前方参照、あるいは
世界中から読み込み可能なファイルへのパスのいずれかでなくては
なりません。
.Pp
エイリアスがファイルを指している場合、そのエイリアスで finger されたとき
指しているファイルの中身が表示されます。
.Sh 使用例
.Bd -literal
# /etc/finger.conf エイリアス定義ファイル
#
# Format alias:(user|alias)
#
# 個人名のエイリアス
#
markk:mkn
john.smith:dev329
john:dev329
sue:/etc/finger/sue.txt
#
# ネットワークステータスメッセージ
#
status:/usr/local/etc/status.txt
#
# 管理者のリダイレクト
#
root:admin
postmaster:admin
abuse:admin
#
# さしあたり、'sod' はシステム管理者です。
#
admin:sod
.Ed
.Sh 関連ファイル
.Bl -tag -width /etc/finger.conf -compact
.It Pa /etc/finger.conf
.Xr finger 1
エイリアス定義データベース
.El
.Sh 関連項目
.Xr finger 1
.Sh 歴史
.Nm
ファイルのサポートは、Mark Knight <markk@knigma.org> が
提出し、最初に
.Fx 4.2
で登場しました。
