freebsd/freebsd-doc/ja_JP.eucJP/man/man5/forward.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard and
.\"	contributors.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/forward.5,v 1.4 1999/08/28 00:20:44 peter Exp %
.\" jpman %Id: forward.5,v 1.3 1998/04/29 11:32:30 kuma Stab %
.\"
.\" WORD: quote	クォート(単一引用符または二重引用符文字のこと)
.\"
.Dd July 2, 1996
.Dt FORWARD 5
.Os
.Sh 名称
.Nm forward
.Nd メールの転送指示
.Sh 解説
.Nm .forward
ファイルは、ユーザのメールの転送先の
メールアドレスもしくはプログラムのリストを格納します。
このファイルが存在しない場合には、メール転送は行なわれません。
行頭に標準のシェルパイプシンボル (|) を付けることにより、
メールはプログラムの標準入力として転送されます。
引数をコマンドに渡す場合には、行全体をクォートで括る必要があります。
セキュリティ上の理由で、
.Nm .forward
ファイルはメール送付先のユーザもしくは root が所有者である必要があり、
ユーザのシェルが
.Pa /etc/shells
にリストされている必要があります。
.Pp
例えば、
.Nm .forward
ファイルが以下の行を含む場合:
.Bd -literal -offset indent
nobody@FreeBSD.org
"|/usr/bin/vacation nobody"
.Ed
.Pp
メールは
.Ar nobody@FreeBSD.org
に転送され、
単一引数
.Ar nobody
を伴なってプログラム
.Pa /usr/bin/vacation
に転送されます。
.Pp
ローカルユーザのアドレスの前にバックスラッシュ文字が付いている場合、
メールは直接そのユーザのメールスプールファイルに配送され、
更なる転送処理は回避されます。
.Pp
例えば、ユーザ chris の
.Nm .forward
ファイルに次の行を含む場合:
.Bd -literal -offset indent
chris@otherhost
\echris
.Ed
.Pp
メールの一方のコピーは
.Ar chris@otherhost
に転送され、
もう一方のコピーはローカルユーザ chris へのメールとして記録されます。

.Sh 関連ファイル
.Bl -tag -width $HOME/.forward -compact
.It Pa $HOME/.forward

ユーザによる転送指示
.El
.Sh 関連項目
.Xr aliases 5 ,
.Xr mailaddr 7 ,
.Xr sendmail 8
