freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ftpd.conf.5
.\"	$NetBSD: ftpd.conf.5,v 1.19 2002/01/15 02:20:50 wiz Exp $
.\"
.\" Copyright (c) 1997-2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Luke Mewburn.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.Dd December 5, 2001
.Dt FTPD.CONF 5
.Os
.Sh 名称
.Nm ftpd.conf
.Nd
.Xr ftpd 8
設定ファイル
.Sh 解説
.Nm
ファイルには、ユーザが各自のコネクションを認証した
直後に適用される
.Xr ftpd 8
に対する各種の設定オプションを指定します。
.Pp
.Nm
は行の並びからなり、
各行は設定ディレクティブ、コメント、空行からなります。
ファイルの中でより後ろに出現するディレクティブは
その前で定義されたディレクティブの設定を
オーバライドします。
これにより
.Sq wildcard
エントリでデフォルトを定義し、
その後で class 専用のオーバライドを定義することができます。
.Pp
ディレクティブ行の書式は以下のとおりです。
.Dl command class [arguments]
.Pp
.Dq \e
はエスケープ文字です。
この文字はコメント文字の機能をエスケープしたり、
行の最後の文字である場合には設定ディレクティブを
複数行にわたって延長することに使用できます。
.Dq #
はコメント文字であり、この文字から行の最後までの
すべての文字が無視されます (ただしエスケープ文字で
エスケープされていない場合に限ります)。
.Pp
認証される個別のユーザは
.Em class
のメンバであり、
.Xr ftpusers 5
で決定されます。
.Em class
はそのユーザに適用される
.Nm
のエントリを決定するときに使用されます。
.Nm
のエントリを構文解析するときには以下のような
特別な class が存在します。
.Bl -tag -width "chroot" -compact -offset indent
.It Sy all
任意の class にマッチします。
.It Sy none
どの class にもマッチしません。
.El
.Pp
各 class には type があり、以下のうちの1つです。
.Bl -tag -width "CHROOT" -offset indent
.It Sy GUEST
.Dq ( anonymous
か
.Dq ftp
としてのログインによる) ゲスト。
ログイン後に
.Xr chroot 2
が実行されます。
.It Sy CHROOT
.Xr ( ftpchroot 5
による)
.Xr chroot 2
ユーザ。
ログイン後に
.Xr chroot 2
が実行されます。
.It Sy REAL
通常ユーザ。
.El
.Pp
.Xr ftpd 8
の
.Sy STAT
コマンドは、ログインしているユーザの class に対し
.Sy private
ディレクティブが設定されていなければ、
.Nm
で定義される当該ユーザの class 設定を戻します。
.Pp
設定行は以下のいずれかになります。
.Bl -tag -width 4n
.It Sy advertise Ar class Ar host
.It Sy advertize Ar class Ar host
.Ar host
のアドレス (host 名か IP アドレス) を
.Sy PASV
と
.Sy LPSV
コマンドへの応答に通知するアドレスとして
設定します。
これはファイアウォールが設定されている場合には
有用なことがあります。
ただし、通知されるアドレスが接続しているアドレス
と異なっている場合には、
多くの ftp クライアントは機能しません。
.Ar class
が
.Dq none
であるかまたは引数がない場合には、無効になります。
.It Sy checkportcmd Ar class Op Sy off
.Sy PORT
コマンドの正当性を検証します。
指定された IP アドレスが
.Tn ftp
コマンドのコネクションとマッチしない場合や、
リモートの TCP ポート番号が
.Dv IPPORT_RESERVED
より小さい場合には、
.Sy PORT
コマンドは処理に失敗します。
このオプションを使用することを、
.Tn ftp
バウンス攻撃についてセキュリティ上潜在的な問題が
あるサイトについては
.Em 特に、
推奨します。
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合には、この機能は無効になります。
そうでない場合には、有効になります。
.It Sy chroot Ar class Op Sy pathformat
.Ar pathformat
が指定されないか、または
.Ar class
が
.Dq none
である場合には、
デフォルトの動作 (下記参照) を行います。
そうでない場合には、
.Ar pathformat
は構文解析されて、ログイン時に
.Xr chroot 2
でルートディレクトリとされるディレクトリを生成します。
.Pp
.Ar pathformat
は以下のエスケープ文字列を混在できます。
.Bl -tag -width "エスケープ文字列" -offset indent -compact
.It Sy "エスケープ文字"
.Sy 解説
.It "\&%c"
class  名。
.It "\&%d"
ユーザのホームディレクトリ。
.It "\&%u"
ユーザ名。
.It "\&%\&%"
.Dq \&%
文字。
.El
.Pp
デフォルトのルートディレクトリは以下のとおりです。
.Bl -tag -width "CHROOT" -offset indent -compact
.It Sy CHROOT
ユーザのホームディレクトリ。
.It Sy GUEST
.Fl a Ar anondir
が指定された場合は
.Ar anondir ,
を使用します。指定されない場合は、
.Sq ftp
ユーザのホームディレクトリを使用します。
.It Sy REAL
デフォルトでは
.Xr chroot 2
コマンドは実行しません。
.El
.It Sy classtype Ar class Ar type
.Ar class
の class type を
.Ar type
(上記参照) に設定します。
.It Xo Sy conversion Ar class
.Ar suffix Op Ar "type disable command"
.Xc
組込みの自動的なファイル変換を定義します。
取得されるファイル名の末尾が
.Ar suffix
で終わっていて、
.Ar ( suffix
のない) 本当のファイルが存在する場合には、
そのファイルの内容ではなく
.Ar command
の出力が戻されます。
.Pp
.Bl -tag -width "disable" -offset indent
.It Ar suffix
変換を開始させるサフィックスです。
.It Ar type
変換が正当であるファイル型の並びです。
正当な型は
.Sq f
(ファイル) および
.Sq d
(ディレクトリ) です。
.It Ar disable
存在する場合には変換を抑止するファイル名です。
ファイル名が
.Dq Pa \&.
である場合にはこの禁止動作を抑止します (即ち、
変換は常に許可されます)。
.It Ar command
変換を行うコマンドです。
.Xr execv 3
を使用してコマンドを実行するので、
最初の単語はコマンドの完全なパス名を指定してください。
.Ar command
中に出現する全ての単語
.Dq %s
は要求されたファイル (ただし
.Ar suffix
はない) と置換されます。
.El
.Pp
ファイル中の後方で定義された conversion ディレクティブは
同じ suffix で前方にある conversion ディレクティブを
オーバライドします。
.It Sy denyquick Ar class Op Sy off
.Sy PASS
コマンドを受付けた後ではなく、
.Sy USER
コマンドを受付けた後に
.Xr ftpusers 5
ルールを適用します。
この機能を有効にすれば利用可能なアカウント (例えば、
一部のユーザは
.Sy REAL
または
.Sy CHROOT
の class を許可されるが、他の
ユーザは許可されない場合) について情報漏洩が生じるものの、
.Sq ( root
のような) 禁止されたユーザが安全でないコネクションを経由して
パスワードを入力することを予防することに役立ちます。
このオプションは anonymous だけのサービスを実行するサーバに
.Em 特に
推奨します。
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合にはこの機能は無効になります。
そうでない場合には有効になります。
.It Sy display Ar class Op Ar file
.Ar file
が指定されないか、または
.Ar class
が
.Dq none
である場合には、これは無効となります。
そうでない場合には、
ユーザが新しいディレクトリに入る度に、
.Ar file
が存在するか調べ、
存在すればその内容をユーザに表示します。
エスケープシーケンスがサポートされています。
より詳細な情報については
.Xr ftpd 8
の
.Sx Display file escape sequences
を参照してください。
.It Sy homedir Ar class Op Sy pathformat
.Ar pathformat
を指定しないかまたは
.Ar class
が
.Dq none
である場合には、デフォルトの動作 (以下参照) を行います。
そうでない場合には、
.Ar pathformat
は構文解析され、ログイン時に移行するディレクトリを生成したり、
パス名のティルダを展開してユーザの
.Sq ホーム
ディレクトリとして使用するなどされます。
.Ar pathformat
は
.Sy chroot
ディレクティブの場合と同様に構文解析されます。
.Pp
デフォルトのホームディレクトリは
.Sy REAL
ユーザについてはユーザのホームディレクトリであり、
.Sy GUEST
や
.Sy CHROOT
ユーザについては
.Pa /
ディレクトリとなります。
.It Xo Sy limit Ar class
.Ar count Op Ar file
.Xc
.Ar class
の同時実行するコネクションの最大数を
.Ar count
に制限します。
.Sq 0
で無制限な数のコネクションを指定します。
制限が超過していて
.Ar file
が指定されていれば、その内容をユーザに表示します。
.Ar class
が
.Dq none
であるかまたは
.Ar count
が指定されていない場合には、無効となります。
.Ar file
が相対パスである場合には、
.Pa /etc
ディレクトリ (ただし、これは
.Fl c Ar confdir
でオーバライドできます) から探索されます。
.It Sy maxfilesize Ar class Ar size
アップロードされるファイルの最大長を
.Ar size
に設定します。
.Ar class
が
.Dq none
であるかまたは引数が指定されない場合には、無効となります。
.It Sy maxtimeout Ar class Ar time
クライアントがリクエストできる最大のタイムアウト時間を設定します。
デフォルトは 2 時間です。
この時間は 30 秒以下にはできず、また
.Sy timeout
値以下にもできません。
.Ar class
が
.Dq none
であるかまたは
.Ar time
が指定されない場合には、デフォルトである 2 時間に設定されます。
.It Sy modify Ar class Op Sy off
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合には、次のコマンドを無効にします :
.Sy CHMOD ,
.Sy DELE ,
.Sy MKD ,
.Sy RMD ,
.Sy RNFR ,
.Sy UMASK .
そうでない場合には、これらのコマンドを有効にします。
.It Sy motd Ar class Op Ar file
.Ar file
が指定されないかまたは
.Ar class
が
.Dq none
である場合には、無効となります。
そうでない場合には、
.Ar file
をログイン後に表示する「今日の連絡事項 (the message of the day)」
ファイルとして使用します。
エスケープシーケンスがサポートされます。
より詳細な情報については
.Xr ftpd 8
の
.Sx Display file escape sequences
を参照してください。
.Ar file
が相対パスである場合には、
.Pa /etc
ディレクトリ (ただし、これは
.Fl c Ar confdir
でオーバライドできます) から探索されます。
.It Sy notify Ar class Op Ar fileglob
.Ar fileglob
が指定されないかまたは
.Ar class
が
.Dq none
である場合には、無効となります。
そうでない場合には、ユーザが新しいディレクトリに入る度に
.Ar fileglob
にマッチする任意のファイルをユーザに告知します。
.It Sy passive Ar class Op Sy off
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合には、パッシブコネクション
.Sy ( PASV ,
.Sy LPSV ,
.Sy EPSV )
を無効にします。
そうでない場合には、有効にします。
.It Sy portrange Ar class Ar min Ar max
パッシブなデータポートに使用されるポート番号の範囲を設定します。
.Ar max
は
.Ar min
より大きくなければなりません。
どちらの番号も
.Dv IPPORT_RESERVED
(1024) と 65535
の間でなければなりません。
.Ar class
が
.Dq none
であるかまたは引数が指定されない場合には、無効となります。
.It Sy private Ar class Op Sy off
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合は、
.Sy STAT
コマンドの出力の中に class 情報を表示しません。
そうでない場合には、 class 情報を表示します。
.It Sy rateget Ar class Ar rate
.Ar class
に対する
get
.Pq Sy RETR
最大転送速度のスロットルを毎秒
.Ar rate
バイトに設定します。
.Ar rate
が 0 である場合には、スロットルは無効になります。
.Ar class
が
.Dq none
であるかまたは引数が指定されない場合には、無効になります。
.Pp
オプションのサフィックスを付加して、
.Ar rate
の解釈を以下のように変更できます。
.Bl -tag -width 3n -offset indent -compact
.It b
変更はありません。
(デフォルト、省略可)
.It k
キロ。引数を 1024 倍します。
.It m
メガ。引数を 1048576 倍します。
.It g
ギガ。引数を 1073741824 倍します。
.It t
テラ。引数を 1099511627776 倍します。
.El
.It Sy rateput Ar class Ar rate
.Ar class
に対する put
.Pq Sy STOR
最大転送速度のスロットルを毎秒
.Ar rate
バイトに設定します。
.Ar rate
は
.Sy rateget Ar rate
の場合と同様に構文解析されます。
.Ar class
が
.Dq none
であるかまたは引数が指定されない場合には、無効になります。
.It Sy sanenames Ar class Op Sy off
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定される場合には、
アップロードされるファイル名に
ファイル名として正当な任意の文字を含めることができます。
そうでない場合には、
.Sq \&.
で始まらず、かつ集合
.Dq [-+,._A-Za-z0-9]
の要素である文字からだけ構成されるファイル名を許可します。
.It Sy template Ar class Op Ar refclass
.Ar refclass
を
.Ar class
の
.Sq テンプレート
として定義します。
以降のディレクティブで行われる
.Ar refclass
へのいかなる参照も
.Ar class
のメンバに適用されます。
共通の属性を共有すべき他のクラスを
不必要な重複なしに容易に定義できるため、
このようにしてテンプレートクラスを定義することは有用です。
1 度にただ 1 つのテンプレートを定義することが可能です。
.Ar refclass
が指定されない場合には、
.Ar class
に対するテンプレートは無効になります。
.It Sy timeout Ar class Ar time
無活動のタイムアウト時間を設定します。
(デフォルトは 15 分です。)
これは 30 秒以下にはできず、また
.Sy maxtimeout
値以上にもできません。
.Ar class
が
.Dq none
であるかまたは
.Ar time
が指定されない場合には、デフォルトである 15 分に設定されます。
.It Sy umask Ar class Ar umaskval
umask に
.Ar umaskval
を設定します。
.Ar class
が
.Dq none
であるかまたは
.Ar umaskval
が指定されない場合には、デフォルトである
.Li 027
に設定されます。
.It Sy upload Ar class Op Sy off
.Ar class
が
.Dq none
であるかまたは
.Sy off
が指定された場合には、
修正コマンド
.Sy CHMOD ,
.Sy DELE ,
.Sy MKD ,
.Sy RMD ,
.Sy RNFR ,
.Sy UMASK
に加え、次のコマンドが無効になります :
.Sy APPE ,
.Sy STOR ,
.Sy STOU
。
その他の場合には、これらのコマンドは有効になります。
.El
.Sh デフォルト
以下のデフォルトを使用します。
.Pp
.Bd -literal -offset indent -compact
checkportcmd  all
classtype     chroot CHROOT
classtype     guest  GUEST
classtype     real   REAL
display       none
limit         all    -1     # 無制限な数のコネクション
maxtimeout    all    7200   # 2 時間
modify        all
motd          all    motd
notify        none
passive       all
timeout       all    900    # 15 分
umask         all    027
upload        all
modify        guest  off
umask         guest  0707
.Ed
.Sh 関連ファイル
.Bl -tag -width /usr/share/examples/ftpd/ftpd.conf -compact
.It Pa /etc/ftpd.conf
このファイル。
.It Pa /usr/share/examples/ftpd/ftpd.conf
.Nm
のサンプルファイル。
.El
.Sh 関連項目
.Xr ftpchroot 5 ,
.Xr ftpusers 5 ,
.Xr ftpd 8
.Sh 歴史
.Nm
の機能は、Simon Burge の業績に基づき、Luke Mewburn が
.Nx 1.3
および以降のリリースに実装しました。
.\" Translated by Tetsuro Furuya <ht5t-fry@asahi-net.or.jp> , Oct., 2002.
.\" Checked by Kazuo Horikawa <horikawa@jp.FreeBSD.org>  , Oct., 2002.
