freebsd/freebsd-doc/ja_JP.eucJP/man/man5/groff_font.5
.ig
Copyright (C) 1989-1995, 2001, 2002, 2003 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.
.de TQ
.br
.ns
.TP \\$1
..
.
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.de Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\"
.\" $FreeBSD$
.\"
.\" FreeBSD jpman project 訳語表
.\" WORD: machine unit	マシン単位
.\" WORD: scaled point	スケールドポイント (troff.1 の記述にあわせた)
.\" WORD: font position	フォント位置 (troff.1 の記述にあわせた)
.\" WORD: mount		マウント
.\"
.
.
.TH GROFF_FONT 5 "1 May 2003" "Groff Version 1.19"
.
.
.SH 名称
groff_font \- groff のデバイスとフォントを記述するファイルの書式
.
.
.SH 解説
groff のフォントの書式は ditroff のフォントの書式に対し、
ほぼスーパセットになっています。
.
.I name
というデバイス用のフォントファイルは、
.BI dev name
というディレクトリに納められます。
.
ファイルには 2 つの種類があります: それは
.B DESC
と呼ばれるデバイス記述ファイルと、各フォント
.I F
ごとに存在する
.IR F
と呼ばれるフォントファイルです。
.
これらはテキストファイルで、ditroff のフォントの書式とは異なり、
対応したバイナリフォーマットはありません。
.
.
.SS DESC ファイルの書式
.
DESC ファイルは、以下の形式の行を含んでいます:
.
後から出てきた項目は、それ以前の値を上書きします。
.
.TP
.B charset
この行とその後に続くファイル内の行はすべて無視されます。
.
これは下位互換性のために残されています。
.
.TP
.BI family\  fam
デフォルトのフォントファミリは
.IR fam
です。
.
.TP
.BI fonts\  n\ F1\ F2\ F3\|.\|.\|.\|Fn
フォント
.I F1\|.\|.\|.\|Fn
がフォント位置
.IR m +1,\|.\|.\|., m + n
にマウントされます。
ここで
.I m
はスタイル数です。
.
このコマンドは複数行にわたって続けることができます。
.
.B 0
というフォント名を指定すると、
対応するフォント位置にはフォントはマウントされません。
.
.TP
.BI hor\  n
水平解像度は
.I n
マシン単位です。
.
.TP
.BI paperheight\  n
出力メディアの、マシン単位での物理的な垂直方向の長さです。
.
これは
.B troff
自体ではなく、出力デバイスによって使用されます。
.
この項目の使用はお勧めしません。
.
代わりに
.B papersize
を使用してください。
.
.TP
.BI papersize\  string
紙サイズを選択します。
.
.I string
に有効な値は、ISO の紙タイプである A0-A7, B0-B7, C0-C7, D0-D7, DL と、
US で使われている紙タイプである letter, legal, tabloid, ledger,
statement, executive, com10, monarch です。
.
.IR string
が定義済みの紙タイプであった場合、大文字小文字は重要ではありません。
.
別の指定方法として、
.I string
にはファイル名 (例えば\& `/etc/papersize') を指定できます。
このファイルをオープンできると、
.B groff
は最初の行を読み取り、上記の紙サイズを検査します。
.
最後の方法としては、
.I string
には
.IB length , width
(コンマの前後に空白は入れられません)
の書式で、自由に紙サイズを指定できます。
.
.I length
と
.I width
のどちらにも、単位がついてなければなりません。
有効な値は、インチを表す 'i'、センチメートルを表す 'c'、
ポイントを表す 'p'、パイカを表す 'P' です。
.
例:
.BR 12c,235p
。
.
数字から始まる引数は、常に自由な紙サイズ指定の書式として扱われます。
.
.B papersize
は、出力メディアの垂直方向と水平方向の両方の長さを設定します。
.
.IP
2 つ以上の引数を指定することもできます。
.B groff
は左から右へ走査し、最初の有効な指定を使用します。
.
.TP
.BI paperwidth\  n
出力メディアの、マシン単位での物理的な水平方向の長さです。
.
この項目の使用はお勧めしません。
.
代わりに
.B papersize
を使用してください。
.
これは
.B troff
自体ではなく、出力デバイスによって使用されます。
.
.TP
.B pass_filenames
troff がドライバに対して、処理しているソースファイル名を伝えるようにします。
これは、別の tcommand にて実現されます:
.B F
.IR filename
。
.
.TP
.BI postpro\  program
.I program
を後処理プログラムとして使用します。
.
.TP
.BI prepro\  program
.I program
をプリプロセッサとして呼び出します。
.
.TP
.BI print\  program
.I program
を、印刷用のスプーラプログラムとして使用します。
省略された場合、
.B groff
の
.B \-l
と
.B \-L
オプションは無視されます。
.
.TP
.BI res\  n
1 インチあたりのマシン単位は
.I n
です。
.
.TP
.BI sizes\  s1\ s2\|.\|.\|.\|sn\  0
デバイスが、
.IR s1 ,
.IR s2 ,\|.\|.\|.\| sn
スケールドポイントのフォントを持つことを表します。
.
大きさのリストは
.BR 0
で終らなければなりません。
.
各
.I si
は、大きさの範囲
.IR m \- n
と指定することもできます。
.
リストは複数行にわたって続けることも可能です。
.
.TP
.BI sizescale\  n
ポイント数への倍率を指定します。
.
デフォルトの値は 1 です。
.
1
.I スケールドポイント
は、1
.RI ポイント/ n
と等しくなります。
.
.B unitwidth
コマンドと
.B sizes
コマンドへの引数は、スケールドポイントで指定されます。
.
.TP
.BI styles\  S1\ S2\|.\|.\|.\|Sm
先頭
.I m
個のフォント位置が、スタイル
.IR S1\|.\|.\|.\|Sm
に関連づけられます。
.
.TP
.B tcommand
後処理プログラムが
.B t
と
.B u
の出力コマンドを扱えることを表します。
.
.TP
.BI unitwidth\  n
ポイントサイズが
.I n
スケールドポイントのフォントに対して、
フォントファイル中の数量をマシン単位で与えます。
.
.TP
.B use_charnames_in_special
このコマンドは、特殊コマンドにおいて、
名前の付いている文字を troff がエンコードすべきであることを指定します。
.
.TP
.BI vert\  n
垂直解像度は
.I n
マシン単位です。
.
.LP
.BR res ,
.BR unitwidth ,
.BR fonts ,
.B sizes
の行は必須です。
.
DESC ファイル中のすべてのコマンドが、
.B troff
自体で使用されるわけではありません。
いくつかのキーワードは (付加的なものでさえも)、
後処理プログラムによって、デバイスに関する任意の情報を
保持しておくために使用されます。
.
.LP
次に示すのは旧式のキーワードであり、
.B groff
が認識はしますが、完全に無視するもののリストです:
.BR spare1 ,
.BR spare2 ,
.BR biggestfont
。
.
.
.SS フォントファイルの書式
.
フォントファイルには 2 つのセクションがあります。
最初のセクションは、空白で区切られた単語が並んだ一連の行からなります。
行の最初の単語はキーで、以降の単語はそのキーに対する値となります。
.
.TP
.BI ligatures\  lig1\ lig2\|.\|.\|.\|lign\ \fR[ 0 \fR]
文字
.IR lig1 ,
.IR lig2 ,\ \|.\|.\|.,\ lign
は合字 (リガチャ; ligature) です。合字には
.BR ff ,
.BR fi ,
.BR fl ,
.BR ffi ,
.BR ffl
が使用可能です。
.
下位互換性のために、合字のリストは
.BR 0
で終ってもかまいません。
.
合字のリストは複数行にわたってはいけません。
.
.TP
.BI name\  F
フォントの名前は
.IR F
です。
.
.TP
.BI slant\  n
フォントの文字が
.I n
度傾斜していることを表します
.
(正の値は進行方向を意味します)。
.
.TP
.BI spacewidth\  n
空白の通常の幅は
.IR n
です。
.
.TP
.B special
フォントは
.IR 特殊
です。
これは、現在のフォントに存在しない文字が要求された場合、
マウントされているすべての特殊フォントが検索されることを示しています。
.
.LP
他のコマンドは
.B troff
には無視されますが、後処理プログラムによって、
フォントに関する任意の情報をフォントファイルに保持しておくために
使用されるかもしれません。
.
.LP
最初のセクションには、
.B #
文字で始まり行末まで続くコメントを入れることができます。
.
.LP
2 番目のセクションには 1 つか 2 つのサブセクションが含まれます。
.
.I charset
サブセクションは必須で、
.I kernpairs
サブセクションはオプションです。
.
これらのサブセクションは任意の順番で書くことができます。
.
各サブセクションは、サブセクション名のみからなる行から始まります。
.
.LP
単語
.B charset
によって charset サブセクションが開始されます。
.
.B charset
行には一連の行が続きます。
.
各行は 1 文字の情報を提供します。
.
行は空白かタブにより区切られたいくつかのフィールドからなります。
.
書式は
.
.IP
.I
.I name metrics type code
.RI [ entity_name ]
.RB [ --
.IR comment ]
.
.LP
で、
.I name
は文字を識別します:
.I name
が単一の文字
.I c
ならば、それは groff の入力文字
.I c
を表します。
.BI \[rs] c
という形式で c が単一の文字なら、特殊文字
.BI \[rs][ c ]\fR
を表します。
それ以外は groff の入力文字
.BI \[rs][ name ]\fR
を表します。
.
これが厳密に 2 文字の
.I xx
ならば、
.BI \[rs]( xx\fR
として入力されます。
.
単一の特殊文字は、
.BI \[rs] c\fR
のように利用できないことに注意してください。
唯一の例外は `\[rs]-' で、これは `\[rs][-]' と同一です。
.
.B \-\-\-
という name は特別で、その文字に名前が無いことを表します。
そのような文字は
.BR troff
中でエスケープシーケンス
.B \[rs]N
によってのみ使われます。
.
.LP
groff は 8 ビット文字に対応していますが、いくつかのユーティリティでは
8 ビット文字を扱うのが困難です。
.
このような理由から、文字コードが
.IR n
である単一の文字と等価な
.BI char n
という表記法が存在します。
.
例えば、
.B char163
は文字コード 163 の文字と等価であり、
これは ISO Latin-1 で英国ポンド記号を表します。
.
.LP
.I type
フィールドは文字の種類を示します:
.
.TP
1
は descender (ベースラインより下にはみ出した部分) を持つ
文字であることを表します。例えば p があてはまります。
.
.TP
2
は ascender (x の高さより上に出る部分) を持つ文字であることを表します。
例えば b があてはまります。
.TP
.
3
は ascender と descender の両方を持つ文字であることを表します。
例えば ( があてはまります。
.
.LP
.I code
フィールドは、後処理プログラムが文字を印字するために使うコードを示します。
.
.B \[rs]N
というエスケープシーケンスにより、
このコードを使って groff に文字を入力することもできます。
.
code はどんな整数でもかまいません。
.
.B 0
から始まると 8 進数として扱われ、
.B 0x
や
.B 0X
で始まると 16 進数として扱われます。
.
しかし、エスケープシーケンス
.B \[rs]N
は 10 進整数しか受け付けないことに注意してください。
.
.LP
.I entity_name
フィールドは、グリフを識別する ASCII 文字列を与えます。
このグリフは、後処理を行うプログラムが文字の印刷に使用します。
.
このフィールドは省略可能であり、
html ドライバが文字集合をエンコード可能とするために導入されました。
.
例えば、文字 `\[rs][Po]' は、html\~4.0 では `&pound;' と表現されます。
.
.LP
行の code フィールド以降と、`-\&-' の後ろは、すべて無視されます。
.
.LP
.I metrics
フィールドの形式は次のようになります
(これは 1 行に書きますが、ここでは読みやすさのために行を分けています):
.IP
.IR width [\fB, height [\fB, depth [\fB, italic-correction
.br
.RI [\fB, left-italic-correction [\fB, subscript-correction ]]]]]
.
.LP
サブフィールド間には空白を入れてはいけません。
.
サブフィールドが存在しない場合は 0 として扱われます。
.
サブフィールドは全て 10 進数の整数で指定されます。
.
対応するバイナリフォーマットが存在しないので、
ditroff のようにこれらの値を
.B char
型変数の範囲に合わせる必要はありません。
.
サブフィールド
.I width
では文字の幅を指定します。
.
サブフィールド
.I height
では文字の高さを指定します (上が正)。
文字がベースラインよりも上にいかない場合、負の高さを持つのではなく
高さが 0 であるとします。
.
サブフィールド
.I depth
では文字の深さを指定します。これはベースラインから文字の一番下までの
長さです (下が正)。
文字がベースラインより下に出ていない場合、負の深さを持つのではなく
深さが 0 であるとします。
.
サブフィールド
.I italic-correction
では、直後にローマンフォントの文字が続く時に、文字の後に加えられる空白の
量を指定します。
.
サブフィールド
.I left-italic-correction
では、直前にローマンフォントの文字がある時に、文字の前に加えられる空白の
量を指定します。
.
サブフィールド
.I subscript-correction
では、添字 (subscript) を加える際に文字の後に加えられる空白の量を
指定します。
.
これはイタリック補正 (上記の italic-correction) よりは少なくなければ
なりません。
.
.LP
charset セクション内では、以下のような書式の行も可能です
.
.IP
.I
name \fB"
.
.LP
これは、
.I name
が前の行で言及した文字の別名であることを表します。
.
.LP
kernpairs セクションは
.B kernpairs
という単語から始まります。
.
このセクションは以下のような書式の行からなります:
.
.IP
.I c1 c2 n
.
.LP
文字
.I c1
が文字
.I c2
の次に現れる時には、それらの間の空白に
.IR n
を加えることを意味します。
.
kernpairs セクションのほとんどのエントリは
.IR n
に負の値を持つことになります。
.
.
.SH 関連ファイル
.
.Tp \w'/usr/share/groff_font/devname/DESC'u+3n
.BI /usr/share/groff_font/dev name /DESC
デバイス
.IR name
用のデバイス記述ファイル
.
.TP
.BI /usr/share/groff_font/dev name / F
デバイス
.IR name
のフォント
.I F
用のフォントファイル
.
.
.SH 関連項目
.
.BR groff_out (5),
.BR troff (1)
.
.\" Local Variables:
.\" mode: nroff
.\" End:
