freebsd/freebsd-doc/ja_JP.eucJP/man/man5/groff_out.5
'\" e
.\" The above line should force the use of eqn as a preprocessor
.\" $FreeBSD$
.ig
Copyright (C) 1989-2000, 2001 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.

	%FreeBSD: src/contrib/groff/man/groff_out.man,v 1.3.2.2 2001/04/26 17:34:26 ru Exp %

..
.\" This man page must be preprocessed with eqn.
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/groff_out.5,v 1.10 2001/04/30 03:48:35 horikawa Exp $
.\"
.\" FreeBSD jpman project 訳語表
.\" WORD: scaled point		スケールドポイント (troff.1, groff_font.5 参照)
.\" WORD: special character	特殊文字 (troff.1 参照)
.\" WORD: special font		スペシャルフォント (troff.1 参照)
.\" WORD: machine unit		マシン単位 (pic.1, groff_font.5 参照)
.\" WORD: print			印字
.ie \n(.g .ds ic \/
.el .ds ic \^
.TH GROFF_OUT 5 "26 April 2001" "Groff Version 1.17"
.SH 名称
groff_out \- groff の中間出力フォーマット
.SH 解説
このマニュアルページは、GNU troff の出力フォーマットについて記述します。
GNU troff が使用する出力フォーマットは、
UNIX のデバイス非依存 troff が使用するものと似ています。
ここでは両者の差のみを記述します。
.LP
.B s
コマンドへの引数はスケールドポイントです (これは
.IR ポイント/ n
を意味します。
.I n
は DESC ファイル中の
.B sizescale
コマンドへの引数です)。
.B x\ Height
コマンドへの引数もまたスケールドポイントです。
.LP
最初の 3 つの出力コマンドは次のようになっていなければなりません:
.IP
.BI x\ T\  device
.br
.BI x\ res\  n\ h\ v
.br
.B x init
.LP
DESC ファイル中に
.B tcommand
行が存在する場合には、troff は以下の 2 つのコマンドを使用します。
.TP
.BI t xxx
.I xxx
は、任意の文字のシーケンスであり、空白または改行を終端とします;
最初の文字を現在位置で印字し、
現在の水平位置を最初の文字の幅だけ増加させます。
続けて、同じ処理を各文字に対して実行します。
文字の幅は、フォントファイルにおいて与えられたものを
現在のポイントサイズに応じて適切にスケーリングしてから、
水平解像度の倍数となるように丸めます。
特殊文字はこのコマンドでは印字できません。
.TP
.BI u n\ xxx
.B t
コマンドと同様ですが、各文字の印字後に現在の水平位置に加えられるものが、
文字幅と
.IR n
の和である点が違います。
.LP
単一文字は 8 ビット目がセットされていてもかまわないことに注意してください。
これはフォント名や特殊文字名にもあてはまります。
.LP
文字名やフォント名は任意の長さが許されます;
ドライバはこれらの長さが 2 文字のみであると仮定してはなりません。
.LP
文字を印字する時、その文字は常に現在のフォント中に存在します。
デバイス非依存 troff とは異なり、
ドライバがスペシャルフォントから文字を探す必要はありません。
.LP
.B x
デバイス制御コマンドが、拡張されました。
.TP
\fBx u \fIn\fR
.I n
が\~1 の場合、空白の下線付けを開始します。
.I n
が\~0 の場合、空白の下線付けを停止します。
これは、nroff モードの
.B cu
リクエストで必要であり、他の場合には無視されます。
.LP
.B D
描画コマンドは拡張されています。
.B \-n
オプション指定時には、GNU pic はこれらの拡張を使用しません。
.TP
\fBDf \fIn\fR\*(ic\en
オブジェクトの塗り潰しに使用する陰影を
.IR n
に設定します; ここで
.I n
は 0 から 1000 の範囲の整数である必要があり、0 は白の塗り潰しを、
1000 は黒の塗り潰しを、
そしてそれらの間の値は中間の陰影を意味します。
この設定は、円の塗り潰し、楕円の塗り潰し、多角形の塗り潰しにのみ適用されます。
デフォルトでは 1000 が使用されます。
塗り潰しオブジェクトが色を持つ場合、
その色でそのオブジェクトの下の全てのものを完全に隠します。
1000 より大きい値や 0 より小さい値も使用される可能性があります:
これらの値を指定すると、
現在線やテキストで使用している陰影で塗り潰すことを意味します。
通常はこれは黒ですが、
ドライバによってはこれを変更する手段を提供するものがあります。
.TP
\fBDC \fId\fR\*(ic\en
現在位置を最左端とする、半径
.I d
の塗り潰された円を描画します。
.TP
\fBDE \fIdx dy\fR\*(ic\en
現在位置を最左端とする、水平半径
.I dx
垂直半径
.I dy
の塗り潰された楕円を描画します。
.EQ
delim $$
.EN
.TP
\fBDp\fR $dx sub 1$ $dy sub 1$ $dx sub 2$ $dy sub 2$ $...$ $dx sub n$ $dy sub n$\en
$i = 1 ,..., n+1$ に対し、
.I i
番目の頂点を現在位置
$+ sum from j=1 to i-1 ( dx sub j , dy sub j )$
とする多角形を描画します。
今のところ、GNU pic のみがこのコマンドを使用し、三角形と矩形を生成します。
.TP
\fBDP\fR $dx sub 1$ $dy sub 1$ $dx sub 2$ $dy sub 2$ $...$ $dx sub n$ $dy sub n$\en
.B Dp
と同様ですが、多角形の外形のみの描画でなく、塗り潰しも行います。
.TP
\fBDt \fIn\fR\*(ic\en
現在の線の太さを
.I n
マシン単位に設定します。
伝統的に UNIX troff ドライバは、
現在のポイントサイズに比例する線の太さを使用します;
.B Dt
コマンドが指定されない場合や、
.B Dt
コマンドに負の
.IR n
が指定された場合は、ドライバはこの方法を使用する必要があります。
.I n
に 0 を指定すると、利用可能な最小の線の太さを選択します。
.LP
これらのコマンドを実行した後、
現在位置をどのように変更するのかという問題が生じます。
GNU pic が生成するコードはこの問題に依存しませんので、
これはたいして重要ではありません。
.IP
\fB\eD\(fm\fIc\fR $x sub 1$ $y sub 1$ $x sub 2$ $y sub 2$ $...$ $x sub n$ $y sub n$\(fm
.LP
の形式、ただし
.I c
は
.BR c ,
.BR e ,
.BR l ,
.BR a ,
.BR ~
のいずれでもない描画コマンドが与えられた時、
UNIX troff は各 $x sub i$ を水平の単位で扱い、$y sub i$ を垂直の単位で扱い、
描画されるオブジェクトの幅は $sum from i=1 to n x sub i$ であり、
高さは $sum from i=1 to n y sub i$ であると仮定します。
(高さに関する仮定は、このような
.B D
コマンドを \ew エスケープシーケンス中で使用した後、
.B st
レジスタおよび
.B sb
レジスタを検査することにより確認できます。)
この規則は全てのオリジナルの描画コマンドにあてはまりますが、
.B De
は例外です。
.BR Df ,
.B Dt
コマンドや、影響は少ないですが
.B DE
コマンドにおいて、たとえ醜い結果となったとしても、
GNU troff もまた互換性のためにこの規則に従います。
それゆえ、
.IP
\fBD\fIc\fR $x sub 1$ $y sub 1$ $x sub 2$ $y sub 2$ $...$ $x sub n$ $y sub n$\en
.LP
の形式の
.B D
コマンドを実行した後は、現在位置は
$( sum from i=1 to n x sub i , sum from i=1 to n y sub i )$
だけ増えます。
.LP
.B x\ X
コマンドへの引数に改行を含めることを許すという、
継続に関する取り決めがあります:
.B x\ X
コマンドへの引数を出力する時、GNU troff は
引数中の
.B +
文字付きの改行を辿ります
(通常は改行で引数全体が終端されます);
それゆえ、
.B x\ X
コマンドを含む行の次行が
.B +
で開始する場合には、
.B x\ X
コマンドを含む行の終端となっている改行は
.B x\ X
コマンドへの引数の一部として扱い、
.B +
を無視し、行の
.B +
に続く部分を
.B x\ X
コマンドに続く行の部分として扱います。
.SH "関連項目"
.BR groff_font (5)
.\"
.\" Local Variables:
.\" mode: nroff
.\" End:
