freebsd/freebsd-doc/ja_JP.eucJP/man/man5/group.5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)group.5	8.3 (Berkeley) 4/19/94
.\"	%Id: group.5,v 1.4.2.2 1998/06/28 21:34:26 hoek Exp %
.\" jpman $Id: group.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.\"
.Dd September 29, 1994
.Dt GROUP 5
.Os
.Sh 名称
.Nm group
.Nd グループ許可ファイルのフォーマット
.Sh 解説
.Aq Pa /etc/group
ファイルは改行で区切られた
.Tn ASCII
レコードから成ります。1 レコードが 1 グループに対応し、コロン
.Ql \&:
で区切られた 4 つの欄から成ります。
これらの欄の意味は以下のとおりです:
.Bl -tag -width password -offset indent -compact
.It group
そのグループの名前。
.It passwd
グループの
.Em 暗号化された
パスワード。
.It gid
そのグループの 10 進数 ID。
.It member
グループメンバ。
.El
.Pp
.Ar group
欄は、そのグループのメンバであるユーザにファイルアクセスを許可するために
用いる、グループの名前です。
.Ar gid
欄はそのグループ名に結び付けられた番号です。両者はファイルアクセスを制御
しますので、システム (またしばしば複数システムの 1 グループ) 中で一意的で
ある必要があります。
.Ar passwd
欄はなくてもいい
.Em 暗号化された
パスワードです。この欄はめったに用いられるこ
とはなく、通常ブランクにしておくよりもむしろアスタリスクが置かれます。
.Ar member
欄は
.Ar group
の権利を許可されたユーザの名前を含んでいます。メンバ名は空白や改行なし
にコンマで区切られます。ユーザの
.Pa /etc/passwd
エントリ中にグループが指定されていれば自動的にそのグループに入ることに
なりますので、
.Pa /etc/group
ファイル中にそのユーザを追加する必要はありません。
.\" .Pp
.\" When the system reads the file
.\" .Pa /etc/group
.\" the fields are read into the structure
.\" .Fa group
.\" declared in
.\" .Aq Pa grp.h :
.\" .Bd -literal -offset indent
.\" struct group {
.\"	char    *gr_name;        /* group name */
.\"	char    *gr_passwd;      /* group password */
.\"	int     gr_gid;          /* group id */
.\"	char    **gr_mem;        /* group members */
.\" };
.\" .Ed
.Sh YP/NIS との相互作用
.Pa /etc/group
ファイルは YP/NIS グループデータベースを有効にするように作成可能です。
C ライブラリ内部としては、
.Ar name
欄が 1 つのプラス符号 (`+') に続く 1 つのグループ名から成るエントリは、
その名前のグループに対する YP/NIS グループエントリで置き換えられます。
.Ar name
欄が引き続いてグループ名を持たない 1 つのプラス符号から成るエントリは、
YP/NIS の
.Dq Li group.byname
マップ全体で置き換えられます。
.Pp
何らかの理由で YP/NIS グループデータベースが有効になった場合、
少数のグループのみが有効であるときですら、全ての逆検索 (すなわち
.Fn getgrgid
) ではデータベース全体を利用することになるでしょう。それ故、
.Fn getgrgid
が返すグループ名が正しい前方マッピングを持つことは保証できません。
.Sh 制限
1 つのグループは 200 以上のメンバを持つことはできません。
.Pa /etc/group
の最大行長は 1024 文字です。それより長い行は読み飛ばされます。
.Sh 関連ファイル
.Bl -tag -width /etc/group -compact
.It Pa /etc/group
.El
.Sh 関連項目
.Xr passwd 1 ,
.Xr setgroups 2 ,
.Xr crypt 3 ,
.Xr getgrent 3 ,
.Xr initgroups 3 ,
.Xr yp 4 ,
.Xr passwd 5
.Sh バグ
.Xr passwd 1
コマンドは
.Nm group
パスワードを変更しません。
.Sh 歴史
.Nm
ファイルフォーマットは
.At v6
で現われました。
YP/NIS の機能は
.Tn SunOS
を手本に作られ、
.Tn FreeBSD
1.1 で初めて現われました。
