freebsd/freebsd-doc/ja_JP.eucJP/man/man5/hosts.lpd.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: hosts.lpd.5,v 1.3 1997/03/07 03:28:02 jmg Exp %
.\" jpman %Id: hosts.lpd.5,v 1.3 1998/04/29 11:35:23 kuma Stab %
.\"
.\" WORD: trusted host	信頼できるホスト
.\"
.Dd June 1, 1996
.Dt HOSTS.LPD 5
.Os FreeBSD
.Sh 名称
.Nm hosts.lpd
.Nd ローカルプリントサービスを使用可能な信頼できるホスト
.Sh 解説
.Nm hosts.lpd
ファイルは、あなたのマシンのローカルプリントサービスを許可するホストの
ホスト名もしくは IP アドレスのリストを含みます。
ホスト名および IP アドレスは、各々 1 行に 1 つずつ記述します。
.Sh 関連ファイル
.Bl -tag -width /etc/hosts.lpdxxxxx -compact
.It Pa /etc/hosts.lpd
.Nm hosts.lpd
ファイルは
.Pa /etc
にあります。
.Sh 関連項目
.Xr printcap 5 ,
.Xr lpd 8 .
