freebsd/freebsd-doc/ja_JP.eucJP/man/man5/hosts.equiv.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/hosts.equiv.5,v 1.10.2.1 2000/12/08 14:59:16 ru Exp %
.\"
.\" jpman %Id: hosts.equiv.5,v 1.3 1998/06/12 11:02:12 mutoh Stab %
.Dd February 11, 1996
.Dt HOSTS.EQUIV 5
.Os FreeBSD
.Sh 名称
.Nm hosts.equiv ,
.Nm .rhosts
.Nd 信頼できるリモートホスト名、およびユーザのデータベース
.Sh 解説
.Nm
および
.Nm .rhosts
ファイルは、ネットワーク上の信頼できるホストとユーザに関する情報を格納
します。
各ホストに対して、1つの行に以下の情報を与えます。

単純に
.Bd -unfilled -offset indent
hostname [username]
.Ed

あるいは、より冗長に以下のようにします。
.Bd -unfilled -offset indent
[+-][hostname|@netgroup] [[+-][username|@netgroup]]
.Ed
.Pp
.Dq @
は netgroup というグループによってホスト、またはユーザを表します。
単独の
.Dq +
は全てのホスト、またはユーザと一致します。前に
.Dq -
を伴うホスト名は、一致する全てのホストとそのホスト上の全ての
ユーザを拒否します。
前に
.Dq -
を伴うユーザ名は、指定されたホスト上の一致したユーザ全てを拒否します。
.Pp
各項目は任意の数の空白やタブ文字で区切られます。
.Dq #
はコメントの開始を表し、これ以降の行末までの文字はこのファイルを
検索するルーチンによって解釈されません。
.Pp
ホスト名は、インターネットアドレス操作ライブラリ
.Xr inet 3
の
.Xr inet_addr 3
ルーチンを用いた伝統的な
.Dq \&.
(ドット) 表記で指定されます。
ホスト名は、フィールド区切り文字、改行、およびコメント文字
以外のあらゆる印字可能文字を含むことができます。
.Pp
セキュリティ上の理由から、ユーザの
.Nm .rhosts
が通常ファイルでないか、所有者がそのユーザでないか、あるいはその
ユーザ以外のユーザが書き込み可能な場合、そのファイルは無視されます。
.Sh 使用例
.Pp
.Dl bar.com foo
.Pp
ホスト
.Dq bar.com
のユーザ
.Dq foo
を信頼します。
.Pp
.Dl +@allclient 
.Pp
ネットグループ
.Dq allclient
の全てのホストを信頼します。
.Pp
.Dl +@allclient -@dau
.Pp
ネットグループ
.Dq allclient
の全てのホストとそのユーザを信頼しますが、
ネットグループ
.Dq dau
のユーザは例外です。
.Sh 関連ファイル
.Bl -tag -width /etc/hosts.equivxxx -compact
.It Pa /etc/hosts.equiv
.Nm
ファイルは
.Pa /etc
に存在します。
.It Pa $HOME/.rhosts
.Nm .rhosts
ファイルは
.Pa $HOME
に存在します。
.El
.Sh 関連項目
.Xr rcp 1 ,
.Xr rlogin 1 ,
.Xr rsh 1 ,
.Xr gethostbyname 3 ,
.Xr inet 3 ,
.Xr innetgr 3 ,
.Xr ruserok 3 ,
.Xr yp 4 ,
.Xr ifconfig 8 ,
.Xr named 8
.Sh バグ
このマニュアルページは不完全です。
より詳細については、
.Pa lib/libc/net/rcmd.c
のソースか、 SunOS のマニュアルページを参照してください。
