freebsd/freebsd-doc/ja_JP.eucJP/man/man5/host.conf.5
.\" Copyright (c) 2001 Giorgos Keramidas <keramida@freebsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/host.conf.5,v 1.1.2.2 2002/02/12 10:12:13 ru Exp %
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd December 6, 2001
.Dt HOST.CONF 5
.Os
.Sh 名称
.Nm host.conf
.Nd リゾルバサービス設定ファイル
.Sh 書式
.Pa /etc/host.conf
.Sh 解説
.Nm
ファイルは
.Fx
のリゾルバの設定の一部を保持します。
ホスト名やアドレスの解決時に、C ライブラリの名前解決ルーチン
.Xr ( gethostbyname 3
など) が利用するサービス (DNS や
.Xr yp 8
など) とそれらの利用順序を記述します。
.Pp
このファイルの書式は人間が読める形式であり、ユーザの好みのテキストエディタで
変更できます。
最初が
.Ql #
で始まる行はコメントとして無視されます。
残りの行はコロン
.Pq Ql \&:
、セミコロン
.Pq Ql \&;
、コンマ
.Pq Ql \&,
または空白 (タブ、スペース、改行文字)
で区切られたいくつかのサービス名を含みます。
.Ss 有効なサービス名
.Nm
中で有効なサービスの名称は次の通りです。
.Bl -tag -width ".Li yellowpages"
.It Li /etc/hosts
.Ql hosts
の別名。
.It Li bind
このサービスはリゾルバに対して、ホスト名やアドレスの名前解決に
インターネットドメインネームシステム (DNS) を使用するようにします。
DNS リゾルバの設定は
.Xr resolver 5
で説明されています。
.It Li dns
.Ql bind
の別名。
.It Li domain
.Ql bind
の別名。
.It Li hosts
このサービス名が
.Nm
で使用されていると、名前とアドレスの解決にローカルホストのデータベース
が使用されます。
ローカルホストのデータベースは
.Xr hosts 5
で説明されています。
.It Li hosttable
.Ql hosts
の別名。
.It Li htable
.Ql hosts
の別名。
.It Li nis
このサービス名が
.Nm
で使用されていると、リゾルバはホスト名とアドレスの調査に YP/NIS を使用します。
YP/NIS システムは
.Xr yp 8
で説明されています。
.It Li yellowpages
.Ql nis
の別名。
.It Li yp
.Ql nis
の別名。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa host.conf"
.It Pa host.conf
サービス設定ファイルは
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr gethostbyname 3 ,
.Xr hosts 5 ,
.Xr resolver 5 ,
.Xr yp 8
