freebsd/freebsd-doc/ja_JP.eucJP/man/man5/hosts.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)hosts.5	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/share/man/man5/hosts.5,v 1.4.2.1 1999/08/29 16:46:47 peter Exp %
.\"
.\" jpman %Id: hosts.5,v 1.3 1998/06/12 15:52:05 kumano Stab %
.Dd December 11, 1993
.Dt HOSTS 5
.Os BSD 4.2
.Sh 名称
.Nm hosts
.Nd ホスト名データベース
.Sh 解説
.Nm hosts
ファイルはネットワーク上の既知のホストに関する情報を保持します。
各ホストに対して、1つの行に以下の情報を与えます。
.Bd -unfilled -offset indent
インターネットアドレス
正式なホスト名
別名
.Ed
.Pp
各項目は任意の数の空白やタブ文字で区切られます。
``#'' はコメントの開始を表し、これ以降の行末までの文字はこの
ファイルを検索するルーチンによって解釈されません。
.Pp
ネームサーバ
.Xr named 8
使用時には、このファイルはネームサーバが動作していない時の予備として
機能します。
ネームサーバのために、ごく少数のアドレスがこのファイルに含まれて
いなければなりません。
これらはブート時に
.Xr ifconfig 8
が必要とするローカルインタフェースのアドレス、およびローカルネットワーク
上の少数のマシンを含みます。
.Pp
このファイルは Network Information Control Center
.Pq Tn NIC
で保守された正式なホストデータベースから作成されますが、非公式な別名や
未知のホストに関しては、ローカルでの変更を最新に保つ必要があります。
.Tn NIC
で保守されたデータベースは不完全なので、
.Tn DARPA
インターネット上のサイトではネームサーバの使用が推奨されます。
.Pp
ネットワークアドレスは、インターネットアドレス操作ライブラリ
.Xr inet 3
の
.Xr inet_addr 3
ルーチンを用いた伝統的な ``.'' (ドット) 表記で指定されます。
ホスト名は、フィールド区切り文字、改行、およびコメント文字
以外のあらゆる印字可能文字を含むことができます。
.Sh 関連ファイル
.Bl -tag -width /etc/hosts -compact
.It Pa /etc/hosts
.Nm hosts
ファイルは
.Pa /etc
に存在します。
.El
.Sh 関連項目
.Xr gethostbyname 3 ,
.Xr ifconfig 8 ,
.Xr named 8
.Rs
.%T "Name Server Operations Guide for BIND"
.Re
.Sh 歴史
.Nm
ファイルフォーマットは
.Bx 4.2
から登場しました。
