freebsd/freebsd-doc/ja_JP.eucJP/man/man5/info.5
.\" info(5)
.\" %Id: info.5,v 1.2 1998/07/31 17:39:31 karl Exp %
.\" jpman %Id: info.5,v 1.3 2000/03/26 22:28:25 horikawa Stab %
.\"
.\" Copyright (C) 1998 Free Software Foundation, Inc.
.\"
.\" Permission is granted to make and distribute verbatim copies of this
.\" manual provided the copyright notice and this permission notice are
.\" preserved on all copies.
.\"
.\" Permission is granted to copy and distribute modified versions of
.\" this manual under the conditions for verbatim copying, provided that
.\" the entire resulting derived work is distributed under the terms of a
.\" permission notice identical to this one.
.\"
.\" Permission is granted to copy and distribute translations of this
.\" manual into another language, under the above conditions for modified
.\" versions, except that this permission notice may be stated in a
.\" translation approved by the Foundation.
.\"
.TH INFO 5 "GNU Info" "FSF"
.SH 名称
info \- 可読なオンライン文書
.SH 解説
info ファイルフォーマットは簡単に処理できるオンライン文書のフォーマットで、
.I emacs(1)
と
.I info(1)
や、他のプログラムで読むことができます。
.PP
info ファイルは通常、
.I texinfo(5)
ソースから、
.IR makeinfo(1) 
によって生成されますが、どうしても必要であれば直接作成することもできます。
.PP
Texinfo の文法や関連するツールに関する完全な解説は、
(Texinfo 自身で書かれた) Texinfo マニュアルを参照してください。
普通は、下のようなコマンドをシェルから実行します:
.RS
.I info texinfo
.RE
またはこの操作を Emacs の中で行うならば:
.RS
.I M-x info RET m texinfo RET
.RE
でその文書を見ることができます。
.SH 入手性
ftp://ftp.gnu.org/pub/gnu/texinfo-<version>.tar.gz
.br
もしくは GNU のミラーサイトから手に入れることができます。
.SH バグ報告
バグレポートは電子メールで bug-texinfo@gnu.org 宛にお送りください。
その他の質問や議論は help-texinfo@gnu.org 宛にお送りください。
.SH 関連項目
info(1), install-info(1), makeinfo(1), texi2dvi(1),
.br
texindex(1).
.br
emacs(1), tex(1).
.br
texinfo(5).
