freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ipnat.5
.TH IPNAT 5
.\" jpman %Id: ipnat.5,v 1.3 1998/09/22 14:16:13 horikawa Stab %
.SH 名称
ipnat, ipnat.conf \- IP NAT ファイルの形式
.SH 解説
ipnat が受け付けるファイルの形式は、以下の文法で記述されるものです。
.LP
.nf
ipmap :: = mapblock | redir | map .

map ::= mapit ifname ipmask "->" ipmask [ mapport ] .
mapblock ::= "map-block" ifname ipmask "->" ipmask [ ports ] .
redir ::= "rdr" ifname [ fromspec ] ipmask "->" ip [ ports ] [ tcpudp ] .
ports ::= "ports" numports | "auto" .
mapit ::= "map" | "bimap" .
ipmask ::= ip "/" bits | ip "/" mask | ip "netmask" mask .
mapport ::= "portmap" tcpudp portnumber ":" portnumber .

fromspec ::= "from" ip "/" ipmask .
tcpudp ::= "tcp" | "udp" | "tcp/udp" .
portnumber ::= number { numbers } | "auto" .
ifname ::= 'A' - 'Z' { 'A' - 'Z' } numbers .

numbers ::= '0' | '1' | '2' | '3' | '4' | '5' | '6' | '7' | '8' | '9' .
.fi
.PP
標準的な NAT 機能では、ひとつのルールは \fBmap\fP で始まり、
その後にインタフェースの指定が続きます。そのインタフェースから
パケットが出て行く際にソースアドレスが書き換えられます。
.PP
書き換えられるパケットの選択は、もとのソースアドレスとの照合のみで
行なわれます。IP アドレスの指定にはネットマスクを指定する必要が
あります。
.PP
もとのアドレスと置き換えられるアドレスは、IP番号/ネットマスクの組から
選ばれます。すべて 1 のネットマスクは、ホスト名が正しいことを表します。
1 が 31 個からなるネットマスク (255.255.255.254) は、ブロードキャスト
アドレスとネットワークアドレスを取ったあとでホスト IP 番号を割り当てる
余裕がないため、正しくないと見なされます。
.PP
TCP パケットと UDP パケットの再マップの際には、ソースポート番号の変更
も可能です。TCP, UDP パケットともども、それぞれの規則で選択が可能です。
これらは、規則のうしろに再マップ先のポート番号の範囲を、
\fBport-number:port-number\fP の形式で指定します。
.SH コマンド
.\" There are found commands recognised by IP Filter's NAT code:
.\" この部分、There are four commands ... の間違いではないかと send-pr 済み
.\" (2000-1-19, by kuma)
IP フィルタの NAT コードが認識するコマンドがあります:
.TP
.B map
アドレスもしくはネットワークひとつを、統制なしのラウンドロビン法で
他のアドレスに写像するときに用います。
.TP
.B rdr
ある IP アドレスとポートの組から別の組に、パケットをリダイレクトする
ときに用います。
.TP
.B bimap
外部 IP アドレスと内部 IP アドレスとの間で双方向 NAT を設定するときに
用います。
.TP
.B map-block
IP アドレスに基づく静的な変換を設定します。アドレスを絞り込み、目的の範囲に
収まるように変換するアルゴリズムに基づくものです。
.SH 照合処理
.PP
基本的な NAT 機能とパケットのリダイレクトにおいては、プロトコルとともに
変更可能性のあるアドレスを用いて、あるパケットを変更せねばならないか
どうかをチェックします。リダイレクトについては、キーワード \fBfrom\fP
を用いて、ソースアドレスに基づくパケット選択を行なうこともできます。
それぞれの規則の "->" の左辺は、その規則のパケット \fI照合処理\fP
部分です。
.SH 変換処理
.PP
"->" の右辺は、それ以前の制約条件との照合が既に成功している場合に、その
パケットに書き込まれるアドレスとポートを指定する部分です。リダイレクトの
場合 (\fBrdr\fP) が最も単純です。新しいデスティネーションアドレスを
その中で指定します。
\fBmap\fP 規則に対しては、デスティネーションアドレスは、新しいアドレス
の組 (ソースとデスティネーション) が一意的であると知られているアドレス
になります。パケットが TCP か UDP パケットの場合、デスティネーション
ポートとソースポートもこの等式に含めます。
アドレスの組が既に存在する場合、IP フィルタは、まず \fBportmap\fP で
指定した有効範囲内でポート番号を 1 つ増やします。そうしても一意的な
アドレスの組が得られない場合、指定されたネットマスクの範囲内で
ソースアドレスを 1 つ増やします。一意的なアドレスの組が決して得られない
場合、パケットは変換されません。\fBmap-block\fP では、新規アドレスの組、
フリーなアドレスの組、一意的なアドレスの組を検索するやりかたがより限定
されます。ここでは、ポートの有効範囲に加えて、新しいソースアドレスを
何にするかを決定するアルゴリズムを使用します。IP アドレスは決して
変更されませんし、ポート番号も割り当てられた範囲を越えるものは
変更されません。
.SH カーネルプロキシ
.PP
IP フィルタには、カーネルにロードされるコードの中に組み込まれた単純な
プロキシがいくつか付いてきます。これにより、パケットをユーザプログラムを
通させずに 2 番目のチャネルを開けておくことが可能となります。
.SH 透過型プロキシ
.PP
真の透過型プロキシ処理 (transparent proxying) は、実際の発信元と
コネクションのアドレスを決定するため、\fB/dev/ipnat\fP 経由で検索を
行なうプロキシプログラムを用いて、localhost (127.0.0.1) のポートに
対応付けるリダイレクト (\fBrdr\fP) 規則を用いて行なう必要があります。
.SH 使用例
.PP
本セクションでは、\fBmap\fP コマンドとその変形を扱います。
.PP
ppp0 インタフェース経由で、内部で使用する IP 番号がネットワーク 10 の
パケットを、ISP (インターネットサービスプロバイダ) が提供してくれた 
209.1.2.0 (8 ビットサブネット) に変更する場合、以下の規則を使います。
.LP
.nf
map ppp0 10.0.0.0/8 -> 209.1.2.0/24
.fi
.PP
ここで、16,000,000 個以上の IP アドレスを 254 個に絞り込もうとすること
が問題なのは明らかでしょう。スコープを広げるために、TCP と UDP については
ポート再マップを使うこともできます。
.LP
.nf
map ppp0 10.0.0.0/8 -> 209.1.2.0/24 portmap tcp/udp 1025:65000
.fi
.PP
これで、ネットワーク 10 で利用可能な空間のうち、不足分は ``アドレス''
527,566 個分だけになります。これらの規則を結合させるとすると、以下のよ
うな指定が必要となります。
.LP
.nf
map ppp0 10.0.0.0/8 -> 209.1.2.0/24 portmap tcp/udp 1025:65000
map ppp0 10.0.0.0/8 -> 209.1.2.0/24
.fi
.PP
これで、TCP/UDP パケットのすべてはポートマップが行なわれ、IP アドレス
のみが変更されるのは ICMP など他のプロトコルだけとなります。
.SH 関連ファイル
/dev/ipnat
.br
/etc/services
.br
/etc/hosts
.SH 関連項目
ipnat(4), hosts(5), ipf(5), services(5), ipf(8), ipnat(8)
