freebsd/freebsd-doc/ja_JP.eucJP/man/man5/isdnd.rc.5
.\"
.\" Copyright (c) 1997, 2002 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdnd/isdnd.rc.5,v 1.33 2003/09/14 13:41:58 ru Exp %
.\"
.\"     last edit-date: [Sun Aug 11 20:07:38 2002]
.\"
.\" $FreeBSD$
.\"
.\" WORD: exchange	交換局
.\" WORD: subscribe	(AOCD サービス等を) 申し込んでいる
.Dd August 11, 2002
.Dt ISDND.RC 5
.Os
.Sh 名称
.Nm isdnd.rc
.Nd isdn4bsd ISDN 接続管理デーモンの設定ファイル書式
.Sh 解説
(コマンドラインで別のものを指定しない限り) ファイル
.Pa /etc/isdn/isdnd.rc
は、
.Xr isdnd 8
ISDN 接続管理デーモンの実行時設定を格納します。
本デーモンは、isdn4bsd パッケージの一部です。
.Pp
設定ファイルには、第 1 桁から始まるキーワードが複数含まれます。
キーワードの後には、1 個以上の空白・タブ、単一の等号、1 個以上の空白・タブ、
キーワード依存のパラメータ値と続きます。
.Pp
文字 '#' で開始する行はコメント行として扱われます。
.Pp
ブール値指定を要求するキーワードに対しては、真を
.Em yes
または
.Em on
で与え、偽を
.Em no
または
.Em off
で与えます。
.Pp
設定ファイルには、単一の
.Em システム
セクションと 1 個以上の
.Em コントローラ
セクションと 1 個以上の
.Em エントリ
セクションが含まれます。
.Em システム
セクションでは、デーモンの操作に関するパラメータや
単一のリモート接続に関連付けられないパラメータを設定可能です。
.Em コントローラ
セクションでは、特定のコントローラに関するパラメータを設定可能です。
.Em エントリ
セクションでは、
単一のリモート接続に直接関連付けられたパラメータを設定可能です。
.Pp
次のキーワードを
.Nm isdnd
は理解します:
.Pp
.Bl -tag -width system
.It Li system
本キーワードにより、システム設定セクションが開始します。
パラメータを伴ってはなりませんし、1 度のみ使用可能です。
本キーワードは必須です。
次のキーワードは、システム設定セクション内で有効です:
.Bl -tag -width useacctfile
.It Li acctall
本パラメータを
.Em on
に設定すると、
ローカルサイトが課金されてない場合や、
課金情報が利用不能だったり課金情報を申し込んでいない場合でも、
アカウンティング情報が書き込まれます。(省略可能)
.It Li acctfile
キーワード
.Em useacctfile
(後述) が
.Em on
に設定されたときに使用されるアカウンティングファイルの名前を指定します。
システムキーワード
.Em rotatesuffix
を参照してください。
本キーワードを指定しないと、システムデフォルトが使用されます。(省略可能)
.It Li add-prefix
.Em on
に設定されると、着呼番号に対して「番号の型」指示子が検索され、
後述の
.Em prefix-national
と
.Em prefix-international
キーワードに指定されるように番号が調整されます。
本キーワードを指定しないと、システムデフォルト (off) が使用されます。
(省略可能)
.It Li aliasing
本パラメータが
.Em on
に設定されると、電話番号から名前へのエイリアス処理が有効にされます (後述の
.Em aliasfile
キーワードも参照)。デフォルトは off です。(省略可能)
.It Li aliasfile
.Em aliasing
キーワードによりエイリアス処理が有効にされたときに
.Xr isdntel 1
ユーティリティと共有される、
電話番号から名前へのエイリアスデータベースファイルの名前を指定します。
(省略可能)
.It Li beepconnect
全画面モードにおいて、本パラメータが
.Em on
に設定されると、呼の接続または切断時にベルを鳴らします。
.It Li extcallattr
本パラメータが
.Em on
に設定されると、拡張の発呼者属性である「スクリーニング指示子」
と「プレゼンテーション指示子」がログファイルに書き込まれます。
デフォルトは off です。(省略可能)
.It Li holidayfile
祭日の日付を含む、祭日ファイルの名前を指定します。
本ファイルは
.Em valid
キーワードと共に使用して、祭日の日付を検索に使用します。(省略可能)
.It Li isdntime
本パラメータが
.Em on
に設定されると、(提供されるならば) 交換局から得られる日付/時刻情報を
ログファイルに書き込みます。デフォルトは off です。(省略可能)
.It Li mailer
本キーワードは、コマンドラインで "-s" フラグにてサブジェクトを指定可能な、
メールプログラムのパス/名前を指定するために使用します。
.Nm
の致命的エラーによる終了の場合、キーワード
.Em mailto
で指定される管理者宛へのメール送信に、このプログラムが使用されます。
(省略可能)
.It Li mailto
本キーワードは、
.Nm
の致命的エラーによる終了の場合に通知を受ける人の電子メールアドレスを
指定するために使用します (キーワード
.Em mailer
も参照してください)。
(省略可能)
.It Li monitor-allowed
本パラメータが
.Em on
または
.Em yes
に設定されると、
ローカルマシンまたはリモートマシンを介した監視が有効になります。
本パラメータは省略可能であり、デフォルトで
.Em off
に設定されます。
.It Li monitor-port
リモート監視用の TCP ポート番号を設定します。
本整数パラメータは省略可能であり、デフォルトでポート 451 に設定されます。
.It Li monitor
本キーワードは、ローカルソケット名または、
リモート監視用にホストまたはネットワークを指定します。
.Em monitor
の指定は次のいずれかです:
.Pp
.Bl -tag -width Ds -compact
.It Ar ローカル (UNIX ドメイン) ソケット名
文字 "/" で開始する必要があります。例: /var/run/isdn-monitor
.It Ar ドット付き 4 つ組のホスト指定
例: 192.168.1.2
.It Ar ドット付き 4 つ組のネットワークアドレスとネットマスク
例: 192.168.1.0/24
.It Ar 解決可能なホスト名
例: localhost
.It Ar 解決可能なネットワーク名とネットマスク
例: up-vision-net/24
.El
.It Li monitor-access
本キーワードは、以前使用した
.Em monitor
キーワードのアクセス権限を指定します。
サポートされているアクセス権限は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar fullcmd
.It Ar restrictedcmd
.It Ar channelstate
.It Ar logevents
.It Ar callin
.It Ar callout
.El
.It Li prefix-international
.Em add-prefix
スイッチ (前述) と組み合わせることにより、
国際番号タグ付きの着呼番号に対するプレフィックス番号文字列を指定します。
エイリアスが使用された場合、それらも相応に調整されます。
(省略可能)
.It Li prefix-national
.Em add-prefix
スイッチ (前述) と組み合わせることにより、
国内番号タグ付きの着呼番号に対するプレフィックス番号文字列を指定します。
エイリアスが使用された場合、それらも相応に調整されます。
(省略可能)
.It Li ratesfile
料金ファイルの名前を指定します。
本キーワードが省略された場合、システムデフォルトが使用されます。(省略可能)
.It Li regexpr
本キーワードは、正規表現を指定するために使用されます。
1 度以上、コンパイル時依存の回数
(現在、ソースにおける MAX_RE の定義では 5 回)
まで指定することが可能です。
.Pp
指定した全正規表現は実行時にログ文字列と比較され、
マッチした場合には、ログテキストをパラメータとしてプログラムが実行されます
(後述のキーワード
.Em regprog
も参照)。
.Pp
正規表現の指定方法については、
.Xr re_format 7
と
.Xr regex 3
を参照してください。
.Em 拡張
正規表現の書式がサポートされています。
.Pp
ヒント: 設定ファイルのパーザが不適切に解釈することを避けるために、
式を適切にクォートする必要があるかもしれません。
(省略可能)
.It Li regprog
本キーワードは、対応する正規表現がログ文字列にマッチした場合に実行される、
プログラムの名前を指定するために使用されます。
.Nm isdnd
は、パス
.Pa /etc/isdn
以下でプログラムを見付けられるものと期待します。
このパスは、本キーワードのパラメータとして指定された文字列の前に付けられます。
(省略可能)
.It Li rotatesuffix
ログファイルおよびアカウンティングファイルの改名に使用するサフィックスを
指定します。
rotatesuffix が使用され USR1 シグナルが isdnd に送られた場合、
ログファイルとアカウンティングファイルは、
閉じられて再度開けられることに加え、
元の名前に rotatesuffix 文字列を後置した名前に改名されます。
本キーワードを省略すると、ログファイルは単に閉じられて再度開けられます。
これはまたデフォルト時の動作です。(省略可能)
.It Li rtprio
.Nm isdnd
が実行されるリアルタイム優先度を、0 〜 31 の範囲の整数値で指定します。
0 は最高の優先度です。
本キーワードは省略可能です。
指定しない場合、
.Nm isdnd
の処理優先度はまったく修正されません。(
.Xr rtprio 1
も参照)。
本キーワードは、
.Nm
を -DUSE_RTPRIO 付きでコンパイルした場合にのみ利用可能です。
.It Li useacctfile
本パラメータが
.Em on
に設定された場合、(利用可能な場合) 課金情報とアカウンティング情報が
アカウンティングファイルに書き込まれます。(省略可能)
.El
.It Li controller
本キーワードは、コントローラ設定セクションを開始します。
パラメータを持ってはなりませんし、各コントローラに対して 1 回使用可能です。
本キーワードは省略可能です。
次のキーワードが、コントローラ設定セクションで有効です:
.Bl -tag -width useacctfile
.It Li protocol
本キーワードは、
コントローラが接続された S0 バスの D チャネルプロトコルの設定に使用されます。
次のパラメータが、現在サポートされています:
.Pp
.Bl -tag -width calledback
.It Ar dss1
ITU 勧告 Q.921 および Q.931 に従う、
DSS1 または所謂 "Euro-ISDN" D チャネルプロトコル。
.It Ar d64s
単一 B チャネル付き ISDN リースライン (ドイツでは所謂 D64S)。
.El
.It Li firmware
本キーワードは、
.Li firmware Ns = Ns Ar /path/to/file
のように使用し、
.Em iavc
ドライバがサポートする能動的なコントローラ (AVM B1, T1) に
ファームウェアをダウンロードします。
本キーワードは全コントローラタイプでサポートされており、
指定したファイルを引数として
.Dv I4B_CTRL_DOWNLOAD
ioctl を起動します。
能動的および受動的な両方のアダプタを装備するシステムで、
受動的なカードが最初に検出されるものでは、
正しいファームウェアを正しいアダプタにダウンロードするために、
ダミーの
.Ql controller
エントリが受動的なカード用に必要です。
.El
.It Li entry
本キーワードにより、単一の設定エントリが開始します。
パラメータを伴ってはなりません。
本キーワードは、少なくとも 1 度は使用する必要があります。
次のキーワードは、エントリセクション内で有効です:
.Bl -tag -width unitlengthsrc
.It Li answerprog
本キーワードは、着信電話接続が設定エントリにおいて
.Em answer
を指定した場合に実行される、プログラムの名前を指定するために使用されます。
デフォルト名は
.Em answer
です。
.Nm isdnd
は、パス
.Pa /etc/isdn
以下でプログラムを見付けられるものと期待します。
このパスは、本キーワードのパラメータとして指定された文字列の前に付けられます。
(省略可能)
.It Li alert
呼 (call) を受け付ける前に待つ秒数を指定するために使用します。
本キーワードは、電話着呼 (dialin-reaction = answer)
のためにのみ指定可能です。
留守番マシンが実行を開始する前に、
電話の着呼 (incoming call) を受け付ける機会を持つために使用します。
本パラメータの最小値は 5 秒であり、パラメータの最大値は 180 秒です。
(省略可能)
.It Li b1protocol
本接続に使用される B チャネルのレイヤ 1 プロトコルです。
本キーワードは必須です。
現在設定可能な値は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar hdlc
HDLC フレーミング。
.It Ar raw
フレーミングを行わない (電話通信のために使用)。
.El
.It Li bcap
本接続に対し、特殊な運搬 (bearer) ケーパビリティを使用します。
本キーワードは省略可能です。
.Pp
.Em dov
以外の値は、
.Em b1protocol
キーワード (上述) で設定された運搬ケーパビリティを設定することになります。
現在使用可能な設定値は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar dov
この接続は
.Em Dov (データオーバボイス)
接続です。
b1protocol キーワードは
.Em hdlc
に設定する必要があります。
この機能は試験的であり、発呼においてのみ動作します。
.El
.It Li budget-calloutperiod
秒単位で時間を指定します。
この期間内は、
.Em budget-calloutncalls
で指定された回数の呼が成功を許されますが、
これを越える発呼は残りの期間ブロックされます。
(省略可能)
.It Li budget-calloutncalls
.Em budget-calloutperiod
の期間に許された発呼数。(省略可能)
.It Li budget-calloutsfile
成功した発呼数が書き込まれるファイルのパスとファイル名。
isdnd の起動時にファイルが存在する場合、内容は保存されます。
ファイルの書式は、起動時刻、最後の更新時刻、呼の数です。
(省略可能)
.It Li budget-calloutsfile-rotate
.Em on
に設定すると、毎晩次の日にファイルを更新しようとする機会に、
新規ファイルに budget-calloutsfile を回転します。
前日の統計情報が budget-calloutsfile で指定されるファイル名に
ハイフンと新しい日付 (!) が付けられたファイルに書き込まれます。
(省略可能)
.It Li budget-callbackperiod
.It Li budget-callbackncalls
.It Li budget-callbacksfile
.It Li budget-calloutsfile-rotate
前述の
.Em budget-calloutperiod ,
.Em budget-calloutncalls ,
.Em budget-calloutsfile ,
.Em budget-calloutsfile-rotate
を見てください。
リモートサイトへのコールバックに使用される予算を指定します。
.It Li callbackwait
リモートサイトからの呼を切ってから
リモートサイトにコールバックするまでに待つ秒数です。(省略可能)
.It Li calledbackwait
ローカルサイトがリモートサイトを呼び出した後、
リモートサイトがローカルサイトにコールバックするまでに待つ秒数です。(省略可能)
.It Li clone
指定した既存エントリの内容を現在のエントリへコピーします。
この機能を使う場合、新規エントリ固有の
.Ql name
と
.Ql usrdeviceunit
の値は最低限現在のエントリに指定してください。
.It Li connectprog
接続確立後でアドレスネゴシエーション完了後
(すなわち接続が使用可能時) に実行するプログラムを指定します。
.Nm
はパス
.Pa /etc/isdn
以下でプログラムを見付けられるとを期待し、
本キーワードに指定したパラメータの前にこのパスを付けます。
接続および切断で指定するプログラムは、次のコマンドライン引数を取ります:
-d (デバイス) -f (フラグ) [ -a (アドレス) ] 場所
.Em デバイス
はデバイス名であり、例えば "isp0"です。
.Em フラグ
は接続アップ時には "up" であり、
インタフェースがダウン状態になった場合は "down" です。
.Em アドレス
はインタフェースに割り当てられたアドレスであり、
ドット付き 4 つ組の IP アドレス
(省略可能。isdnd が分かる場合のみ) です。
(省略可能)
.It Li dialin-reaction
着信接続要求を受けた場合にどうするかを指定するために使用します。
本キーワードは必須です。
現在サポートされているパラメータは次の通りです:
.Pp
.Bl -tag -width calledback -compact
.It Ar accept
着呼を受け付けます。
.It Ar reject
着呼を拒否します。
.It Ar ignore
着呼を無視します。
.It Ar answer
着信音声呼び出しに対して、留守番電話を開始します。
.It Ar callback
リモートサイトが呼び出したとき、
その呼を切ってリモートサイトにコールバックします。
.El
.It Li dialout-type
本キーワードは、どのタイプのダイヤルアウトモードが使用されるかを設定します。
本キーワードは必須です。
現在サポートされているパラメータは次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar normal
通常動作。呼を受け付けると思われるリモートサイトを呼び出します。
.It Ar calledback
コールバック動作。
呼を拒否してから当方にコールバックするリモートサイトを呼び出します。
.El
.It Li dialrandincr
ダイヤル時または再ダイヤル時、本パラメータが
.Em on
に設定されていると、
ダイヤル再試行時間に乱数 (現在 0 〜 3 秒) が加えられます。
2 つのサイトが同期してダイヤルしてしまい、
他方もダイヤルしているために双方がダイヤルする度にビジーを検出するという機会を
最小化します。
.It Li dialretries
ダイヤルをあきらめる前に再試行する回数です。(省略可能)
.Em -1
に設定すると、再試行数は無限になります!
.It Li direction
本キーワードは、発信着信・発信のみ・着信のみのいずれの接続が可能であるかを
設定するために使用します。
本キーワードは省略可能であり、デフォルトは
.Em inout
です。
.Pp
現在サポートされているパラメータは次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar inout
通常動作。接続の確立は、リモートからでもローカルからでも可能です。
.It Ar in
着信接続のみ可能です。
.It Ar out
発信接続のみ可能です。
.El
.It Li disconnectprog
接続が閉じた後に実行するプログラム名です。
.Nm
はパス
.Pa /etc/isdn
以下でプログラムを見付けられるとを期待し、
本キーワードに指定したパラメータの前にこのパスを付けます。
(省略可能)
.It Li downtries
失敗する試行回数を指定するために使用します。
試行 (=再試行サイクルです!) がこの回数だけ失敗すると、
インタフェースを (
.Em downtime
秒だけ) 無効にします。
(詳細はキーワード
.Em usedown
を参照)。本キーワードは省略可能です。
.It Li downtime
.Em downtries
の設定値の回数の後、
インタフェースが無効化される秒数を設定するために使用されます。
(詳細はキーワード
.Em usedown
を参照)。
本キーワードは省略可能であり、デフォルトで 60 秒に設定されます。
.It Li earlyhangup
次の課金単位となる前に接続を切るための (保険の) 秒数を指定します。
(省略可能)
.It Li idle-algorithm-outgoing
発呼 (outgoing call) がアイドルであるとき、
何時接続を切るかを判定するのに使用するアルゴリズム。
現在使用可能なアルゴリズムは次の通りです:
.Pp
.Bl -tag -width calledback -compact
.It Ar fix-unit-size
呼全体を通じて、固定長の課金単位を仮定する、アイドルアルゴリズムです。
.\" idle algorithm which assumes fixed sized changing units during the whole call.
.\" の changing は charging であるはず。send-pr する
.\" <horikawa@jp.FreeBSD.org> Nov 20 1999
.It Ar var-unit-size
最初の課金単位後は、時間ベースの課金を仮定する、アイドルアルゴリズムです。
.El
.It Li idletime-outgoing
接続を切る前に発呼がアイドルとなる秒数。(省略可能)
アイドルタイムアウトに 0 を指定すると、この機能を無効にします。
.It Li idletime-incoming
接続を切る前に着呼がアイドルとなる秒数。(省略可能)
アイドルタイムアウトに 0 を指定すると、この機能を無効にします。
.It Li isdncontroller
本エントリの接続に使用される ISDN コントローラ番号。(必須)
.It Li isdnchannel
本エントリの接続に対して使用される ISDN コントローラチャネル番号。
ここで明示的にチャネルを選択すると
SETUP メッセージはそのチャネルを要求しますが、
リクエストに
.Em 望ましい (preferred)
(指定チャネルを望む) とマークするだけであって、
排他的 (指定チャネルのみ受け付ける) とマークするのではありません。
よって、交換局は要求されたチャネル以外を選択することが依然として可能です!
(必須)
.It Li isdntxdel-incoming
.Xr timeout 9
カーネルサブルーチンに適合する遅延値であり、
.Em 着信
ISDN 接続に対して接続確立が成功した後に、
最初のパケットの送出をこの値だけ遅延させます。
指定単位は 1/100 秒です。
ゼロ (0) を指定すると本機能を無効化します。これがデフォルト値です。
本機能は
.Xr i4bipr 4
IP over raw HDLC ISDN ドライバ用に実装されました
(本ドライバに対してのみ意味を持ちます)。(省略可能)
.It Li isdntxdel-outgoing
.Xr timeout 9
カーネルサブルーチンに適合する遅延値であり、
.Em 発信
ISDN 接続に対して接続確立が成功した後に、
最初のパケットの送出をこの値だけ遅延させます。
指定単位は 1/100 秒です。
ゼロ (0) を指定すると本機能を無効化します。これがデフォルト値です。
本機能は
.Xr i4bipr 4
IP over raw HDLC ISDN ドライバ用に実装されました
(本ドライバに対してのみ意味を持ちます)。(省略可能)
.It Li local-phone-dialout
ローカルサイトからダイヤルアウトする場合に使用される、ローカルの電話番号。
リモートサイトに対してダイヤルアウトするとき、
ここで指定した番号が
.Em "発番号情報要素 (Calling Party Number Information Element)"
に埋め込まれます。
.Pp
本キーワードは、
.Em ipr
ユーザランドインタフェースのために必須です。
.It Li local-subaddr-dialout
ローカルサイトからダイヤルアウトする場合に使用される、ローカルのサブアドレス。
リモートサイトに対してダイヤルアウトするとき、
ここで指定したサブアドレスが
.Em "発番号情報要素 (Calling Party Number Information Element)"
に埋め混まれます。
.Pp
本キーワードは、
.Em ipr
ユーザランドインタフェースのために必須です。
.It Li local-phone-incoming
着呼の宛先を確認するために使用する、ローカルの電話番号です。
リモートサイトがダイヤルインするとき、
リモートサイトの希望接続先がローカルサイトであることを確認するために、
本番号を使用します。
この値は、電話交換局から得られる
.Em "着番号情報要素 (Called Party Number Information Element)"
と比較されます。
.Pp
本キーワードは
.Em ipr
インタフェースのために必須です。
.It Li name
その設定エントリにシンボルによる名前を定義します。
全画面表示においてこの名前を使用して
リモートサイトへのリンクを識別しやすくすることと、
アカウンティングに使用することを目的としています。(必須)
.It Li maxconnecttime
最大の接続時間を秒単位で指定します。
B チャネル上の接続が持続する絶対的な上限を定義するために使用してください。
.Em 注意:
この機能は接続時間を制限するために使用され、
接続試行回数は制限し「ません」。
使用する場合、budget 機能も有効にし、接続試行回数も制限してください
(さもないと、回線の接続そして再接続が永遠に繰り返され、
電話会社からの請求書に好ましくない影響を与えます)!
.It Li ppp-auth-paranoid
.Em no
に設定すると、
ローカルサイトに起因する接続の信頼性を、
リモートサイトが証明する必要はありません。
デフォルトは
.Em yes
であり、リモートサイトは常に証明する必要があります。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-send-auth
が pap または chap に設定されている場合のみ使用します。
(省略可能)
.It Li ppp-auth-rechallenge
相手が chap の再挑戦をサポートしていない場合、
.Em no
に設定します。
デフォルトは
.Em yes
であり、リモートサイトの証明確認をもう一度行います。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-expect-auth
が chap に設定されている場合のみ使用します。
(省略可能)
.It Li ppp-expect-auth
ローカルサイトは、リモートサイトの証明確認を、
指定した方法で行うものと期待します。
サポートされている方法は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar none
相手の証明を要求しません。
典型的には ISP へのダイヤルアウト
(多くの ISP がクライアントを認証しません) か
ローカルサイトで匿名ダイヤルインを提供する場合に使用します
.It Ar chap
パスワードを素のテキストで送る必要のない、好ましい認証方法です。
.It Ar pap
誰でも伝線を見て名前をパスワードを取得できてしまう、
防護されていない認証方法です。
.El
.Pp
.Em ppp-auth-paranoid
を
.Em no
に設定すると
(デフォルトは
.Em yes
です)、外向き接続ではリモートサイトの自身の証明を要求しません。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対してのみ使用します。
(省略可能)
.It Li ppp-expect-name
リモートサイトの認証にあたり、提供されることが必要な名前。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-expect-auth
が pap または chap に設定されている場合のみ使用します。
(省略可能)
.It Li ppp-expect-password
リモートサイトの認証にあたり、提供されることが必要な秘密情報。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-expect-auth
が pap または chap に設定されている場合のみ使用します。
(省略可能)
.It Li ppp-send-auth
リモートサイトが要求する認証方法。
現在サポートされている方法は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar none
リモートサイトは、認証を期待しないかサポートしません。
.It Ar chap
パスワードを素のテキストで送る必要のない、好ましい認証方法です。
.It Ar pap
誰でも伝線を見て名前をパスワードを取得できてしまう、
防護されていない認証方法です。
.El
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対してのみ使用します。
(省略可能)
.It Li ppp-send-name
リモートホストに送られる、認証用の名前。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-send-auth
が pap または chap に設定されている場合のみ使用します。
(省略可能)
.It Li ppp-send-password
ローカルサイトの証明のためにリモートホストに送られる、認証用の秘密情報。
.Pp
本キーワードは、
.Em isp
PPP インタフェースに対して
.Em ppp-send-auth
が pap または chap に設定されている場合のみ使用します。
(省略可能)
.It Li ratetype
料金ファイル中の、使用する料金エントリ。(省略可能)
.Pp
例えば、
ratetype=0 は /etc/isdn/isdnd.rates 中で "ra0" で開始する行を選択します
(典型的には ra0 行は、
各曜日および各時刻における、ローカルの呼び出し料金の表集合です。)
.It Li recoverytime
ダイヤル再試行とダイヤル再試行の間に待つ秒数。(省略可能)
.It Li remdial-handling
複数個の発信番号が指定された場合のダイヤルアウト動作を指定するために
使用されます。
現在サポートされているパラメータは次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar first
新規 (非再試行) 呼設定 (call setup) の度に、最初の番号から開始します。
.It Ar last
新規 (非再試行) 呼設定の度に、
接続確立が成功した最後の番号から開始します。
.It Ar next
新規 (非再試行) 呼設定の度に、
最後に使用したものの次の番号から開始します。
.El
.It Li remote-phone-dialout
ローカルサイトからダイヤルアウトする場合に使用される、リモートの電話番号。
リモートサイトに対してダイヤルアウトするとき、
ここで指定した番号が
.Em "着番号情報要素 (Called Party Number Information Element)"
に埋め込まれます。
.Pp
本キーワードは、ipr インタフェースのために必須です。
.\" 原文の .em (Execute Macro) は、引数無しの場合効果が無いので削除
.\" horikawa@jp.freebsd.org 1999/01/19
複数回指定して、
どれかひとつが成功するまでいくつかの番号に対して試行させることもできます。
.It Li remote-subaddr-dialout
ローカルサイトからダイヤルアウトする場合に使用される、リモートのサブアドレス。
リモートサイトに対してダイヤルアウトするとき、
ここで指定したサブアドレスが
.Em "着番号情報要素 (Called Party Number Information Element)"
に埋め込まれます。
.Pp
本キーワードは、
.Em ipr
インタフェースのために必須です。
remote-phone-dialout 番号にリンクさせ、そのうちのどれかひとつが成功するまで、
複数回指定可能です。
.It Li remote-phone-incoming
着呼を確認するために使用する、リモートの電話番号です。
リモートサイトがダイヤルインするとき、
ローカルシステムに対して接続する権限がある
正しいリモートサイトであることを確認するために、
本番号を使用します。
この値は、電話交換局から得られる
.Em "発番号情報要素 (Calling Party Number Information Element)"
と比較されます。
.Pp
本キーワードは ipr インタフェースのために必須です。
.Pp
本キーワードにワイルドカードパラメータ '*' を渡して、
誰もがダイヤルイン可能とできます。
.It Li remote-subaddr-incoming
着呼を確認するために使用する、リモートのサブアドレスです。
リモートサイトがダイヤルインするとき、
ローカルシステムに対して接続する権限がある
正しいリモートサイトであることを確認するために、
本サブアドレスを使用します。
この値は、電話交換局から得られる
.Em "発番号情報要素 (Calling Party Number Information Element)"
と比較されます。
.Pp
本キーワードは ipr インタフェースのために必須です。
.Pp
本キーワードにワイルドカードパラメータ '*' を渡して、
誰もがダイヤルイン可能とできます。
.It Li unitlength
秒数による課金単位の長さ。
アイドル時間とともに使用して、いつ接続を切るのかを決定します。
(省略可能)
.It Li unitlengthsrc
本キーワードは、ショートホールドモードにおいて
.Xr isdnd 8
がどこから unitlength を取得するかを指定します。
現在設定可能な値は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Ar none
unitlength は、どこにも指定されません。
.It Ar cmdl
コマンドラインで指定される unitlength を使用します。
.It Ar conf
設定ファイルでキーワード
.Em unitlength
で指定される unitlength を使用します。
.It Ar rate
設定ファイルにおいてキーワード
.Em ratetype
で指定される料金ファイル中の unitlength を使用します。
.It Ar aocd
ISDN 回線において AOCD を申し込んでいる場合、
動的に計算される unitlength を使用します。
(AOCD は ```Advice Of Charge During the call (呼の間の課金アドバイス)''
の頭文字で、遠距離通信 (すなわち電話) 業者が提供する、
課金単位を示すサービスです)。
.El
.It Li usrdevicename
ISDN B チャネルデータをユーザランドにインタフェースするために使用する、
ユーザランドインタフェースを指定します。
本キーワードは必須です。
本キーワードは次のパラメータを受け付けます:
.Pp
.Bl -tag -width Ds -compact
.It Ar ipr
本パラメータは raw HDLC IP over ISDN インタフェースを設定します。
.It Ar isp
本パラメータは shyncronous PPP over ISDN インタフェースを設定します。
.It Ar rbch
本パラメータは Raw B CHannel アクセスインタフェースを設定します。
.It Ar tel
ISDN 電話通信。
.El
.It Li usrdeviceunit
usrdevicename が指定するデバイスの、ユニット番号を指定します。
.It Li usedown
エントリセクションにおいて、キーワード
.Em downtries
と
.Em downtime
を有効にするために使用します。
(回線ビジーの場合等) 遷移に失敗する場合に、
過度のダイヤル動作を避けるために、
.Nm isdnd
が IP インタフェースの有効・無効を動的に切り替えるために使用します。
本パラメータは省略可能であり、デフォルトで
.Em off
に設定されます。
.It Li usesubaddr
サブアドレスを有効にするために使用します。
本パラメータは省略可能であり、デフォルトで
.Em off
に設定されます。
.It Li valid
.Em 注 :
この機能は実験用です!
このキーワードへのパラメータは、エントリの有効期間を表す文字列です。
時間の指定は、曜日や祭日指定 (システムセクションの
.Em holidayfile
キーワードを参照してください) と、コロンに続けて、
オプションの時間の範囲を hh:mm-hh:mm で指定したものです。
曜日は 0 から 6 の数字で指定され、番号 7 は祭日です:
.Pp
.Bl -tag -width Ds -compact
.It Ar 0
日曜日
.It Ar 1
月曜日
.It Ar 2
火曜日
.It Ar 3
水曜日
.It Ar 4
木曜日
.It Ar 5
金曜日
.It Ar 6
土曜日
.It Ar 7
祭日
.El
.Pp
次の例は、german Telekom の "T-ISDN xxl" 料金表です:
.Bl -tag -width Ds -compact
.It Ar 1,2,3,4,5,6,09:00-18:00
月曜日から土曜日までの昼間 9:00 から 18:00
.It Ar 1,2,3,4,5,6,18:00-9:00
月曜日から土曜日までの夜間 18:00 から 9:00
.It Ar 0,7
日曜日と祭日、全 24 時間
.El
.Pp
本キーワードは省略可能です。
.El
.El
.Sh アイドル時間の計算とショートホールドモード
.Bl -tag -width "incoming calls
.It Li 着呼
呼び出し側が課金構造などのほとんどを知っているものと見なすので、キーワード
.Em idletime-incoming
のみが着呼に機能します。
.Pp
着呼に対しては回線は定常的に監視され、
.Em idletime-incoming
で指定する秒数の期間トラフィックが無い場合には、呼は閉じられます。
.Pp
典型的には、
.Em idletime-incoming
は最終手段として使用するため、課金単位時間よりもずっと大きな値を設定します。
典型的な値は 1 〜 5 分です。
.It Li 発呼
発呼の切断時間を、3 種類の方法のいずれかに設定可能です:
.Bl -tag -width "shorthold mode
.It Li 単純モード
単純なモードであり、
.Em idle-algorithm-outgoing
は
.Em fix-unit-size
であることが必要で、
.Em unitlength
の選択値は 0 (ゼロ) であり
.Em idletime-outgoing
は 0 より大きいことが必要です。
.Pp
送信のトラフィックは定常的に監視され、
.Em idletime-outgoing
で指定された秒数だけトラフィックが無かった場合、呼は閉じられます。
.Pp
単純なモードの典型値は 10 〜 30 秒です。
.It Li 固定単位課金用ショートホールドモード
このショートホールドモードでは、
.Em idle-algorithm-outgoing
であることが必要で、
.Em unitlength
と
.Em idletime-outgoing
の選択値は 0 (ゼロ) より大きいことが必要であり、
.Em earlyhangup は 0 (ゼロ) 以上であることが必要です
。
.Bd -literal
|<unchecked window>|<checkwindow>|<safetywindow>|
|                  |             |              |
+------------------+-------------+--------------+
|                  |             |              |
|                  |<-idle-time->|<earlyhangup->|
|<--------------unitlength--------------------->|
.Ed
.Pp
チェック対象外ウィンドウ (uncheked window) は、
(unitlength - (idle-time + earlyhangup)) の長さであり、
この間アイドルチェックはされません。
チェック対象外ウィンドウが終ると、idle-time の期間、
回線にトラフィックが無いかチェックされます。
チェックウィンドウ (check-window) の期間にトラフィックが検出された場合、
次の単位 (unit) の先頭から同じ手続きが再度開始されます。
チェックウィンドウの期間トラフィックが検出されない場合、
チェックウィンドウ終了時に回線が閉じられます、
.Pp
注:
.Em unitlength
は
.Em idletime-outgoing
と
.Em earlyhangup
の合計よりも大きいことが必要 (!) です!
.It 可変単位課金用ショートホールドモード
このショートホールドモードでは、
.Em idle-algorithm-outgoing
は
.Em var-unit-size
であることが必要で、
.Em unitlength
と
.Em idletime-outgoing
の選択値は 0 (ゼロ) より大きいことが必要です。
.Pp
このショートホールドモードは、
呼の課金が、経過時間と固定の接続課金からなる場合に向いています。
例えば British Telecom の課金がこの方法です。
.Pp
各呼は、2 つの期間に分割されます。
1 番目は
.Em チェック対象外 (unchecked)
期間であり、2 番目は
.Em チェック対象 (checked)
期間です。
.Em チェック対象
期間は、最初の単位時間が終る 1 秒前に開始します。
.Pp
.Em チェック対象
期間では、
.Em idle-time
秒の間にトラフィックが無い場合、呼が切断されます。
.Pp
.Bd -literal
|<---unchecked------------------>|<------checked------>
+------------------+-------------+
|                  |<-idle-time->|
|<--------------unitlength------->|
.Ed
.Pp
経験からは、有用な idle-time は 15 秒から 30 秒です。
.Pp
idle-time が短か過ぎると、
ネットワーク処理をまだ終えていないアプリケーションが新たな呼を発生します。
.Pp
.El
.El
.Sh 関連ファイル
.Bl -tag -width /etc/isdn/isdnd.rc -compact
.It Pa /etc/isdn/isdnd.rc
.Nm isdnd
ISDN デーモンのデフォルトの設定ファイル。
.El
.Sh 関連項目
.Xr regex 3 ,
.Xr re_format 7 ,
.Xr isdnd 8 ,
.Xr isdnmonitor 8 ,
.Sh 作者
.An -nosplit
.Xr isdnd 8
デーモンと本マニュアルページは
.An Hellmuth Michaelis Aq hm@FreeBSD.org
.An Hellmuth Michaelis
が書きました。
.Pp
本マニュアルページへ
.An Barry Scott Aq barry@scottb.demon.co.uk
が追加しました。
