freebsd/freebsd-doc/ja_JP.eucJP/man/man5/isdnd.acct.5
.\"
.\" Copyright (c) 1997, 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdnd.acct.5,v 1.11 2001-08-05 01:34:12 horikawa Exp $
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdnd/isdnd.acct.5,v 1.9.2.4 2001/08/01 17:45:03 obrien Exp %
.\"
.\"	last edit-date: [Mon Dec 13 22:58:12 1999]
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/isdnd.acct.5,v 1.10 2001/07/29 05:15:21 horikawa Exp $
.Dd September 11, 1998
.Dt ISDND.ACCT 5
.Os
.Sh 名称
.Nm isdnd.acct
.Nd isdn4bsd ISDN 管理デーモンのアカウンティングファイルの形式
.Sh 解説
ファイル
.Pa isdnd.acct
はアカウンティング情報を含みます。
このアカウンティング情報は、
.Xr isdnd 8
の設定ファイル
.Xr isdnd.rc 5
中で変数
.Em useacctfile
が
.Em on
に設定されていて、かつ ISDN 接続に課金情報通達 (AOCD または AOCE)
が申し込まれていれば、書き込まれます。
.Pp
変数
.Em acctall
が
.Em on
に設定されていれば、ローカルサイトが課金されてない場合や、
課金情報が利用不能だったり課金情報を申し込んでいない場合でも、
アカウンティング情報が書き込まれます。
.Pp
アカウンティング行の一般的な形式は次のようになります:
.Pp
.Dl FROM - UNTIL NAME UNITS (SECONDS) (INBYTES/OUTBYTES)
.Pp
.Em FROM
は接続が確立された時刻で、
.Dl 日.月.年 時:分:秒
という形式になります。
.Pp
.Em UNTIL
は接続が切断された時刻です。形式は上記の
.Em FROM
と同じです。
.Pp
.Em NAME
は、設定ファイル
.Xr isdnd.rc 5
の
.Em name
エントリから得られる、この接続のシンボル名です。
.Pp
.Em UNITS
はその接続にかかった課金単位の合計です。
.Pp
.Em SECONDS
は接続が続いた秒数です。
.Pp
.Em INBYTES
(受信バイト) と
.Em OUTBYTES
(送信バイト) は転送されたバイト数です。(オプション)
.Sh 関連ファイル
.Bl -tag -width /var/log/isdnd.acct -compact
.It Pa /var/log/isdnd.acct
ISDN デーモン
.Nm isdnd
用のデフォルトのアカウンティング情報ファイル。
.Sh 使用例
これは典型的なアカウンティング行です:
.Pp
.Dl 12.06.97 10:41:37 - 12.06.97 10:45:18 GROGGY 2 (65) (4711/1147)
.Sh 関連項目
.Xr isdnd.rc 5 ,
.Xr isdnd 8
.Sh 作者
.Xr isdnd 8
デーモンと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
