freebsd/freebsd-doc/ja_JP.eucJP/man/man5/isdnd.rates.5
.\"
.\" Copyright (c) 1997, 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: isdnd.rates.5,v 1.10 1999/12/13 22:11:55 hm Exp % 
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdnd/isdnd.rates.5,v 1.9.2.1 2000/12/08 15:28:11 ru Exp %
.\"
.\"     last edit-date: [Mon Dec 13 22:59:31 1999]
.\"
.\" jpman %Id: isdnd.rates.5,v 1.3 1999/02/06 15:32:40 horikawa Stab %
.\" WORD: short hold time	ショートホールド時間
.Dd September 11, 1998
.Dt ISDND.RATES 5
.Os
.Sh 名称
.Nm isdnd.rates
.Nd isdn4bsd ISDN 管理デーモン料金記述ファイル
.Sh 解説
ファイル
.Pa isdnd.rates
には、ある時刻、曜日、接続先への距離について、
課金単位がどれだけの間続くかを記述します。
このファイルが利用可能な場合、これらの情報は ISDN 接続管理デーモン
.Xr isdnd 8
が接続のショートホールド時間を計算するのに使われます。
.Pp
料金エントリ行の書式は次のようになります:
.Pp
最初のフィールドである
.Pq Fa rate-code
は (各曜日の) 料金の集合を定義します。
この集合は
.Xr isdnd 8
設定ファイル
.Xr isdnd.rc 5
で参照できます。
このフィールドは識別子
.Dq ra
で始まり、0 から 4 までの範囲の数字をひとつ続ける必要があります。
.Pp
2 番目のフィールドである
.Pq Fa day-number
は、そのエントリが料金を定義する曜日を選択します。
0 が日曜日、1 が月曜日で、土曜日を表す数字 6 までです。
.Pp
行の残りは、スペースで区切られた 1 個以上のフィールドから成り、
各フィールドは次の構文を取ります:
.Bd -filled -offset indent
start_hour.start_minutes-end_hour.end_minutes:charge_unit_length
.Ed
.Pp
start_hour (開始時) と start_minutes (開始分) はある時間区分の開始を、
end_hour (終了時) と end_minutes (終了分) は終了を定義します。
charge_unit_length は、その前で定義されている時間区分における
課金単位の長さを定義します。このフィールド中にスペースやタブを
含めてはいけません。時間と分は必ず 2 桁で指定して下さい。
1 桁だけで十分な場合でも、0 を先行させる必要があります。
.Pp
例として、
.Bd -filled -offset indent
14.00-18.00:90
.Ed
.Pp
は、午後 2:00 から午後 6:00 の間は
ひとつの課金単位が 90 秒続くことを定義します。
.Sh 関連ファイル
.Bl -tag -width /etc/isdn/isdnd.rates -compact
.It Pa /etc/isdn/isdnd.rates
ISDN デーモン
.Nm isdnd
用のデフォルトの料金指定ファイル。
.El
.Sh 使用例
次の行:
.Bd -literal
ra0 0 00.00-05.00:240 05.00-21.00:150 21.00-24.00:240
.Ed
.Pp
は日曜日における単位の期間を定義しています。
.Sh 関連項目
.Xr isdnd.rc 5 ,
.Xr isdnd 8
.Sh 作者
.An -nosplit
.Nm
が属す
.Xr isdnd 8
デーモン用の料金サブシステムは
.An Gary Jennejohn
が設計、作成しました。
.Pp
.Xr isdnd 8
デーモンと本マニュアルページは
.An Hellmuth Michaelis Aq hm@hcs.de
が作成しました。
