freebsd/freebsd-doc/ja_JP.eucJP/man/man5/kbdmap.5
.\" Copyright (c) 2000
.\"	David Malone
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kbdcontrol/kbdmap.5,v 1.6.2.1 2004/08/24 20:43:10 simon Exp %
.\"
.\" $FreeBSD$
.\"
.Dd September 11, 2000
.Dt KBDMAP 5
.Os
.Sh 名称
.Nm kbdmap
.Nd kbdcontrol 用のキーボードマップファイルのフォーマット
.Sh 書式
.Nm
.Sh 解説
.Nm
ファイルには、キーボード上のキーが
どのように振る舞うべきかが記述されています。
これらのファイルは
.Xr kbdcontrol 1
によって読み込むこともできますし、
.Xr kbdmap 1
によってデフォルトの
.Nm
ファイルを対話的に選択することもできます。
.Nm
ファイルはブート時に読み込まれるように
.Xr rc.conf 5
に指定することもできます。
また
.Xr kbdcontrol 1
を使って現在のキーマップを出力することもできます。
.Pp
ファイルの各行には、キーまたはアクセントを記述します。
.Ql #
記号は行末までコメントを表します。
.Pp
キーの記述は、そのキーのスキャンコードから始めます。
その後にシフトキー、コントロールキー、オルトキーと
組み合わせた時の結果を次の順番で記述します:
無修飾、
シフト、
コントロール、
コントロールとシフト、
オルト、
オルトとシフト、
オルトとコントロール、
オルトとコントロールとシフト。
それぞれの修飾キーと組み合わせた時のアクションは、
以下を指定できます:
.Bl -tag -width Ar
.It ' Ns Ar symbol Ns No '
キーが生成すべき記号をシングルクォートでくくって指定します。
.It Ar decnum
生成する
.Tn ASCII
コードを 10 進数で指定します
(
.Xr ascii 7
参照)。
例えばスペースには 32 を指定します。
.It 0x Ns Ar hexnum
生成する
.Tn ASCII
コードを 16 進数で指定します。
例えばスペースには 0x20 を指定します。
.It Ar ctrlname
.Tn ASCII
コントロール文字の標準の名称を一つ指定します:
nul,
soh,
stx,
etx,
eot,
enq,
ack,
bel,
bs,
ht,
nl,
vt,
np,
cr,
so,
si,
dle,
dc1,
dc2,
dc3,
dc4,
nak,
syn,
etb,
can,
em,
sub,
esc,
fs,
gs,
rs,
ns,
us,
sp,
del。
.It Ar accentname
アクセントの名称を指定することで、
次に押すキーがそのアクセントに対応する文字を生成します。
後述のアクセントの記述を参照してください。
アクセントの名称は以下です:
dgra,
dacu,
dcir,
dtil,
dmac,
dbre,
ddot,
duml,
ddia,
dsla,
drin,
dced,
dapo,
ddac,
dogo,
dcar。
.It fkey Ns Ar N
.Ar N
番目のファンクションキーとして振る舞います。
ここで
.Ar N
は 10 進数です。
.It lshift
左シフトキーとして振る舞います。
.It rshift
右シフトキーとして振る舞います。
.It clock
キャプスロックキーとして振る舞います。
.It nlock
数値ロックキーとして振る舞います。
.It slock
スクロールロックキーとして振る舞います。
.It lalt|alt
左オルトキーとして振る舞います。
.It btab
バックワードタブとして振る舞います。
.It lctrl|ctrl
左コントロールキーとして振る舞います。
.It rctrl
右コントロールキーとして振る舞います。
.It ralt
右オルト (altgr) キーとして振る舞います。
.It alock
オルトロックキーとして振る舞います。
.It ashift
オルトシフトキーとして振る舞います。
.It meta
メタキーとして振る舞います。
.It lshifta|shifta
左シフトキー/オルトロックキーとして振る舞います。
(訳注 他のキーと一緒に押された時はシフトキー、
単独で押された時はオルトロックキーとなります。)
.It rshifta
右シフトキー/オルトロックキーとして振る舞います。
(訳注 lshifta 参照)
.It lctrla|ctrla
左コントロールキー/オルトロックキーとして振る舞います。
(訳注 他のキーと一緒に押された時はコントロールキー、
単独で押された時はオルトロックキーとなります。)
.It rctrla
右コントロールキー/オルトロックキーとして振る舞います。
(訳注 lctrla 参照)
.It lalta|alta
左オルトキー/オルトロックキーとして振る舞います。
(訳注 他のキーと一緒に押された時はオルトキー、
単独で押された時はオルトロックキーとなります。)
.It ralta
右オルトキー/オルトロックキーとして振る舞います。
(訳注 lalta 参照)
.It nscr
次のスクリーンへの切替キーとして振る舞います。
.It pscr
前のスクリーンへの切替キーとして振る舞います。
.It scr Ns Ar N
.Ar N
番目のスクリーンへの切替キーとして振る舞います。
ここで
.Ar N
は 10 進数です。
.It boot
マシンをリブートします。
.It halt
マシンを停止します。
.It pdwn
マシンを停止し電源を落します。
.It debug
デバッガを起動します。
.It susp
APM を使いサスペンドします。
.It saver
スプラッシュ画面とテキスト画面をトグルして
スクリーンセーバを有効にします。
.It panic
システムをパニックさせます。
この機能を有効にするには、
.Xr sysctl 8
変数
.Va machdep.enable_panic_key
を 1 に設定する必要があります。
.It paste
マウスバッファのペーストと同じです。
.El
.Pp
最後に、キーの記述を完了するために、
キャプスロックと数値ロックが押された時の結果を
記述するフラグを指定します。
キャプスロックがそのキーに影響することを示すには
.Ql C
を、数値ロックがそのキーに影響することを示すには
.Ql N
を、キャプスロックと数値ロックの両方が
そのキーに影響することを示すには
.Ql B
を、そしてどちらも影響しない時は
.Ql O
を指定します。
.Pp
アクセントキーは、次に押されたキーの振る舞いを
装飾するよう働きます。
アクセントの記述は、
前述のアクセントの名称の一つから始めます。
次にそのアクセントの記号が、シングルクォートでくくられるか、
10 進数または 16 進数の
.Tn ASCII
コードで指定されます。
この記号は、アクセントキーの次にスペースキーが
押された時に生成されます。
.Pp
アクセントキーの記述は、
様々な記号をどのように装飾するかを、
通常の記号と装飾された記号の対を小括弧でくくったリストによって
続けて指定します。
どちらの記号も、シングルクォートでくくられるか、
10 進数または 16 進数の
.Tn ASCII
コードで指定されます。
.Pp
例として、ある
.Nm
から引用した記述を見てみます:
.Bd -literal -offset indent
  041   dgra   172    nop    nop    '|'    '|'    nop    nop     O
  dgra  '`'  ( 'a' 224 ) ( 'A' 192 ) ( 'e' 232 ) ( 'E' 200 )
             ( 'i' 236 ) ( 'I' 204 ) ( 'o' 242 ) ( 'O' 210 )
             ( 'u' 249 ) ( 'U' 217 )
.Ed
この引用部は UK キーボード上で
抑音記号キーとして振る舞う
バックティックキーを設定しています。
バックティックキーの後にスペースキーを押すと
バックティックを生成し、
バックティックの後に母音を押すと
抑音記号付きの母音に対応する
ISO-8859-1 の記号を生成します。
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/keymaps/* -compact
.It Pa /usr/share/syscons/keymaps/*
標準キーボードマップファイル
.El
.Sh 関連項目
.Xr kbdcontrol 1 ,
.Xr kbdmap 1 ,
.Xr keyboard 4 ,
.Xr syscons 4 ,
.Xr ascii 7
.Sh 歴史
このマニュアルページは
.Fx 4.2
で初めて登場しました。
