freebsd/freebsd-doc/ja_JP.eucJP/man/man5/kernfs.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard.
.\" 4. Neither the name of author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/kernfs.5,v 1.8 1999/08/28 00:20:46 peter Exp %
.\"
.\" jpman %Id: kernfs.5,v 1.3 1998/07/21 23:04:50 jsakai Stab %
.\"WORD: machine independent	機種に依存しない
.\"WORD: decimal ASCII		ASCII 表記の 10 進数
.\"WORD: mount point		マウントポイント
.\"
.Dd December 14, 1996
.Dt KERNFS 5
.Os BSD 4.4
.Sh 名称
.Nm kernfs
.Nd カーネルファイルシステム
.Sh 書式
.Bd -literal
kern		/kern	kernfs	rw 0 0
.Ed
.Sh 解説
カーネルファイルシステム
.Nm kernfs
は、現在実行中のカーネルに関する情報へのアクセス手段を提供するものです。
これは通常 
.Pa /kern
にマウントされます。
このファイルシステムは読み取り可能な数個の通常ファイルを含んでおり、
これらのファイルの一部には書き込むこともできます。
ファイルの内容は文字列と ASCII 表記の 10 進整数からなり、
機種に依存しない書式になっています。
数値が返されるときは、後ろに改行文字が付け加えられます。
.Pp
マウントポイントには以下のファイルが含まれます。
.Bl -tag -width copyright
.It Pa bootfile
現在のカーネルが起動したパス。
.It Pa boottime
システムが最後に起動した時間 (ASCII 表記の 10 進数)。
.It Pa copyright
カーネルの著作権標示。
.It Pa hostname
現在のホスト名。後ろに改行がつきます。
このファイルに書き込むことにより、現在のホスト名を変更することが
できます。
ホスト名に後続する改行文字は書き込み時には取り除かれます。
.It Pa hz
システムクロックの周波数 (ASCII 表記の 10 進数)。
.It Pa  loadavg
過去 1 分間、5 分間および 15 分間のロードアベレージで、カーネル固定小数点
フォーマットで表されます。最後の整数は固定小数のスケーリングファクタ
です。全ての数値は ASCII 10 進数で表されます。
.It Pa pagesize
マシンのページサイズ (ASCII 10進数)。
.It Pa physmem
マシンの物理メモリのページ数 (ASCII 表記の 10 進数)。
.It Pa root
システムのルートディレクトリ。chroot した環境では、
.Xr mount_kernfs 8
を、新しい
.Pa /kern
マウントポイントを生成するために用いることができます。
.Pa /kern/root
はカレントプロセスのルートではなく、システム全体のルートを示すことに
なる予定です。現在はまだ利用できません。
.It Pa rootdev
ルートデバイス。現在はまだ利用できません。
.It Pa rrootdev
raw ルートデバイス。現在はまだ利用できません。
.It Pa time
システムクロックの秒数およびマイクロ秒数 (ASCII 表記の 10 進数)。
.It Pa version
カーネルのバージョン文字列。
.Pa /etc/motd
のヘッドラインは
.Dq Ic "sed 1q /kern/version"
を実行することによって生成することができます。
.El
.Pp
.Nm
によって得られる情報のほとんどは
.Xr sysctl 8
からも入手可能です。
.Sh 関連ファイル
.Bl -tag -width /kern/XXXXXXX
.It Pa /kern
.Nm kernfs
のための通常のマウントポイント。
.El
.Sh 関連項目
.Xr sysctl 3 ,
.Xr mount_kernfs 8 ,
.Xr sysctl 8
.Sh 歴史
.Nm 
ファイルシステムは
.Bx 4.4
で最初に登場しました。
.Nm
マニュアルページは
.Fx 2.2
で最初に登場しました。
.Sh 作者
.Nm
マニュアルページは
.An Mike Pritchard Aq mpp@FreeBSD.org
によって書かれたもので、
.An Jan-Simon Pendry
による
.Xr mount_kernfs 8
マニュアルページに基づいています。
