freebsd/freebsd-doc/ja_JP.eucJP/man/man5/keycap.5
.\"
.\" Copyright (c) 1992,1993,1994 Hellmuth Michaelis
.\"
.\" Copyright (c) 1990 The Regents of the University of California.
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" @(#)keycap.5, 3.00, Last Edit-Date: [Sun Jan  2 13:45:59 1994]
.\" %FreeBSD: src/usr.sbin/pcvt/keycap/man5/keycap.5,v 1.9.2.3 2000/12/27 16:23:19 ru Exp %
.\"
.\" $FreeBSD$
.\"WORD: keyboard mapping	キーボードマッピング
.\"WORD: .Sh CAPABILITIES	ケーパビリティ
.\"
.\"
.Dd January 3, 1993
.Dt KEYCAP 5
.Os FreeBSD
.Sh 名称
.Nm keycap
.Nd キーボードマッピングデータベース
.Sh 書式
.Nm
.Sh 解説
.Nm
ファイルはキーボードマッピングを記述するデータベースで、
.Xr kcon 1
が用います。
.Pp
.Nm
のエントリは `:' で区切られた多数のフィールドからなります。
各マッピングの最初のエントリは、そのマッピングの名称として
認識される名前を、文字 `|' で区切って並べたものです。
最初と最後以外の全ての名前は全部小文字で、空白文字を含まない必要があります。
最後の名前は可読性を高めるために、大文字や空白文字を含めることができます。
.Sh ケーパビリティ
.Pp
.Bl -column indent indent
.Sy "名称	型	解説
.It "de	bool	キーボードマッピングをコンパイル時に入れたデフォルトにリセットする"
.It "D<n>	bool	キー <n> を完全に使用不可にする"
.It "
.It "m<n>	num	ALT キーのキー番号を指定する
.It "l<n>	num	ALTGR キーのキー番号を指定する
.It "h<n>	num	SHIFT キーのキー番号を指定する
.It "t<n>	num	CONTROL キーのキー番号を指定する
.It "ca<n>	num	CAPS LOCK キーのキー番号を指定する
.It "sh<n>	num	SHIFT LOCK キーのキー番号を指定する
.It "nl<n>	num	NUM LOCK キーのキー番号を指定する
.It "sc<n>	num	SCROLL LOCK キーのキー番号を指定する
.It "
.It "K<n>	str	シフトなし (通常) のキーに文字列を対応させる
.It "S<n>	str	シフト (SHIFT キーと同時に押す) 時のキーに文字列を対応させる
.It "C<n>	str	CONTROL キーと同時に押したときの文字列を対応づける
.It "A<n>	str	ALTGR キーと同時に押したときの文字列を対応づける
.It "
.It "tc	str	指定箇所以外が同じマップを持つエントリ \- 最後に指定する必要があります。"
.El
.Pp
キー番号を記述するパラメータ <n> は 1 から 128 までの番号を取ることが
できます。

文字列パラメータは 15 文字までの値を取ることができます。

.Pp
.Ss エントリの例
以下のエントリはテスト用のエントリ記述で、
.Nm
ファイルの中のごく単純なエントリ記述の1つに、この記述通りのものが存在します。
.Pp
.Bd -literal
tt\||test\||Test entry which swaps y and z:\e
	:K22=z:S22=Z:C22=\e032:\e
	:K46=y:S46=Y:C46=\e031:
.Ed
.Pp
行の最後に \e を置くことによって、エントリを複数行に続けることができます。
コメントは
.Dq #
で始まる行に含めることができます。
.Sh 関連ファイル
.Bl -tag -width /usr/share/misc/keycap.pcvt -compact
.It Pa /usr/share/misc/keycap.pcvt
キーボードマッピングの記述を含むファイル
.El
.Sh 関連項目
.Xr kcon 1 ,
.Xr keycap 3
.Sh 使用例
.Dq Li l1#60
は、 ALTGR キーのキー番号として、 60 を指定します。
.Pp
.Dq Li K100=hugo
は、キー番号 100 のキーに文字列 'hugo' を対応させます。
.Pp
.Dq Li K100=^D
は、キー番号 100 のキーにコントロール文字 EOT (0x04) を対応させます。
.Pp
.Dq Li K100=\e000
は、キー番号 100 のキーにコントロール文字 NUL (0x00) を対応させます。
