freebsd/freebsd-doc/ja_JP.eucJP/man/man5/linprocfs.5
.\" %FreeBSD: src/share/man/man5/linprocfs.5,v 1.1.2.4 2001/07/21 09:16:52 schweikh Exp %
.\" Written by Garrett Wollman
.\" This file is in the public domain.
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/linprocfs.5,v 1.3 2001/05/14 01:09:29 horikawa Exp $
.Dd August 10, 1994
.Dt LINPROCFS 5
.Os BSD 4.4
.Sh 名称
.Nm linprocfs
.Nd Linux プロセスファイルシステム
.Sh 書式
.Bd -literal
linproc		/compat/linux/proc	linprocfs	rw 0 0
.Ed
.Sh 解説
Linux プロセスファイルシステム、すなわち
.Nm
は、Linux のプロセスファイルシステムのサブセットをエミュレートします。
いくつかの Linux バイナリが完全動作するために必要です。
.Pp
.Nm
はプロセス空間の 2 つのレベルのビューを提供します。
高いレベルでは、プロセスは、先頭に 0 の付かない
10 進数のプロセス ID に従って名前付けされます。
また、調査要求を行っているプロセスを常に参照する、
.Pa self
と呼ばれる特別なノードも存在します。
.Pp
各ノードは以下の項目を含むディレクトリです:
.Pp
各ディレクトリはいくつかのファイルを含んでいます:
.Bl -tag -width status
.It Pa exe
プロセステキストが読まれた vnode への参照。
これはプロセスのシンボルテーブルへのアクセスを得るか、または
プロセスのもう 1 つのコピーを始めるために使われます。
.It Pa mem
プロセスの完全な仮想メモリイメージ。
プロセス中に存在するアドレスのみにアクセス可能です。
このファイルへ読み書きするとプロセスを修正します。
テキストセグメントへの書き込みは、そのプロセスのみに留まります。
.El
.Pp
各ノードはプロセスのユーザによって所有され、
ユーザのプライマリグループに属します。
.Pa mem
ノードは例外で、
.Li kmem
グループに属します。
.Sh 関連ファイル
.Bl -tag -width /compat/linux/proc/self/XXXXXXX -compact
.It Pa /compat/linux/proc
.Nm
の標準マウントポイント。
.It Pa /compat/linux/proc/cpuinfo
人間が判読しやすい形式の、CPU のベンダとモデルに関する情報。
.It Pa /compat/linux/proc/meminfo
人間が判読しやすい形式の、システムのメモリ情報。
.It Pa /compat/linux/proc/pid
プロセス
.Pa pid
のプロセス情報を含んだディレクトリ。
.It Pa /compat/linux/proc/self
カレントプロセスのプロセス情報を含んだディレクトリ
.It Pa /compat/linux/proc/self/exe
実行形式イメージ
.It Pa /compat/linux/proc/self/mem
プロセスの完全な仮想アドレス空間
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr procfs 5 ,
.Xr mount_linprocfs 8
.Sh 作者
.An -nosplit
.Nm
は、
.An Pierre Beyssac
によって
.Nm procfs
から作られました。
このマニュアルページは、
.An Garrett Wollman
が書いた
.Xr procfs 5
マニュアルページに基づいて、
.ie t .An Dag-Erling Sm\(/orgrav
.el An Dag-Erling Smorgrav
が書きました。
.Sh 歴史
.Nm
は
.Fx 4.0
ではじめて登場しました。
