freebsd/freebsd-doc/ja_JP.eucJP/man/man5/login.access.5
.\"
.\" %FreeBSD: src/usr.bin/login/login.access.5,v 1.12 2002/10/16 15:17:38 charnier Exp %
.\"
.\" $FreeBSD$
.\"
.\" WORD: access granted	アクセス許可(許可された状態)
.\"
.Dd April 30, 1994
.Dt LOGIN.ACCESS 5
.Os
.Sh 名称
.Nm login.access
.Nd ログインアクセス制御表
.Sh 解説
.Nm
ファイルは、ログインを許可または拒否する
(ユーザ, ホスト) の組や (ユーザ, tty) の組を指定します。
.Pp
誰かがログインする際に、
.Nm
から (ユーザ, ホスト) の組にマッチする最初のエントリを探します。
非ネットワークログインの場合には、
(ユーザ, tty) の組にマッチする最初のエントリを探します。
表のエントリ中のパーミッションフィールドは、
ログインを許可するか拒否するかを決定します。
.Pp
ログインアクセス制御表の各行は、":" 文字で区切られる
次のような 3 フィールドから成ります:	パーミッション : ユーザ : 起点
.Pp
第 1 フィールドは、"+" (アクセス許可) もしくは "-" (アクセス不許可) の
文字です。
第 2 フィールドは、ログイン名・グループ名・ALL (常にマッチ)
を 1 つ以上含むリストです。
第 3 フィールドは、tty 名 (非ネットワークログイン用)・ホスト名・
ドメイン名 ("." から開始)・ホストアドレス・インターネットのネットワーク番号
("." で終了)・ALL (常にマッチ)・LOCAL ("." を含まない文字列にマッチ)
を 1 つ以上含むリストです。
NIS 使用時には、ホストおよびユーザの指定に @netgroupname を使用できます。
.Pp
EXCEPT 演算子を使用すると、非常に小さいルールを記述できます。
.Pp
名前がログインしたユーザ名にマッチしない場合のみ、
グループファイルが検索されます。
ユーザが明示的にリストされている
グループのみがマッチします。
このプログラムはユーザのプライマリグループ ID 値を見ません。
.Sh 関連ファイル
.Bl -tag -width /etc/login.access -compact
.It Pa /etc/login.access
ログインアクセス制御テーブル
.El
.Sh 関連項目
.Xr login 1 ,
.Xr pam 8
.Sh 作者
.An Guido van Rooij
