freebsd/freebsd-doc/ja_JP.eucJP/man/man5/magic.5
.\"
.\" %FreeBSD: src/usr.bin/file/magic.5,v 1.11.2.3 2000/12/12 14:52:49 ru Exp %
.\"
.\" install as magic.4 on USG, magic.5 on V7 or Berkeley systems.
.\"
.\" jpman %Id: magic.5,v 1.3 1998/07/21 05:29:49 jsakai Stab %
.Dd December 8, 2000
.Dt MAGIC 5 "Public Domain"
.Os 
.Sh 名称
.Nm magic
.Nd file コマンドのマジック番号ファイル
.Sh 解説
このマニュアルページでは
.Xr file 1
コマンド バージョン 3.22 で使用されるマジックファイルのフォーマットに
ついて説明します。
.Nm file
コマンドは、他のテストと共に、ファイルがある
.Em "マジック番号"
で始まっているかどうかをテストして、ファイルのタイプを識別します。
ファイル
.Pa /usr/share/misc/magic
では、どのマジック番号をテストするか、
あるマジック番号が見つかったときにどのようなメッセージを出力するか、
また、そのファイルから抽出するべき追加情報について指定しています。
.Pp
このファイルの各行ではテストすべき項目について指定しています。
テストは、ファイル中のある特定のオフセットで始まるデータを
1 バイト、2 バイトもしくは 4 バイトの数値あるいは文字列と
比較して行います。
もしテストが成功するとメッセージが出力されます。
各行は以下のフィールドから構成されます。
.Bl -tag -width indent
.It offset
テストするファイルのデータのオフセットをバイト数で指定する数字です。
.It type
テストするデータの型です。指定できる値は
.Bl -tag -width indent
.It byte
1 バイトの値。
.It short
(ほとんどのシステムにおいて) 2 バイトの値。
そのマシンの固有のバイト順で指定します。
.It long
(ほとんどのシステムにおいて) 4 バイトの値。
そのマシンの固有のバイト順で指定します。
.It string
バイトの文字列。
文字列タイプの指定には、後ろに /[Bbc]* を付けることが可能です。
.Dq B
フラグは、ターゲットの空白を圧縮します。
圧縮対象には、少なくともひとつの空白文字が含まれることが必要です。
マジックに "n" 個の連続する空白がある場合、
マッチするためには、
ターゲットには少なくとも "n" 個の連続する空白があることが必要です。
.Dq b
フラグは、すべての空白を省略可能な空白として扱います。
最後に
.Dq c
は、大文字小文字を区別しないマッチングを指定します。
すなわち、マジック中の小文字は、
ターゲット中の小文字と大文字の両方にマッチします。
一方、マジック中の大文字は、ターゲット中の大文字にのみマッチします。
.It date
UNIX 日時として解釈される 4 バイトの値。
.It beshort
(ほとんどのシステムにおいて) 2 バイトの値。
ビッグエンディアンのバイト順です。
.It belong
(ほとんどのシステムにおいて) 4 バイトの値。
ビッグエンディアンのバイト順です。
.It bedate
UNIX 日時として解釈される (ほとんどのシステムにおいて) 4 バイトの値。
ビッグエンディアンのバイト順です。
.It leshort
(ほとんどのシステムにおいて) 2 バイトの値。
リトルエンディアンのバイト順です。
.It lelong
(ほとんどのシステムにおいて) 4 バイトの値。
リトルエンディアンのバイト順です。
.It ledate
UNIX 日時として解釈される (ほとんどのシステムにおいて) 4 バイトの値。
リトルエンディアンのバイト順です。
.El
.El
.Pp
数字の型にはオプションとして
.Em &
と数値を続けることができ、
これにより比較を行う前に AND をとる数値を指定します。
型の前に
.Em u
を付加すると比較は符号なしで行なわれます。
.Bl -tag -width indent
.It test
ファイル中の値と比較される値。
型が数字の場合、この値は C 言語の形式で指定されます。
これが文字列の場合、
通常のエスケープ記法 (たとえば改行では\en) が可能な C 言語文字列として
指定されます。
.It ""
数値の前には実行される操作を示す文字を付加することができます。
その文字には
ファイルの値が指定された値と等価であることを指定する
.Em =
、ファイルの値が指定された値より小さいことを指定する
.Em <
、ファイルの値が指定された値より大きいことを指定する
.Em >
、指定された値の中でセットされているすべてのビットが
ファイルでの値ですべてセットされていることを指定する
.Em &
、指定された値の中でセットされているどれかのビットが
ファイルでの値でオフであることを指定する
.Em ^
、何らかの値がマッチすることを指定する
.Em x
があります。
これらの文字がない場合は
.Em =
が指定されているものとみなされます。
.It ""
数値は C 言語の形式で指定されます。例えば
.Em 13
は 10 進数、
.Em 013
は 8 進数、
.Em 0x13
は 16 進数となります。
.It ""
文字列値については、
ファイル中のバイト文字列は指定されたバイト文字列に
マッチしなければなりません。
オペレータ
.Em =
と
.Em <
と
.Em >
(
.Em &
を除く)
が文字列に適用できます。
マッチングに使用される長さは
マジックファイルでの文字列の引数の長さとなります。
これは
.Em >\e0
とすることにより、
その行はどの文字列にもマッチすることが可能であり、
おそらくその文字列が出力されることを意味します
(すべての文字列はヌル文字列より長いため)。
.It message
比較が成立したときに出力されるメッセージです。
文字列に
.Xr printf 3
指定形式が含まれている場合は、ファイルから得た値 (指定されたマスクを
適用したもの) が、そのメッセージをフォーマット文字列として用いて出力さ
れます。
.El
.Pp
いくつかのファイルフォーマットは、ファイルタイプと共に出力される追加情報
を含んでいます。文字
.Em >
で始まる行は追加テストと出力されるメッセージを指定します。
その行での
.Em >
の数はテストのレベルを指定します。行頭に
.Em >
がない行はレベル 0 とみなされます。
レベル
.Em n+1
の各行はマジックファイル中でその行より前にあるもっとも近いレベル
.Em n
の行の制御下にあります。レベル
.Em n
での行のテストが成功した場合、それに続く行で指定されたすべてのレベル
.Em n+1
のテストが実施され、
それらのテストが成功するとメッセージが出力されます。
次のレベル
.Em n
の行でこれが終了します。
最後の
.Em >
に続く最初の文字が
.Em \&(
であれば、その括弧の後の文字列は間接オフセットとして解釈されます。
これは括弧の後の数字がそのファイル中のオフセットとして使用されることを
意味します。そのオフセットでの値が読み込まれ、再度ファイルのオフセット
として使用されます。間接オフセットは
.Em (x[.[bslBSL]][+-][y])
の形式をとります。値
.Em x
はファイル中でのオフセットとして使われます。
型指定子
.Em [bslBSL] 
によりそれぞれバイト、short もしくは long として読み込まれます。
大文字の型は、値をビッグエンディアンとして解釈し、
小文字の型は、値をリトルエンディアンとして解釈します。
その数字に値
.Em y
が加算され、その結果はファイルの中でのオフセットとして使用されます。型
指定子がない場合は long がデフォルトの型となります。
.Pp
オフセットは、その前にあるフィールドの長さに依存するため、
正確な値が分からない場合があります。
そのような場合は最後の上位レベルのフィールドの最後からの
相対的なオフセットを指定することができます。
(もちろんこれは下位レベルのテスト、すなわち
.Em >
で始まるテストでのみ可能です。)
この場合の相対オフセットは
.Em &
をオフセットのプレフィックスとして使用して指定します。
.Sh バグ
フォーマット
.Em long ,
.Em belong ,
.Em lelong ,
.Em short ,
.Em beshort ,
.Em leshort ,
.Em date ,
.Em bedate ,
.Em ledate
はシステムに依存します。
テストされるファイルは通常それらの長さが不変であるシステムのものであり、
これらはおそらくバイト数 (2B とか 4B とか) として指定すべきででょう。
.Pp
間接オフセットで使用されるエンディアンを指定したデータは
(現在は) サポートされていません。
.Sh 関連項目
.Xr file 1
.\"
.\" From: guy@sun.uucp (Guy Harris)
.\" Newsgroups: net.bugs.usg
.\" Subject: /etc/magic's format isn't well documented
.\" Message-ID: <2752@sun.uucp>
.\" Date: 3 Sep 85 08:19:07 GMT
.\" Organization: Sun Microsystems, Inc.
.\" Lines: 136
.\" 
.\" Here's a manual page for the format accepted by the "file" made by adding
.\" the changes I posted to the S5R2 version.
.\"
.\" Modified for Ian Darwin's version of the file command.
