freebsd/freebsd-doc/ja_JP.eucJP/man/man5/mailer.conf.5
.\"	$NetBSD: mailer.conf.5,v 1.2 1999/05/29 18:18:30 christos Exp %
.\"	%FreeBSD: src/share/man/man5/mailer.conf.5,v 1.1.1.1.2.5 2001/08/17 13:08:47 ru Exp %
.\"
.\" Copyright (c) 1998
.\" 	Perry E. Metzger.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed for the NetBSD Project
.\"	by Perry E. Metzger.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/mailer.conf.5,v 1.7 2001/08/18 23:50:30 horikawa Exp $
.\" The following requests are required for all man pages.
.Dd December 16, 1998
.Dt MAILER.CONF 5
.Os
.Sh 名称
.Nm mailer.conf
.Xr mailwrapper 8
.Nd の設定ファイル
.Sh 解説
.Pa /etc/mail/mailer.conf
はいくつかのペアが含まれています。
それぞれのペアの 1 番目の要素は
.Xr mailwrapper 8
によって起動されるプログラムの名前です。
通常、このプログラムは
.Pa /usr/sbin/sendmail
へのシンボリックリンクです (大抵のシステムでは、
.Xr newaliases 1
と
.Xr mailq 1
はそのように設定されているでしょう)。
それぞれのペアの 2 番目の要素は最初の名前が起動された時に、
実際に実行されるプログラムの名前です。
ファイルにはどの行にでも最初の列に # を示すことにより、
コメントを含めることができます。
.Sh 使用例
以下は伝統的な sendmail 起動動作のための
.Nm
設定例です。
.Bd -literal
# /usr/libexec/sendmail/sendmail という名前 "実際の" sendmail を実行します
sendmail	/usr/libexec/sendmail/sendmail
send-mail	/usr/libexec/sendmail/sendmail
mailq		/usr/libexec/sendmail/sendmail
newaliases	/usr/libexec/sendmail/sendmail
.Ed
.Pp
この例では、sendmail の代わりに、sendmail のように動作する Postfix を
起動する方法を示しています。
.Bd -literal
# postfix を用いて sendmail をエミュレートします
sendmail	/usr/libexec/postfix/sendmail
send-mail	/usr/libexec/postfix/sendmail
mailq		/usr/libexec/postfix/sendmail
newaliases	/usr/libexec/postfix/sendmail
.Ed
.Sh 関連ファイル
/etc/mail/mailer.conf
.Sh 関連項目
.Xr mail 1 ,
.Xr mailq 1 ,
.Xr newaliases 1 ,
.Xr mailwrapper 8 ,
.Xr sendmail 8
.Sh 歴史
.Nm
は
.Nx 1.4
で登場しました。
.Sh 作者
Perry E. Metzger <perry@piermont.com>
.Sh バグ
このプログラムは、互換のためだけに存在しています。このプログラムのかわりに、
どういう手段でメールを送るかを決める標準的なコマンドをつくり、そして
.Xr mailq 1
のような "異なる名前で実行されると振る舞いが異なる" という動作は
すべてなくしてしまうべきです。
