freebsd/freebsd-doc/ja_JP.eucJP/man/man5/make.conf.5
.\" Copyright (c) 2000
.\"	Mike W. Meyer
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/make.conf.5,v 1.89.2.4 2004/10/09 18:38:58 dougb Exp %
.\"
.\" $FreeBSD$
.\"
.Dd October 5, 2004
.Dt MAKE.CONF 5
.Os
.Sh 名称
.Nm make.conf
.Nd システムビルド情報
.Sh 解説
.Nm
ファイルには
.Fx
のソースや ports アプリケーションの制御に関する設定が含まれています。
通常
.Nm
ファイルは、システム管理者が、
これらの値をデフォルトから変更したい場合に作成します。
.Pp
.Nm
の用途は、コマンド実行やコンパイル動作を直接行うことではなく、
.Pa /usr/src ,
.Pa /usr/ports ,
.Pa /usr/doc
などにある様々な makefile にインクルードされることです。
そのような makefile では、内部の動作が
.Nm
の与える条件によって変化するようになっているのです。
.Pp
.Pa /etc/make.conf
ファイルはそれぞれ適切な
.Pa Makefile
からインクルードされます。
各々の Makefile の中では、
利用可能なすべてのオプションに対し、デフォルトの設定が与えられています。
.Pa /etc/make.conf
で指定する必要があるオプションは、
システム管理者がデフォルトから変更したいと思ったものだけです。
.Pp
ビルドの手続きは、大きく 4 つの領域に分けられます。
world、カーネル、ドキュメント、ports です。
.Nm
で設定された変数はこれらの領域の 1 つ、2 つ、あるいは全てに適用されます。
変数は、特定のビルドに対して
.Xr make 1
の
.Fl D
オプションを用いて指定することもできます。
.Pp
以下のリストでは、それぞれ指定したビルドの途中で用いることのできる
各変数の名前と簡単な説明を記述します。
.Vt bool
と指定されている変数では、その値は意味を持ちません。
変数が設定されていれば (たとえ値が
.Dq Li FALSE
や
.Dq Li NO
でも)、変数が設定されているものとして扱われます。
.Pp
次のリストは、すべてのビルド (あるいはビルド以外の目的で使われる
.Pa Makefile )
で用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va ALWAYS_CHECK_MAKE
.Pq Vt bool
ソースツリー (通常は
.Pa /usr/src )
のトップレベル makefile に対し、
.Xr make 1
が最新であるか常に確認するよう指示します。
通常これは、古いバージョンの
.Fx
からのアップグレードを扱えるようにするために、
world および buildworld ターゲットに対してのみ実行されます。
.It Va CFLAGS
.Pq Vt str
C のコードをコンパイルするときのコンパイラの設定を制御します。
.Fl O
と
.Fl O2
以外の最適化レベルはサポートされていません。
.Va BDECFLAGS
は、
.An "Bruce Evans" Aq bde@FreeBSD.org
が開発や変更のテスト用に勧めている
.Xr gcc 1
設定です。
これは、設定すれば、以下のように使用可能です。
.Pp
.Bd -literal -offset indent
CFLAGS+=${BDECFLAGS}
.Ed
.It Va CPUTYPE
.Pq Vt str
生成コードが対象とするプロセッサを制御します。
特別なコード (現在のところ OpenSSL のみ) に対する
プロセッサ固有の最適化を制御し、
.Va CFLAGS
および
.Va COPTFLAGS
の値を変更して
.Xr gcc 1
への適切な最適化ディレクティブを含むようにします。
.Va CFLAGS
および
.Va COPTFLAGS
の自動設定は、それぞれ
.Va NO_CPU_CFLAGS
および
.Va NO_CPU_COPTFLAGS
で上書きできます。
認識される
.Va CPUTYPE
オプションについては、
.Pa /usr/share/examples/etc/make.conf
を参照してください。
.It Va NO_CPU_CFLAGS
.Pq Vt str
この変数を設定すると、コンパイル時に自動的に CPU 固有コンパイラフラグが
.Va CFLAGS
へ追加されることを妨げます。
.It Va NO_CPU_COPTFLAGS
.Pq Vt str
この変数を設定すると、コンパイル時に自動的に CPU 固有コンパイラフラグが
.Va COPTFLAGS
へ追加されることを妨げます。
.It Va CVS_UPDATE
.Pq Vt bool
.Dq Li "make update"
で ports を更新するときに
.Xr cvs 1
を用いる場合、設定します。
.It Va CXXFLAGS
.Pq Vt str
C++ のコードをコンパイルするときのコンパイラの設定を制御します。
.Va CXXFLAGS
は最初は
.Va CFLAGS
の値に設定されます。
この
.Va CXXFLAGS
の値に追加を行いたい場合は、
.Dq Li =
ではなく
.Dq Li +=
を用いてください。
.It Va INSTALL
.Pq Vt str
デフォルトのインストールコマンドです。
ターゲットと異なるか存在しないファイルのみをインストールする場合、
次の例を用いてください。
.Bd -literal -offset indent
INSTALL="install -C"
.Ed
.Pa ( /usr/share/mk
にあるものを含めて) makefile によっては、
与えられたインストールコマンドに対して
固定のオプションを与えてしまうものがあることに注意してください。
.It Va LOCAL_DIRS
.Pq Vt str
この変数には
.Pa /usr/src
で make を行うときに入るべきディレクトリをすべてリストします。
.It Va MAKE_SHELL
.Pq Vt str
.Xr make 1
が makefile 中のコマンドスクリプトを処理するために
内部的に使用するシェルを制御します。
.Xr sh 1 ,
.Xr ksh 1 ,
.Xr csh 1
すべてがサポートされています。
.Pp
.Dl "MAKE_SHELL?=sh"
.It Va MTREE_FOLLOWS_SYMLINKS
.Pq Vt str
.Xr mtree 8
にシンボリックリンクを追跡させたい場合は、これを
.Dq Fl L
に設定します。
.It Va NO_DOCUPDATE
.Pq Vt bool
.Dq Li "make update"
で doc ツリーを更新させない場合これを設定します。
.It Va NO_PORTSUPDATE
.Pq Vt bool
.Dq Li "make update"
で ports ツリーを更新させない場合これを設定します。
.It Va SUP_UPDATE
.Pq Vt bool
.Dq Li "make update"
による ports の更新に
.Xr cvsup 1
を使う場合これを設定します。
.It Va SUP
.Pq Vt str
.Dq Li "make update"
で用いられる
.Xr cvsup 1
コマンドの置き場所です。
.It Va SUPFLAGS
.Pq Vt str
.Dq Li "make update"
を行うとき
.Xr sup 1
に与えるフラグ。
デフォルトは
.Op Fl g L Ar 2
です。
.It Va SUPHOST
.Pq Vt str
.Dq Li "make update"
を行うときに用いる sup サーバのホスト名です。
.It Va SUPFILE
.Pq Vt str
.Dq Li "make update"
を行うとき、最初に用いる
.Ar supfile
です。
デフォルトは
.Pa /usr/share/examples/cvsup/standard\-supfile
です。
.It Va SUPFILE1
.Pq Vt str
.Dq Li "make update"
を行うとき、二番目に用いる
.Ar supfile
です。
デフォルトは
.Pa /usr/share/examples/cvsup/secure\-supfile
です。
.It Va SUPFILE2
.Pq Vt str
.Dq Li "make update"
を行うとき、三番目に用いる
.Ar supfile
です。
デフォルトは
.Pa /usr/share/examples/cvsup/secure\-supfile
です。
.It Va PORTSSUPFILE
.Pq Vt str
.Dq Li "make update"
を行うときの ports 用の
.Ar supfile
です。
デフォルトは
.Pa /usr/share/examples/cvsup/ports\-supfile
です。
.It Va DOCSUPFILE
.Pq Vt str
.Dq Li "make update"
を行うときのドキュメント用の
.Ar supfile
です。
デフォルトは
.Pa /usr/share/examples/cvsup/doc\-supfile
です。
.El
.Pp
次のリストは、カーネルのビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va BOOT_COMCONSOLE_PORT
.Pq Vt str
ブートブロックが、キーボード/ビデオカードの代わりにシリアルコンソールを
用いるよう設定された場合に、コンソールとして用いるポートアドレスです。
.It Va BOOT_COMCONSOLE_SPEED
.Pq Vt int
ブートブロックが、キーボード/ビデオカードの代わりにシリアルコンソールを
用いるよう設定された場合に、コンソールで用いるボーレートです。
.It Va BOOTWAIT
.Pq Vt int
カーネルがデフォルトカーネルのブートを開始する前に、
コンソールのキーが押されるのを待つ時間を制御します。
値はだいたいミリ秒単位となります。
ディスクからブートする前のキー入力の認識は BIOS が行うので、
これが 0 に設定されていた場合でも、
ユーザの選択したブートパラメータを与えることは可能です。
.It Va COPTFLAGS
.Pq Vt str
カーネルをコンパイルするときのコンパイラの設定を制御します。
.Op Fl O
を越えた最適化レベル
.Pq Op Fl O2 , No ...\&
は、動作が保証されていません。
.It Va KERNCONF
.Pq Vt str
.Dq Li "${MAKE} buildkernel"
によるビルドと
.Dq Li "${MAKE} installkernel"
によるインストールとで、どのカーネル設定を用いるかを制御します。
例えば
.Bd -literal -offset indent
KERNCONF=MINE DEBUG GENERIC OTHERMACHINE
.Ed
.Pp
とすると、
.Pa MINE , DEBUG , GENERIC , OTHERMACHINE
といった各設定ファイルに対応するカーネルをビルドし、
.Pa MINE
に対応するカーネルをインストールします。
デフォルトは
.Pa GENERIC
です。
.It Va LOADER_TFTP_SUPPORT
.Pq Vt bool
buildkernel が影響するオプションではありませんが、他に良い場所がありません。
デフォルトでは
.Xr pxeboot 8
ローダがカーネルを NFS 経由で取得します。
これを定義して
.Pa /usr/src/sys/boot
を再コンパイルすると、カーネルを TFTP 経由で取得するようになります。
これにより、
.Xr pxeboot 8
がカスタム BOOTP ディスクレスカーネルをロードし、サーバの
.Pa /
をマウントしますが、サーバのカーネルはロードしません。
.It Va MODULES_OVERRIDE
.Pq Vt str
モジュールすべてではなく一部をビルドしたい場合、
モジュールリストをここに設定します。
.It Va NO_KERNELCONFIG
.Pq Vt bool
.Dq Li "${MAKE} buildkernel"
の際に
.Xr config 8
を実行しない場合には、これを設定します。
.It Va NO_KERNELDEPEND
.Pq Vt bool
.Dq Li "${MAKE} buildkernel"
の際に
.Dq Li "${MAKE} depend"
を実行しない場合には、これを設定します。
.It Va NO_MODULES
.Pq Vt bool
カーネルといっしょにモジュールをビルドしない場合に設定します。
.El
.Pp
次のリストは、world のビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va COMPAT1X
.Pq Vt bool
.Fx
1 互換ライブラリをインストールする場合に設定します。
.It Va COMPAT20
.Pq Vt bool
.Fx 2.0
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT21
.Pq Vt bool
.Fx 2.1
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT22
.Pq Vt bool
.Fx 2.2
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT3X
.Pq Vt bool
.Fx
3 互換ライブラリをインストールする場合に設定します。
.It Va COMPAT4X
.Pq Vt bool
.Fx
4 互換ライブラリをインストールする場合に設定します。
.It Va MAKE_IDEA
.Pq Vt bool
IDEA 暗号化コードをビルドする場合に設定します。
このコードは米国やヨーロッパの多くの国々で特許が取得されています。
合法的に IDEA を使えるかどうか決めるのは
.Em あなたの責任
です。
.It Va NO_DYNAMICROOT
.Pq Vt bool
.Pa /bin
と
.Pa /sbin
を動的にリンクしたくない場合に設定します。
.It Va NO_KERBEROS
.Pq Vt bool
Kerberos 5 (KTH Heimdal) をビルドしたくない場合に設定します。
.It Va ENABLE_SUID_K5SU
.Pq Vt bool
ksu ユーティリティを使用したい場合に設定します。
設定しないと、本ユーティリティはユーザ ID 設定ビットが
設定されずにインストールされます。
.It Va ENABLE_SUID_NEWGRP
.Pq Vt bool
ユーザ ID 設定ビットを設定して
.Xr newgrp 1
をインストールする場合に、これを設定します。
設定しないと、
.Xr newgrp 1
はユーザのグループを変更できません。
.It Va ENABLE_SUID_SSH
.Pq Vt bool
.Xr ssh 1
をユーザ ID 設定ビットをオンにしてインストールする場合に、これを設定します。
.It Va MODULES_WITH_WORLD
.Pq Vt bool
カーネルと同時にではなく、
システムと同時にモジュールをビルドする場合に設定します。
.It Va NO_BLUETOOTH
.Pq Vt bool
Bluetooth 関連のカーネルモジュール、プログラム、ライブラリを
ビルドしない場合に設定します。
.It Va NO_BOOT
.Pq Vt bool
ブートブロックとローダをビルドしない場合に設定します。
.It Va NO_CVS
.Pq Vt bool
CVS をビルドしない場合に設定します。
.It Va NO_CXX
.Pq Vt bool
.Xr g++ 1
および関連ライブラリをビルドしない場合に設定します。
.It Va NO_FORTRAN
.Pq Vt bool
.Xr g77 1
と関連ライブラリをビルドしない場合に設定します。
.It Va NO_GDB
.Pq Vt bool
.Xr gdb 1
をビルドしない場合に設定します。
.It Va NO_I4B
.Pq Vt bool
isdn4bsd パッケージをビルドしない場合に設定します。
.It Va NO_IPFILTER
.Pq Vt bool
IP Filter パッケージをビルドしない場合に設定します。
.It Va NO_PF
.Pq Vt bool
PF ファイアウォールパッケージをビルドしない場合に設定します。
.It Va NO_AUTHPF
.Pq Vt bool
.Xr authpf 8
をビルドしない場合に設定します。
.It Va NO_TOOLCHAIN
.Pq Vt bool
プログラム開発に使用するプログラム、
すなわちコンパイラやデバッガ等をビルドしない場合に設定します。
.It Va NOINET6
.Pq Vt bool
IPv6 ネットワークに関連するプログラムやライブラリを
ビルドしない場合に設定します。
.It Va NOATM
.Pq Vt bool
ATM ネットワークに関連するプログラムやライブラリを
ビルドしない場合に設定します。
.It Va NO_USB
.Pq Vt bool
.Xr usbd 8
および関連プログラムをビルドしない場合に設定します。
.It Va NO_LPR
.Pq Vt bool
.Xr lpr 1
と関連プログラムをビルドしない場合に設定します。
.It Va NO_ACPI
.Pq Vt bool
.Xr acpiconf 8 ,
.Xr acpidump 8
および関連プログラムをビルドしない場合に設定します。
.It Va NO_VINUM
.Pq Vt bool
.Xr vinum 8
と関連プログラムをビルドしない場合に設定します。
.It Va NO_MAILWRAPPER
.Pq Vt bool
MTA セレクタである
.Xr mailwrapper 8
をビルドしない場合に設定します。
.It Va NOMAN
マニュアルページをビルドしない場合に設定します。
.Pq Vt bool
.It Va NO_OBJC
.Pq Vt bool
Objective C のサポートをビルドしない場合に設定します。
.It Va NO_OPENSSH
.Pq Vt bool
OpenSSH をビルドしない場合に設定します。
.It Va NO_OPENSSL
.Pq Vt bool
OpenSSL をビルドしない場合に設定します
(同時に
.Va NO_KERBEROS
と
.Va NO_OPENSSH
も設定されたことになります)。
.It Va NO_SENDMAIL
.Pq Vt bool
.Xr sendmail 8
と関連プログラムをビルドしない場合に設定します。
.It Va NO_SHAREDOCS
.Pq Vt bool
.Bx 4.4
の古い文書をビルドしない場合に設定します。
.It Va NO_TCSH
.Pq Vt bool
.Pa /bin/csh
(これは
.Xr tcsh 1
です) をビルド・インストールしない場合に設定します。
.It Va NOCLEAN
.Pq Vt bool
.Dq Li "make buildworld"
の途中で clean を行わない場合に設定します。
何をやっているかわからない人は設定すべきではありません。
.It Va NOCLEANDIR
.Pq Vt bool
.Dq Li "${MAKE} cleandir"
の代わりに
.Dq Li "${MAKE} clean"
を実行する場合に設定します。
.It Va NOCRYPT
.Pq Vt bool
crypto コードを一切ビルドしない場合に設定します。
.It Va NOGAMES
.Pq Vt bool
ゲームをビルドしない場合に設定します。
.It Va NOINFO
.Pq Vt bool
.Xr info 5
各ファイルを作成・インストールしない場合に設定します。
.It Va NOLIBC_R
.Pq Vt bool
.Nm libc_r
.Pf ( Nm libc
のリエントラント版) をビルドしない場合に設定します。
.It Va NOLIBPTHREAD
.Pq Vt bool
.Nm libpthread
(M:N スレッド) ライブラリをビルドしない場合に設定します。
.It Va NOLIBTHR
.Pq Vt bool
.Nm libthr
(1:1 スレッド) ライブラリをビルドしない場合に設定します。
.It Va NOMANCOMPRESS
.Pq Vt bool
man ページのインストールの際に圧縮を行わない場合に設定します。
.It Va NOPROFILE
.Pq Vt bool
profile 版ライブラリをコンパイルしない場合に設定します。
.It Va NOSHARE
.Pq Vt bool
.Pa share
サブディレクトリをビルドしない場合に設定します。
.It Va NO_BIND
.Pq Vt bool
BIND をビルドしない場合に設定します。
以下のどの *_BIND_* 変数が定義されていたとしても、
BIND を一部分たりともビルドしません。
.It Va NO_BIND_DNSSEC
.Pq Vt bool
DNSSEC 関連バイナリ
.Xr dnssec-keygen 8 ,
.Xr dnssec-signzone 8
のビルドおよびインストールをしない場合に設定します。
.It Va NO_BIND_ETC
.Pq Vt bool
デフォルトのファイルを
.Pa /var/named/etc/namedb
へインストールしない場合に設定します。
.It Va NO_BIND_LIBS_LWRES
.Pq Vt bool
軽量リゾルバライブラリを
.Pa /usr/lib
にインストールしない場合に設定します。
しかし、ビルドシステムのみに使用されるライブラリは、
必要に応じてビルドされます。
.It Va NO_BIND_MTREE
.Pq Vt bool
.Xr mtree 8
を使用して
.Pa /var/named
以下に chroot ディレクトリ構造を作成せず、さらに
.Pa /etc/namedb
のシンボリックリンクを chroot 環境に作成しない場合に設定します。
一般的には、このオプションは
.Vt NO_BIND_ETC
とともに使用されるべきです。
.It Va NO_BIND_NAMED
.Pq Vt bool
.Xr named 8 ,
.Xr named.reload 8 ,
.Xr named-checkconf 8 ,
.Xr named-checkzone 8 ,
.Xr rndc 8 ,
.Xr rndc-confgen 8
のビルドおよびインストールをしない場合に設定します。
.It Va NO_BIND_UTILS
.Pq Vt bool
BIND のユーザランドユーティリティ
.Xr dig 1 ,
.Xr host 1 ,
.Xr nslookup 1 ,
.Xr nsupdate 8
のビルドおよびインストールをしない場合に設定します。
.It Va WITH_BIND_LIBS
.Pq Vt bool
BIND のライブラリとインクルードファイルをインストールする場合に設定します。
.It Va PPP_NOSUID
.Pq Vt bool
.Xr ppp 8
を suid root プログラムとしてはインストールしない場合に設定します。
.It Va SENDMAIL_MC
.Pq Vt str
インストール時に用いるデフォルトの
.Xr m4 1
設定ファイルです。
この値には
.Pa .mc
ファイルのフルパスを与えます。
例えば
.Pa /etc/mail/myconfig.mc
です。
make install すると、既存の
.Pa /etc/mail/sendmail.cf
を上書きしてしまうので、注意して使ってください。
.Va SENDMAIL_CF
はもう推奨されなくなりました。
.It Va SENDMAIL_SUBMIT_MC
.Pq Vt str
インストール時に用いるメール提出用デフォルト
.Xr m4 1
設定ファイルです。
この値には
.Pa .mc
ファイルのフルパスを与えます。
例えば
.Pa /etc/mail/mysubmit.mc
です。
インストールによって既存の
.Pa /etc/mail/submit.cf
が上書きされてしまいますので、注意して使用してください。
.It Va SENDMAIL_ADDITIONAL_MC
.Pq Vt str
ビルド時に
.Pa .cf
ファイルに変換される追加分の
.Pa .mc
ファイル (複数指定可) です。
値には、これらの
.Pa .mc
ファイルへのフルパスを与えます。
例えば
.Pa /etc/mail/foo.mc
.Pa /etc/mail/bar.mc
など。
.It Va SENDMAIL_CF_DIR
.Pq Vt str
.Pa .mc
ファイルから
.Pa .cf
ファイルをビルドするために使用する
.Xr m4 1
設定ファイルのデフォルトの場所を
オーバライドします。
.It Va SENDMAIL_M4_FLAGS
.Pq Vt str
.Pa .mc
ファイルから
.Pa .cf
ファイルを作成するときに
.Xr m4 1
に渡されるフラグ。
.It Va SENDMAIL_CFLAGS
.Pq Vt str
.Xr sendmail 8
をビルドするときにコンパイルコマンドに渡すフラグです。
.Va SENDMAIL_*
各フラグを用いれば、SASL サポートをその設定と共に指定できます。
例えば次のようにします。
.Bd -literal -offset indent
SENDMAIL_CFLAGS=-I/usr/local/include -DSASL
SENDMAIL_LDFLAGS=-L/usr/local/lib
SENDMAIL_LDADD=-lsasl
.Ed
.It Va SENDMAIL_LDFLAGS
.Pq Vt str
.Xr sendmail 8
をビルドするときに
.Xr ld 1
コマンドに渡すフラグです。
.It Va SENDMAIL_LDADD
.Pq Vt str
.Xr sendmail 8
をビルドするときに
.Xr ld 1
コマンドの末尾に追加するフラグです。
.It Va SENDMAIL_DPADD
.Pq Vt str
.Xr sendmail 8
をビルドするときに追加する依存関係です。
.It Va SENDMAIL_SET_USER_ID
.Pq Vt bool
設定すると、
.Xr sendmail 8
をグループ ID 設定ではなく、
root にユーザ ID 設定したバイナリとしてインストールし、
.Pa /etc/mail/submit.{cf,mc}
をインストールしません。
このフラグの使用は推奨できません。
可能であれば、
.Pa /etc/mail/README
に書かれている代りの方法を採用すべきです。
.It Va SENDMAIL_MAP_PERMS
.Pq Vt str
このモードのエイリアスおよびマップのデータベースファイルが、
.Pa /etc/mail/Makefile
を使用して作成されます。
デフォルト値は 0640 です。
.It Va TOP_TABLE_SIZE
.Pq Vt int
.Xr top 1
は、ユーザ名用にハッシュ表を使用します。
ハッシュの大きさはローカルユーザ数に合うように調整可能です。
テーブルの大きさは、
.Pa /etc/passwd
の行数の約 2 倍の素数であるべきです。
デフォルト数は 20011 です。
.It Va WANT_FORCE_OPTIMIZATION_DOWNGRADE
.Pq Vt int
高い最適化レベルを強制的に低くするように、システムのコンパイラをビルドします。
.Xr gcc 1
.Fl O2
以上の高い最適化レベルは、しばしば既知の最適化バグを引き起こすことが
知られています \(em Alpha プラットフォームでは、さらにひどいです。
ここで割り当てられた値が、最も高い最適化レベルの値として使用されます。
.El
.Pp
次のリストは、ドキュメントのビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va DISTDIR
.Pq Vt str
distfiles が保存されている場所です。
通常これは
.Va PORTSDIR
の
.Pa distfiles
です。
.It Va DOC_LANG
.Pq Vt str
ビルド・インストール対象の言語とエンコーディングのリストです。
.It Va PRINTERDEVICE
.Pq Vt str
システム文書のデフォルトのフォーマットです。
これはプリンタに依存します。
単純なプリンタなら
.Dq Li ascii
を設定します。
PostScript プリンタやグラフィックスプリンタ + ghostscript フィルタなら
.Dq Li ps
を設定します。
両方設定することもできます。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /usr/share/examples/etc/make.conf" -compact
.It Pa /etc/make.conf
.It Pa /usr/doc/Makefile
.It Pa /usr/share/examples/etc/make.conf
.It Pa /usr/src/Makefile
.It Pa /usr/src/Makefile.inc1
.El
.Sh 関連項目
.Xr gcc 1 ,
.Xr install 1 ,
.Xr make 1 ,
.Xr ports 7 ,
.Xr lpd 8 ,
.Xr sendmail 8
.Sh 歴史
.Nm
ファイルは
.Fx 4.0
以前のいつかに登場しました。
.Sh 作者
このマニュアルページは
.An "Mike W. Meyer" Aq mwm@mired.org
が書きました。
.Sh バグ
このマニュアルページは現在の
.Nm
で利用できるオプションに比べると、古くなることが時々あるかもしれません。
現在利用できる最新のオプションについては、
.Pa /usr/share/examples/etc/make.conf
ファイルを調べてください。
.Sh 警告
.Ev MAKEOBJDIRPREFIX
と
.Ev MAKEOBJDIR
は環境変数であり、
.Nm
中ではなく、make の環境の中に設定すべきであることに注意してください。
