freebsd/freebsd-doc/ja_JP.eucJP/man/man5/make.conf.5
.\" Copyright (c) 2000
.\"	Mike W. Meyer
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/make.conf.5,v 1.12.2.2 2001/05/17 07:08:38 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/make.conf.5,v 1.4 2001/05/14 01:09:30 horikawa Exp $
.\"
.Dd November 3, 2000
.Dt MAKE.CONF 5
.Os
.Sh 名称
.Nm make.conf
.Nd システムビルド情報
.Sh 解説
.Nm
ファイルには
.Fx
のソースや ports アプリケーションの制御に関する設定が含まれています。
通常
.Nm
ファイルは、システム管理者が、
これらの値をデフォルトから変更したい場合に作成します。
.Pp
.Nm
の用途は、コマンド実行やコンパイル動作を直接行うことではなく、
.Pa /usr/src ,
.Pa /usr/ports ,
.Pa /usr/doc
などにある様々な makefile にインクルードされることです。
そのような makefile では、
内部の動作が
.Nm
の与える条件によって変化するようになっているのです。
.Pp
.Pa /etc/make.conf
ファイルはそれぞれ適切な
.Pa Makefile
からインクルードされます。
各々の Makefile の中では、
利用可能なすべてのオプションに対し、デフォルトの設定が与えられています。
.Pa /etc/make.conf
で指定する必要があるオプションは、
システム管理者がデフォルトから変更したいと思ったものだけです。
.Pp
ビルドの手続きは、大きく 4 つの領域に分けられます。
world、カーネル、ドキュメント、ports です。
.Nm
で設定された変数はこれらの領域の 1 つ、2 つ、
あるいは全てに適用されます。
変数は、特定のビルドに対して
.Xr make 1
の
.Fl D
オプションを用いて指定することもできます。
.Pp
以下のリストでは、それぞれ指定したビルドの途中で用いることのできる
各変数の名前と簡単な説明を記述します。
.Vt bool
と指定されている変数では、その値は意味を持ちません。
変数が設定されていれば (たとえ値が
.Dq Li FALSE
や
.Dq Li NO
でも)、変数が設定されているものとして扱われます。
.Pp
次のリストは、すべてのビルド (あるいはビルド以外の目的で使われる
.Pa Makefile )
で用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va CFLAGS
.Qt Vt str
C のコードをコンパイルするときのコンパイラの設定を制御します。
.Op Fl O
を越えた最適化レベル
.Pq Op Fl O2 , No ...\&
はサポートされていません。
.Va BDECFLAGS
は、
.An "Bruce Evans" Aq bde@FreeBSD.org
が開発や変更のテスト用に勧めている
.Xr gcc 1
設定です。
これは以下のように使用可能です。
.Pp
.Bd -literal -offset indent
CXFLAGS+=${BDECFLAGS}
.Ed
.It Va CVS_UPDATE
.Qt Vt bool
.Dq Li "make update"
で ports を更新するときに
.Xr cvs 1
を用いる場合、設定します。
.It Va CXXFLAGS
.Qt Vt str
C++ のコードをコンパイルするときのコンパイラの設定を制御します。
.Va CXXFLAGS
は最初は
.Va CFLAGS
の値に設定されます。この
.Va CXXFLAGS
の値に追加を行いたい場合は、
.Dq Li =
ではなく
.Dq Li +=
を用いてください。
.It Va INSTALL
.Qt Vt str
デフォルトのインストールコマンドです。
インストールを行う前に比較を行いたい場合は、次の例を用いてください。
.Bd -literal -offset indent
INSTALL="install -C"
.Ed
.It Va LOCAL_DIRS
.Qt Vt str
この変数には
.Pa /usr/src
で make を行うときに入るべきディレクトリをすべてリストします。
.It Va MTREE_FOLLOWS_SYMLINKS
.Qt Vt str
.Xr mtree 8
にシンボリックリンクを追跡させたい場合は、
これを
.Dq Fl L
に設定します。
.It Va NO_DOCUPDATE
.Qt Vt bool
.Dq Li "make update"
で doc ツリーを更新させない場合これを設定します。
.It Va NO_PORTSUPDATE
.Qt Vt bool
.Dq Li "make update"
で ports ツリーを更新させない場合これを設定します。
.It Va SUP_UPDATE
.Qt Vt bool
.Dq Li "make update"
による ports の更新に
.Xr cvsup 1
を使う場合これを設定します。
.It Va SUP
.Qt Vt str
.Dq Li "make update"
で用いられる
.Xr cvsup 1
コマンドの置き場所です。
.It Va SUPFLAGS
.Qt Vt str
.Dq Li "make update"
を行うとき
.Xr sup 1
に与えるフラグ。デフォルトは
.Op Fl g L Ar 2
です。
.It Va SUPHOST
.Qt Vt str
.Dq Li "make update"
を行うときに用いる
sup サーバのホスト名です。
.It Va SUPFILE
.Qt Vt str
.Dq Li "make update"
を行うとき、最初に用いる
.Ar supfile
です。デフォルトは
.Pa /usr/share/examples/cvsup/standard\-supfile 
です。
.It Va SUPFILE1
.Qt Vt str
.Dq Li "make update"
を行うとき、二番目に用いる
.Ar supfile
です。デフォルトは
.Pa /usr/share/examples/cvsup/secure\-supfile 
です。
.It Va SUPFILE2
.Qt Vt str
.Dq Li "make update"
を行うとき、三番目に用いる
.Ar supfile
です。デフォルトは
.Pa /usr/share/examples/cvsup/secure\-supfile
です。
.It Va PORTSSUPFILE
.Qt Vt str
.Dq Li "make update"
を行うときの ports 用の
.Ar supfile
です。デフォルトは
.Pa /usr/share/examples/cvsup/ports\-supfile
です。
.It Va DOCSUPFILE
.Qt Vt str
.Dq Li "make update"
を行うときのドキュメント用の
.Ar supfile 
です。デフォルトは
.Pa /usr/share/examples/cvsup/doc\-supfile
です。
.El
.Pp
次のリストは、カーネルのビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va BOOT_COMCONSOLE_PORT
.Qt Vt str
ブートブロックが、
キーボード/ビデオカードの代わりに
シリアルコンソールを用いるよう設定された場合に、
コンソールとして用いるポートアドレスです。
.It Va BOOT_COMCONSOLE_SPEED
.Qt Vt int
ブートブロックが、
キーボード/ビデオカードの代わりに
シリアルコンソールを用いるよう設定された場合に、
コンソールで用いるボーレートです。
.It Va BOOTWAIT
.Qt Vt int
カーネルがデフォルトカーネルのブートを開始する前に、
コンソールのキーが押されるのを待つ時間を制御します。
値はだいたいミリ秒単位となります。
ディスクからブートする前のキー入力の認識は BIOS が行うので、
これが 0 に設定されていた場合でも、
ユーザの選択したブートパラメータを与えることは可能です。
.It Va COPTFLAGS
.Qt Vt str
カーネルをコンパイルするときのコンパイラの設定を制御します。
.Op Fl O
を越えた最適化レベル
.Pq Op Fl O2 , No ...\&
はサポートされていません。
.It Va KERNEL
.Qt Vt str
.Dq Li "${MAKE} buildkernel"
によるビルドと
.Dq Li "${MAKE} installkernel" .
によるインストールとで、
どのカーネル設定を用いるかを制御します。例えば
.Bd -literal -offset indent
KERNEL=MINE DEBUG GENERIC OTHERMACHINE
.Ed
.Pp
とすると、
.Pa MINE , DEBUG , GENERIC , OTHERMACHINE
といった各設定ファイルに対応するカーネルをビルドし、
.Pa MIME
に対応するカーネルをインストールします。
デフォルトは
.Pa GENERIC
です。
.It Va NO_KERNELCONFIG
.Qt Vt bool
.Dq Li "${MAKE} buildkernel"
の際に
.Xr config 8
を実行しない場合には、これを設定します。
.It Va NO_KERNELDEPEND
.Qt Vt bool
.Dq Li "${MAKE} buildkernel"
の際に
.Dq Li "${MAKE} depend"
を実行しない場合には、これを設定します。
.It Va NO_MODULES
.Qt Vt bool
カーネルといっしょにモジュールをビルドしない場合に設定します。
.El
.Pp
次のリストは、world のビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va COMPAT1X
.Qt Vt bool
.Fx
1 互換ライブラリをインストールする場合に設定します。
.It Va COMPAT20
.Qt Vt bool
.Fx 2.0
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT21
.Qt Vt bool
.Fx 2.1
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT22
.Qt Vt bool
.Fx 2.2
互換ライブラリをインストールする場合に設定します。
.It Va COMPAT3X
.Qt Vt bool
.Fx
3 互換ライブラリをインストールする場合に設定します。
.It Va ENABLE_SUIDPERL
.Qt Vt bool
suid
.Xr perl 1
バイナリのインストールを行う場合に設定します。
.It Va FETCH_CMD
.Qt Vt str
ファイルの取得に用いるコマンドです。
通常は
.Xr fetch 1
です。
.It Va MAKE_IDEA
.Qt Vt bool
IDEA 暗号化コードをビルドする場合に設定します。
このコードは米国やヨーロッパの多くの国々で特許が取得されています。
合法的に IDEA を使えるかどうか決めるのは
.Em あなたの責任
です。
.It Va MAKE_KERBEROS4
.Qt Vt bool
KerverosIV (KTH eBones) をビルドする場合に設定します。
.It Va MAKE_KERBEROS5
.Qt Vt bool
Kerveros5 (KTH Heimdal) をビルドする場合に設定します。
.Em 注意!
これはまだ実験的なコードです。
安定している Kerberos5 が必要ならば、
ports を用いてください。
.It Va MODULES_WITH_WORLD
.Qt Vt bool
カーネルと同時にではなく、
システムと同時にモジュールをビルドする場合に設定します。
.It Va NO_CVS
.Qt Vt bool
CVS をビルドしない場合に設定します。
.It Va NO_BIND
.Qt Vt bool
BIND をビルドしない場合に設定します。
.It Va NO_FORTRAN
.Qt Vt bool
.Xr g77 1
と関連ライブラリをビルドしない場合に設定します。
.It Va NO_LPR
.Qt Vt bool
.Xr lpr 1
と関連プログラムをビルドしない場合に設定します。
.It Va NO_MAILWRAPPER
.Qt Vt bool
MTA セレクタである
.Xr mailwrapper 8
をビルドしない場合に設定します。
.It Va NO_MAKEDEV
.Qt Vt bool
インストールの際に
.Pa /dev
で
.Dq Li "MAKEDEV all"
を実行しない場合に設定します。
.It Va NO_OBJC
.Qt Vt bool
Objective C のサポートをビルドしない場合に設定します。
.It Va NO_OPENSSH
.Qt Vt bool
OpenSSH をビルドしない場合に設定します。
.It Va NO_OPENSSL
.Qt Vt bool
OpenSSL をビルドしない場合に設定します
(同時に
.Va NO_OPENSSH
も設定されたことになります)。
.It Va NO_SENDMAIL
.Qt Vt bool
.Xr sendmail 8
と関連プログラムをビルドしない場合に設定します。
.It Va NO_SHAREDOCS
.Qt Vt bool
.Bx 4.4
の古い文書をビルドしない場合に設定します。
.It Va NO_TCSH
.Qt Vt bool
.Pa /bin/csh
(これは
.Xr tcsh 1
です) をビルド・インストールしない場合に設定します。
.It Va NO_X
.Qt Vt bool
X\-Windows のサポート (例えば
.Xr doscmd 1
など) をコンパイルしない場合に設定します。
.It Va NOCLEAN
.Qt Vt bool
.Dq Li "make buildworld"
の途中で clean を行わない場合に設定します。
何をやっているかわからない人は設定すべきではありません。
.It Va NOCLEANDIR
.Qt Vt bool
.Dq Li "${MAKE} cleandir"
の代わりに
.Dq Li "${MAKE} clean"
を実行する場合に設定します。
.It Va NOCRYPT
.Qt Vt bool
crypto コードを一切ビルドしない場合に設定します。
.It Va NOGAMES
.Qt Vt bool
ゲームをビルドしない場合に設定します。
.It Va NOINFO
.Qt Vt bool
.Xr info 5
各ファイルを作成・インストールしない場合に設定します。
.It Va NOLIBC_R
.Qt Vt bool
.Nm libc_r
.Pf ( Nm libc
のリエントラント版)
をビルドしない場合に設定します。
.It Va NOMANCOMPRESS
.Qt Vt bool
man ページのインストールの際に圧縮を行わない場合に設定します。
.It Va NOPERL
.Qt Vt bool
.Xr perl 1
をビルドしない場合に設定します。
.It Va NOPROFILE
.Qt Vt bool
profile 版ライブラリをコンパイルしない場合に設定します。
.It Va NOSECURE
.Qt Vt bool
.Pa secure
サブディレクトリで crypto コードをビルドしない場合に設定します。
.It Va NOSHARE
.Qt Vt bool
.Pa share
サブディレクトリをビルドしない場合に設定します。
.It Va NOUUCP
.Qt Vt bool
.Xr uucp 1
と関連プログラムをビルドしない場合に設定します。
.It Va PERL_THREADED
.Qt Vt bool
.Xr perl 1
をスレッドサポート機能込みでビルド・インストールする場合に設定します。
.It Va PPP_NOSUID
.Qt Vt bool
.Xr ppp 8
を suid root プログラムとしてはインストールしない場合に設定します。
.It Va SENDMAIL_MC
.Qt Vt str
インストール時に用いるデフォルトの m4 設定ファイルです。
この値には .mc ファイルのフルパスを与えます。例えば
.Pa /etc/mail/myconfig.mc 。
make install すると、既存の
.Pa /etc/mail/sendmail.cf
を上書きしてしまうので、注意して使ってください。
.Va SENDMAIL_CF
はもう推奨されなくなりました。
.It Va SENDMAIL_ADDITIONAL_MC
.Qt Vt str
ビルド時に .cf ファイルに変換される追加分の .mc ファイル
(複数指定可) です。
値には、これらの .mc ファイルへのフルパスを与えます。
例えば
.Pa /etc/mail/foo.mc
.Pa /etc/mail/bar.mc
など。
.It Va SENDMAIL_CFLAGS
.Qt Vt str
.Xr sendmail 8
をビルドするときにコンパイルコマンドに渡すフラグです。
.Va SENDMAIL_*
各フラグを用いれば、 SASL サポートをその設定と共に指定できます。
例えば次のようにします。
.Bd -literal -offset indent
SENDMAIL_CFLAGS=-I/usr/local/include -DSASL
SENDMAIL_LDFLAGS=-L/usr/local/lib
SENDMAIL_LDADD=-lsasl
.Ed
.It Va SENDMAIL_LDFLAGS
.Qt Vt str
.Xr sendmail 8
をビルドするときに
.Xr ld 1
コマンドに渡すフラグです。
.It Va SENDMAIL_LDADD
.Qt Vt str
.Xr sendmail 8
をビルドするときに
.Xr ld 1
コマンドの末尾に追加するフラグです。
.It Va SENDMAIL_DPADD
.Qt Vt str
この変数の説明は与えられていません。
.El
.Pp
次のリストは、ドキュメントのビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va DISTDIR
.Qt Vt str
distfiles が保存されている場所です。
通常これは
.Va PORTSDIR
の
.Pa distfiles
です。
.It Va DOC_LANG
.Qt Vt str
ビルド・インストール対象の言語とエンコーディングのリストです。
.It Va PRINTERDEVICE
.Qt Vt str
システム文書のデフォルトのフォーマットです。
プリンタに依存します。
簡単なプリンタなら
.Dq Li ascii
に、PostScript プリンタや
グラフィックスプリンタ + ghostscript フィルタなら
.Dq Li ps
に設定できます。
.El
.Pp
次のリストは、ports のビルドで用いられる変数の名前と簡単な説明です。
.Bl -tag -width Ar
.It Va FORCE_PKG_RESIDENT
.Qt Vt bool
既存の package 
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
の登録情報を上書きする場合に設定します。
.It Va HAVE_MOTIF
.Qt Vt bool
システムに Motif がある場合に設定します。
.It Va KRB5_HOME
.Qt Vt str
MIT Kerberos5 の port を
.Pa /usr/local
以外にインストールしたい場合に設定します。
.\"translator: "ports" で固有単語とみなすべき？
.It Va LOCALBASE
.Qt Vt str
X 以外の ports をインストールする際のベースディレクトリを与えます。
これは
.Pa /usr/ports
でビルドを行う際に
.Va PREFIX
にデフォルト値として与えられます。
.It Va MASTER_SITE_AFTERSTEP
.Qt Vt str
AfterStep の ports のマスタサイトを変更します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_BACKUP
.Qt Vt str
.Pa Makefile
にリストされている場所が使えない場合、
ports が distfile をチェックしに行く場所を制御します。
パスの最後の部分は
.Dq Li /${DIST_SUBDIR}/
でなければなりません。
.It Va MASTER_SITE_COMP_SOURCES
.Qt Vt str
.Pa comp.sources
ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li %SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_GNOME
.Qt Vt str
GNOME ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li %SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_GNU
.Qt Vt str
GNU ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li %SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_KDE
.Qt Vt str
KDE ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li %SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_FREEBSD
.Qt Vt bool
設定されていると、すべてのファイルをマスタの
.Fx
サイトから取得します。
.It Va MASTER_SITE_MOZILLA
.Qt Vt str
Mozilla ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li %SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_OVERRIDE
.Qt Vt str
設定されていると、ports の
.Pa Makefile
にリストされているサイトよりも先に、このサイトをチェックしに行きます。
次のようにすればバックアップサイトを先にチェックさせることができます。
.Bd -literal -offset indent
MASTER_SITE_OVERRIDE?=	${MASTER_SITE_BACKUP}
.Ed
.It Va MASTER_SITE_PERL_CPAN
.Qt Vt str
Perl ports のマスタサイトの場所を制御します。
パスの最後の部分は
.\".Bd -literal -offset indent
.\" /%SUBDIR%/
.\".Ed
.Dq Li /%SUBDIR%/
でなければなりません。
.\"translator: ここの .Bd .Ed はコメントアウトしました。
.It Va MASTER_SORT_REGEX
.Qt Vt str
ミラーセットのソート順を制御する場合に設定します。
.Pa .jp
ドメインのミラーを優先的に用いたければ、以下のような設定をします。
.Bd -literal -offset indent
MASTER_SORT_REGEX?=	^file: ^ftp://ftp\.FreeBSD\.org/pub/FreeBSD/ports/local-distfiles/ ://[^/]*\.jp/ ://[^/]*\.jp\.
.Ed
.Pp
他の国別 TLD ドメインのユーザは、
.Dq Li jp
を適切なドメインに変更してください。
.It Va MASTER_SITE_RINGSERVER
.Qt Vt str
Ringserver ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_RUBY
.Qt Vt str
Ruby ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_SUNSITE
.Qt Vt str
Sunsite ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_TCLTK
.Qt Vt str
Tcl/Tk ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_TEX_CTAN
.Qt Vt str
TeX ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_WINDOWMAKER
.Qt Vt str
WindowMaker ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_XCONTRIB
.Qt Vt str
X contrib の ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_XEMACS
.Qt Vt str
Xemacs ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MASTER_SITE_XFREE
.Qt Vt str
XFree ports のマスタサイトの場所を制御します。
パスの最後の部分は
.Dq Li /%SUBDIR%/
でなければなりません。
.It Va MOTIFLIB
.Qt Vt str
.Pa libXm.a
と
.Pa libXm.so
の場所です。
.It Va MOTIF_STATIC
.Qt Vt bool
Motif を用いる ports を、Motif の共有ライブラリを持たない
システム上でも実行させたい場合に設定します。
.It Va NOCLEANDEPENDS
.Qt Vt bool
.Dq Li "make clean"
によって clean される他の ports から依存されている
ports を clean したくない場合に設定します。
.It Va NOPORTDOCS
.Qt Vt bool
ports と同時に追加ドキュメントをインストールしない場合に設定します。
.It Va PACKAGES
.Qt Vt str
package ターゲットのみに用いられます。
package ツリーのディレクトリです。
.It Va PATCH_SITES
.Qt Vt str
パッチファイルの配布をしている一次サイトの場所です。
.It Va PORTSDIR
.Qt Vt str
ports ツリーの場所です。
.It Va USA_RESIDENT
.Qt Vt bool
米国居住者は設定してください。
設定すると、米国輸出規制に従う必要がある ports が、
この規制に従うようになります。
.It Va WRKDIRPREFIX
.Qt Vt str
ports をビルドする際に用いる一時ファイルを作成する場所です。
.It Va X11BASE
.Qt Vt str
X11 ディストリビューションを
.Pa /usr/X11R6
以外の場所にインストールしたい場合、その場所を設定します。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/defaults/make.conf -compact
.It Pa /etc/defaults/make.conf
.It Pa /etc/make.conf
.It Pa /usr/doc/Makefile
.It Pa /usr/src/Makefile
.It Pa /usr/src/Makefile.inc1
.It Pa /usr/ports/Mk/bsd.port.mk
.It Pa /usr/ports/Mk/bsd.sites.mk
.El
.Sh 関連項目
.Xr gcc 1 ,
.Xr install 1 ,
.Xr lpd 8 ,
.Xr make 1 ,
.Xr ports 7 ,
.Xr sendmail 8
.Sh 歴史
.Nm
ファイルは
.Fx 4.0
以前のいつかに登場しました。
.Sh 作者
このマニュアルページは
.An "Mike W. Meyer" Aq mwm@mired.org
が書きました。
.Sh バグ
このマニュアルページは現在の
.Nm
で利用できるオプションに比べると、
古くなることが時々あるかもしれません。
現在利用できる最新のオプションについては、
.Pa /etc/defaults/make.conf
ファイルを調べてください。
