freebsd/freebsd-doc/ja_JP.eucJP/man/man5/modems.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)modems.5	3/24/95
.\" %FreeBSD: src/usr.bin/tip/tip/modems.5,v 1.5 1999/08/28 01:06:34 peter Exp %
.\" jpman %Id: modems.5,v 1.3 1998/07/02 14:15:42 horikawa Stab %
.\"
.Dd March 24, 1995
.Dt MODEMS 5
.Os BSD 4.4
.Sh 名称
.Nm modems
.Nd モデム設定データベース
.Sh 解説
.Xr tip 1
によって知られるモデムとその属性は
.Xr termcap 5
ファイルのような構造の
.Tn ASCII
ファイルに記録されます。
ファイルの各行は、1 つの
.Em モデム
についての記述を提供します。
フィールドはコロン (``:'') で分けられています。
\e 文字の直後に改行がある行末は、次の行へ継続されます。
.Pp
最初のエントリはモデムの (複数の) 名称です。
.\" docs7092 の内容を反映
もしモデムの名称が 1 つ以上ある場合、名称は縦棒で区切られます。
モデムの名称の後に記述フィールドが続きます。
`=' 記号が続くフィールド名は、文字型が続くことを示します。
`#' 記号が続くフィールド名は、数値が続くことを示します。
.Pp
.Xr tip 1
が呼び出された時、リモートシステムに対するエントリが
.\" docs7092 の内容を反映
.Pa /etc/remote
データベースから検索されます。
(短縮されている) "ACU" タイプケーパビリティが含まれる場合、
.Xr tip 1
は特定のモデムを
.Pa /etc/modems
から検索します。
モデムエントリが見付かった場合、リモートシステムとの接続時や切断時に
どのように
.Xr tip 1
プログラムがモデムを扱うかの適当なケーパビリティを決定します。
.Sh ケーパビリティ
ケーパビリティは、文字列 (str) ・数値 (num) ・ブーリアンフラグ (bool) 
のいずれかです。文字列ケーパビリティは
.Em capability Ns Ar = Ns Em value 
のように指定されます。例えば、 ``reset_command=ATZ\\r'' のように指定
します。数値ケーパビリティは
.Em capability Ns Ar # Ns Em value
のように指定されます。例えば、``intercharacter_delay#50'' のように指
定します。ブーリアンケーパビリティは単にケーパビリティを記述するだけで
指定されます。
.Bl -tag -width intercharacter_delay indent
.It Cm \&dial_command
(str)
リモートシステムにダイアルするために使われる AT コマンドです
(典型的には "ATDT" でしょう)。
.It Cm \&echo_off_command
(str)
コマンドエコーを抑制するための ATコマンドです。
.It Cm \&escape_guard_time
(num)
ミリ秒で表現されたディレイです。
コマンドに戻るエスケープシーケンスフレームに使われます。
.It Cm \&escape_sequence
(str)
コマンドに戻るためのエスケープシーケンスです。
.It Cm \&hangup_command
(str)
モデムをハングアップするために使われる AT コマンドです。
.It Cm \&hw_flow_control
(bool)
コンピュータとモデム (DTE/DCE) の間でハードウェア (RTS/CTS) フロー制御
を行うようにします。
.It Cm \&init_string
(str)
ダイアル前にモデムを初期化するために使われる AT コマンドです。
.It Cm \&intercharacter_delay
(num)
コマンドをモデムに送る時の文字間に開けられる、ミリ秒で指定され
るディレイ値です。
.It Cm \&intercommand_delay
(num)
モデムに発行されるコマンド間に開けられる、ミリ秒で指定される最小ディレイ
値です。
.It Cm \&lock_baud
(bool)
コンピュータとモデム (DTE / DCE) の間で固定のビットレートが使われます。
ビットレートは
.Pa /etc/remote
で指定されます。
.It Cm \&reset_command
(str)
モデムをリセットするための AT コマンドです。
.It Cm \&reset_delay
(num)
リセットし準備状態に戻るのにモデムで必要とされるミリ秒で指定される時間
です。
.Sh 関連ファイル
.Bl -tag -width /etc/modems -compact
.It Pa /etc/modems
.Pa /etc 
ディレクトリにおかれた
.Nm モデム
設定データベースファイルです。
.El
.Sh 関連項目
.Xr tip 1 ,
.Xr remote 5
.Sh 歴史
.Nm
ファイル書式は
.Bx 4.4 
から登場しました。
