freebsd/freebsd-doc/ja_JP.eucJP/man/man5/netgroup.5
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)netgroup.5	8.2 (Berkeley) 12/11/93
.\" jpman $Id: netgroup.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.\"
.Dd December 11, 1993
.Dt NETGROUP 5
.Os
.Sh 名称
.Nm netgroup
.Nd ネットワークグループを定義する
.Sh 書式
.Nm netgroup
.Sh 解説
.Nm
ファイルは
ネットワークへの同じようなアクセス権を与えられた
.Sy (host, user, domain)
の形式の値の組を指定します。
.Pp
このファイル中のそれぞれの行は、ネットグループ名とそれに続くネットグループの
メンバリストで構成されます。
それぞれのメンバは、他のネットグループ名か、次のような値の組に
する事ができます。
.Bd -literal -offset indent
(host, user, domain)
.Ed
.Pp
ここで 
.Sy host ,
.Sy user 
および
.Sy domain
は、それぞれの構成要素に対応する文字列名です。
コンマで区切られたフィールドはどれも、空にする事で ``ワイルドカード'' を、
``-'' にする事で ``値無し'' を指定する事ができます。
メンバリストは空白またはコンマで区切る事ができ、文字 ``\e'' を行の最後
に使う事によって行を継続できます。
1 行は 1024 文字までに制限されています。
.Nm
データベースにアクセスするためには、通常
.Xr getnetgrent 3
の中の関数が使われます。
.Pp
# で始まる行はコメントとして扱われます。
.Sh NIS/YP の相互作用
他の多くのプラットフォームでは、
.Nm
はもっぱら
.Tn NIS
と一緒に用いられ、ローカルの
.Pa /etc/netgroup
ファイルは無視されます。
.Bx Free
では
.Tn NIS
かローカルファイルの
.Nm
のどちらかを使うようにする事が出来ます。しかし、
この機能は慎重に使うべきです。
現在の
.Nm
システムは、
.Fn innetgr 3
を用いた照会に関する部分が極めて非効率です。
これは、問い合わせのあったその場で
.Nm
のメンバ情報を計算するためです。
それに比べて、
.Tn NIS
の
.Nm
データベースは
.Fn innetgr 3
が素早く照会を完了させるためのキー項目を持った 3つのマップ
(netgroup, netgroup.byuser そして netgroup.byhost)によって構成されています。
.Bx Free
の
.Nm
システムは、
次の方法で
.Tn NIS
の
.Nm
マップと互いに作用し合う事が出来ます:
.Bl -bullet -offset indent
.It
もし
.Pa /etc/netgroup
ファイルが存在しなかった場合、または存在しても空の場合、または存在して
も
.Sq +
しか書かれていない場合で、これらのいずれかの場合に加えて
.Tn NIS
が動いている場合は、
.Nm
は
.Tn NIS
だけを使って照会を行ないます。このとき、
.Fn innetgr 3
は、netgroup.byuser マップと netgroup.byhost マップを最大限に利用して
高速検索を行ないます (これは、SunOS とそれに類するプラットホームの
実装とほとんど同じです) 。
.It
もし
.Pa /etc/netgroup
が存在し、かつローカルの
.Nm
情報のみを含んでいる (
.Tn NIS
の
.Sq +
がない) 場合、
そのローカルの
.Nm
情報のみが使用されます (
.Tn NIS
の情報は無視されます)。
.It
もし、
.Pa /etc/netgroup
が存在し、かつローカルの netgroup データ
.Pa および
.Tn NIS
の
.Sq +
トークンの両方が含まれている場合、ローカルのデータと
.Tn NIS
の netgroup マップは 1 つにつながれた
.Nm
データベースの様に処理されます。この構成は最も柔軟ですが、
最も非効率です。特に、このデータベースが大きい場合は
.Fn innetgr 3
による照会は極端に遅くなります。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/netgroup -compact
.It Pa /etc/netgroup
ネットグループデータベース
.El
.Sh 関連項目
.Xr getnetgrent 3 ,
.Xr exports 5
.Sh 互換性
このファイルフォーマットは、さまざまなベンダと互換性がありますが、
すべてのベンダが同一のフォーマットを使っているわけではないようです。
.Sh バグ
ネットグループのメンバの組に基づいたアクセス制限の解釈は、さまざまな
ネットワークアプリケーション任せになっています。
また、ドメイン指定を
.Bx
環境に適用する方法も不明確です。
.Pp
.Nm
データベースは逆引きスピードアップのため、
.Xr passwd 5
の様にハッシュ化された
.Xr db 3
データベースに格納されるべきです。
