freebsd/freebsd-doc/ja_JP.eucJP/man/man5/netid.5
.\" Copyright (c) 1996 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Mats O Jansson
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/libexec/mknetid/netid.5,v 1.3 2002/12/24 13:41:46 ru Exp %
.\"
.\" $FreeBSD$
.\" WORD:	record	レコード
.Dd January 13, 1996
.Dt NETID 5
.Os
.Sh 名称
.Nm netid
.Nd
.Tn YP
ネットワーク・資格証明ファイル
.Sh 解説
.Nm
フォーマットのファイルはほとんどありません。
その一つは
.Tn YP
マップ
.Pa netid.byname
に使われるものです。
このフォーマットはかなり単純なものです。
各行は 2 つの項目 (キーと値) からなります。
.Xr mknetid 8
によって 3 種類のレコードが作られます。
.Pp
1 つ目の種類は、ある UID がどの GID を持っているかに関する情報です:
.Pp
.Sm off
.Li unix . Ao Ar uid Ac @ Aq Ar yp-domain
.Sm on
.Sm off
.Ao Ar uid Ac : Ao Ar gid Ac , Aq Ar gid
.Sm on
.Pp
2 つ目の種類は、ホストに関する情報です:
.Pp
.Sm off
.Li unix . Ao Ar hostname Ac @ Aq Ar yp-domain
.Sm on
.Sm off
.Li 0 : Aq Ar hostname
.Sm on
.Pp
3 つ目の種類は、
.Nm
ファイル中の、上記 2 種類以外のレコードのことです。
.Sh 使用例
設定ファイルは以下のようなものになるでしょう:
.Bd -literal
unix.10714@kaka 10714:400,10
unix.jodie@kaka 0:jodie
.Ed
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/netid" -compact
.It Pa /etc/netid
.Xr mknetid 8
によって自動生成されない行向け
.El
.Sh 関連項目
.Xr mknetid 8 ,
.Xr yp 8
.Sh 作者
.An Mats O Jansson Aq moj@stacken.kth.se
