freebsd/freebsd-doc/ja_JP.eucJP/man/man5/networks.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)networks.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/networks.5,v 1.9 2004/07/03 18:29:23 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt NETWORKS 5
.Os
.Sh 名称
.Nm networks
.Nd ネットワーク名のデータベース
.Sh 解説
.Nm
ファイルは、
.Tn DARPA
インターネットを含む既知のネットワークの情報を保持します。
各ネットワーク毎に、以下の情報を表す 1 行が存在します。
.Bd -unfilled -offset indent
公式ネットワーク名
ネットワーク番号
別名
.Ed
.Pp
各項目は任意個の空白文字やタブ文字で分けられます。
``#'' はコメント開始を表し、
行末までの文字はファイルを検索するルーチンに解釈されません。
このファイルは通常
Network Information Control Center
.Pq Tn NIC
が管理する公式ネットワークデータベースから生成しますが、
非公式な別名や未知のネットワークに関する情報を最新とするために、
ローカルでの変更が必要になるかもしれません。
.Pp
ネットワーク番号は、
インターネットアドレス操作ライブラリ
.Xr inet 3
の
.Xr inet_network 3
ルーチンが使用する、伝統的な ``.'' (ドット) 表記で指定します。
ネットワーク名は、フィールド区切り文字・改行文字・コメント文字以外の、
任意の表示可能文字からなります。
.Sh 関連ファイル
.Bl -tag -width /etc/networks -compact
.It Pa /etc/networks
.Nm
は
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr getnetent 3
.Sh バグ
静的ファイルの代わりに、ネームサーバを使用すべきです。
.Sh 歴史
.Nm
ファイルフォーマットは
.Bx 4.2
に登場しました。
