freebsd/freebsd-doc/ja_JP.eucJP/man/man5/nologin.5
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)nologin.8	8.1 (Berkeley) 6/19/93
.\"	%Id: nologin.5,v 1.2.2.2 1998/07/17 20:13:42 jkh Exp %
.\"
.\" jpman $Id: nologin.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.\"
.Dd June 19, 1993
.Dt NOLOGIN 5
.Os FreeBSD 2.1
.Sh 名称
.Nm nologin
.Nd ログインを拒否する
.Sh 解説
.Nm
は、
.Pa /etc/nologin
ファイルがあるとログインを拒否します。
このプログラムはユーザに
.Pa /etc/nologin
の内容を表示し、終了します。
.Sh セキュリティ
ユーザ root の
.Xr login 1
では無視されます。
.Sh 関連ファイル
.Bl -tag -width /etc/nologinxxx -compact
.It Pa /etc/nologin
.Nm
ファイルは
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr login 1 ,
.Xr rlogin 1 ,
.Xr telnet 1 ,
.Xr shutdown 8
