freebsd/freebsd-doc/ja_JP.eucJP/man/man5/opiekeys.5
.\" opiekeys.5: Manual page describing the /etc/opiekeys file.
.\"
.\" Portions of this software are Copyright 1995 by Randall Atkinson and Dan
.\" McDonald, All Rights Reserved. All Rights under this copyright are assigned
.\" to the U.S. Naval Research Laboratory (NRL). The NRL Copyright Notice and
.\" License Agreement applies to this software.
.\"
.\"	History:
.\"
.\"	Modified by cmetz for OPIE 2.32. This is opiekeys.5, not opiekeys.1 or
.\"         opieaccess.5.
.\"	Written at NRL for OPIE 2.0.
.\"
.ll 6i
.pl 10.5i
.\"	@(#)opiekeys.5	2.0 (NRL) 1/10/95
.\"	%FreeBSD: src/contrib/opie/opiekeys.5,v 1.4 2000/04/10 11:18:48 kris Exp %
.\" $FreeBSD$
.\"
.lt 6.0i
.TH OPIEKEYS 5 "January 10, 1995"
.AT 3
.SH 名称
/etc/opiekeys \- ユーザキー情報の OPIE(One-time Password In Everything) データベース

.SH 解説
.I opiekeys
ファイルには
OPIE ソフトウェアがユーザ認証のために使用するユーザ情報が格納されます。
.I opiekeys
ファイルは S/Key の
.I /etc/skeykeys
データベースファイルに対して下位互換ですが、これは
ハッシングアルゴリズム (MD4 および MD5) が S/Key と OPIE で同一の
場合に限られます (すなわち、 MD5 OPIE は MD4 S/Key キーを使用できません)。
.I opiekeys
ファイルは、空白 (タブは正しく解釈されますが、代りにスペースを使うべきです)
で区切られた次のような 6 フィールドから成ります:
.PP
.nf
.ta \w'              'u
フィールド名		内容
name    	ユーザのログイン名。
sequence	ユーザのシーケンス番号。
seed    	ユーザの種。
key     	ユーザの最後のレスポンス (16 進数)。
date    	最後に変更された日付。
time    	最後に変更された時刻。
.fi
.SH 関連項目
.BR ftpd (8)
.BR login (1),
.BR opie (4),
.BR opiekeys (5),
.BR opiepasswd (1),
.BR opieinfo (1),
.BR su (1),

.SH 作者
Bellcore の S/Key は、
Bellcore の Phil Karn, Neil M. Haller, John S. Walden が記述しました。
OPIE は NRL にて Randall Atkinson, Dan McDonald, Craig Metz が作成しました。

S/Key は Bell Communications Research (Bellcore) の商標です。

.SH 連絡先
OPIE は Bellcore の "S/Key Users" メーリングリストで議論されています。
加入要求は電子メールを下記アドレスに送ってください:
.sp
skey-users-request@thumper.bellcore.com
