freebsd/freebsd-doc/ja_JP.eucJP/man/man5/periodic.conf.5
.\"-
.\" Copyright (c) 2000 Brian Somers <brian@Awfulhak.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/periodic.conf.5,v 1.8.2.18 2002/01/17 10:36:36 sheldonh Exp %
.\"
.\" $FreeBSD$
.Dd June 22, 2000
.Dt PERIODIC.CONF 5
.Os
.Sh 名称
.Nm periodic.conf
.Nd 定期実行ジョブの設定情報
.Sh 解説
.Nm
ファイルには、日次/週次/月次のシステムメンテナンスジョブを
どのように実行するかが記述されています。
このファイルは
.Pa /etc/defaults
にあり、
.Pa /etc
の下にある同名のファイルは部分的に優先されます。
そしてさらに
.Pa /etc/periodic.conf.local
が優先されます。
.Pp
.Nm
は実際にはそれぞれの定期実行スクリプトからシェルスクリプトとして
取り込まれ、単にデフォルトの設定変数を提供することを意図しています。
.Pp
以下の変数は
.Xr periodic 8
自身によって使用されます:
.Bl -tag -offset 4n -width 2n
.It Va local_periodic
.Pq Vt 文字列
定期実行スクリプトを検索するディレクトリのリスト。
このリストは
.Xr periodic 8
の引数が絶対パスのディレクトリ名でなかった場合にのみ使用され、常に
.Pa /etc/periodic
が前置きされます。
.It Va dir Ns No _output
.Pq Vt パス No または Vt リスト
.Ar dir
ディレクトリから起動されるスクリプトの出力をどうするか記述します。
この変数に絶対パスが指定された場合、出力はそのファイルに行われます。
絶対パスではなかった場合は、一つ以上のスペースで区切られた
複数のメールアドレスと解釈され、それらのユーザにメールで送られます。
この変数が設定されてない場合や変数が空であった場合は、
標準出力に出力されます。
.Pp
それほど気にかけていないマシンでは
.Va daily_output ,
.Va weekly_output ,
.Va monthly_output
はそれぞれ
.Dq /var/log/daily.log ,
.Dq /var/log/weekly.log ,
.Dq /var/log/monthly.log
にしておくといいでしょう。すると
.Xr newsyslog 8
が、(もしファイルがあれば) これらのファイルを適切な時に切替えます。
.It Va dir Ns No _show_success
.It Va dir Ns No _show_info
.It Va dir Ns No _show_badconfig
.Pq Vt ブール値
これらの変数は
起動されたスクリプトの戻り値に従って、
.Xr periodic 8
が出力を抑制するかどうかを制御します (ここで
.Ar dir
はそれぞれのスクリプトが置かれてるディレクトリ名です)。
もしスクリプトの戻り値が
.Sq 0
で、
.Va dir Ns No _show_success
が
.Dq NO
に設定されていた場合、
.Xr periodic 8
はスクリプトの出力を抑制します。
もしスクリプトの戻り値が
.Sq 1
で、
.Va dir Ns No _show_info が
.Dq NO
に設定されていた場合、
.Xr periodic 8
はスクリプトの出力を抑制します。
もしスクリプトの戻り値が
.Sq 2
で、
.Va dir Ns No _show_badconfig
が
.Dq NO
に設定されていた場合、
.Xr periodic 8
はスクリプトの出力を抑制します。
もしこれらの変数が
.Dq YES
にも
.Dq NO
にも設定されていなかった場合は、それぞれのデフォルト値は
.Dq YES ,
.Dq YES
そして
.Dq NO
です。
.Pp
スクリプトの戻り値がどのように解釈されるかは
.Xr periodic 8
のマニュアルページを参照して下さい。
.El
.Pp
以下の変数は
.Pa /etc/periodic/daily
にある標準のスクリプトによって使用されます:
.Bl -tag -offset 4n -width 2n
.It Va daily_clean_disks_enable
.Pq Vt ブール値
.Va daily_clean_disks_files
にマッチしたファイルを毎日削除したい場合
.Dq YES
にします。
.It Va daily_clean_disks_files
.Pq Vt 文字列
マッチさせるファイル名のリストを設定します。
ワイルドカードも使用できます。
.It Va daily_clean_disks_days
.Pq Vt 整数
.Va daily_clean_disks_enable
が
.Dq YES
の場合、何日間ファイルにアクセスや修正がなかったら
削除するかをこの変数に設定する必要もあります。
.It Va daily_clean_disks_verbose
.Pq Vt ブール値
削除したファイル名を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_clean_tmps_enable
.Pq Vt ブール値
毎日一時ディレクトリをきれいにしたい場合
.Dq YES
に設定します。
.It Va daily_clean_tmps_dirs
.Pq Vt 文字列
.Va daily_clean_tmps_enable
が
.Dq YES
に設定されていた場合にきれいにするディレクトリ名のリストを指定します。
.It Va daily_clean_tmps_days
.Pq Vt 整数
.Va daily_clean_tmps_enable
が設定されていた場合、何日間ファイルにアクセスや修正がなかったら
削除するかをこの変数に設定する必要もあります。
.It Va daily_clean_tmps_ignore
.Pq Vt 文字列
.Va daily_clean_tmps_enable
が
.Dq YES
に設定されていた場合に削除させたくないファイルのリストを設定します。
ワイルドカードも使用可能です。
.It Va daily_clean_tmps_verbose
.Pq Vt ブール値
削除したファイル名を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_clean_preserve_enable
.Pq Vt ブール値
.Pa /var/preserve
から古いファイルを削除したい場合
.Dq YES
に設定します。
.It Va daily_clean_preserve_days
.Pq Vt 整数
何日間ファイルに修正がなかったら削除するかを
この変数に設定します。
.It Va daily_clean_preserve_verbose
.Pq Vt ブール値
削除したファイル名を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_clean_msgs_enable
.Pq Vt ブール値
古いシステムメッセージを削除する場合
.Dq YES
に設定します。
.It Va daily_clean_msgs_days
.Pq Vt 整数
何日間ファイルに修正がなかったら削除するかを設定します。
この変数が空白だった場合、
.Xr msgs 1
のデフォルト値が使われます。
.It Va daily_clean_rwho_enable
.Pq Vt ブール値
.Pa /var/who
の下の古いファイルを削除したい場合
.Dq YES
に設定します。
.It Va daily_clean_rwho_days
.Pq Vt 整数
何日間ファイルに修正がなかったら削除するかを設定します。
.It Va daily_clean_rwho_verbose
.Pq Vt ブール値
削除したファイル名を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_clean_hoststat_enable
.Pq Vt ブール値
.Pa /var/spool/.hoststat
の下の古いファイルを削除したい場合
.Dq YES
に設定します。
.It Va daily_clean_hoststat_days
.Pq Vt 整数
何日間ファイルに修正がなかったら削除するかを設定します。
.It Va daily_clean_hoststat_verbose
.Pq Vt ブール値
削除したファイル名を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_backup_passwd_enable
.Pq Vt ブール値
.Pa /etc/master.passwd
ファイルと
.Pa /etc/group
ファイルのバックアップをとりリポートを出力させたい場合
.Dq YES
に設定します。
リポートは、両ファイルに対する修正点と
.Pa group
ファイルに
.Xr chkgrp 8
をかけた結果を出力します。
.It Va daily_backup_aliases_enable
.Pq Vt ブール値
.Pa /etc/mail/aliases
ファイルのバックアップをとり修正点を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_backup_distfile_enable
.Pq Vt ブール値
.Pa /etc/Distfile
ファイルのバックアップをとり修正点を日次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va daily_calendar_enable
.Pq Vt ブール値
毎日
.Ic calendar -a
を行いたい場合
.Dq YES
に設定します。
.It Va daily_accounting_enable
.Pq Vt ブール値
毎日アカウンティングファイルを
切り替えたい場合
.Dq YES
にします。
.Xr rc.conf 5
の中の
.Va accounting_enable
が有効になっていない場合は切り替える必要はありません。
.It Va daily_accounting_compress
.Pq Vt ブール値
日々のアカウンティングファイルを
.Xr gzip 1
を使用して圧縮したい場合
.Dq YES
に設定します。
.It Va daily_accounting_save
.Pq Vt 数値
.Va daily_accounting_enable
が設定されている場合、
保存すべき日々のアカウンティングファイル数を指定します。
デフォルトは
.Dq 3
です。
.It Va daily_accounting_flags
.Pq Vt 文字列
.Va daily_accounting_enable
が
.Dq YES
に設定されていた場合に (
.Fl s
に加えて)
.Xr sa 8
ユーティリティに渡すフラグを指定します。
デフォルトは
.Fl q
です。
.It Va daily_distfile_enable
.Pq Vt ブール値
毎日
.Xr rdist 1
を実行したい場合
.Dq YES
に設定します。その場合
.Pa /etc/Distfile
も存在していなければなりません。
.It Va daily_news_expire_enable
.Pq Vt ブール値
.Pa /etc/news.expire
を実行したい場合
.Dq YES
に設定します。
.It Pa daily_uuclean_enable
.Pq Vt ブール値
.Ic uustat -a
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_disks_enable
.Pq Vt ブール値
(
.Va daily_status_disks_df_flags
を引数に指定して)
.Xr df 1
を実行し、また
.Ic dump -W
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_disks_df_flags
.Pq Vt 文字列
.Va daily_status_disks_enable
が
.Dq YES
の場合、
.Xr df 1
ユーティリティに渡す引数を設定します。
.It Va daily_status_uucp_enable
.Pq Vt ブール値
.\" 原文の /etc/uuclean.daily は誤りと思われる [man-jp-reviewer 3018],
.\" docs/2267
.Ic uustat -a
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_network_enable
.Pq Vt ブール値
.Ic netstat -i
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_network_usedns
.Pq Vt ブール値
.Xr netstat 1
を実行する時、(DNS を参照するための)
.Fl n
オプションをつけずに実行したい場合
.Dq YES
に設定します。
.It Va daily_status_rwho_enable
.Pq Vt ブール値
.Xr uptime 1
を実行したい場合 (もしくは
.Pa /etc/rc.conf
の中で
.Va rwhod_enable
を
.Dq YES
に設定していて
.Xr ruptime 1
を実行したい場合)
.Dq YES
に設定します。
.It Va daily_status_mailq_enable
.Pq Vt ブール値
.Xr mailq 1
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_mailq_shorten
.Pq Vt ブール値
.Va daily_status_mailq_enable
を
.Dq YES
に設定していて
.Nm mailq
の出力を短くしたい場合
.Dq YES
に設定します。
.It Va daily_status_security_enable
.Pq Vt ブール値
.Pa /etc/security
を実行したい場合
.Dq YES
に設定します。
.It Va daily_status_security_inline
.Pq Vt ブール値
.Pa /etc/security
.\" inline -> その場
をその場で実行したい場合
.Dq YES
に設定します。
デフォルトでは、
.Va daily_status_security_output
の値に従い、出力をメールするかログします。
.It Va daily_status_security_output
.Pq Vt 文字列
.Va daily_status_security_inline
が
.Dq NO
である場合の、
.Pa /etc/security
の送信先です。
この変数は、前述の
.Va *_output
変数と同様に振舞います。
すなわち、1 個以上の email アドレスか、1 個の絶対パス指定のファイル名です。
.It Va daily_status_security_noamd
.Pq Vt ブール値
前日のファイルシステムのマウント状況と比較する時に
.Xr amd 8
によるマウントを無視したい場合
.Dq YES
に設定します。
.It Va daily_status_mail_rejects_enable
.Pq Vt ブール値
.Pa /var/log/maillog
に記録された
前日分のメール拒否を要約したい場合
.Dq YES
に設定します。
.It Va daily_status_named_enable
.Pq Vt ブール値
前日文の拒否されたゾーン転送 (AXFR と IXFR) を要約したい場合
.Dq YES
に設定します。
.It Va daily_status_named_usedns
.Pq Vt ブール値
DNS の逆引き検索を有効にしたい場合
.Dq YES
に設定します。
.It Va daily_status_mail_rejects_logs
.Pq Vt 整数
前日分のメール拒否をチェックするべき
maillog ファイルの数を設定します。
.It Va daily_queuerun_enable
.Pq Vt ブール値
Set to
.Dq YES
if you want to manually run the mail queue at least once a day.
.It Va daily_local
.Pq Vt 文字列
他のすべての日次スクリプトの後に実行する
追加スクリプトのリストを設定します。
すべてのスクリプトは絶対パスで指定されなければなりません。
.El
.Pp
以下の変数は
.Pa /etc/periodic/weekly
にある標準のスクリプトによって使用されます:
.Bl -tag -offset 4n -width 2n
.It Va weekly_clean_kvmdb_enable
.Pq Vt ブール値
古い
.Pa /var/db/kvm_*.db
ファイルを削除したい場合
.Dq YES
に設定します。
現在のカーネルが使っている kvm ファイルは削除されません。
.It Va weekly_clean_kvmdb_days
.Pq Vt 整数
何日間ファイルにアクセスがなかったら
削除するかをこの変数に設定する必要があります。
.It Va weekly_clean_kvmdb_verbose
.Pq Vt ブール値
削除したファイル名を週次の出力で報告させたい場合
.Dq YES
に設定します。
.It Va weekly_uucp_enable
.Pq Vt ブール値
.Pa /usr/libexec/uucp/clean.weekly
を実行したい場合
.Dq YES
に設定します。
.It Va weekly_locate_enable
.Pq Vt ブール値
.Pa /usr/libexec/locate.updatedb
を実行したい場合
.Dq YES
に設定します。このスクリプトは
.An nobody
ユーザとして
.Ic nice -5
を使用して実行され、
.Xr locate 1
コマンドによって使われるテーブルを生成します。
.It Va weekly_whatis_enable
.Pq Vt ブール値
.Pa /usr/libexec/makewhatis.local
を実行したい場合
.Dq YES
に設定します。このスクリプトは
.Xr apropos 1
コマンドによって使われるデータベースを再生成します。
.It Va weekly_catman_enable
.Pq Vt ブール値
.Pa /usr/libexec/catman.local
を実行したい場合
.Dq YES
に設定します。
このスクリプトはすべての古くなったマニュアルページを処理して、
ディスク容量を消費する代わりに
.Xr man 1
コマンドを速くします。
.It Va weekly_noid_enable
.Pq Vt ブール値
システム上でみなしごになったファイルを
探したい場合
.Dq YES
に設定します。
みなしごになったファイルとは、
無効なユーザやグループのものとなっているファイルです。
.It Va weekly_noid_dirs
.Pq Vt 文字列
みなしごになったファイルを探したいディレクトリのリストを
指定します。これは通常
.Pa /
に設定されます。
.It Va weekly_status_pkg_enable
.Pq Vt ブール値
インストールされているパッケージの中で
古くなったものを
.Xr pkg_version 1
を使用して一覧にしたい場合
.Dq YES
に設定します。
.It Va weekly_local
.Pq Vt 文字列
他のすべての週次スクリプトの後に実行する
追加スクリプトのリストを設定します。
すべてのスクリプトは絶対パスで指定されなければなりません。
.El
.Pp
以下の変数は
.Pa /etc/periodic/monthly
にある標準のスクリプトによって使用されます:
.Bl -tag -offset 4n -width 2n
.It Va monthly_accounting_enable
.Pq Vt ブール値
.Xr ac 8
コマンドによってログインのアカウンティング処理を行いたい場合
.Dq YES
に設定します。
.It Va monthly_local
.Pq Vt 文字列
他のすべての月次スクリプトの後に実行する
追加スクリプトのリストを設定します。
すべてのスクリプトは絶対パスで指定されなければなりません。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/defaults/periodic.conf
.It Pa /etc/defaults/periodic.conf
デフォルト設定ファイルです。
このファイルはすべてのデフォルトの変数と設定値が記述されています。
.It Pa /etc/periodic.conf
通常、システム特有の変数を優先させるためのファイルです。
.It Pa /etc/periodic.conf.local
さらに追加して優先させるためのファイルで、
.Pa /etc/periodic.conf
を共有していたり、配布していたりする場合に役立ちます。
.El
.Sh 関連項目
.Xr apropos 1 ,
.Xr calendar 1 ,
.Xr df 1 ,
.Xr gzip 1 ,
.Xr locate 1 ,
.Xr man 1 ,
.Xr msgs 1 ,
.Xr netstat 1 ,
.Xr nice 1 ,
.Xr pkg_version 1 ,
.Xr rdist 1 ,
.Xr rc.conf 5 ,
.Xr ac 8 ,
.Xr chkgrp 8 ,
.Xr dump 8 ,
.Xr newsyslog 8 ,
.Xr periodic 8
.Sh 歴史
.Nm
ファイルは
.Fx 4.1
で登場しました。
.Sh 作者
.An Brian Somers Aq brian@Awfulhak.org
