freebsd/freebsd-doc/ja_JP.eucJP/man/man5/phones.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)phones.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/phones.5,v 1.3 1999/08/28 00:20:48 peter Exp %
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt PHONES 5
.Os BSD 4.2
.Sh 名称
.Nm phones
.Nd リモートホストの電話番号のデータベース
.Sh 解説
ファイル
.Pa /etc/phones
には、
.Xr tip 1
プログラムが使用する、
システム内のプライベートな電話番号が格納されます。
このファイルは通常は読めませんので、特権情報を格納することができます。
このファイルのフォーマットは、次の形式の一連の行です:
<システム名>[\ \et]*<電話番号>。
システム名は
.Xr remote 5
ファイルで定義されているものの 1 つであり、
電話番号は ``,'' もしくは行末で終わる任意の文字列からなります。
``='' および ``*'' の文字は、(交換機を通す場合)
一旦停止して次のダイヤルトーンを待つように自動電話機能に指示します。
``='' は
.Tn DF02-AC
にて必要ですし、``*'' は
.Tn BIZCOMP
1030
にて必要です。
.Pp
1 行には 1 つの電話番号のみ記述可能です。
しかしながら、ファイル中に同じシステム名が含まれる場合、
.Xr tip 1
は接続を確立するまで順番に各番号にダイヤルしようとします。
.Sh 関連ファイル
.Bl -tag -width /etc/phones -compact
.It Pa /etc/phones
.El
.Sh 関連項目
.Xr tip 1 ,
.Xr remote 5
.Sh 歴史
.Nm
ファイルは
.Bx 4.2
に登場しました。
