freebsd/freebsd-doc/ja_JP.eucJP/man/man5/pim6dd.conf.5
.\" Copyright (C) 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: pim6dd.conf.5,v 1.2 1999/12/10 06:08:49 itojun Exp %
.\" jpman %Id: pim6dd.conf.5,v 1.3 2000/10/18 00:11:56 horikawa Stab %
.\"	%FreeBSD: src/usr.sbin/pim6dd/pim6dd.conf.5,v 1.2.2.3 2000/05/09 14:12:52 sheldonh Exp %
.\"
.Dd Nov 17, 1998
.Dt PIM6DD.CONF 5
.Os
.Sh 名称
.Nm pim6dd.conf
.Nd pim6dd (PIM for IPv6 dense mode デーモン) の設定ファイル
.Sh 解説
このファイルには
.Nm pim6dd
デーモンがシステム上の各インタフェースを
どのように扱うかということを記述します。
デフォルト (設定ファイルが存在しない場合も含みます) では
PIM は全てのインタフェースに対して動作しますが、
この動作は本ファイルで変更できます。
.Ql #
で始まる行はコメントです。
.Pp
4 種の設定コマンドがあります:
.Bl -tag -width Ds -compact
.It Xo
.Ic default_source_preference Ar preference
.Xc
PIM assert メッセージを送出する際のデフォルトの preference の値を指定します。
preference は assert election で上流ルータを決定する際に使われます。
現在、
.Xr pim6dd 8
.\" .Nm -> .Xr pim6dd 8
.\" [man-jp-reviewer 2736] に基き修正
はユニキャスト経路制御プロトコルから preference や metric を得られませんので、
デフォルトの値を設定するとよいでしょう。
.\"
.It Ic default_source_metric Ar metric
PIM assert メッセージを送出する際のデフォルトの metric の値を指定します。
metric が使われないような preference を設定することができますし、
デフォルトの metric を設定することもできます。
なお、この metric のデフォルト値は 1024 です。
.\"
.It Xo
.Ic phyint Ar interface
.Op disable
.Xc
そのインタフェースがたとえマルチキャスト可能であっても無視するように、
.Nm
に指示します。
インタフェースは "name unit" 形式で、例えば
.Ar gif0
や
.Ar ep1
のように指定します。
.\"
.It Xo
.Ic phyint Ar interface
.Op preference Ar preference
.Op metric Ar metric
.Xc
PIM assert メッセージをそのインタフェースから送出する際の
preference ないし metric の値を指定します。
.\"
.It Xo
.Ic filter Ar groupaddrs Ar interfaces...
.Xc
出力フィルタを指定します。
到着したマルチキャストパケットの終点が、指定した
.Ar groupaddrs
にマッチした場合、
パケットは
.Ar interfaces
には送出されません。
さらに、指定した以外に出力インタフェースがないのであれば、
.Nm pim6dd
は prune (枝切り) メッセージを上流隣接ルータ (neighbor) に送ります。
.Ar groupaddrs
の有効なフォーマットは以下の通りです。
.Bl -tag -width Ds -compact
.It Ar multicastaddr1-multicastaddr2
スコープ (administrative scope) の数値範囲を指定します。
.Ar multicastaddr1
から
.Ar multicastaddr2
までのマルチキャストアドレスが除外されます。
.Ql -
の前にも後ろにも、
空白やタブ文字が入っていてはいけないことに気をつけてください。
.It Ar multicastaddr/prefixlen
スコープのグループプレフィックスを指定します。
指定したプレフィックスにマッチするマルチキャストアドレスが除外されます。
.Ar prefixlen
が指定されなければ、
.Ar multicastaddr
と正確に一致している場合を意味します。
.El
.Ar interfaces
は空白で区切られたインタフェースのリストです。
それぞれのインタフェースは "name unit" 形式で指定します。
.El
.\"
.Sh 使用例
.Bd -literal -offset
# phyint gif0 disable
# phyint ep0 preference 101
phyint de0 disable
filter ff15::4000/120 gif1 gif2
filter ff18::1000-ff18::1050 gif3
.Ed
.Sh 関連項目
.Xr pim6dd 8
.Sh 歴史
.Nm pim6dd
コマンドと設定ファイル
.Nm
は University of Oregon (オレゴン大学) で開発された
IPv4 マルチキャスト経路制御デーモンである、
.Nm pimdd
に基づいています。
.Nm Pimdd
は University of Southern California (南カリフォルニア大学) で開発された
PIM sparse-mode
.Nm pimd
に基づいています。
これら 2 つのプログラムの一部は
.Nm mrouted
に由来しています。
.Nm Mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.Pp
KAME Project (http://www.kame.net/) スタックに基づく
IPv6 および IPsec サポートは、
.Fx 4.0
で初めて統合されました。
