freebsd/freebsd-doc/ja_JP.eucJP/man/man5/pim6sd.conf.5
.\" Copyright (C) 1999 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	KAME Id: pim6sd.conf.5,v 1.10 2000/07/09 17:28:42 itojun Exp
.\"	%FreeBSD: src/usr.sbin/pim6sd/pim6sd.conf.5,v 1.2.2.7 2001/03/06 14:21:30 ru Exp %
.\"
.\" jpman %Id: pim6sd.conf.5,v 1.2 2000/09/13 22:14:42 mzaki Stab %
.\"
.Dd Oct 6, 1999
.Dt PIM6SD.CONF 5
.Os
.Sh 名称
.Nm pim6sd.conf
.Nd pim6sd (PIM for IPv6 sparse mode デーモン) の設定ファイル
.\"
.Sh 解説
.Nm
の設定ファイルはセミコロン
.Pq Ql \&;
を文末とする一連の文から成ります。
それぞれの文は、デーモンがシステム上の各インタフェースを
どのように扱うかということを指定したり、
PIM プロトコルのパラメータを指定したり、
プロトコルで定められている特別な動作を要求したりします。
.Pp
それぞれの文は複数行にわけることができます。
.Pp
.Ql #
で始まる行はコメントです。
.\".Pp
.\".Xr pim6sd 8
.\"は設定ファイルがなくても動作しますが、
.\"デーモンは設定ファイルがないことを警告します。
.\"その場合、デーモンは設定可能なパラメータに自動的にそれぞれ
.\"デフォルトの値を設定します。
.\"
.Pp
以下に挙げる文を設定ファイル中で指定できます。
.Pp
.Bl -tag -width Ds
.It Ic log Ar option... ;
出力するデバッグメッセージを指定します。
通常、それぞれの
.Ar option
は出力するメッセージの集合を指定します。
.Ar option
が
.Ic no
で始まっている場合、
そのオプションで指定されるメッセージは出力されません。
例えば、
.Ic `all nomld'
は、MLD 関連のもの以外の全てのメッセージを出力します。
有効なオプションは次の通りです:
.Ic mld_proto , mld_timer , mld_member , mld ,
.Ic switch , trace , mtrace , traceroute ,
.Ic timeout , callout , pkt , packets ,
.Ic interfaces , vif , kernel , cache ,
.Ic mfc , k_cache , k_mfc , rsrr ,
.Ic pim_detail , pim_hello , pim_neighbors , pim_register ,
.Ic registers , pim_join_prune , pim_j_p , pim_jp ,
.Ic pim_bootstrap , pim_bsr , bsr , bootstrap ,
.Ic pim_asserts , pim_cand_rp , pim_c_rp , pim_rp ,
.Ic rp , pim_routes , pim_routing , pim_mrt ,
.Ic pim_timers , pim_rpf , rpf , pim ,
.Ic routes , routing , mrt , routers ,
.Ic mrouters , neighbors , timers , asserts ,
.Ic all
。
.\"
.It Ic reverselookup Pq Cm yes | no ;
ログにおいて、IPv6 アドレスに対するホスト名を解決したい場合に指定します。
.Ic yes
では、ホスト名が解決されます。
.Ic no
では、解決されません。
デフォルトでは、ホスト名は解決されません。
.\"
.It Ic phyint Ar interface Op Cm disable ;
そのインタフェースがたとえマルチキャスト可能であっても無視するように
.Xr pim6sd 8
に指示します。
デフォルトでは
PIM は全てのインタフェースに対して動作することに注意してください。
.\" 原著者によると、設定ファイルが存在しない場合は
.\" 動作しないとのことなので、「(設定ファイルが存在しない場合も含みます)」
.\" を削除しました。原文も更新される (た？) ことでしょう。
.\" [man-jp-reviewer 2739] horikawa@jp.FreeBSD.org 09/30/2000 
インタフェースは "name unit" 形式で、例えば
.Ar gif0
や
.Ar ep1
のように指定します。
.\"
.It Xo
.Ic phyint Ar interface
.Op Cm preference Ar preference
.Op Cm metric Ar metric
.Op Cm nolistener ;
.Xc
PIM assert メッセージをそのインタフェースから送出する際の
preference ないし metric の値を指定します。
オプションパラメータである
.Ic nolistener
が指定されていれば、
.Xr pim6sd 8
はそのインタフェースには MLD パケットを送りません。
このオプションは通常は意味がありませんが、
MLD メッセージが邪魔である (例えばデバッグ中) とか、
本当にそのインタフェースに受信者 (listener) がいないような時には役立ちます。
.\"
.It Ic default_source_preference Ar preference ;
PIM assert メッセージを送出する際のデフォルトの preference の値を指定します。
preference は assert election で上流ルータを決定する際に使われます。
現在、
.Xr pim6sd 8
はユニキャスト経路制御プロトコルから preference や metric を得られませんので、
デフォルトの値を設定するとよいでしょう。
なお、この preference のデフォルト値は 1024 です。
.\"
.It Ic default_source_metric Ar metric ;
PIM assert メッセージを送出する際のデフォルトの metric の値を指定します。
metric が使われないような preference を設定することができますし、
デフォルトの metric を設定することもできます。
なお、この metric のデフォルト値は 1024 です。
.\"
.It Ic granularity Ar second ;
タイマの粒度を秒単位で指定します。
デフォルトの値は 5 です。
.\"
.It Ic hello_period Ar period coef ;
.Ar period
は hello メッセージ間の間隔を秒単位で指定します。
.Ar coef
は hello 保持時間を決定するための係数です。
hello 保持時間は
.Ar period
*
.Ar coef
になります。
間隔と係数のデフォルト値はそれぞれ 30 と 3.5 です。
したがってデフォルトの保持時間は 105 秒になります。
.\"
.It Ic join_prune_period Ar period coef ;
.Ar period
は join/prune メッセージ間の間隔を秒単位で指定します。
.Ar coef
は join/prune 保持時間を決定するための係数です。
保持時間は
.Ar period
*
.Ar coef
になります。
間隔と係数のデフォルト値はそれぞれ 60 と 3.5 です。
したがってデフォルトの保持時間は 210 秒になります。
.\"
.It Ic data_timeout Ar timer ;
あるソースアドレスからのパケットが途切れた場合に、
対応する (S,G) 状態が削除されるまでの時間を指定します。
デフォルトの値は 210 です。
.\"
.It Ic register_suppression_timeout Ar interval ;
.Ar interval
は Register-Stop を受け取ってから再び PIM Register を送れるようになるまでの
間隔を指定します。
デフォルトの値は 60 です。
.\"
.It Ic probe_time Ar timer ;
.Ar timer
は、
Register-Stop を受け取ることでリスタートすることがない場合に、
空の Register を送ってから Register-Suppression-Timer が期限切れに
なるまでの時間を指定します。
デフォルトの値は 5 です。
.\"
.It Ic assert_timeout Ar interval ;
.Ar interval
は、最後に assert を受け取ってからその assert が時間切れになるまでの
間隔を指定します。
デフォルトの値は 180 です。
.\"
.It Xo
.Ic cand_rp
.Op Ar interface
.Op Cm time Ar time
.Op Cm priority Ar priority ;
.Xc
Candidate Rendezvous Point(RP) として動作するために指定します。
標準的な使用法では、
.Ic cand_rp
のみを指定することが推奨されています。
それ以外のパラメータはすべてオプションであり、自動的に設定されます。
.Ar interface
が指定されている場合には、
.Xr pim6sd 8
は指定したインタフェースについてグローバルアドレスを検索し、
Candidate-RP-Advertisement のアドレスに使います。
オプションパラメータの
.Ic time
は、2 つの連続する Candidate-RP-Advertisement の間隔を秒単位で指定します。
デフォルトの値は 60 です。
2.5 *
.Ar time
が Candidate-RP-Advertisement メッセージに設定されます。
もう 1 つのオプションパラメータ
.Ic priority
は、RP の優先度を指定します。
デフォルトの値は 0 であり、これは最高の優先度を意味します。
.\"
.It Ic group_prefix Ar prefix ;
.Ar prefix
は、Rendezvous Point(RP) として動作している時に、
その RP が処理するグループプレフィックスを指定します。
.\"
.It Xo
.Ic cand_bootstrap_router
.Op Ar interface
.Op Cm time Ar time
.Op Cm priority Ar priority
.Op Cm masklen Ar masklen ;
.Xc
Candidate bootstrap router(BSR) として動作することを指定します。
標準的な使用法では、
.Ic cand_bootstrap_router
のみを指定することが推奨されています。
それ以外のパラメータはすべてオプションであり、自動的に設定されます。
.Ar interface
が指定されている場合には、
.Xr pim6sd 8
は指定したインタフェースについてグローバルアドレスを検索し、
Bootstrap メッセージ中のアドレスに使います。
オプションパラメータの
.Ic time
は、2 つの連続する bootstrap の送信間隔を秒単位で指定します。
デフォルトの値は 60 です。
もう 1 つのオプションパラメータ
.Ic priority
は、BSR の優先度を指定します。
.\" [man-jp-reviewer 2739]
デフォルトの値は 0 であり、これは最低の優先度を意味します。
ハッシュマスクの長さは、
.Ic masklen
パラメータで指定可能です。
値
.Ar masklen
は、0 を下回ったり 128 を上回ってはなりません。
.\"
.It Xo
.Ic switch_register_threshold
.Cm rate Ar rate Cm interval Ar interval ;
.Xc
Rendezvous Point(RP) が最短パスツリー (shortest path tree; SPT)
に切り替えるための閾値を指定します。
これは RP として動作している時にのみ有効です。
.Ic rate
は閾値をビット/秒単位で、
.Ic interval
は rate のチェック間隔を秒単位で指定します。
デフォルトの値はそれぞれ 50000 と 20 です。
\"
.It Xo
.Ic switch_data_threshold
.Cm rate Ar rate Cm interval Ar interval ;
.Xc
最終段のルータが最短パスツリーに切り替えるための
閾値を指定します。
.Ic rate
は閾値をビット/秒単位で、
.Ic interval
は rate のチェック間隔を秒単位で指定します。
デフォルトの値はそれぞれ 50000 と 20 です。
.El
.\"
.Sh 使用例
.Bd -literal -offset
# phyint gif0 disable;
# phyint ep0 preference 101;
phyint de0 disable;
#
# followings are for a candidate Rendezvous Point, which should usually
# be disabled.
cand_bootstrap_router;
cand_rp;
.Ed
.Sh 関連項目
.Xr pim6sd 8
.Sh 歴史
.Xr pim6sd 8
コマンドは LSIIT Laboratory の Michael Hoerdt が開発しました。
これは University of Southern California (南カリフォルニア大学) で
開発された
.Nm mrouted
由来の IPv4 PIM sparse-mode
.Nm pimd
に基づいています。
.Nm mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.Pp
KAME Project (http://www.kame.net/) スタックに基づく
IPv6 および IPsec サポートは、
.Fx 4.0
で初めて統合されました。
