freebsd/freebsd-doc/ja_JP.eucJP/man/man5/publickey.5
.\" @(#)publickey.5	2.1 88/08/07 4.0 RPCSRC; from 1.6 88/02/29 SMI;
.\" jpman %Id: publickey.5,v 1.3 1998/09/22 14:15:14 horikawa Stab %
.\"
.\" WORD: public key	公開鍵
.\" WORD: secret key	秘密鍵
.\"
.TH PUBLICKEY 5 "19 October 1987"
.SH 名称
publickey \- 公開鍵データベース
.SH 書式
.B /etc/publickey
.SH 解説
.LP
.B /etc/publickey
は、安全なネットワークで用いられる公開鍵のデータベースです。
このデータベースは、ネットワークユーザ名 (これは、ユーザまたは
ホスト名を指します) 、ユーザの公開鍵 (16進表現) 、コロン、ログイン
パスワードで暗号化されたユーザの秘密鍵 (16進表現) を順につなげた
ものからなります。
.LP
ユーザは
.BR chkey (1)
コマンドを使って、システム管理者は
.BR newkey (8)
コマンドを使ってこのファイルを更新します。
ファイル
.B /etc/publickey
には、NIS マスタマシン上のデータだけを置くべきです。
このマシン上で、この
ファイルは変換されて
.SM NIS
データベース
.BR publickey.byname
の中に置かれます。
.SH 関連項目
.BR chkey (1),
.BR publickey (3R),
.BR newkey (8),
.BR ypupdated (8C)
