freebsd/freebsd-doc/ja_JP.eucJP/man/man5/pw.conf.5
.\" Copyright (C) 1996
.\" David L. Nugent.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY DAVID L. NUGENT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL DAVID L. NUGENT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/pw/pw.conf.5,v 1.8.2.1 1999/08/29 15:47:26 peter Exp %
.\" jpman %Id: pw.conf.5,v 1.3 1998/07/02 18:49:55 kumano Stab %
.\"
.Dd December 9, 1996
.Dt PW.CONF 5
.Os 
.Sh 名称
.Nm pw.conf
.Nd pw.conf 設定ファイルのフォーマット
.Sh 解説
ファイル
.Aq Pa /etc/pw.conf
には
.Xr pw 8
プログラムで使用される設定データが含まれています。
.Xr pw 8
プログラムはシステムのパスワードとグループファイルのメンテナンスに使用され、
ユーザやグループを追加、削除、変更します。
このファイルは
.Xr pw 8
コマンドによって
.Ar useradd
コマンドと
.Fl D
オプション
を使うか、テキストエディタによって直接編集することによって変更されます。
.Pp
.Aq Pa /etc/pw.conf
における各行は、コメントもしくは設定データとして扱われます。
空白行と
.Ql \&#
文字によって開始している行はコメントとなります。
それら以外の行はキーワードが最初に指定され、
それに対応するデータが続くものとして処理されます。
.Pp
.Xr pw 8
によって認識されるキーワードには以下のものがあります。
.Bl -tag -width password_days -offset indent -compact
.It defaultpasswd
新規ユーザのパスワードとなります。
.It reuseuids
UID の空き番号を再使用します。
.It nispasswd
NIS パスワードデータベースへのパスです。
.It reusegids
GID の空き番号を再使用します。
.It skeleton
ホームディレクトリにコピーするデフォルトのファイルの在処です。
.It newmail
新規ユーザに送付するメールです。
.It logfile
このファイルにユーザ/グループの変更のログを取ります。
.It home
ホームディレクトリのルートディレクトリです。
.It shellpath
シェルプログラムのパスです。
.It shells
有効なシェルのリストです (パスは含みません)。
.It defaultshell
デフォルトのシェルです (パスは含みません)。
.It defaultgroup
デフォルトのグループです。
.It extragroups
新規ユーザをこのグループに追加します。
.It defaultclass
新規ユーザのこのログインクラスに設定します。
.It minuid
.It maxuid
有効なデフォルトユーザ ID の範囲です。
.It mingid
.It maxgid
有効なデフォルトグループ ID の範囲です。
.It expire_days
アカウントが期限切れとなるまでの日数です。
.It password_days
パスワードが期限切れとなるまでの日数です。
.El
.Pp
.Ar defaultpasswd
の有効な値は以下の通りです。
.Bl -tag -width password_days -offset indent -compact
.It no
新規に作成したアカウントでのログインを無効にします。
.It yes
パスワードをアカウント名に強制的に設定します。
.It none
強制的にパスワードをブランクにします。
.It random
ランダムなパスワードを生成します。
.El
.Pp
2 番目と 3 番目のオプションは安全ではなく、
一般からアクセス可能なシステムでは可能であれば避けるべきです。
最初のオプションはそのアカウントが使用される前にスーパユーザが
.Xr passwd 1
を使ってパスワードを設定する必要があります。
これは管理者のアカウントを作成する場合にも便利です。
最後のオプションでは
.Xr pw 8
は標準出力にランダムに生成したパスワードを出力します。
これが最も好ましく安全なオプションです。
.Xr pw 8
はファイルハンドル経由で (コマンド行による方法は安全でないためです)
新規ユーザに特定のパスワードを設定する方法も提供しています。
.Pp
.Ar reuseuids
と
.Ar reusegids
は新規のユーザ ID とグループ ID 番号の生成方法を指定します。
このフィールドで
.Ql \&yes
が指定されていると
.Xr pw 8
は許可された範囲で
最初の使用されていないユーザ ID か グループ ID を検索します。
.Ql \&no
が指定されていると
範囲中のすでに存在している他のユーザ ID もしくはグループ ID が
新規に生成された ID より必ず小さくなることを保証し、
以前にユーザもしくはグループを削除したことによって生じた
グループ ID もしくはユーザ ID の空き番号を再度使用することを
避けることができます。
デフォルトグループがキーワード
.Ar defaultgroup
によって指定されていない場合、
.Xr pw 8
は新規ユーザに対して新規グループを生成し、
新規のユーザ ID とグループ ID に同じものを使用するように試みます。
新規ユーザのユーザ ID がすでにグループ ID として使用されている場合は、
その代わりに次に使用可能なグループ ID が選択されます。
.Pp
NIS サーバで
.Pa /etc/master.passwd
とは別の passwd データベースを管理している場合、
このオプションを使用すると、
ユーザレコードの追加・修正・削除といった更新を
追加のファイルに対しても同時に行うことができます。
空白または 'no' に設定すると、
追加のデータベースは更新されません。
絶対パス名を使用する必要があります。
.Pp
.Ar skeleton
キーワードはユーザの新規のホームディレクトリの内容を作る上での
もととなるディレクトリを指定します。
デフォルトでは
.Pa /usr/share/skel
となっています。
.Xr pw 8
で
.Fl m
オプションを指定すると、ユーザのホームディレクトリが作成され、
.Ar skeleton
ディレクトリに含まれるファイルがそこにコピーされます。
.Pp
.Ar newmail
キーワードによって送信するメッセージの本文を含むファイルの
パス名を指定することによって、
新規ユーザに通知の電子メールを送信することができます。
アカウントが作成された時にメールを出さないようにするには、
このエントリを空にしておくか
.Ql \&no
を指定します。
.Pp
.Ar logfile
オプションによってパスワードファイルの変更のログを指定したログファイルに
取ることができます。
ログファイルを作成したり追加したりしないようにするには、
このフィールドを空にしておくか
.Ql \&no
を指定します。
.Pp
.Ar home
キーワードは必ず指定する必要のあるものです。
これはすべての新規ユーザのホームディレクトリが作成される
ディレクトリの場所を指定するものです。
.Pp
.Ar shellpath
はログインシェルとして使われるプログラムが含まれる
ディレクトリのリストをコロン
.Ql \&:
で区切って指定します。
.Pp
.Ar shells
キーワードはログインシェルとして使用可能なプログラムのリストを指定します。
このリストはコンマで区切られたシェル名のリストであり、パスは含みません。
これらのシェルは
.Ar shellpath
によって指定されているいずれかのディレクトリの中にある必要があります。
.Pp
.Ar defaultshell
キーワードは
.Xr pw 8
のコマンド行で新規ユーザのシェルプログラムが
何も指定されていない場合のシェルプログラムを指定します。
.Pp
.Ar defaultgroup
キーワードは新規アカウントに使用される第 1 グループ
(パスワードファイル中のグループ ID 番号) を指定します。
これが空であるか、
.Ql \&no
が指定されていると各々の新規ユーザには自動的に各々のグループが
作成されます。
これはユーザによって通常使われている
.Em umask
に関係なく、システムの他のユーザによる不正アクセスから
各ユーザのファイルを守ることができるため、
新規にユーザを作成する場合の推奨方法となります。
.Pp
.Ar extragroups
によって新規ユーザを自動的に
.Pa /etc/groups
ファイル中のグループに登録することができます。
これはすべてのユーザがあるリソースを共有していたり、
ユーザを同じ第 1 グループに登録したい場合に便利な機能です。
.Xr pw 8
のコマンドオプションで
.Fl G
を使用することによって、このキーワードの効果を変更することができます。
.Pp
.Ar defaultclass
フィールドにより、
.Xr pw 8
によって指定されない場合に新規ユーザが割り当てられるログインクラス (
.Xr login.conf 5
参照) を指定することができます。
.Pp
.Ar minuid ,
.Ar maxuid ,
.Ar mingid ,
.Ar maxgid
の各キーワードは自動的に割り当てるユーザ ID とグループ ID 番号の
範囲を指定します。
ユーザとグループ ID のデフォルトの値は最小 1000 から最大 32000 の
範囲となります。
実際に
.Xr pw 8
によってアカウントを作成する際に使用されるユーザとグループ ID は
コマンド行のオプションの
.Fl u
と
.Fl g
によって変更することができます。
.Pp
.Ar expire_days
と
.Ar password_days
はそれぞれアカウントが作成された日から、
アカウントの期限が切れる日、
またはユーザがアカウントのパスワードの変更を強要される日までの
日数計算を自動的に行うために使用されます。
いずれかのフィールドで値
.Ql \&0
を指定すると、対応する (アカウントかパスワードの) 期限切れを抑止します。
.Pp
.Sh 制限事項
.Pa /etc/pw.conf
で 1 行は最長 1024 文字までとなります。
これより長い行についてはスキップされコメントとして扱われます。
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/pw.conf
.It Pa /etc/passwd
.It Pa /etc/master.passwd
.It Pa /etc/group
.El
.Sh 関連項目
.Xr passwd 1 ,
.Xr group 5 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr pw 8
