freebsd/freebsd-doc/ja_JP.eucJP/man/man5/radius.conf.5
,.\" Copyright 1998 Juniper Networks, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libradius/radius.conf.5,v 1.4.2.1 2000/12/08 13:49:39 ru Exp %
.\"
.\" jpman %Id: radius.conf.5,v 1.4 1999/02/11 08:06:56 horikawa Stab %
.\" WORD: sensitive	(情報を)極めて慎重に扱うべき[radius.5]

.Dd October 30, 1999
.Dt RADIUS.CONF 5
.Os FreeBSD
.Sh 名称
.Nm radius.conf
.Nd RADIUS クライアントの設定ファイル
.Sh 書式
.Pa /etc/radius.conf
.Sh 解説
.Nm
は、RADIUS クライアントライブラリの設定に必要な情報を含みます。
本ファイルは
.Xr rad_config 3
が解釈します。
本ファイルは 1 行以上のテキスト行を含み、
各行は、ライブラリが使用する単一の RADIUS サーバについて記述します。
先行する空白は、空行および、コメントのみの行と同様、無視されます。
.Pp
1 つの RADIUS サーバは、3 から 5 フィールドからなる 1 行により記述されます:
.Pp
.Bl -item -offset indent -compact
.It
サーバタイプ
.It
サーバホスト
.It
共有鍵
.It
タイムアウト
.It
リトライ数
.El
.Pp
フィールドは空白で区切ります。
フィールドの先頭にある
.Ql #
文字はコメントを開始し、行末まで続きます。
フィールドはダブルクォートで括ることができ、
この場合空白を含んだり、
.Ql #
文字で開始することができます。
クォートされた文字列中では、ダブルクォート文字は
.Ql \e\&"
で表現可能であり、バックスラッシュは
.Ql \e\e
で表現可能です。
他のエスケープシーケンスはサポートされていません。
.Pp
.Pp
最初のフィールドはサーバタイプを指定します。
.Ql auth
で RADIUS 認証を指定するか、
.Ql acct
で RADIUS アカウンティングを指定します。
単一サーバで両方のサービスを提供する場合、ファイル中に 2 行必要です。
以前のバージョンのファイルではサービスタイプを含みませんでした。
後方互換のため、最初のフィールドが
.Ql auth
か
.Ql acct
のいずれでもない場合、ライブラリは、
.Ql auth
が指定されたものとして振舞い、
その行をフィールド 2 から 5 が指定されたものとして解釈します。
.Pp
第 2 フィールドは、
完全な形でのドメイン名でもかまいませんし、
ドット付き 4 つ組の IP アドレスでもかまいません。
ホストの後には
.Ql \&:
と数値によるポート番号を続けることができます。この時、間に空白を入れては
いけません。ポートを指定しない場合、サービスタイプ
.Ql auth
および
.Ql acct
のそれぞれに対して
.Pa /etc/services
ファイルの
.Ql radius
または
.Ql radacct
のサービスになります。
.Pa /etc/services
ファイルにこのようなエントリが無い場合、
標準の RADIUS ポート 1812 および 1813 になります。
.Pp
第 3 フィールドには共有鍵が置かれ、
クライアントとサーバホスト以外には知られてはなりません。
共有鍵は任意の文字列ですが、
空白を含む場合はダブルクォートで括る必要があります。
共有鍵の長さに制限はありませんが、
RADIUS プロトコルでは先頭 128 文字しか使用されません。
注意: 有名な RADIUS サーバには、
16 文字より長い共有鍵では正しく動作しないというバグを持ったものがあります。
.Pp
第 4 フィールドは、
サーバから正当なリプライを受け取るまでに待つ秒数であり、
10 進数で指定します。
このフィールドを省略すると、デフォルトの 3 秒になります。
.Pp
第 5 フィールドは、
諦めるまでに最大何回サーバに認証を試みるかを示す値を 10 進数で指定します。
省略すると、デフォルトの 3 回になります。
これは試行回数の合計であり、リトライ回数ではないことに注意してください。
.Pp
RADIUS サーバは、各サービスに対して最大 10 個まで指定できます。
サーバはラウンドロビン方式で試され、有効な返答が返されるか、
全サーバに対して、最大試行回数に達するまで続けます。
.Pp
このファイルの標準的な置き場所は
.Pa /etc/radius.conf
です。しかし、
.Xr rad_config 3
を呼び出すときに別のパス名を指定できます。
このファイルは、共有鍵という形で極めて慎重に扱うべき情報を格納する
ファイルですから、root 以外には読めないようにすべきです。
.Sh 関連ファイル
.Pa /etc/radius.conf
.Sh 使用例
.Bd -literal
# 全部デフォルトである単純なエントリ
acct  radius1.domain.com  OurLittleSecret

# サーバはまだ廃れた RADIUS ポート使っており、
# タイムアウトと最大試行回数を増加しています:
auth  auth.domain.com:1645  "I can't see you"  5  4

# サーバを IP アドレスで指定:
auth  192.168.27.81  $X*#..38947ax-+=
.Ed
.Sh 関連項目
.Xr libradius 3
.Rs
.%A C. Rigney, et al
.%T Remote Authentication Dial In User Service (RADIUS)
.%O RFC 2138
.Re
.Rs
.%A C. Rigney
.%T RADIUS Accounting
.%O RFC 2139
.Re
.Sh 作者
この文書を
.An John Polstra
が書き、Juniper Networks, Inc. が
.Fx
プロジェクトに寄贈しました。
