freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ranlib.5
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ranlib.5.5	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.bin/ranlib/ranlib.5,v 1.4 1999/08/28 01:05:03 peter Exp %
.\" jpman %Id: ranlib.5,v 1.3 1998/06/25 08:46:35 jsakai Stab %
.\"
.Dd June 6, 1993
.Dt RANLIB 5
.Os
.Sh 名称
.Nm ranlib
.Nd アーカイブ (ライブラリ) の目次テーブルのフォーマット
.Sh 書式
.Fd #include <ranlib.h>
.Sh 解説
アーカイブの目次テーブルコマンド
.Nm
は、オブジェクトファイルを含むアーカイブの目次テーブルを作成します。
このテーブルはリンクエディタ
.Xr ld 1
が使用します。
このコマンドは、ユーティリティ
.Xr ar 1
が作成したアーカイブに対して操作を行ないます。
.Pp
.Nm
の機能により、
3 つの部分からなる新しいファイルがアーカイブの先頭に付加されます。
最初の部分は標準のアーカイブヘッダであり、特別な名前フィールド
\&"__.SYMDEF" を持ちます。
.Pp
2 番目の部分は ``long'' に ranlib 構造のリストが続きます。
long は ranlib 構造のバイトでの大きさです。
各 ranlib 構造は、
次の部分 (シンボルの文字列テーブル) への 0 を基準としたオフセットと、
シンボルを定義するアーカイブファイルへのアーカイブの先頭からのオフセット
からなります。
実際の ranlib 構造の個数は、
この数値を個々の ranlib 構造の大きさで割ったものです。
.Pp
3 番目の部分は ``long'' に文字列テーブルが続きます。
long は文字列テーブルのバイト数です。
.Sh 関連項目
.Xr ar 1 ,
.Xr ranlib 1
