freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rc.conf.5
.\" Copyright (c) 1995
.\"	Jordan K. Hubbard
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/rc.conf.5,v 1.64.2.11 2000/12/12 10:00:56 ru Exp %
.\"
.\" jpman %Id: rc.conf.5,v 1.3 1998/06/26 09:39:58 jsakai Stab %
.\"
.Dd July 3, 2000
.Dt RC.CONF 5
.Os
.Sh 名称
.Nm rc.conf
.Nd システム設定情報
.Sh 解説
.Nm
ファイルはローカルホスト名、全ての潜在的なネットワークインタフェースに
関する設定の詳細、システムの初期起動時に立ち上げるべき
サービスに関する記述可能な情報を含んできます。初めてインストールする際に
は、一般に
.Nm
ファイルはシステムインストールユーティリティ
.Pa /stand/sysinstall
によって初期化されます。
.Pp
.Nm
の目的は、
コマンドの実行やシステム起動操作を直接行うことではありません。
それに代わり、
そこに見出される設定にしたがって内部操作を条件付きで制御する
.Pa /etc
下のいろいろな類の起動スクリプトの一部をなしています。
.Pp
.Pa /etc/rc.conf
ファイルは、
使用可能な全オプションのデフォルト設定を指定するファイル
.Pa /etc/defaults/rc.conf
からインクルードされます。
オプションを
.Pa /etc/rc.conf
に指定する必要があるのは、
システム管理者がこれらのデフォルトを上書きしたい場合だけです。
ファイル
.Pa /etc/rc.conf.local
は、
.Pa /etc/rc.conf
の設定を上書きするために使用されます。これは歴史的事情のためです。
後述の
.Dq rc_conf_files
を参照してください。
.Pp
以下に示すのは
.Nm
ファイル中で設定可能な各変数について、
その名前と簡単な解説をリストしたものです。
.Bl -tag -width Ar
.It Ar swapfile
(文字列)
.Ar NO
にセットすると
スワップファイルはインストールされません。
.Ar NO
以外の場合、その値は追加スワップ領域のために利用するファイルの
完全パス名として用いられます。
.It Ar apm_enable
(ブール値)
.Ar YES
にセットすると
.Xr apm 8
コマンドでの自動電源管理 (Automatic Power Management) のサポートを有効に
します。
.It Ar apmd_enable
(ブール値)
.Xr apmd 8
を実行し、ユーザランドから APM イベントを扱います。
APM サポートも有効にします。
.It Ar apmd_flags
(文字列)
.Ar apmd_enable
が
.Ar YES
の場合、これらは
.Xr apmd 8
デーモンに渡すフラグになります。
.It Ar pccard_enable
(ブール値)
.Ar YES
にセットすると起動時に PCCARD のサポートを有効にします。
.It Ar pccard_mem
(文字列) PCCARD コントローラメモリアドレスをセットします。
.Ar DEFAULT
とするとデフォルト値になります。
.It Ar pccard_ifconfig
(文字列) ブート時またはカード挿入時に
.Xr ifconfig 8
に渡される引数のリストです
(例えば、
固定アドレスの場合は "inet 192.168.1.1 netmask 255.255.255.0" などですし、
DHCP クライアントの場合は "DHCP" です)。
.It Ar pccard_beep
(整数)
0 である場合、PCCARD コントローラを静寂モードにします。
1 である場合、ビープモードにします。
2 である場合、メロディモードにします。
.It Ar pccard_conf
(文字列)
.Xr pccardd 8
デーモンの設定ファイルのパスです (例えば
.Pa /etc/pccard.conf.sample
です)。
.It Ar pccardd_flags
(文字列)
.Ar pccard_enable 
が
.Ar YES
の場合、これらは
.Xr pccardd 8
デーモンに渡すフラグになります。
.It Ar local_startup
(文字列) 起動スクリプトファイルを検索するためのディレクトリのリストです。
.It Ar hostname
(文字列) ネットワーク上でのあなたのホストの完全な形のドメイン名 (The
Fully Qualified Domain Name) です。あなたがネットワークに接続されていない
場合でも、この変数は確実に何か意味のあるものに設定すべきです。
ホスト名を DHCP を介して設定するために
.Xr dhclient 8
を使用している場合、この変数は空文字列に設定すべきです。
.It Ar nisdomainname
(文字列) あなたのホストの NIS ドメイン名。NIS が動いてないときは
.Ar NO
とします。
.It Ar dhcp_program
(文字列) DHCP クライアントプログラムのパスです
(ISC DHCP クライアントの
.Pa /sbin/dhclient
がデフォルトです)。
.It Ar dhcp_flags
(文字列) DHCP クライアントプログラムに渡す追加のフラグです。
ISC DHCP クライアント用に利用可能なコマンドラインオプションについては、
.Xr dhclient 8
ページを参照してください。
.It Ar firewall_enable
(ブール値) 起動時にロードされるファイアウォール規則を持ちたくないときには
.Ar NO
、持ちたいときには
.Ar YES 
をセットします。
.Ar YES
にセットし、かつカーネルが IPFIREWALL 付きで作られなかった場合、
ipfw カーネルモジュールがロードされます。
.Ar ipfilter_enable
も参照してください。
.It Ar firewall_script
(文字列)
.Pa /etc/rc.firewall
以外のファイアウォールスクリプトを実行したい場合、
そのスクリプトの完全なパス名をこの変数に設定してください。
.It Ar firewall_type
(文字列)
.Pa /etc/rc.firewall
中で選択されたファイアウォールのタイプまたはローカルファイアウォール規則
の組を含むファイルを名付けます。
.Pa /etc/rc.firewall
中では以下のものが選択可能です: 
.Dq open
- 無制限の IP アクセス;
.Dq closed
- lo0 経由を除く全ての IP サービスを禁止;
.Dq client
- ワークステーション向けの基本的な保護;
.Dq simple
- LAN 向けの基本的な保護。
ファイル名が指定される場合には完全なパス名でなければなりません。
.It Ar firewall_quiet
(ブール値)
.Ar YES
にセットすると起動時にコンソール上で ipfw 規則の表示を行ないません。
.It Ar firewall_logging
(ブール値)
.Ar YES
にセットすると ipfw のイベントロギングを有効にします。
IPFIREWALL_VERBOSE カーネルオプションと等価です。
.It Ar natd_program
(文字列)
.Xr natd 8
のパス。
.It Ar natd_enable
(ブール値)
.Ar YES
にセットすると natd を有効にします。
.Ar firewall_enable
もまた
.Ar YES
にセットされ、
.Xr divert 4
ソケットがカーネルで有効にされている必要があります。
.It Ar natd_interface
natd が実行されるパブリックインタフェースの名前です。
.Ar natd_enable
が
.Ar YES
にセットされている場合には、これを設定する必要があります。
インタフェースの指定は、インタフェース名でも IP アドレスでもかまいません。
.It Ar natd_flags
追加の natd フラグはここに記述する必要があります。
.Fl n
または
.Fl a
のフラグは上記
.Ar natd_interface
とともに自動的に引数として追加されます。
.\" ----- ipfilter_enable seting --------------------------------
.It Ar ipfilter_enable
(ブール値) デフォルトは
.Ar NO
にセットされます。
.Ar YES
にセットすると、
.Xr ipf 8
パケットフィルタリングを有効にします。
厳密に言えば、この設定と、
.Ar ipfilter_program ,
.Ar ipfilter_rules ,
.Ar ipfilter_flags
が連結されてコマンドとなるいう事実とを "濫用" して、
およそどんなフィルタでも構築可能です。
ただし、
.Ar ipfilter_rules
で指定されるファイルが読めることが必要です。
.Ar ipfilter_enable
と
.Ar ipnat_enable
が
.Ar YES
にセットされ、
.Ar ipnat_rules
で指定されたファイルが読める場合、
.Ar ipnat_program ,
.Ar ipnat_rules ,
.Ar ipnat_flags
が、
ネットワークアドレス変換プログラムの起動のためのコマンドラインを構成します。
.Ar ipfilter_enable
と
.Ar ipmon_enable
が
.Ar YES
にセットされた場合、
.Ar ipmon_program
と
.Ar ipmon_flags
が、上記コマンドの動作を監視するための別のコマンドラインを構成します。
詳細は
.Pa /etc/rc.network
を参照してください。
.Pp
典型的な用途では、
.Bd -literal
ipfilter_enable="YES"
ipfilter_flags=""
ipnat_enable="YES"
ipmon_enable="YES"

.Ed
を
.Pa /etc/rc.conf
に記述し、
.Pa /etc/ipf.rules
と
.Pa /etc/ipnat.rules
を適切に編集する必要があるでしょう。
ipf 使用時には、
.Ar firewall_enable
をオフにすることを推奨します。
カーネル構成ファイル中に
.Bd -literal
options  IPFILTER
options  IPFILTER_LOG
options  IPFILTER_DEFAULT_BLOCK

.Ed
を置くことも良い考えです。
.\" ----- ipfilter_program setting ------------------------------
.It Ar ipfilter_program
(文字列) デフォルトで
.Ar /sbin/ipf -Fa -f
にセットされます。
この変数は、フィルタルール (別のファイル中にあるものと期待されます)
までのコマンドラインを含みます (フィルタルールは含みません)。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipfilter_rules setting --------------------------------
.It Ar ipfilter_rules
(文字列) デフォルトで
.Ar /etc/ipf.rules
にセットされます。
この変数は、フィルタルール定義ファイルの名前を含みます。
このファイルは、実行するフィルタコマンドから読めることが期待されます。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipfilter_flags setting --------------------------------
.It Ar ipfilter_flags
(文字列) デフォルトで
.Ar -E
にセットされます。
この変数は、フィルタコマンドに追加されるフラグを含みます。
このフラグはルール定義ファイルの後に追加されます。
デフォルト設定では、オンデマンドでロードされる ipf モジュールを初期化します。
ipfilter を直接カーネルに組み込むときには (これが推奨です)、
この変数を空にしてコード初期化が複数回行われないようにすべきです。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipnat_enable setting ----------------------------------
.It Ar ipnat_enable
(ブール値) デフォルトで
.Ar NO
にセットされます。
.Ar YES
にセットすると、
.Xr ipnat 8
ネットワークアドレス変換を有効にします。
この変数をセットする場合、
.Ar ipfilter_enable
もセットすることが必要です。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipnat_program setting ---------------------------------
.It Ar ipnat_program
(文字列) デフォルトで
.Ar /sbin/ipnat -CF -f
にセットされます。
この変数は、変換ルール定義 (別のファイル中にあるものと期待されます)
までのコマンドラインを含みます (変換ルール定義は含みません)。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipnat_rules setting -----------------------------------
.It Ar ipnat_rules
(文字列) デフォルトで
.Ar /etc/ipnat.rules
にセットされます。
この変数は、ネットワークアドレス変換を定義するファイルの名前を含みます。
このファイルは、実行する NAT プログラムから読めることを期待しています。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipnat_flags setting -----------------------------------
.It Ar ipnat_flags
(文字列) デフォルトで空です。
この変数は、ipnat のコマンドラインに追加されるフラグを含みます。
このフラグはルール定義ファイルの後に追加されます。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipmon_enable setting ----------------------------------
.It Ar ipmon_enable
(ブール値) デフォルトで
.Ar NO
にセットされます。
.Ar YES
にセットすると、
.Xr ipmon 8
モニタリング (
.Xr ipf 8
と
.Xr ipnat 8
のイベントのログ) を有効にします。
この変数をセットする場合、
.Ar ipfilter_enable
もセットすることが必要です。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipmon_program setting ---------------------------------
.It Ar ipmon_program
(文字列) デフォルトで
.Ar /sbin/ipmon
にセットされます。
この変数は
.Xr ipmon 8
実行形式のファイル名を含みます。
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- ipmon_flags setting -----------------------------------
.It Ar ipmon_flags
(文字列) デフォルトで
.Ar -Ds
にセットされます。
この変数は、
.Xr ipmon 8
プログラムに渡されるフラグを含みます。
他の典型的な例は
.Ar -D /var/log/ipflog
であり、これは
.Xr ipmon 8
に
.Xr syslogd 8
をバイパスさせて、直接ファイルにログさせます。
このような場合、必ず
.Pa /etc/newsyslog.conf
を次のように修正してください:
.Bd -literal
/var/log/ipflog  640  10  100  *  Z  /var/run/ipmon.pid

.Ed
詳細は
.Ar ipfilter_enable
を参照してください。
.\" ----- end of added ipf hook ---------------------------------
.It Ar tcp_extensions
(ブール値) デフォルトでは
.Ar NO
です。YES にセットすると、
.%T RFC 1323
で述べられているような
ある TCP オプションを有効にします。
もしネットワークコネクションが不規則にハングアップしたり、
それに類する他の不具合がある場合には、これを
.Ar NO
に戻して様子をみてみるのもよいかもしれません。世間に出回っている
ハードウェア/ソフトウェアの中には、これらのオプションでうまく動作しない
ものがあることが知られています。
.It Ar log_in_vain
(ブール値) デフォルトで
.Ar NO
にセットされています。
YES に設定すると、
listen 中のソケットが無いポートに対する接続の試みをログするようになります。
.It Ar tcp_keepalive
(ブール値) デフォルトで
.Ar YES
にセットされています。
NO にセットすると、
アイドルな TCP 接続を検出し、相手がまだ起きていて、到達可能であることを、
確認しなくなります。
.It Ar tcp_drop_synfin
(ブール値) デフォルトで
.Ar NO
にセットされています。
YES にセットすると、
TCP フレームで SYN と FIN のフラグを共にセットされているものを、
カーネルが無視するようになります。
これにより、OS が指紋を残すのを防ぎますが、
正当なアプリケーションが動作しなくなるかもしれません。
RCP_DROP_SYNFIN オプション付きでカーネルを構築した場合のみ、
本オプションが使用可能です、
.It Ar tcp_restrict_rst
(ブール値) デフォルトで
.Ar NO
にセットされています。
YES にセットすると、
不正な TCP パケット (例えば、閉じられたポート宛のフレーム)
に応答する TCP RST フレームの送出を、
カーネルに止めさせます。
RCP_RESTRICT_RST オプション付きでカーネルを構築した場合のみ、
本オプションが使用可能です、
.It Ar icmp_drop_redirect
(ブール値) デフォルトで
.Ar NO
にセットされています。
YES にセットすると、
ICMP REDIRECT パケットを、カーネルが無視するようになります。
.It Ar icmp_log_redirect
(ブール値) デフォルトで
.Ar NO
にセットされています。
YES にセットすると、
ICMP REDIRECT パケットを、カーネルが記録するようになります。
ログメッセージの速度制限はありませんので、
あなたのネットワーク内の問題解決にのみ使用すべきです。
.It Ar network_interfaces
(文字列) このホスト上で形成されるネットワークインタフェースのリストを
設定します。
たとえば、ループバックデバイス (標準) および SMC Elite Ultra NIC があるなら
.Qq Ar "lo0 ed0"
という 2 つのインタフェースを設定します。
.Em interface
の各値に対して
.No ifconfig_ Ns Em interface
という変数が存在すると仮定されます。
1 つのインタフェースに複数の IP アドレスを登録したい場合は、
ここに IP エイリアスのエントリを追加することも可能です。
対象とするインタフェースが ed0 であると仮定すると、
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.253 netmask 0xffffffff" 
ifconfig_ed0_alias1="inet 127.0.0.254 netmask 0xffffffff"

.Ed
というようになります。
見つかった各 ifconfig_<interface>_alias<n> エントリについて、
その内容が
.Xr ifconfig 8
に渡されます。最初にアクセスに失敗した時点で実行は中止されるので
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.251 netmask 0xffffffff"
ifconfig_ed0_alias1="inet 127.0.0.252 netmask 0xffffffff"
ifconfig_ed0_alias2="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_ed0_alias4="inet 127.0.0.254 netmask 0xffffffff"

.Ed
のようにすると、alias4 は追加され
.Em ない
ことに注意してください。これは
alias3 エントリを抜かしたことで検索が中止されるからです。
.Pp
インタフェースの DHCP での立ち上げは、
.No ifconfig_ Ns Em interface
変数を
.Dq DHCP
に設定することで可能です。
例えば ed0 デバイスを HDCP で初期化するには、
次のような行を指定すればよいです:
.Bd -literal
ifconfig_ed0="DHCP"
.Ed
.It Ar ppp_enable
(ブール値)
.Ar YES
にセットすると、
.Xr ppp 8
デーモンを実行します。
.It Ar ppp_mode
(文字列)
.Xr ppp 8
デーモンを実行するモードです。受け付けられるモードは
.Ar auto , ddial , direct ,
.Ar dedicated
のいずれかです。
完全な解説はマニュアルを参照してください。
.It Ar ppp_nat
(ブール値)
.Ar YES
にセットすると、パケットエイリアスを有効にします。
.Ar gateway_enable
と共に使用することにより、
本ホストをネットワークアドレス変換ルータとして使用して、
プライベートネットワークアドレスのホストからの
インターネットへのアクセスを可能にします。
.It Ar ppp_profile
(文字列)
.Pa /etc/ppp/ppp.conf
から使用するプロファイル名です。
.It Ar ppp_user
(文字列) このユーザ名の元で ppp を起動します。
デフォルトでは ppp は
.Ar root
が起動します。
.It Ar rc_conf_files
(文字列) 本オプションは、
.Pa /etc/defaults/rc.conf
の設定を上書きするファイルのリストを指定するために使用されます。
ファイルは指定された順序に読み込まれ、
ファイルへの完全なパスを含む必要があります。
デフォルトでは、指定されるファイルは
.Pa /etc/rc.conf
と
.Pa /etc/rc.conf.local
です。
.It Ar syslogd_enable
(ブール値)
.Ar YES
にセットすると
.Xr syslogd 8
デーモンを起動します。
.It Ar syslogd_flags
(文字列)
.Ar syslogd_enable
が
.Ar YES
の場合、これらは
.Xr syslogd 8
に渡すフラグになります。
.It Ar inetd_enable
(ブール値)
.Ar YES
にセットすると
.Xr inetd 8
デーモンを起動します。
.It Ar inetd_flags
(文字列)
.Ar inetd_enable
が
.Ar YES
の場合、これらは
.Xr inetd 8
へ渡すフラグとなります。
.It Ar named_enable
(ブール値)
.Ar YES
にセットすると
.Xr named 8
デーモンを起動します。
.It Ar named_program
(文字列)
.Xr named 8
のパス (デフォルトは
.Pa /usr/sbin/named
です)。
.It Ar named_flags
(文字列)
.Ar named_enable
が
.Ar YES
の場合、これらは
.Xr named 8
に渡すフラグとなります。
.It Ar kerberos_server_enable
(ブール値) ブート時に Kerberos 認証サーバを起動したい場合は
.Ar YES
にセットします。
.It Ar kadmind_server_enable
.Xr kadmind 8
(Kerberos 管理デーモン) を実行したい場合は
.Ar YES
とします。スレーブサーバ上では
.Ar NO
にセットします。
.It Ar kerberos_stash
(文字列)
.Ar YES
なら (唯一
.Ar kerberos_server_enable
が
.Ar YES
にセットされ、かつ
.Xr kerberos 1
および
.Xr kadmind 8
の両方を用いるときにのみ) 隠されたマスタキーのプロンプト入力を行なう代りに、
そのキーを用いるよう Kerberos サーバに指示します。
.It Ar rwhod_enable
(ブール値)
.Ar YES
にセットするとブート時に
.Xr rwhod 8
デーモンを起動します。
.It Ar rwhod_flags
(文字列)
.Ar rwhod_enable
が
.Ar YES
にセットされている場合、これらは rwhod に渡すフラグになります。
.It Ar amd_enable
(ブール値)
.Ar YES
にセットするとブート時に
.Xr amd 8
デーモンを起動します。
.It Ar amd_flags
(文字列)
.Ar amd_enable
が
.Ar YES
にセットされている場合、これらは amd に渡すフラグとなります。
詳しくは
.Xr amd 8
の
.Xr info 1
ページを利用してください。
.It Ar update_motd
(ブール値)
.Ar YES
にセットするとブート時に実行されているカーネルリリースを反映するように
.Pa /etc/motd
を更新します。
.Ar NO
にセットすると
.Pa /etc/motd
は更新を行いません。
.It Ar nfs_client_enable
(ブール値)
.Ar YES
にセットするとブート時に NFS クライアントデーモンを起動します。
.It Ar nfs_client_flags
(文字列)
.Ar nfs_client_enable
が
.Ar YES
の場合、これらは
.Xr nfsiod 8
デーモンに渡すフラグとなります。
.It Ar nfs_access_cache
.Ar nfs_client_enable
が
.Ar YES
の場合、この変数に
.Ar 0
をセットして NFS ACCESS RPC キャッシングを無効化することができますし、
NFS ACCESS 結果がキャッシュされる秒数を指定することもできます。
2-10 秒の値を設定すると、
多くの NFS 操作のネットワークトラフィックを十分減らします。
.It Ar nfs_server_enable
(ブール値)
.Ar YES
にセットするとブート時に NFS サーバデーモンを起動します。
.It Ar nfs_server_flags
(文字列)
.Ar nfs_server_enable
が
.Ar YES
の場合、これらは
.Xr nfsd 8
デーモンに渡すフラグとなります。
.It Ar single_mountd_enable
(ブール値)
.Ar YES
にセットし
.Ar nfs_server_enable
をセットしないと、
.Xr mountd 8
は起動しますが
.Xr nfsd 8
デーモンは起動しません。
実際に NFS は使用せずに CFS を使用する場合に、一般的に必要となります。
.It Ar weak_mountd_authentication
(ブール値)
.Ar YES
にセットすると、権限付けられていないマウント要求を行なうために
PCNFSD のようなサービスを許可します。
.It Ar nfs_privport
(ブール値)
.Ar YES
にセットすると、安全なポート上でのみ NFS サービスを提供します。
.It Ar nfs_bufpackets
(整数) 数値を設定すると、そのパケット数分のソケットバッファ空間が、
NFS クライアント上に予約されます。
.Ar DEFAULT
に設定すると、カーネルのデフォルト (典型的には 4) が使用されます。
ギガビットネットワークでは大きな値を設定すると高性能になるでしょう、
最小値は 2 であり、最大値は 64 です。
.It Ar rcp_lockd_enable
(ブール値) この変数が
.Ar YES
にセットされ、しかも NFS サーバである場合、ブート時に
.Xr rpc.lockd 8
を起動します。
.It Ar rcp_statd_enable
(ブール値) この変数が
.Ar YES
にセットされ、しかも NFS サーバである場合、ブート時に
.Xr rpc.statd 8
を起動します。
.It Ar portmap_program
(文字列)
.Xr portmap 8
のパス (デフォルトは
.Pa /usr/sbin/portmap
です)。
.It Ar portmap_enable
(ブール値)
.Ar YES
の場合、ブート時に
.Xr portmap 8
サービスを起動します。
.It Ar portmap_flags
(文字列)
.Ar portmap_enable
が
.Ar YES
の場合、これらは
.Xr portmap 8
デーモンに渡すフラグとなります。
.It Ar xtend_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr xtend 8 
デーモンを起動します。
.It Ar xtend_flags
(文字列)
.Ar xtend_enable
が
.Ar YES
の場合、これらは
.Xr xtend 8
デーモンに渡すフラグとなります。
.It Ar pppoed_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr pppoed 8 
デーモンを起動し、PPP オーバイーサネットサービスを提供します。
.It Ar pppoed_provider
.Xr pppoed 8
はこの
.Ar provider
に対する要求を listen し、究極的にはこの名前を
.Ar system
引数として
.Xr ppp 8
を実行します。
.It Ar pppoed_flags
.Xr pppoed 8
へ渡す追加のフラグ。
.It Ar pppoed_interface
pppoed が実行されるネットワークインタフェース。
.Ar pppoed_enable
が
.Dq YES
にセットされた場合、必須です。
.It Ar timed_enable
(ブール値)
.Ar YES
なら、ブート時に
.Xr timed 8
サービスを実行します。このコマンドは、全ホストについて一貫した
.Qq "ネットワーク時間"
が確立されなければならないマシンネットワークのためにあります。
これが有用である典型例は、
ファイルのタイムスタンプがネットワークワイドで一貫性をもつことが
期待されるような、大規模 NFS 環境です。
.It Ar timed_flags
(文字列)
.Ar timed_enable
が
.Ar YES
の場合、これらは
.Xr timed 8
サービスに渡すフラグとなります。
.It Ar ntpdate_enable
(ブール値)
.Ar YES
にセットすると、システムスタートアップ時に ntpdate を実行します。
このコマンドは、ある標準的な参照先を元に、ただ
.Ar 1 回
だけシステム時刻を同期させるためにあります。
また、システムを最初にインストールする際、
これを (知られているサービスのリストから) 最初にセットアップするオプションが
.Pa /stand/sysinstall
プログラムによって提供されます。
.It Ar ntpdate_program
(文字列)
.Xr ntpdate 8
のパス
(デフォルトは
.Pa /usr/sbin/ntpdate
です)。
.It Ar ntpdate_flags
(文字列)
.Ar ntpdate_enable
が
.Ar YES
の場合、これらは
.Xr ntpdate 8
コマンドに渡すフラグとなります (典型的にはホスト名)。
.It Ar xntpd_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr xntpd 8
コマンドが起動されます。
.It Ar xntpd_program
(文字列)
.Xr xntpd 8
のパス
(デフォルトは
.Pa /usr/sbin/xntpd
です)。
.It Ar xntpd_flags
(文字列)
.Ar xntpd_enable
が
.Ar YES
の場合、これらは
.Xr xntpd 8
デーモンに渡すフラグとなります。
.It Ar nis_client_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypbind 8
サービスを起動します。
.It Ar nis_client_flags
(文字列)
.Ar nis_client_enable
が
.Ar YES
の場合、これらは
.Xr ypbind 8
サービスに渡すフラグとなります。
.It Ar nis_ypset_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypset 8
デーモンを起動します。
.It Ar nis_ypset_flags
(文字列)
.Ar nis_ypset_enable
が
.Ar YES
の場合、これらは
.Xr ypset 8
デーモンに渡すフラグとなります。
.It Ar nis_server_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypserv 8
デーモンを起動します。
.It Ar nis_server_flags
(文字列)
.Ar nis_server_enable
が
.Ar YES
の場合、これらは
.Xr ypserv 8
デーモンに渡すフラグとなります。
.It Ar nis_ypxfrd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypxfrd 8
デーモンを起動します。
.It Ar nis_ypxfrd_flags
(文字列)
.Ar nis_ypxfrd_enable
が
.Ar YES
の場合、これらは
.Xr ypxfrd 8
デーモンに渡すフラグとなります。
.It Ar nis_yppasswdd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr yppasswdd 8
デーモンを起動します。
.It Ar nis_yppasswdd_flags
(文字列)
.Ar nis_yppasswdd_enable
が
.Ar YES
の場合、これらは
.Xr yppasswdd 8
デーモンに渡すフラグとなります。
.It Ar defaultrouter
(文字列)
.Ar NO
をセットしないと、このホスト名または IP アドレスへのデフォルトルートを
作成します (このルータがネームサーバへたどりつく必要がある
場合は IPアドレスを使用すること!)。
.It Ar static_routes
(文字列) システムブート時に追加したいスタティックルートのリストを
セットします。
.Ar NO
以外をセットした場合、その値を空白で区切った各要素について、
各
.Em element
毎に変数
.No route_ Ns element
が存在すると仮定され、その後、
.Dq route add
操作に渡されます。
.It Ar gateway_enable
(ブール値)
.Ar YES
にセットすると、IP ルータとして動作する、
たとえばインタフェース間でパケットをフォワードするように
ホストを設定します。
.It Ar router_enable
(ブール値)
.Ar YES
にセットすると、
.Ar router
および
.Ar router_flags
の設定に基づいて、ある種のルーティングデーモンを実行します。
.It Ar router
(文字列)
.Ar router_enable
が
.Ar YES
にセットされると、これが使用するルーティングデーモン名になります。
.It Ar router_flags
(文字列)
.Ar router_enable
が
.Ar YES
にセットされると、これらがルーティングデーモンへ渡すフラグとなります。
.It Ar mrouted_enable
(ブール値)
.Ar YES
にセットすると、マルチキャストルーティングデーモン
.Xr mrouted 8
を起動します。
.It Ar mrouted_flags
(文字列)
.Ar mrouted_enable
が
.Ar YES
の場合、これらはマルチキャストルーティングデーモンへ渡すフラグとなります。
.It Ar ipxgateway_enable
(ブール値)
.Ar YES
にセットすると、IPX トラフィックのルーティングを有効にします。
.It Ar ipxrouted_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr IPXrouted 8
デーモンを起動します。
.It Ar ipxrouted_flags
(文字列)
.Ar ipxrouted_enable
が
.Ar YES
の場合、これらは
.Xr IPXrouted 8
デーモンへ渡すフラグとなります。
.It Ar arpproxy_all
.Ar YES
にセットするとグローバルプロキシ ARP を有効にします。
.It Ar forward_sourceroute
これが
.Ar YES
にセットされ、更に
.Ar gateway_enable
もまた
.Ar YES
にセットされている場合、
送信元が経路指定したパケット (source routed packets) はフォワードされます。
.It Ar accept_sourceroute
.Ar YES
にセットすると、
システムは自分宛の送信元経路指定パケットを受け付けます。
.It Ar rarpd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr rarpd 8
デーモンを起動します。
.It Ar rarpd_flags
(文字列)
.Ar rarpd_enable
が
.Ar YES
の場合、これらは
.Xr rarpd 8
デーモンへ渡すフラグとなります。
.It Ar atm_enable
(ブール値)
.Ar YES 
システムブート時に ATM インタフェースの設定を有効にします。
次に説明する ATM 関連の変数に関し、
利用可能なコマンドパラメータの更なる詳細については、
.Xr atm 8
のマニュアルページを参照してください。
更なる詳細な設定情報に関しては、
.Pa /usr/share/examples/atm
中のファイルも参照してください。
.It Ar atm_netif_<intf>
(文字列) ATM 物理インタフェース
.Va <intf>
に対し、本変数は、
作成すべき ATM ネットワークインタフェースの
名前プレフィックスと数字を指定します。
値はコマンド
.Dq atm set netif Va <intf>
のパラメータとして渡されます。
.It Ar atm_sigmgr_<intf>
(文字列) ATM 物理インタフェース
.Va <intf>
に対し、本変数は使用すべき ATM シグナリングマネージャを定義します。
値はコマンド
.Dq atm attach Va <intf>
のパラメータとして渡されます。
.It Ar atm_prefix_<intf>
(文字列) ATM 物理インタフェース
.Va <intf>
に対し、本変数は、
UNI シグナリングマネージャを使用するインタフェースの
NSAP プレフィックスを定義します。
.Em ILMI
に設定すると、プレフィックスは自動的に
.Xr ilmid 8 
デーモンを介して設定されます。
そうでない場合、値はコマンド
.Dq atm set prefix Va <intf>
のパラメータとして渡されます。
.It Ar atm_macaddr_<intf>
(文字列) ATM 物理インタフェース
.Va <intf>
に対し、本変数は、
UNI シグナリングマネージャを使用するインタフェースの
MAC アドレスを定義します。
.Em NO
に設定すると、ATM インタフェースカードに格納されている
ハードウェア MAC アドレスが使用されます。
そうでない場合、値はコマンド
.Dq atm set mac Va <intf>
のパラメータとして渡されます。
.It Ar atm_arpserver_<netif>
(文字列) ATM 物理インタフェース
.Va <netif>
に対し、本変数は、ATMARP サービスを提供するホストの ATM アドレスを定義します。
本変数は、UNI シグナリングマネージャを使用するインタフェースにおいてのみ
利用可能です。
.Em local
に設定すると、本ホストが ATMARP サーバになります。
値はコマンド
.Dq atm set arpserver Va <netif>
のパラメータとして渡されます。
.It Ar atm_scsparp_<netif>
(ブール値)
.Em YES
に設定すると、ネットワークインタフェース
.Va <netif> 
に対する SCSP/ATMARP サービスが、
.Xr scspd 8
および
.Xr atmarpd 8
を使用して開始されます。
本変数は
.So 
.No atm_arpserver_ Ns Va <netif> 
.No Ns = Ns Qq local
.Sc 
が定義されている場合にのみ利用可能です。
.It Ar atm_pvcs
(文字列) システムブート時に追加したい ATM PVC のリストを設定します。
値中で空白で区切られた 
.Em element 
ごとに、変数
.No atm_pvc_ Ns Em element
が存在するものと仮定されます。これらの変数の値がコマンド
.Dq atm add pvc
のパラメータとして渡されます。
.It Ar atm_arps
(文字列) システムブート時に追加したい、
永続的な ATM ARP エントリのリストを設定します。
値中で空白で区切られた 
.Em element 
ごとに、変数
.No atm_arp_ Ns Em element
が存在するものと仮定されます。これらの変数の値がコマンド
.Dq atm add arp
のパラメータとして渡されます。
.It Ar keymap
(文字列)
.Ar NO
にセットするとキーマップはインストールされません。それ以外の場合、
ここで指定した
.Ar value
がキーマップファイル
.Pa /usr/share/syscons/keymaps/<value>.kbd
をインストールするのに用いられます。
.It Ar keyrate
(文字列) キーボードのリピートスピードです。以下のいずれかにセットします。
.Ar slow ,
.Ar normal ,
.Ar fast
デフォルト値を希望する場合は
.Ar NO
とします。
.It Ar keychange
(文字列)
.Ar NO
以外にセットすると、その値でファンクションキーをプログラムしようとします。
指定できる値は単一の文字列で,
.Qq Ar "<funkey_number> <new_value> [<funkey_number> <new_value>]..."
という形式でないといけません。
.It Ar cursor
(文字列) カーソルの動作を明示的に指定する場合は
.Ar normal ,
.Ar blink ,
.Ar destructive
のいずれかの値にセットします。デフォルト動作を選ぶには
.Ar NO
とします。
.It Ar scrnmap
(文字列)
.Ar NO
にセットすると、スクリーンマップはインストールされません。
それ以外の場合には、ここで指定した
.Ar value
がスクリーンマップファイル
.Pa /usr/share/syscons/scrnmaps/<value>
をインストールするのに用いられます。
.It Ar font8x16
(文字列)
.Ar NO
にセットするとスクリーンサイズの要求に対しデフォルトの 8x16 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar font8x14
(文字列)
.Ar NO
にセットするとスクリーンサイズの要求に対しデフォルトの 8x14 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar font8x8
(文字列)
.Ar NO
にセットすると、スクリーンサイズの要求に対しデフォルトの 8x8 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar blanktime
(整数)
.Ar NO
にセットすると、デフォルトのスクリーンブランク時間間隔が用いられます。
それ以外の場合は
.Ar value 
秒にセットされます。
.It Ar saver
(文字列)
.Ar NO
以外にセットすると、これが実際に使用する
スクリーンセーバ (ブランク, 蛇, デーモンなど) となります。
.It Ar moused_enable
(文字列)
.Ar YES
にセットすると、コンソール上でのカット/ペーストセレクション用に
.Xr moused 8
デーモンが起動されます。
.It Ar moused_type
(文字列) 利用したいマウスのプロトコルのタイプ。
.Ar moused_enable
が
.Ar YES
の場合、この変数は必ず設定しなければなりません。
多くの場合、
.Xr moused 8
デーモンは適切なマウスタイプを自動的に検出することができます。
デーモンにマウスを検出させるには、この変数を
.Ar auto
にセットします。
自動検出が失敗する場合、以下のリストから 1 つを選びます。
.Pp
マウスが PS/2 マウスポートに接続されている場合、
.Ar auto
か
.Ar ps/2
を常に指定する必要があります。マウスのブランドやモデルには無関係です。
同様に、マウスがバスマウスポートに接続されている場合、
.Ar auto
か
.Ar busmouse
を選択してください。
他のプロトコルはシリアルマウス用であり、
PS/2 マウスおよびバスマウスでは動作しません。
USB マウスを持っている場合、
.Ar auto
のみが USB マウスで動作する唯一のプロトコルです。
.Bd -literal
microsoft        Microsoft マウス (シリアル)
intellimouse     Microsoft IntelliMouse (シリアル)
mousesystems     Mouse system 社製のマウス (シリアル)
mmseries         MM シリーズのマウス (シリアル)
logitech         Logitech 製のマウス (シリアル)
busmouse         バスマウス
mouseman         Logitech の MouseMan および TrackMan (シリアル)
glidepoint       ALPS 製の GlidePoint (シリアル)
thinkingmouse    Kensignton 製の ThinkingMouse (シリアル)
ps/2             PS/2 マウス
mmhittab         MM の HitTablet (シリアル)
x10mouseremote   X10 MouseRemote (シリアル)
versapad         Interlink VersaPad (シリアル)

.Ed
お使いのマウスが上記のリストにない場合でも、
リスト中のいずれかと互換性があるかも知れません。
互換性に関する情報については
.Xr moused 8
のマニュアルページを参照してください。
.Pp
また、
この変数が有効であるときは、(Xサーバのような) 他の全てのマウスクライアントは
仮想マウスデバイス
.Pa /dev/sysmouse
を通してマウスにアクセスし、
それを sysmouse タイプのマウスとして構成すべきであると
いうことにも注意すべきです。これは、
.Xr moused 8
使用時は、全てのマウスデータがこの単一の標準フォーマットに変換されるためです。
クライアントプログラムが sysmouse タイプを
サポートしないなら次に望ましいタイプとして mousesystems を指定してください。
.It Ar moused_port
(文字列)
.Ar moused_enable
が
.Ar YES
の場合、これはマウスが接続されている実際のポートになります。
たとえば、COM1 シリアルマウスに対しては
.Pa /dev/cuaa0
、PS/2 マウスに対しては
.Pa /dev/psm0
、バスマウスに対しては
.Pa /dev/mse0
となります。
.It Ar moused_flags
(文字列)
.Ar moused_type
がセットされている場合、これらは
.Xr moused 8
デーモンに渡す追加のフラグとなります。
.It Ar allscreens_flags
(文字列) 設定すると、各仮想端末
.Pq Pa /dev/ttyv*
に対し、これらのオプションを使用して
.Xr vidcontrol 1
を実行します。
例えば
.Ar -m on
は、
.Ar moused_enable
が
.Ar YES
にセットされている場合、全仮想端末上でマウスポインタを有効にします。
.It Ar cron_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr cron 8
デーモンを起動します。
.It Ar lpd_program
(文字列)
.Xr lpd 8
のパス (デフォルトは
.Pa /usr/sbin/lpd
です)。
.It Ar lpd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr lpd 8
デーモンを起動します。
.It Ar lpd_flags
(文字列)
.Ar lpd_enable
が
.Ar YES
の場合、これらは
.Xr lpd 8
デーモンに渡すフラグとなります。
.It Ar sendmail_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr sendmail 8
デーモンを起動します。
.It Ar sendmail_flags
(文字列)
.Ar sendmail_enable
が
.Ar YES
の場合、これらは
.Xr sendmail 8
デーモンに渡すフラグとなります。
.It Ar dumpdev
(文字列)
.Ar NO
にセットしないと、カーネルクラッシュダンプ出力先を
.Em value
で指定したスワップデバイスに向けます。
システム再開時に、
.Xr savecore 8
プログラムは、指定したデバイスからクラッシュダンプを探し、典型的には
.Pa /var/crash
ディレクトリに格納します。
.It Ar check_quotas
(ブール値)
.Xr quotacheck 8
コマンドによってユーザディスクのクォータチェックを有効にしたいなら、
.Ar YES
にセットします。
.It Ar accounting_enable
(ブール値)
.Xr accton 8
ファシリティでシステムアカウンティングを有効にしたいなら
.Ar YES
にセットします。
.It Ar ibcs2_enable
(ブール値)
システム初期ブート時に iBCS2 (SCO) バイナリエミュレーションを有効にしたいなら
.Ar YES
にセットします。
.It Ar ibcs2_loaders
(文字列) これを
.Ar NO
にセットせずに
.Ar ibcs2_enable
を
.Ar YES
にセットした場合、
この文字列は有効化すべき追加の iBCS2 ローダのリストを指定します。
.It Ar linux_enable
(ブール値)
システムブート時に Linux/ELF バイナリエミュレーションを有効にしたいなら
.Ar YES
にセットします。
.It Ar rand_irqs
(文字列) 乱数生成用に監視する IRQ のリストをセットします (
.Xr rndcontrol 8
のマニュアル参照)。
.It Ar clear_tmp_enable
(ブール値)
起動時に
.Pa /tmp
下を消去したいなら
.Ar YES
をセットします。
.It Ar ldconfig_paths
(文字列)
.Xr ldconfig 8
で使用する共有ライブラリのパスのリストをセットします。注意:
.Pa /usr/lib
は常に先頭に追加されるので、このリストに指定する必要はありません。
.It Ar kern_securelevel_enable
(ブール値)
カーネルのセキュリティレベルをシステムスタートアップ時に設定したい場合に、
.Ar YES
にセットします。
.It Ar kern_securelevel
(整数)
スタートアップ時にセットされるカーネルセキュリティレベルです。
.Ar 値
として許される範囲は -1 (コンパイル時のデフォルト) から 3 (最も安全) です。
利用可能なセキュリティレベルとシステム操作への影響については、
.Xr init 8
を参照してください。
.It Ar start_vinum
(ブール値)
システムブート時に
.Xr vinum 8
を開始したい場合、
.Ar YES
にセットします。
.It Ar sshd_program
(文字列) SSH サーバプログラムへのパスです
.Po
.Pa /usr/sbin/sshd
がデフォルトです
.Pc 。
.It Ar sshd_enable
(ブール値) ブート時に
.Xr sshd 8
を起動したい場合、
.Ar YES
にセットします。
.It Ar sshd_flags
(文字列)
.Ar sshd_enable
が
.Ar YES
の場合、これらは
.Xr sshd 8
デーモンに渡すフラグになります。
.Sh 関連ファイル
.Bl -tag -width /etc/defaults/rc.conf -compact
.It Pa /etc/defaults/rc.conf
.It Pa /etc/rc.conf
.It Pa /etc/rc.conf.local
.El
.Sh 関連項目
.Xr catman 1 ,
.Xr makewhatis 1 ,
.Xr gdb 1 ,
.Xr info 1 ,
.Xr exports 5 ,
.Xr motd 5 ,
.Xr accton 8 ,
.Xr amd 8 ,
.Xr apm 8 ,
.Xr atm 8 ,
.Xr cron 8 ,
.Xr dhclient 8 ,
.Xr gated 8 ,
.Xr ifconfig 8 ,
.Xr inetd 8 ,
.Xr lpd 8 ,
.Xr moused 8 ,
.Xr mrouted 8 ,
.Xr named 8 ,
.Xr nfsd 8 ,
.Xr nfsiod 8 ,
.Xr ntpdate 8 ,
.Xr pcnfsd 8 ,
.Xr portmap 8 ,
.Xr quotacheck 8 ,
.Xr rc 8 ,
.Xr rndcontrol 8 ,
.Xr route 8 ,
.Xr routed 8 ,
.Xr rpc.lockd 8 ,
.Xr rpc.statd 8 ,
.Xr rwhod 8 ,
.Xr savecore 8 ,
.Xr sendmail 8 ,
.Xr sshd 8 ,
.Xr sysctl 8 ,
.Xr syslogd 8 ,
.Xr swapon 8 ,
.Xr tickadj 8 ,
.Xr timed 8 ,
.Xr vinum 8 ,
.Xr vnconfig 8 ,
.Xr xntpd 8 ,
.Xr xtend 8 ,
.Xr ypbind 8 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh 歴史
.Nm
ファイルは
.Fx 2.2.2
で登場しました。
.Sh 作者
.An Jordan K. Hubbard .
