freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rc.conf.5
.\" Copyright (c) 1995
.\"	Jordan K. Hubbard
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/rc.conf.5,v 1.221.2.4 2004/10/16 08:13:19 pjd Exp %
.\"
.\" $FreeBSD$
.\"
.Dd September 29, 2004
.Dt RC.CONF 5
.Os
.Sh 名称
.Nm rc.conf
.Nd システム設定情報
.Sh 解説
.Nm
ファイルは、ローカルホスト名、存在しないものも含め任意の
ネットワークインタフェースに関する設定の詳細、
どのサービスをシステムの初期起動時に立ち上げるべきかを
記述する情報を含んでいます。
一般に
.Nm
ファイルは、新規にインストールする際に、
システムインストールユーティリティ
.Xr sysinstall 8
によって初期化されます。
.Pp
.Nm
の目的は、
直接コマンドを実行したりシステム起動操作を行うことではなく、
.Pa /etc
の中のさまざまな汎用起動スクリプトによりインクルードされ、
.Nm
の中の設定に基づき、それらの起動スクリプト内部の動作を条件分岐させる
ことにあります。
.Pp
.Pa /etc/rc.conf
ファイルは、
使用可能なオプション全てのデフォルト設定を指定するファイル
.Pa /etc/defaults/rc.conf
からインクルードされます。
オプションを
.Pa /etc/rc.conf
に指定する必要があるのは、
システム管理者がこれらのデフォルトを上書きしたい場合だけです。
ファイル
.Pa /etc/rc.conf.local
は、
.Pa /etc/rc.conf
の設定を上書きするために使用されます。
これは歴史的事情のためです。
後述の
.Va rc_conf_files
を参照してください。
.Pp
次に示すリストは、
.Nm
ファイル中で設定可能な各変数について、
その名前と簡単な解説をしたものです。
.Bl -tag -width indent-two
.It Va rc_debug
.Pq Vt ブール値
.Dq Li YES
にすると、rc スクリプトからのデバッグメッセージ出力を有効にします。
新規スクリプトの編集時や組み込み時に誤りを診断するために、
この変数が有用かもしれません。
この手続きは大量の出力を端末と
.Xr syslog 3
に生成しますので、注意してください。
.It Va rc_info
.Pq Vt ブール値
.Dq Li NO
にすると、rc スクリプトからの情報メッセージを無効にします。
情報メッセージは、警告やエラーとするほど深刻ではない状態のときに表示されます。
.It Va swapfile
.Pq Vt 文字列
.Dq Li NO
にすると
スワップファイルはインストールされません。
.Dq Li NO
以外の場合、その値は追加スワップ領域に利用するファイルの
フルパス名として用いられます。
.It Va apm_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると
.Xr apm 8
コマンドでの自動電源管理 (Automatic Power Management) のサポートを有効に
します。
.It Va apmd_enable
.Pq Vt ブール値
.Xr apmd 8
を実行し、ユーザランドから APM イベントを扱います。
APM サポートも有効にします。
.It Va apmd_flags
.Pq Vt 文字列
.Va apmd_enable
が
.Dq Li YES
の場合、これらは
.Xr apmd 8
デーモンに渡すフラグになります。
.It Va devd_enable
.Pq Vt ブール値
.Xr devd 8
を実行し、カーネルからのデバイス追加、デバイス削除、未知のイベントを扱います。
.It Va kldxref_enable
.Pq Vt ブール値
デフォルトで
.Dq Li NO
です。
.Dq Li YES
に設定すると、ブート時に、
.Pa linker.hints
ファイルを
.Xr kldxref 8
で自動的に再構築します。
.It Va kldxref_clobber
.Pq Vt ブール値
デフォルトで
.Dq Li NO
です。
.Va kldxref_enable
が真の場合、これを
.Dq Li YES
にすると、ブート時に既存の
.Pa linker.hints
ファイルを上書きします。
そうでない場合、
.Pa linker.hints
ファイルが存在しない場合のみ生成されます。
.It Va kldxref_module_path
.Pq Vt 文字列
デフォルトで空です。
.Xr kld 4
モジュールを含むパスからなる、セミコロン
.Pq Ql \&;
で区切られたリストです。
空の場合、
.Va kern.module_path
.Xr sysctl 8
の内容が使用されます。
.It Va pccard_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時に PCCARD のサポートを有効にします。
.It Va pccard_mem
.Pq Vt 文字列
PCCARD コントローラメモリアドレスを設定します。
.Dq Li DEFAULT
とするとデフォルト値になります。
.It Va pccard_ifconfig
.Pq Vt 文字列
ブート時またはカード挿入時に
.Xr ifconfig 8
に渡される引数のリストです
(例えば、
固定アドレスの場合は
.Dq Cm inet Li 192.168.1.1 Cm netmask Li 255.255.255.0
などですし、
DHCP クライアントの場合は
.Dq Li DHCP
です)。
.It Va pccard_beep
.Pq Vt 整数
0 である場合、PCCARD コントローラを静寂モードにします。
1 である場合、ビープモードにします。
2 である場合、メロディモードにします。
.It Va pccard_conf
.Pq Vt 文字列
.Xr pccardd 8
デーモンの設定ファイルのパスです
(例えば
.Pa /etc/pccard.conf.sample
です)。
.It Va pccardd_flags
.Pq Vt 文字列
.Va pccard_enable
が
.Dq Li YES
の場合、これらは
.Xr pccardd 8
デーモンに渡すフラグになります。
.It Va pccard_ether_delay
.Pq Vt 文字列
.Pa /etc/pccard_ether
スクリプト中で
.Xr dhclient 8
を起動するまでの遅延時間を設定します。
デフォルトは 5 秒です。
これは、
.Xr ed 4
ベースの新しいカードを使用した時にシステムがハングしてしまうという
.Xr ed 4
ドライバのバグを回避するためのものです。
.It Va removable_interfaces
.Pq Vt 文字列
.Pa /etc/pccard_ether
でサポートすべき、取り外し可能なネットワークインタフェースのリストです。
.It Va tmpmfs
.Pa /tmp
メモリファイルシステムの生成を制御します。
.Dq Li YES
を設定した場合、常時生成されます。
.Dq Li NO
を設定した場合、決して生成されません。
これら以外の値を設定した場合、
.Pa /tmp
が書き込み可能でない場合に、メモリファイルシステムが生成されます。
.It Va tmpsize
生成された
.Pa /tmp
メモリファイルシステムの大きさを制御します。
.It Va varmfs
.Pa /var
メモリファイルシステムの生成を制御します。
.Dq Li YES
を設定した場合、常時生成されます。
.Dq Li NO
を設定した場合、決して設定されません。
これら以外の値を設定した場合、
.Pa /var
が書き込み可能でない場合に、メモリファイルシステムが生成されます。
.It Va varsize
.Pa /var
メモリファイルシステムの大きさを制御します。
.It Va populate_var
.Pa /var
ファイルシステムへの自動ファイル埋め込み
.Pq automatic population
を制御します。
.Dq Li YES
を設定した場合、常時ファイル埋め込みが行われます。
.Dq Li NO
を設定した場合、決して埋め込みは行われません。
これら以外の値を設定した場合、
.Pa /tmp
が書き込み可能でない場合に、メモリファイルシステムが生成されます。
この過程では、
通常のシステムで
.Pa /usr
がマウントされる前に、
.Pa /usr
にあるコマンドのうちいくつかへのアクセスが必要です。
.It Va local_startup
.Pq Vt 文字列
起動スクリプトファイルを検索するディレクトリのリストです。
.It Va script_name_sep
.Pq Vt 文字列
起動スクリプトファイルのリストを各々のファイル名に分割するために
使用するフィールドセパレータです。
デフォルトは空白です。
名前に空白を含む起動スクリプトを持っていない限り、変更不要です。
.It Va hostname
.Pq Vt 文字列
ネットワーク上でのホストの完全な形のドメイン名 (FQDN; The
Fully Qualified Domain Name) です。
ネットワークに接続されていない場合でも、
この変数は確実に何か意味のあるものに設定すべきです。
ホスト名を DHCP を介して設定するために
.Xr dhclient 8
を使用している場合、この変数は空文字列に設定すべきです。
.It Va ipv6_enable
.Pq Vt ブール値
IPv6 ネットワークサポートを有効にします。
このためには、カーネルが
.Cd "options INET6"
付きでコンパイルされていることが必要です。
.It Va nisdomainname
.Pq Vt 文字列
ホストの NIS ドメイン名。
NIS を使用しないときは
.Dq Li NO
とします。
.It Va dhclient_program
.Pq Vt 文字列
DHCP クライアントプログラムのパスです
(ISC DHCP クライアントの
.Pa /sbin/dhclient
がデフォルトです)。
.It Va dhclient_flags
.Pq Vt 文字列
DHCP クライアントプログラムに渡す追加のフラグです。
ISC DHCP クライアント用に利用可能なコマンドラインオプションについては、
.Xr dhclient 8
マニュアルページを参照してください。
.It Va background_dhclient
.Pq Vt ブール値
.Dq Li YES
に設定すると、DHCP クライアントをバックグラウンドで起動します。
ネットワークが動作していることに依存するアプリケーションで問題と
なるかもしれませんが、多くの場合は起動が早くなります。
.It Va firewall_enable
.Pq Vt ブール値
ファイアウォール規則を起動時にロードするには、
.Dq Li YES
に設定します。
カーネルが
.Cd "options IPFIREWALL"
付きで作られなかった場合、
.Pa ipfw.ko
カーネルモジュールがロードされます。
.Va ipfilter_enable
も参照してください。
.It Va ipv6_firewall_enable
.Pq Vt ブール値
IPv6 の
.Va firewall_enable
です。
IPv6 ファイアウォール規則を起動時にロードするには、
.Dq Li YES
に設定します。
カーネルが
.Cd "options IPV6FIREWALL"
付きで作られなかった場合、
.Pa ip6fw.ko
カーネルモジュールがロードされます。
.It Va firewall_script
.Pq Vt 文字列
この変数は、実行するファイアウォールスクリプトのフルパスを指定します。
デフォルトは
.Pa /etc/rc.firewall
です。
.It Va ipv6_firewall_script
.Pq Vt 文字列
IPv6 の
.Va firewall_script
です。
.It Va firewall_type
.Pq Vt 文字列
.Pa /etc/rc.firewall
中にある選択肢から選んだファイアウォールタイプもしくは
ローカルファイアウォール規則の組を含むファイル名をつけます。
.Pa /etc/rc.firewall
において有効なタイプは以下のものです。
.Pp
.Bl -tag -width ".Li simple" -compact
.It Li open
無制限の IP アクセス;
.It Li closed
.Dq Li lo0
経由を除く全ての IP サービスを禁止
.It Li client
ワークステーション向けの基本的な保護
.It Li simple
LAN 向けの基本的な保護
.El
.Pp
ファイル名が指定される場合にはフルパス名でなければなりません。
.It Va ipv6_firewall_type
.Pq Vt 文字列
IPv6 の
.Va firewall_type
です。
.It Va firewall_quiet
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時にコンソール上でファイアウォール規則の表示を行いません。
.It Va ipv6_firewall_quiet
.Pq Vt ブール値
IPv6 の
.Va firewall_quiet
です。
.It Va firewall_logging
.Pq Vt ブール値
.Dq Li YES
に設定すると、ファイアウォールのイベントロギングを有効にします。
.Dv IPFIREWALL_VERBOSE
カーネルオプションと等価です。
.It Va ipv6_firewall_logging
.Pq Vt ブール値
IPv6 の
.Va firewall_logging
です。
.It Va firewall_flags
.Pq Vt 文字列
.Va firewall_type
でファイル名を指定する場合、
.Xr ipfw 8
に渡されるフラグです。
.It Va ipv6_firewall_flags
.Pq Vt 文字列
IPv6 の
.Va firewall_flags
です。
.It Va natd_program
.Pq Vt 文字列
.Xr natd 8
のパス。
.It Va natd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr natd 8
を有効にします。
.Va firewall_enable
もまた
.Dq Li YES
に設定しておく必要があります。
また、
.Xr divert 4
ソケットがカーネルで有効にされている必要があります。
.It Va natd_interface
.Pq Vt 文字列
.Xr natd 8
が実行されるパブリックインタフェースの名前です。
インタフェースの指定は、インタフェース名でも IP アドレスでもかまいません。
.It Va natd_flags
.Pq Vt 文字列
追加の
.Xr natd 8
フラグはここに記述する必要があります。
.Fl n
または
.Fl a
のフラグは上記
.Va natd_interface
とともに自動的に引数として追加されます。
.\" ----- ipfilter_enable setting --------------------------------
.It Va ipfilter_enable
.Pq Vt ブール値
デフォルトは
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、
.Xr ipf 8
パケットフィルタリングを有効にします。
.Pp
典型的な用途では、
.Bd -literal
ipfilter_enable="YES"
ipnat_enable="YES"
ipmon_enable="YES"
ipfs_enable="YES"
.Ed
.Pp
を
.Pa /etc/rc.conf
に記述し、
.Pa /etc/ipf.rules
と
.Pa /etc/ipnat.rules
を適切に編集する必要があるでしょう。
.Pp
.Va ipfilter_enable
と
.Va ipnat_enable
とは別々に有効にできることに注意してください。
.Va ipmon_enable
および
.Va ipfs_enable
を有効にするには
.Va ipfilter_enable
と
.Va ipnat_enable
の少なくともどちらか 1 つが有効になっている必要があります。
.Pp
カーネル設定ファイル中に
.Bd -literal
options IPFILTER
options IPFILTER_LOG
options IPFILTER_DEFAULT_BLOCK
.Ed
.Pp
を置くことも良い考えです。
.\" ----- ipfilter_program setting ------------------------------
.It Va ipfilter_program
.Pq Vt 文字列
.Xr ipf 8
へのパスです (デフォルトは
.Pa /sbin/ipf
です)。
.\" ----- ipfilter_rules setting --------------------------------
.It Va ipfilter_rules
.Pq Vt 文字列
デフォルトで
.Pa /etc/ipf.rules
に設定されます。
この変数は、フィルタルール定義ファイルの名前を含みます。
このファイルは、
.Xr ipf 8
コマンドが実行できるよう、読み取り可能であることが期待されます。
.\" ----- ipv6_ipfilter_rules setting ---------------------------
.It Va ipv6_ipfilter_rules
.Pq Vt 文字列
デフォルトは
.Pa /etc/ipf6.rules
に設定されます。
この変数には、IPv6 フィルタルール定義ファイルの名前を含みます。
このファイルは、
.Xr ipf 8
コマンドが実行できるよう、読み取り可能であることが期待されます。
.\" ----- ipfilter_flags setting --------------------------------
.It Va ipfilter_flags
.Pq Vt 文字列
デフォルトは空文字列です。
この変数には、
.Xr ipf 8
プログラムに渡されるフラグが含まれます。
.\" ----- ipnat_enable setting ----------------------------------
.It Va ipnat_enable
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、
.Xr ipnat 1
ネットワークアドレス変換を有効にします。
詳細は
.Va ipfilter_enable
を参照してください。
.\" ----- ipnat_program setting ---------------------------------
.It Va ipnat_program
.Pq Vt 文字列
.Xr ipnat 1
へのパスです (デフォルトは
.Pa /sbin/ipnat
です)。
.\" ----- ipnat_rules setting -----------------------------------
.It Va ipnat_rules
.Pq Vt 文字列
デフォルトで
.Pa /etc/ipnat.rules
に設定されます。
この変数は、ネットワークアドレス変換を定義するファイルの名前を含みます。
このファイルは、
.Xr ipnat 1
コマンドが実行できるよう、読み取り可能であることが期待されます。
.\" ----- ipnat_flags setting -----------------------------------
.It Va ipnat_flags
.Pq Vt 文字列
デフォルトは空文字列です。
この変数には、
.Xr ipnat 1
プログラムへ渡されるフラグが含まれます。
.\" ----- ipmon_enable setting ----------------------------------
.It Va ipmon_enable
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、
.Xr ipmon 8
モニタリング (
.Xr ipf 8
と
.Xr ipnat 1
のイベントのログ) を有効にします。
この変数を設定する場合、
.Va ipfilter_enable
あるいは
.Va ipnat_enable
も設定することが必要です。
詳細は
.Va ipfilter_enable
を参照してください。
.\" ----- ipmon_program setting ---------------------------------
.It Va ipmon_program
.Pq Vt 文字列
.Xr ipmon 8
へのパスです (デフォルトは
.Pa /sbin/ipmon
です)。
.\" ----- ipmon_flags setting -----------------------------------
.It Va ipmon_flags
.Pq Vt 文字列
デフォルトで
.Dq Li -Ds
に設定されます。
この変数は、
.Xr ipmon 8
プログラムに渡されるフラグを含みます。
他の典型的な例は
.Dq Fl D Pa /var/log/ipflog
であり、これは
.Xr ipmon 8
に
.Xr syslogd 8
をバイパスさせて、直接ファイルにログを書かせます。
このような場合、必ず
.Pa /etc/newsyslog.conf
を次のような感じで修正してください:
.Bd -literal
/var/log/ipflog  640  10  100  *  Z  /var/run/ipmon.pid
.Ed
.\" ----- ipfs_enable setting -----------------------------------
.It Va ipfs_enable
.Pq Vt ブール値
デフォルトでは
.Dq Li NO
に設定されます。
この変数を
.Dq Li YES
に設定すると
.Xr ipfs 8
が有効になり、シャットダウン時にフィルタおよび NAT 状態テーブルを
保存し、再起動時に読み込み直されるようになります。
この変数を設定するには
.Va ipfilter_enable
あるいは
.Va ipnat_enable
も
.Dq Li YES
に設定する必要があります。
詳細は
.Va ipfilter_enable
を参照してください。
.Va kern_securelevel
を 3 に設定した場合、
.Va ipfs_enable
は使用できなくなることに注意してください。
なぜなら、セキュアレベルを引き上げることでシャットダウン時に
.Xr ipfs 8
が状態テーブルを保存できなくなるからです。
.\" ----- ipfs_program setting ----------------------------------
.It Va ipfs_program
.Pq Vt 文字列
.Xr ipfs 8
へのパスです (デフォルトは
.Pa /sbin/ipfs
です)。
.\" ----- ipfs_flags setting ------------------------------------
.It Va ipfs_flags
.Pq Vt 文字列
デフォルトは空文字列です。
この変数には、
.Xr ipfs 8
プログラムに渡されるフラグが含まれます。
.\" ----- end of added ipf hook ---------------------------------
.It Va pf_enable
.Pq Vt ブール値
デフォルトでは
.Dq Li NO
です。
この変数を
.Dq Li YES
と設定すると、
.Xr pf 4
パケットフィルタ機能が有効になります。
.Pp
通常、
.Pp
.Dl pf_enable="YES"
.Pp
を
.Pa /etc/rc.conf
に置くだけでなく、
.Pa /etc/pf.conf
を適切に編集することも必要になります。
.Pp
.Dl "device pf"
.Pp
により、
.Xr pf 4
パケットフィルタ機能がカーネルに組み込まれます。
設定しない場合、モジュールからロードされます。
.It Va pf_rules
.Pq Vt 文字列
.Xr pf 4
ルールセット設定ファイルのパスです
( デフォルトは
.Pa /etc/pf.conf
です)。
.It Va pf_program
.Pq Vt 文字列
.Xr pfctl 8
のパスです
( デフォルトは、
.Pa /sbin/pfctl
です )。
.It Va pf_flags
.Pq Vt 文字列
.Va pf_enable
に
.Dq Li YES
を設定した場合、
これらのフラグが
.Xr pfctl 8
プログラムがルールセットをロードするときに渡されます。
.It Va pflog_enable
.Pq Vt ブール値
デフォルトでは
.Dq Li NO
です。
.Dq Li YES
に設定すると、
.Xr pf 4
パケットフィルタからのパケットログを取る
.Xr pflogd 8
を有効にします。
.It Va pflog_logfile
.Pq Vt 文字列
.Va pflog_enable
を
.Dq Li YES
に設定した場合、この変数は
.Xr pflogd 8
がどこにログファイルを格納するかを制御します
(デフォルトでは
.Pa /var/log/pflog
です)。
ログファイルのローテーション調整については、
.Pa /etc/newsyslog.conf
を確認して下さい。
.It Va pflog_program
.Pq Vt 文字列
.Xr pflogd 8
プログラムのパスです
( デフォルトは
.Pa /sbin/pflogd
です )。
.It Va pflog_flags
.Pq Vt 文字列
デフォルトは空です。
この変数は
.Xr pflogd 8
プログラムに渡す追加のオプションを含みます。
.It Va tcp_extensions
.Pq Vt ブール値
デフォルトでは
.Dq Li YES
です。
.Dq Li NO
に設定すると、
.\".Rs
.%T "RFC 1323"
.\".Re
.\" .Rs/.Re でくくると、RFC 1323 の後ろに "." がついてしまうので、
.\" はずしました。(by metal)
で述べられている
ある TCP オプションを無効にします。
.Dq Li NO
に設定すると、ネットワークコネクションが不規則にハングアップしたり
する不具合や、
それに類する他の不具合を回避する助けとなるかもしれません。
ネットワークデバイスによっては、これらのオプションに関して
うまく動作しないものがあることが知られています。
.It Va log_in_vain
.Pq Vt 整数
デフォルトで 0 に設定されています。
.Xr sysctl 8
変数
.Va net.inet.tcp.log_in_vain
と
.Va net.inet.udp.log_in_vain
が、
.Xr tcp 4
と
.Xr udp 4
に記述されているように、指定された値に設定されます。
.It Va tcp_keepalive
.Pq Vt ブール値
デフォルトで
.Dq Li YES
に設定されています。
通信相手がまだ立ち上がっていて到達可能であることを確認するために、
アイドル状態の TCP 接続を叩く機能ですが、
.Dq Li NO
に設定すると、この機能を無効にします。
.It Va tcp_drop_synfin
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されています。
.Dq Li YES
に設定すると、
TCP フレームで SYN と FIN のフラグが共に設定されているものを、
カーネルが無視するようになります。
これにより、OS の正体をばらす指紋を残すことを防ぎますが、
正当なアプリケーションが動作しなくなるかもしれません。
.Dv TCP_DROP_SYNFIN
オプション付きでカーネルを構築した場合のみ、
本オプションが使用可能です。
.It Va icmp_drop_redirect
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されています。
.Dq Li YES
に設定すると、
ICMP REDIRECT パケットをカーネルが無視するようになります。
更なる情報は
.Xr icmp 4
を参照してください。
.It Va icmp_log_redirect
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されています。
.Dq Li YES
に設定すると、
ICMP REDIRECT パケットをカーネルが記録するようになります。
ログメッセージの速度制限はありませんので、
ネットワークに生じた問題の解決にのみ使用すべきです。
更なる情報は
.Xr icmp 4
を参照してください。
.It Va icmp_bmcastecho
.Pq Vt ブール値
.Dq Li YES
に設定すると、
ブロードキャストまたはマルチキャストの ICMP ping パケットに
応答するようになります。
更なる情報は
.Xr icmp 4
を参照してください。
.It Va ip_portrange_first
.Pq Vt 整数
.Dq Li NO
以外に設定すると、デフォルトのポート範囲の最初のポートになります。
更なる情報は
.Xr ip 4
を参照してください。
.It Va ip_portrange_last
.Pq Vt 整数
.Dq Li NO
以外に設定すると、デフォルトのポート範囲の最後のポートになります。
更なる情報は
.Xr ip 4
を参照してください。
.It Va network_interfaces
.Pq Vt 文字列
このホスト上で設定するネットワークインタフェースのリストを
設定します。
たとえば、ループバックデバイス
.Pq Li lo0
および
.Xr ed 4
ドライバの NIC があるなら、
.Dq Li "lo0 ed0"
に設定されるでしょう。
.Ar interface
の各値に対して
.Va ifconfig_ Ns Aq Ar interface
という変数も存在すると仮定されます。
1 つのインタフェースに複数の IP アドレスを登録したい場合は、
ここに IP エイリアスのエントリを追加することも可能です。
対象とするインタフェースが
.Li ed0
であると仮定すると、
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_ed0_alias1="inet 127.0.0.254 netmask 0xffffffff"
.Ed
.Pp
というようになります。
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
エントリが 1 つ見つかるごとに、
その内容が
.Xr ifconfig 8
に渡されます。
最初にアクセスに失敗した時点で実行は中止されるので
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.251 netmask 0xffffffff"
ifconfig_ed0_alias1="inet 127.0.0.252 netmask 0xffffffff"
ifconfig_ed0_alias2="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_ed0_alias4="inet 127.0.0.254 netmask 0xffffffff"
.Ed
.Pp
のようにすると、alias4 は追加され
.Em ない
ことに注意してください。
これは
alias3 エントリが存在しないことにより、
そこで検索が中止されるからです。
.Pp
.Pa /etc/start_if. Ns Aq Ar interface
ファイルが存在する場合、
.Va ifconfig_ Ns Aq Ar interface
および
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
の変数で指定されたインタフェース設定が実行される前に、
このファイルが
.Xr sh 1
インタプリタにより実行されます。
.Pp
.Va ifconfig_ Ns Aq Ar interface
変数を
.Dq Li DHCP
に設定することで、インタフェースを DHCP で立ち上げることが
可能です。
例えば
.Li ed0
デバイスを DHCP で初期化するには、
次のような行を指定すればよいです:
.Bd -literal
ifconfig_ed0="DHCP"
.Ed
.It Va ipv6_network_interfaces
.Pq Vt 文字列
IPv6 の
.Va network_interfaces
です。
設定すべき ifconfig 変数は
.Va ifconfig_ Ns Aq Ar interface
ではなく、
.Va ipv6_ifconfig_ Ns Aq Ar interface
です。
エイリアスは
.Va ipv6_ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
のように設定します。
.Va ipv6_prefix_ Ns Aq Ar interface
も関係あります。
.Va ipv6_ifconfig_ Ns Aq Ar interface
設定を持たないインタフェースは、
.Va ipv6_gateway_enable
が
.Dq Li NO
に設定されている場合には、
.Xr rtsol 8
で自動設定されます。
IPv6 ネットワークコードは
.Pa /etc/start_if. Ns Aq Ar interface
ファイルをサポートしないことに注意してください。
.It Va ipv6_default_interface
.Pq Vt 文字列
.Dq Li NO
以外に設定すると、
これがスコープ対象のアドレスに対するデフォルト出力インタフェースになります。
現在のところ、これは IPv6 リンクローカルマルチキャストアドレスに
対してのみ働きます。
.It Va cloned_interfaces
.Pq Vt 文字列
このホストに生成する、複製可能なネットワークインタフェースの
リストを設定します。
.Va cloned_interfaces
のエントリは、設定を行うため自動的に
.Va network_interfaces
に追加されます。
.It Va gif_interfaces
.Pq Vt 文字列
このホストで設定する、
.Xr gif 4
トンネルインタフェースのリストを設定します。
.Ar interface
の各値に対して、
.Va gifconfig_ Ns Aq Ar interface
変数が存在すると想定されます。
本変数の値を使用し、
.Xr ifconfig 8
の
.Cm tunnel
オプションの書式に従って、トンネルのリンク層を設定します。
さらに本オプションは、リストされたインタフェースの設定を試みる前に、
これらが
.Xr ifconfig 8
の
.Cm create
オプションで作成されていることを保証します。
.It Va sppp_interfaces
.Pq Vt 文字列
このホスト上で設定すべき
.Xr sppp 4
インタフェースのリストに設定します。
各
.Ar interface
に対して
.Va spppconfig_ Ns Aq Ar interface
変数が存在するものと仮定されます。
各インタフェースは、普通の
.Va ifconfig_ Ns Aq Ar interface
設定でも設定されます。
使用可能なオプションについての更なる情報は
.Xr spppcontrol 8
を参照してください。
.It Va ppp_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr ppp 8
デーモンを実行します。
.It Va ppp_mode
.Pq Vt 文字列
.Xr ppp 8
デーモンを実行するモードです。
受け付けられるモードは
.Dq Li auto ,
.Dq Li ddial ,
.Dq Li direct ,
.Dq Li dedicated
のいずれかです。
完全な解説はマニュアルを参照してください。
.It Va ppp_nat
.Pq Vt ブール値
.Dq Li YES
に設定すると、ネットワークアドレス変換を有効にします。
.Va gateway_enable
と共に使用することにより、
本ホストをネットワークアドレス変換ルータとして使用して、
プライベートネットワークアドレスのホストからの
インターネットへのアクセスを可能にします。
.It Va ppp_profile
.Pq Vt 文字列
.Pa /etc/ppp/ppp.conf
から使用するプロファイル名です。
.It Va ppp_user
.Pq Vt 文字列
このユーザ名の元で
.Xr ppp 8
を起動します。
デフォルトでは
.Xr ppp 8
は
.Dq Li root
が起動します。
.It Va rc_conf_files
.Pq Vt 文字列
本オプションは、
.Pa /etc/defaults/rc.conf
の設定を上書きするファイルのリストを指定するために使用されます。
ファイルは指定された順序に読み込まれますし、
また、ファイルへの完全なパスを含む必要があります。
デフォルトでは、指定されるファイルは
.Pa /etc/rc.conf
と
.Pa /etc/rc.conf.local
です。
.It Va gbde_autoattach_all
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Pa /etc/rc.d/gbde
は
.Pa /etc/fstab
中の .bde デバイスを自動的に初期化しようとします。
.It Va gbde_devices
.Pq Vt 文字列
スクリプトがアタッチしようとするデバイスのリストもしくは
.Dq Li AUTO
です。
.It Va gbde_lockdir
.Pq Vt 文字列
.Xr gbde 4
のロックファイルが置かれるディレクトリです。
デフォルトのロックファイルディレクトリは
.Pa /etc
です。
.Pp
個々の
.Xr gbde 4
デバイスに対するロックファイルは、変数
.Va gbde_lock_ Ns Aq Ar device
を設定することで上書きすることができます。
ここで
.Ar device
は、暗号化デバイスから
.Dq Pa /dev/
と
.Dq Pa .bde
の部分を除いたものです。
.It Va gbde_attach_attempts
.Pq Vt 整数
.Xr gbde 4
デバイスへのアタッチを試みる回数です。
つまり、ユーザにパスフレーズを尋ねる回数です。
デフォルトは 3 です。
.It Va gbde_swap_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Pa /etc/fstab
にリストされたすべての .bde スワップデバイスを
ランダムな一回限りの鍵で初期化します。
カーネルダンプの復旧ができなくなることに注意してください。
.It Va fsck_y_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
ファイルシステムの初期調整に失敗した場合、
.Xr fsck 8
を
.Fl y
フラグ付きで実行します。
.It Va background_fsck
.Pq Vt ブール値
.Dq Li YES
に設定すると、可能ならば、システムは
.Xr fsck 8
をバックグラウンドで実行しようと試みます。
.It Va background_fsck_delay
.Pq Vt 整数
この秒数だけスリープした後で、バックグラウンド
.Xr fsck 8
を開始します。
デフォルトは 60 秒であり、X サーバ等の巨大なアプリケーションの起動が、
.Xr fsck 8
によるディスク I/O 占有の前となるようにします。
.It Va netfs_types
.Pq Vt 文字列
ネットワークベースのファイルシステムタイプを列挙します。
通常、エンドユーザが変更すべきものではありません。
代りに
.Va extra_netfs_types
を使用してください。
.It Va extra_netfs_types
.Pq Vt 文字列
.Dq Li NO
(デフォルト) 以外に設定すると、ネットワーク初期化まで遅延させて
.Xr rc 8
により起動時に自動マウントするファイルシステムタイプのリストを、
この変数により拡張します。
これは、空白区切りのネットワークファイルシステム記述子ペアのリストです。
それぞれのペアは、
.Xr mount 8
に渡されるファイルシステムタイプと、人が読める 1 語記述を、コロン
.Pq Ql \&:
で結合したものです。
デフォルトリストの拡張が必要なのは、
サードパーティのファイルシステムタイプを使用する場合だけです。
.It Va syslogd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr syslogd 8
デーモンを起動します。
.It Va syslogd_program
.Pq Vt 文字列
.Xr syslogd 8
へのパス
(デフォルトは
.Pa /usr/sbin/syslogd
です)。
.It Va syslogd_flags
.Pq Vt 文字列
.Va syslogd_enable
が
.Dq Li YES
の場合、これらは
.Xr syslogd 8
に渡すフラグになります。
.It Va inetd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr inetd 8
デーモンを起動します。
.It Va inetd_program
.Pq Vt 文字列
.Xr inetd 8
へのパス
(デフォルトは
.Pa /usr/sbin/inetd
です)。
.It Va inetd_flags
.Pq Vt 文字列
.Va inetd_enable
が
.Dq Li YES
の場合、これらは
.Xr inetd 8
へ渡すフラグとなります。
.It Va named_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr named 8
デーモンを起動します。
.It Va named_program
.Pq Vt 文字列
.Xr named 8
へのパス (デフォルトは
.Pa /usr/sbin/named
です)。
.It Va named_flags
.Pq Vt 文字列
.Va named_enable
が
.Dq Li YES
の場合、これらは
.Xr named 8
に渡すフラグとなります。
.It Va named_pidfile
.Pq Vt 文字列
これは、
.Xr named 8
デーモンの PID ファイルへのデフォルトパスです。
.Xr named.conf 5
で場所を変えた場合、これも変えてください。
.It Va named_chrootdir
.Pq Vt 文字列
.Xr chroot 8
環境で実行するネームサーバのルートディレクトリです
(デフォルトは
.Pa /var/named)。
空のままにすると、
.Xr named 8
は
.Xr chroot 8
環境では実行しません。
.It Va named_chroot_autoupdate
.Pq Vt ブール値
.Dq Li NO
に設定すると、
.Xr chroot 8
環境の自動更新を無効にします。
.It Va named_symlink_enable
.Pq Vt ブール値
.Dq Li NO
に設定すると、デーモンの PID ファイルの
.Xr chroot 8
環境へのシンボリックリンクを無効化します。
.It Va kerberos5_server_enable
.Pq Vt ブール値
ブート時に Kerberos 5 認証デーモンを起動したい場合は
.Dq Li YES
とします。
.It Va kerberos5_server
.Pq Vt 文字列
.Va kerberos5_server_enable
が
.Dq Li YES
の場合、これが Kerberos 5 認証サーバのパスになります。
.It Va kadmind5_server_enable
.Pq Vt ブール値
.Xr kadmind 8
すなわち Kerberos 5 管理デーモンを起動したい場合は
.Dq Li YES
とします。
スレーブサーバでは
.Dq Li NO
に設定します。
.It Va kadmind5_server
.Pq Vt 文字列
.Va kadmind5_server_enable
が
.Dq Li YES
の場合、これが Kerberos 5 管理デーモンのパスになります。
.It Va kpasswdd_server_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、Kerberos 5 パスワード変更デーモン
.Xr kpasswdd 8
を実行します。
スレーブサーバでは、
.Dq Li NO
を設定します。
.It Va kpasswdd_server
.Pq Vt 文字列
.Va kpasswdd_server_enable
が
.Dq Li YES
の場合、これが Kerberos 5 パスワード変更デーモンのパスになります。
.It Va rwhod_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr rwhod 8
デーモンを起動します。
.It Va rwhod_flags
.Pq Vt 文字列
.Va rwhod_enable
が
.Dq Li YES
に設定されている場合、これらは rwhod に渡すフラグになります。
.It Va amd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr amd 8
デーモンを起動します。
.It Va amd_flags
.Pq Vt 文字列
.Va amd_enable
が
.Dq Li YES
に設定されている場合、これらは amd に渡すフラグとなります。
詳しくは
.Xr amd 8
マニュアルページを利用してください。
.It Va amd_map_program
.Pq Vt 文字列
設定されている場合、
指定されたプログラムは、
.Xr amd 8
マップのリストを取得するために実行されることになります。
例えば、
.Xr amd 8
マップが NIS に格納されている場合、
この変数の値を設定して、
.Pa amd.master
NIS マップから
.Xr amd 8
マップのリストを取得するために
.Xr ypcat 1
を実行させるようにできます。
.It Va update_motd
.Pq Vt ブール値
.Dq Li YES
に設定すると、実行されているカーネルリリースを反映するように、
ブート時に
.Pa /etc/motd
を更新します。
.Dq Li NO
に設定すると、
.Pa /etc/motd
は更新を行いません。
.It Va nfs_client_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に NFS クライアントデーモンを起動します。
.It Va nfs_access_cache
.Pq Vt 整数
.Va nfs_client_enable
が
.Dq Li YES
の場合、この変数に
.Dq Li 0
を設定して
NFS ACCESS
RPC キャッシングを無効化することができますし、
NFS ACCESS 結果がキャッシュされる秒数を指定することもできます。
2-10 秒の値を設定すると、
多くの NFS 操作に対するネットワークトラフィックを十分減らします。
.It Va nfs_server_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に NFS サーバデーモンを起動します。
.It Va nfs_server_flags
.Pq Vt 文字列
.Va nfs_server_enable
が
.Dq Li YES
の場合、これらは
.Xr nfsd 8
デーモンに渡すフラグとなります。
.It Va mountd_enable
.Pq Vt ブール値
.Dq Li YES
に設定し
.Va nfs_server_enable
を設定しないと、
.Xr mountd 8
は起動しますが
.Xr nfsd 8
デーモンは起動しません。
実際に NFS は使用せずに CFS を使用する場合に、一般的に必要となります。
.It Va mountd_flags
.Pq Vt 文字列
.Va mountd_enable
が
.Dq Li YES
の場合、これらは
.Xr mountd 8
デーモンへのフラグとなります。
.It Va weak_mountd_authentication
.Pq Vt ブール値
.Dq Li YES
に設定すると、PCNFSD のようなサービスに対し、
権限付けられていないマウント要求を許すようになります。
.It Va nfs_reserved_port_only
.Pq Vt ブール値
.Dq Li YES
に設定すると、安全なポート上でのみ NFS サービスを提供します。
.It Va nfs_bufpackets
.Pq Vt 整数
数値を設定すると、その数のパケットに相当するソケットバッファ空間が、
NFS クライアント上に予約されます。
カーネルのデフォルトは、通常は 4 です。
ギガビットネットワークの場合、これより大きな値を設定した方が
性能が向上するかもしれません。
最小値は 2 であり、最大値は 64 です。
.It Va rpc_lockd_enable
.Pq Vt ブール値
この変数が
.Dq Li YES
に設定され、しかも NFS サーバである場合、ブート時に
.Xr rpc.lockd 8
を起動します。
.It Va rpc_statd_enable
.Pq Vt ブール値
この変数が
.Dq Li YES
に設定され、しかも NFS サーバである場合、ブート時に
.Xr rpc.statd 8
を起動します。
.It Va rpcbind_program
.Pq Vt 文字列
.Xr rpcbind 8
へのパス (デフォルトは
.Pa /usr/sbin/rpcbind
です)。
.It Va rpcbind_enable
.Pq Vt ブール値
.Dq Li YES
の場合、ブート時に
.Xr rpcbind 8
サービスを起動します。
.It Va rpcbind_flags
.Pq Vt 文字列
.Va rpcbind_enable
が
.Dq Li YES
の場合、これらは
.Xr rpcbind 8
デーモンに渡すフラグとなります。
.It Va keyserv_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、Secure RPC 実行のために、起動時に
.Xr keyserv 8
デーモンを実行します。
.It Va keyserv_flags
.Pq Vt 文字列
.Va keyserv_enable
が
.Dq Li YES
の場合、これらは
.Xr keyserv 8
デーモンに渡すフラグになります。
.It Va pppoed_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr pppoed 8
デーモンを起動し、PPP over Ethernet サービスを提供します。
.It Va pppoed_ Ns Ar provider
.Pq Vt 文字列
.Xr pppoed 8
はこの
.Ar provider
に対する要求を待ち受け、最終的にはこの名前を
.Ar system
引数として
.Xr ppp 8
を実行します。
.It Va pppoed_flags
.Pq Vt 文字列
.Xr pppoed 8
へ渡す追加のフラグ。
.It Va pppoed_interface
.Pq Vt 文字列
.Xr pppoed 8
が実行されるネットワークインタフェース。
.Va pppoed_enable
が
.Dq Li YES
に設定された場合、必須です。
.It Va timed_enable
.Pq Vt ブール値
.Dq Li YES
なら、ブート時に
.Xr timed 8
サービスを実行します。
このコマンドは、全ホストについて一貫した
.Dq "ネットワーク時間"
が確立されなければならないマシンネットワークのためにあります。
これが有用である典型例は、
ファイルのタイムスタンプがネットワーク全体で一貫性をもつことが
期待されるような、大規模 NFS 環境です。
.It Va timed_flags
.Pq Vt 文字列
.Va timed_enable
が
.Dq Li YES
の場合、これらは
.Xr timed 8
サービスに渡すフラグとなります。
.It Va ntpdate_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムスタートアップ時に
.Xr ntpdate 8
を実行します。
このコマンドは、ある標準的な参照先を元に、ただ
.Em 1 回
だけシステム時刻を同期させるためにあります。
また、システムを最初にインストールする際、
この値を (知られているサービスのリストから) 初期設定するオプションが
.Xr sysinstall 8
プログラムによって提供されます。
.It Va ntpdate_hosts
.Pq Vt 文字列
起動時に同期を取る NTP サーバを空白で区切って並べたリスト。
デフォルトでは、ファイル
.Pa /etc/ntp.conf
が存在する時に、このファイルの中のサーバのリストを使用します。
.It Va ntpdate_program
.Pq Vt 文字列
.Xr ntpdate 8
へのパス
(デフォルトは
.Pa /usr/sbin/ntpdate
です)。
.It Va ntpdate_flags
.Pq Vt 文字列
.Va ntpdate_enable
が
.Dq Li YES
の場合、これらは
.Xr ntpdate 8
コマンドに渡すフラグとなります (通常はホスト名)。
.It Va ntpd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr ntpd 8
コマンドが起動されます。
.It Va ntpd_program
.Pq Vt 文字列
.Xr ntpd 8
へのパス
(デフォルトは
.Pa /usr/sbin/ntpd
です)。
.It Va ntpd_flags
.Pq Vt 文字列
.Va ntpd_enable
が
.Dq Li YES
の場合、これらは
.Xr ntpd 8
デーモンに渡すフラグとなります。
.It Va nis_client_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr ypbind 8
サービスを起動します。
.It Va nis_client_flags
.Pq Vt 文字列
.Va nis_client_enable
が
.Dq Li YES
の場合、これらは
.Xr ypbind 8
サービスに渡すフラグとなります。
.It Va nis_ypset_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr ypset 8
デーモンを起動します。
.It Va nis_ypset_flags
.Pq Vt 文字列
.Va nis_ypset_enable
が
.Dq Li YES
の場合、これらは
.Xr ypset 8
デーモンに渡すフラグとなります。
.It Va nis_server_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr ypserv 8
デーモンを起動します。
.It Va nis_server_flags
.Pq Vt 文字列
.Va nis_server_enable
が
.Dq Li YES
の場合、これらは
.Xr ypserv 8
デーモンに渡すフラグとなります。
.It Va nis_ypxfrd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr rpc.ypxfrd 8
デーモンを起動します。
.It Va nis_ypxfrd_flags
.Pq Vt 文字列
.Va nis_ypxfrd_enable
が
.Dq Li YES
の場合、これらは
.Xr rpc.ypxfrd 8
デーモンに渡すフラグとなります。
.It Va nis_yppasswdd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr rpc.yppasswdd 8
デーモンを起動します。
.It Va nis_yppasswdd_flags
.Pq Vt 文字列
.Va nis_yppasswdd_enable
が
.Dq Li YES
の場合、これらは
.Xr rpc.yppasswdd 8
デーモンに渡すフラグとなります。
.It Va rpc_ypupdated_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システム起動時に
.Nm rpc.ypupdated
デーモンを実行します。
.It Va defaultrouter
.Pq Vt 文字列
.Dq Li NO
が設定されていない場合、このホスト名または IP アドレスを持つ
デフォルトルートを
作成します (このルータ名もネームサーバに到達する必要がある
場合は IP アドレスを使用すること!)。
.It Va ipv6_defaultrouter
.Pq Vt 文字列
IPv6 の
.Va defaultrouter
です。
.It Va static_routes
.Pq Vt 文字列
システムブート時に追加すべきスタティックルートのリストを
設定します。
.Dq Li NO
以外を設定した場合、その値を空白で区切った要素
.Ar element
それぞれに対し変数
.Va route_ Ns Aq Ar element
が存在すると仮定され、後でこれらの内容が
.Dq Nm route Cm add
操作に渡されることになります。
例えば、
.Bd -literal
static_routes="mcast gif0local"
route_mcast="-net 224.0.0.0/4 -iface gif0"
route_gif0local="-host 169.254.1.1 -iface lo0"
.Ed
.It Va ipv6_static_routes
.Pq Vt 文字列
IPv6 の
.Va static_routes
です。
.Dq Li NO
以外に設定した場合、その値を空白で区切った要素
.Ar element
それぞれに対し変数
.Va ipv6_route_ Ns Aq Ar element
が存在すると仮定され、後でこれらの内容が
.Dq Nm route Cm add Fl inet6
操作に渡されることになります。
.It Va natm_static_routes
.Pq Vt 文字列
.Xr natmip 4
において
.Va static_routes
と等価なものです。
空でない場合、その値を空白で区切った要素
.Ar element
それぞれに対し変数
.Va route_ Ns Aq Ar element
が存在することが仮定され、後でこれらの内容が
.Dq Nm atmconfig Cm natm Cm add
操作に渡されることになります。
.It Va gateway_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、IP ルータとして動作するように、
例えば、インタフェース間でパケットをフォワードするように
ホストを設定します。
.It Va ipv6_gateway_enable
.Pq Vt ブール値
IPv6 の
.Va gateway_enable
です。
.It Va router_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Va router
および
.Va router_flags
の設定に基づいて、ある種のルーティングデーモンを実行します。
.It Va ipv6_router_enable
.Pq Vt ブール値
IPv6 の
.Va router_enable
です。
.Dq Li YES
に設定すると、
.Va ipv6_router
および
.Va ipv6_router_flags
の設定に基づいて、ある種のルーティングデーモンを実行します。
.It Va router
.Pq Vt 文字列
.Va router_enable
が
.Dq Li YES
に設定されると、これが使用するルーティングデーモン名になります。
.It Va ipv6_router
.Pq Vt 文字列
IPv6 の
.Va router
です。
.It Va router_flags
.Pq Vt 文字列
.Va router_enable
が
.Dq Li YES
に設定されると、これらがルーティングデーモンへ渡すフラグとなります。
.It Va ipv6_router_flags
.Pq Vt 文字列
IPv6 の
.Va router_flags
です。
.It Va mrouted_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr mrouted 8
デーモンを起動します。
.It Va mroute6d_enable
.Pq Vt ブール値
IPv6 の
.Va mrouted_enable
です。
.Dq Li YES
に設定すると、IPv6 マルチキャストルーティングデーモンを実行します。
IPv6 マルチキャストルーティングデーモンは
.Fx
ベースシステムに含まれていませんが、
.Xr pim6dd 8
を
.Fx
Ports Collection からインストールすることができます。
.It Va mrouted_flags
.Pq Vt 文字列
.Va mrouted_enable
が
.Dq Li YES
の場合、これらは
.Xr mrouted 8
へ渡すフラグとなります。
.It Va mroute6d_flags
.Pq Vt 文字列
IPv6 の
.Va mrouted_flags
です。
.Va mroute6d_enable
が
.Dq Li YES
の場合、
これらは IPv6 マルチキャストルーティングデーモンへ渡すフラグとなります。
.It Va mroute6d_program
.Pq Vt 文字列
.Va mroute6d_enable
が
.Dq Li YES
の場合、これが IPv6 マルチキャストルーティングデーモンのパスです。
.It Va rtadvd_enable
.Pq Vt ブール値
.Dq Li YES
の場合、起動時に
.Xr rtadvd 8
デーモンを実行します。
.Xr rtadvd 8
は
.Va ipv6_gateway_enable
にも
.Dq Li YES
が設定されている場合のみ実行します。
.Xr rtadvd 8
ユーティリティは、ルータ広告パケットを、
.Va rtadvd_interfaces
で指定したインタフェースへ送ります。
.Xr rtadvd 8
は非常に注意して設定すべきです。
.Xr rtadvd.conf 5
を細かく調整することになるかもしれません。
.It Va rtadvd_interfaces
.Pq Vt 文字列
.Va rtadvd_enable
が
.Dq Li YES
の場合、これが使用するインタフェースリストです。
.It Va ipxgateway_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、IPX トラフィックのルーティングを有効にします。
.It Va ipxrouted_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr IPXrouted 8
デーモンを起動します。
.It Va ipxrouted_flags
.Pq Vt 文字列
.Va ipxrouted_enable
が
.Dq Li YES
の場合、これらは
.Xr IPXrouted 8
デーモンへ渡すフラグとなります。
.It Va arpproxy_all
.Pq Vt ブール値
.Dq Li YES
に設定すると、グローバルプロキシ ARP を有効にします。
.It Va forward_sourceroute
.Pq Vt ブール値
これが
.Dq Li YES
に設定され、更に
.Va gateway_enable
もまた
.Dq Li YES
に設定されている場合、
送信元が経路指定したパケット (source routed packets) はフォワードされます。
.It Va accept_sourceroute
.Pq Vt ブール値
.Dq Li YES
に設定すると、
システムは自分宛の送信元経路指定パケットを受け付けます。
.It Va rarpd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr rarpd 8
デーモンを起動します。
.It Va rarpd_flags
.Pq Vt 文字列
.Va rarpd_enable
が
.Dq Li YES
の場合、これらは
.Xr rarpd 8
デーモンへ渡すフラグとなります。
.It Va bootparamd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr bootparamd 8
デーモンを起動します。
.It Va bootparamd_flags
.Pq Vt 文字列
.Va bootparamd_enable
が
.Dq Li YES
の場合、これらは
.Xr bootparamd 8
デーモンへ渡すフラグとなります。
.It Va stf_interface_ipv4addr
.Pq Vt 文字列
.Dq Li NO
以外に設定すると、これが 6to4 (IPv6 over IPv4 トンネリングインタフェース)
のローカル IPv4 アドレスです。
6to4 インタフェースを有効にするには、このエントリを指定してください。
.It Va stf_interface_ipv4plen
.Pq Vt 整数
6to4 IPv4 アドレスのプレフィックス長であり、対向アドレス範囲を限定します。
有効な値は 0-31 です。
.It Va stf_interface_ipv6_ifid
.Pq Vt 文字列
.Xr stf 4
の IPv6 インタフェース ID です。
.Dq Li AUTO
に設定可能です。
.It Va stf_interface_ipv6_slaid
.Pq Vt 文字列
.Xr stf 4
の IPv6 サイトレベルアグリゲータです。
.It Va ipv6_faith_prefix
.Pq Vt 文字列
.Dq Li NO
以外に設定すると、これが faith プレフィックスになり、
FAITH IPv6-to-IPv4 TCP 変換器を有効にします。
.Xr faithd 8
の設定も必要です。
.It Va ipv6_ipv4mapping
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Li ( ::ffff:a.b.c.d
のような)
IPv4 をマップした IPv6 アドレス通信を有効にします。
.It Va atm_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
システムブート時に ATM インタフェースの設定を有効にします。
次に説明する ATM 関連の変数に関し、
利用可能なコマンドパラメータの更なる詳細については、
.Xr atm 8
のマニュアルページを参照してください。
更なる詳細な設定情報に関しては、
.Pa /usr/share/examples/atm
中のファイルも参照してください。
.It Va atm_load
.Pq Vt 文字列
ロードすべき物理 ATM インタフェースドライバのリストです。
典型的な値は
.Dq Li hfa_pci
や
.Dq Li hea_pci
です。
.It Va atm_netif_ Ns Aq Ar intf
.Pq Vt 文字列
ATM 物理インタフェース
.Ar intf
に対し、本変数は、
生成すべき ATM ネットワークインタフェースの名前の
プレフィックスと数字を定義します。
値はコマンド
.Dq Nm atm Cm "set netif" Ar intf
のパラメータとして渡されます。
.It Va atm_sigmgr_ Ns Aq Ar intf
.Pq Vt 文字列
ATM 物理インタフェース
.Ar intf
に対し、本変数は使用すべき ATM シグナリングマネージャを定義します。
値はコマンド
.Dq Nm atm Cm attach Ar intf
のパラメータとして渡されます。
.It Va atm_prefix_ Ns Aq Ar intf
.Pq Vt 文字列
ATM 物理インタフェース
.Ar intf
に対し、本変数は、
UNI シグナリングマネージャを使用するインタフェースの
NSAP プレフィックスを定義します。
.Dq Li ILMI
に設定すると、プレフィックスは自動的に
.Xr ilmid 8
デーモンを介して設定されます。
そうでない場合、値はコマンド
.Dq Nm atm Cm "set prefix" Ar intf
のパラメータとして渡されます。
.It Va atm_macaddr_ Ns Aq Ar intf
.Pq Vt 文字列
ATM 物理インタフェース
.Ar intf
に対し、本変数は、
UNI シグナリングマネージャを使用するインタフェースの
MAC アドレスを定義します。
.Dq Li NO
に設定すると、ATM インタフェースカードに格納されている
ハードウェア MAC アドレスが使用されます。
そうでない場合、値はコマンド
.Dq Nm atm Cm "set mac" Ar intf
のパラメータとして渡されます。
.It Va atm_arpserver_ Ns Aq Ar netif
.Pq Vt 文字列
ATM 物理インタフェース
.Ar netif
に対し、本変数は、ATMARP サービスを提供するホストの ATM アドレスを定義します。
本変数は、UNI シグナリングマネージャを使用するインタフェースにおいてのみ
利用可能です。
.Dq Li local
に設定すると、本ホストが ATMARP サーバになります。
値はコマンド
.Dq Nm atm Cm "set arpserver" Ar netif
のパラメータとして渡されます。
.It Va atm_scsparp_ Ns Aq Ar netif
.Pq Vt ブール値
.Dq Li YES
に設定すると、ネットワークインタフェース
.Ar netif
に対する SCSP/ATMARP サービスが、
.Xr scspd 8
および
.Xr atmarpd 8
を使用して開始されます。
本変数は
.Va atm_arpserver_ Ns Aq Ar netif
が
.Dq Li local
に設定されている場合にのみ利用可能です。
.It Va atm_pvcs
.Pq Vt 文字列
システムブート時に追加したい ATM PVC のリストを設定します。
この値を空白で区切った要素
.Ar element
それぞれに対し、変数
.Va atm_pvc_ Ns Aq Ar element
が存在すると仮定されます。
これらの変数それぞれについて、その値がコマンド
.Dq Nm atm Cm "add pvc"
のパラメータとして渡されます。
.It Va atm_arps
.Pq Vt 文字列
システムブート時に追加したい、
永続的な ATM ARP エントリのリストを設定します。
この値の中で空白で区切られた
.Ar element
ごとに、変数
.Va atm_arp_ Ns Aq Ar element
が存在するものと仮定されます。
これらの変数の値がコマンド
.Dq Nm atm Cm "add arp"
のパラメータとして渡されます。
.It Va natm_interfaces
.Pq Vt 文字列
.Xr harp 4
を介して HARP でも使用される、
.Xr natm 4
インタフェースのリストに設定します。
このリストが空ではない場合、このリスト中のすべてのインタフェースが
.Xr ifconfig 8
で立ち上げられ、
.Xr harp 4
がロードされます。
これが動作するためには、
該当するインタフェースドライバがカーネルに組み込まれているか
ルートパーティションに存在することが必要です。
.It Va keybell
.Pq Vt 文字列
キーボードベル音。
デフォルト動作が必要な場合、
.Dq Li normal ,
.Dq Li visual ,
.Dq Li off ,
.Dq Li NO
のいずれかに設定します。
詳細については
.Xr kbdcontrol 1
マニュアルページを参照してください。
.It Va keyboard
.Pq Vt 文字列
空文字列以外を設定した場合、このデバイスを
仮想コンソールのキーボード入力として設定します。
.It Va keymap
.Pq Vt 文字列
.Dq Li NO
に設定すると、キーマップはインストールされません。
それ以外の場合、
ここで指定した値
.Ar value
がキーマップファイル
.Pa /usr/share/syscons/keymaps/ Ns Ao Ar value Ac Ns Pa .kbd
をインストールするのに用いられます。
.It Va keyrate
.Pq Vt 文字列
キーボードのリピートスピードです。以下のいずれかに設定します。
.Dq Li slow ,
.Dq Li normal ,
.Dq Li fast
か、
デフォルト値を希望する場合は
.Dq Li NO
とします。
.It Va keychange
.Pq Vt 文字列
.Dq Li NO
以外に設定すると、その値でファンクションキーをプログラムしようとします。
指定できる値は単一の文字列で,
.Dq Ar funkey_number new_value Op Ar funkey_number new_value ... .
という形式でないといけません。
.It Va cursor
.Pq Vt 文字列
カーソルの動作を明示的に指定する場合は
.Dq Li normal ,
.Dq Li blink ,
.Dq Li destructive
のいずれかの値に設定します。
デフォルト動作を選ぶには
.Dq Li NO
とします。
.It Va scrnmap
.Pq Vt 文字列
.Dq Li NO
に設定すると、スクリーンマップはインストールされません。
それ以外の場合には、ここで指定した
.Ar value
がスクリーンマップファイル
.Pa /usr/share/syscons/scrnmaps/ Ns Aq Ar value
をインストールするのに用いられます。
.It Va font8x16
.Pq Vt 文字列
.Dq Li NO
に設定すると、スクリーンサイズの要求に対しデフォルトの 8x16 フォント値が
用いられます。
それ以外の場合は
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
の値が用いられます。
.It Va font8x14
.Pq Vt 文字列
.Dq Li NO
に設定すると、スクリーンサイズの要求に対しデフォルトの 8x14 フォント値が
用いられます。
それ以外の場合は
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
の値が用いられます。
.It Va font8x8
.Pq Vt 文字列
.Dq Li NO
に設定すると、スクリーンサイズの要求に対しデフォルトの 8x8 フォント値が
用いられます。
それ以外の場合は
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
の値が用いられます。
.It Va blanktime
.Pq Vt 整数
.Dq Li NO
に設定すると、デフォルトのスクリーンブランク時間間隔が用いられます。
それ以外の場合は
.Ar value
秒に設定されます。
.It Va saver
.Pq Vt 文字列
.Dq Li NO
以外に設定すると、これが実際に使用する
スクリーンセーバ
.Li ( blank , snake , daemon
など) となります。
.It Va moused_enable
.Pq Vt 文字列
.Dq Li YES
に設定すると、コンソール上でのカット/ペーストセレクション用に
.Xr moused 8
デーモンが起動されます。
.It Va moused_type
.Pq Vt 文字列
このホストに接続しているマウスのプロトコルのタイプ。
.Va moused_enable
が
.Dq Li YES
の場合、この変数は必ず設定しなければなりません。
多くの場合、
.Xr moused 8
デーモンは適切なマウスタイプを自動的に検出することができます。
デーモンにマウスを検出させるには、この変数を
.Dq Li auto
に設定します。
自動検出が失敗する場合、以下のリストから 1 つを選びます。
.Pp
マウスが PS/2 マウスポートに接続されている場合、
.Dq Li auto
か
.Dq Li ps/2
を常に指定する必要があります。マウスのブランドやモデルには無関係です。
同様に、マウスがバスマウスポートに接続されている場合、
.Dq Li auto
か
.Dq Li busmouse
を選択してください。
他のプロトコルはシリアルマウス用であり、
PS/2 マウスおよびバスマウスでは動作しません。
USB マウスの場合、
.Dq Li auto
のみが、動作する唯一のプロトコルです。
.Pp
.Bl -tag -width ".Li x10mouseremote" -compact
.It Li microsoft
Microsoft マウス (シリアル)
.It Li intellimouse
Microsoft IntelliMouse (シリアル)
.It Li mousesystems
Mouse system 社製のマウス (シリアル)
.It Li mmseries
MM シリーズのマウス (シリアル)
.It Li logitech
Logitech 製のマウス (シリアル)
.It Li busmouse
バスマウス
.It Li mouseman
Logitech の MouseMan および TrackMan (シリアル)
.It Li glidepoint
ALPS 製の GlidePoint (シリアル)
.It Li thinkingmouse
Kensington 製の ThinkingMouse (シリアル)
.It Li ps/2
PS/2 マウス
.It Li mmhittab
MM の HitTablet (シリアル)
.It Li x10mouseremote
X10 MouseRemote (シリアル)
.It Li versapad
Interlink VersaPad (シリアル)
.El
.Pp
お使いのマウスが上記のリストにない場合でも、
リスト中のいずれかと互換性があるかも知れません。
互換性に関する情報については
.Xr moused 8
のマニュアルページを参照してください。
.Pp
また、
この変数が有効であるときは、(Xサーバのような) 他の全ての
マウスクライアントは仮想マウスデバイス
.Pa /dev/sysmouse
を通してマウスにアクセスし、
それを
.Dq Li sysmouse
タイプのマウスとして設定すべきであると
いうことにも注意すべきです。
これは、
.Xr moused 8
使用時は、全てのマウスデータがこの単一の標準フォーマットに
変換されるためです。
クライアントプログラムが
.Dq Li sysmouse
タイプを
サポートしないなら
.Dq Li mousesystems
を
指定してください。
これがその次に望ましいタイプです。
.It Va moused_port
.Pq Vt 文字列
.Va moused_enable
が
.Dq Li YES
の場合、これはマウスが接続されている実際のポートになります。
たとえば、COM1 シリアルマウスに対しては
.Pa /dev/cuaa0
、PS/2 マウスに対しては
.Pa /dev/psm0
、バスマウスに対しては
.Pa /dev/mse0
となります。
.It Va moused_flags
.Pq Vt 文字列
.Va moused_type
が設定されている場合、これらは
.Xr moused 8
デーモンに渡す追加のフラグとなります。
.It Va mousechar_start
.Pq Vt 整数
.Dq Li NO
に設定すると、デフォルトのマウスカーソル文字範囲
.Li 0xd0 Ns - Ns Li 0xd3
が使用されます。
そうでない場合、範囲の開始位置を
.Ar value
文字に設定されます。
.Xr vidcontrol 1
を参照してください。
デフォルトの範囲が言語のコード表で占められている場合に使用してください。
.It Va allscreens_flags
.Pq Vt 文字列
設定すると、各仮想端末
.Pq Pa /dev/ttyv*
に対し、これらのオプションを使用して
.Xr vidcontrol 1
を実行します。
例えば
.Dq Fl m Cm on
は、
.Va moused_enable
が
.Dq Li YES
に設定されている場合、全仮想端末上でマウスポインタを有効にします。
.It Va allscreens_kbdflags
.Pq Vt 文字列
設定されると、各仮想端末
.Pq Pa /dev/ttyv*
に対し、
.Xr kbdcontrol 1
がこれらのオプション付きで実行されます。
例えば、
.Dq Fl h Li 200
は
.Xr syscons 4
をスクロールバック (ヒストリ) バッファ 200 行に設定します。
.It Va cron_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr cron 8
デーモンを起動します。
.It Va cron_program
.Pq Vt 文字列
.Xr cron 8
へのパス
(デフォルトは
.Pa /usr/sbin/cron
です)。
.It Va cron_flags
.Pq Vt 文字列
.Va cron_enable
が
.Dq Li YES
を設定されている場合、これが
.Xr cron 8
へ渡すフラグとなります。
.It Va cron_dst
.Pq Vt ブール値
.Dq Li YES
に設定されている場合、
.Xr cron 8
における夏時間移行時の特別扱いが有効になります
.Fl ( s
フラグの使用と等価です)。
.It Va lpd_program
.Pq Vt 文字列
.Xr lpd 8
へのパス (デフォルトは
.Pa /usr/sbin/lpd
です)。
.It Va lpd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に
.Xr lpd 8
デーモンを起動します。
.It Va lpd_flags
.Pq Vt 文字列
.Va lpd_enable
が
.Dq Li YES
の場合、これらは
.Xr lpd 8
デーモンに渡すフラグとなります。
.It Va mta_start_script
.Pq Vt 文字列
本変数は、メール転送エージェントを起動するスクリプトへの
フルパスを指定します。
デフォルトは、
.Pa /etc/rc.sendmail
です。
.Pa /etc/rc.sendmail
が使用する
.Va sendmail_*
変数は、
.Xr rc.sendmail 8
マニュアルページに記述してあります。
.It Va dumpdev
.Pq Vt 文字列
システムクラッシュ時にクラッシュダンプを書き込むデバイス
(通常はスワップパーティション) を指定します。
この変数の値は
.Xr dumpon 8
への引数として渡されます。
クラッシュダンプを無効にするには、この変数を
.Dq Li NO
に設定します。
.It Va dumpdir
.Pq Vt 文字列
クラッシュ後にシステムがリブートするとき、
.Va dumpdev
変数で指定されるデバイスにクラッシュダンプが見付かると、
.Xr savecore 8
は、
このクラッシュダンプとカーネルのコピーを、
.Va dumpdir
変数で指定されるディレクトリへ保存します。
デフォルト値は
.Pa /var/crash
です。
.Va dumpdir
を
.Dq Li NO
に設定すると、ブート時に
.Xr savecore 8
を起動しません。
.It Va savecore_flags
.Pq Vt 文字列
クラッシュダンプが有効な場合、これらは
.Xr savecore 8
ユーティリティに渡すフラグになります。
.It Va enable_quotas
.Pq Vt ブール値
.Dq Li YES
に設定すると、システム起動時に、
.Xr quotaon 8
コマンドによってユーザディスクのクォータチェックを有効にします。
.It Va check_quotas
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr quotacheck 8
コマンドによってユーザディスクのクォータチェックを有効にします。
.It Va accounting_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
.Xr accton 8
機能でシステムアカウンティングを有効にします。
.It Va ibcs2_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
システム初期ブート時に iBCS2 (SCO) バイナリエミュレーションを有効にします。
.It Va ibcs2_loaders
.Pq Vt 文字列
これを
.Dq Li NO
に設定せずに
.Va ibcs2_enable
を
.Dq Li YES
に設定した場合、
この文字列は有効化すべき追加の iBCS2 ローダのリストを指定します。
.It Va linux_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
システムブート時に Linux/ELF バイナリエミュレーションを有効にします。
.It Va osf1_enable
.Pq Vt ブール値
システムブート時に OSF/1 (Digital UNIX) バイナリエミュレーションを
有効にしたいなら
.Dq Li YES
に設定します (Alpha)。
.It Va svr4_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時に SysVR4 エミュレーションを有効にします。
.It Va sysvipc_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時に System V IPC プリミティブをロードします。
.It Va clear_tmp_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
起動時に
.Pa /tmp
下を消去します。
.It Va ldconfig_paths
.Pq Vt 文字列
.Xr ldconfig 8
で使用する共有ライブラリのパスのリストを設定します。
注意:
.Pa /usr/lib
は常に先頭に追加されるので、このリストに指定する必要はありません。
.It Va ldconfig_paths_aout
.Pq Vt 文字列
.Xr ldconfig 8
が古い
.Xr a.out 5
形式をサポートする際に使用する共有ライブラリパスのリストを設定します。
.It Va ldconfig_insecure
.Pq Vt ブール値
.Xr ldconfig 8
ユーティリティは、通常、
root 以外が書き込み可能なディレクトリの使用を拒否します。
.Dq Li YES
に設定すると、
システムの起動中はこのセキュリティチェックを無効化します。
.It Va kern_securelevel_enable
.Pq Vt ブール値
カーネルのセキュリティレベルをシステムスタートアップ時に設定したい場合に、
.Dq Li YES
に設定します。
.It Va kern_securelevel
.Pq Vt 整数
スタートアップ時に設定されるカーネルセキュリティレベルです。
値
.Ar value
として許される範囲は \-1 (コンパイル時のデフォルト)
から 3 (最も安全) です。
利用可能なセキュリティレベルと、
それがシステムの動作へ及ぼす影響については、
.Xr init 8
を参照してください。
.It Va lomac_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
ブート時に Low Watermark Mandatory Access Control (LOMAC) を有効にします。
このセキュリティモデルは、システムプロセスに対し、完全性の制約を課します。
LOMAC モデルの完全な説明と、システム動作に及ぼす影響については、
.Xr lomac 4
を参照してください。
.It Va start_vinum
.Pq Vt ブール値
.Dq Li YES
に設定すると、
システムブート時に
.Xr vinum 8
を開始します。
.It Va sshd_program
.Pq Vt 文字列
SSH サーバプログラムへのパスです
.Pa ( /usr/sbin/sshd
がデフォルトです)。
.It Va sshd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、
ブート時に
.Xr sshd 8
を起動します。
.It Va sshd_flags
.Pq Vt 文字列
.Va sshd_enable
が
.Dq Li YES
の場合、これらは
.Xr sshd 8
デーモンに渡すフラグになります。
.It Va usbd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時に
.Xr usbd 8
を実行します。
.It Va usbd_flags
.Pq Vt 文字列
.Va usbd_enable
が
.Dq Li YES
の場合、これらは
.Xr usbd 8
デーモンに渡すフラグになります。
.It Va watchdogd_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr watchdogd 8
を起動します。
このためには、カーネルが
.Xr watchdog 4
互換のデバイス付きでコンパイルされていることが必要です。
.It Va watchdogd_flags
.Pq Vt 文字列
.Va watchdogd_enable
に
.Dq Li YES
が設定されている場合、これらのフラグが
.Xr watchdogd 8
デーモンに渡されます。
.It Va jail_enable
.Pq Vt ブール値
.Dq Li NO
に設定すると、設定済の jail は起動されません。
.It Va jail_list
.Pq Vt 文字列
空白で区切られた jail 名のリストです。
これは、複数の jail の識別と設定を助ける、設定のためのものです。
このリストで指定される名前が、
ある jail のインスタンスに共通する識別子として使用されます。
対象の jail 名が
.Li vjail
とすると、これに依存する下記の変数ができます:
.Bd -literal
jail_vjail_hostname="jail.example.com"
jail_vjail_ip="192.168.1.100"
jail_vjail_rootdir="/var/jails/vjail/root"
jail_vjail_exec="/bin/sh /etc/rc"
.Ed
.Pp
最後の項目は省略可能です。
設定されていない場合には、デフォルトの
.Pa /etc/rc
になります。
.It Va jail_set_hostname_allow
.Pq Vt ブール値
.Dq Li NO
に設定すると、jail 中の root ユーザがホスト名を設定できないようにします。
.It Va jail_socket_unixiproute_only
.Pq Vt ブール値
.Dq Li NO
に設定すると、jail 内で TCP/IP 以外のプロトコルを使えないようにします。
.It Va jail_sysvipc_allow
.Pq Vt ブール値
.Dq Li YES
に設定すると、jail 内のアプリケーションが System V IPC を使えるようにします。
.It Va unaligned_print
.Pq Vt ブール値
.Dq Li NO
に設定すると、境界調整されていないアクセスに対する警告は
表示されません (Alpha)。
.\" ----- isdn settings ---------------------------------
.It Va isdn_enable
.Pq Vt ブール値
デフォルトは
.Dq Li NO
です。
.Dq Li YES
に設定すると、
.Xr isdnd 8
デーモン
をシステム起動時に起動します。
.It Va isdn_flags
.Pq Vt 文字列
デフォルトは
.Dq Fl d Ns Cm n Fl d Ns Li 0x1f9
です。
.Xr isdnd 8
に渡される追加のフラグです (調整可能なパラメータについては
.Va isdn_fsdev
と
.Va isdn_ttype
を参照してください)。
.It Va isdn_ttype
.Pq Vt 文字列
デフォルトは
.Dq Li cons25
です。
.Xr isdnd 8
が全画面モードで動作する場合の出力端末の型です。
.It Va isdn_screenflags
.Pq Vt 文字列
デフォルトで
.Dq Li NO
に設定されます。
全画面モード用のビデオモードです (
.Xr syscons 4
コンソールドライバ専用です)。
.Xr vidcontrol 1
を参照してください。
.It Va isdn_fsdev
.Pq Vt 文字列
デフォルトは
.Dq Li NO
です。
.Xr isdnd 8
が全画面モードで動作する場合の出力端末です (デーモンモード時は
.Dq Li NO
です)。
.It Va isdn_trace
.Pq Vt ブール値
デフォルトは
.Dq Li NO
です。
.Dq Li YES
に設定すると、ISDN プロトコルトレースユーティリティ
.Xr isdntrace 8
をシステム起動時に有効にします。
.It Va isdn_traceflags
.Pq Vt 文字列
デフォルトは
.Dq Fl f Pa /var/tmp/isdntrace0
です。
.Xr isdntrace 8
へのフラグです。
.\" -----------------------------------------------------
.It Va pcvt_verbose
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、
起動スクリプトが行った動作に関する冗長なメッセージが表示されます。
.Em 注 :
ここで記述されている
.Xr pcvt 4
オプション関連の効果のためには、
.Xr pcvt 4
ドライバがカーネルに組み込まれている必要があります。
.It Va pcvt_keymap
.Pq Vt 文字列
デフォルトで
.Dq Li NO
に設定されます。
これで各国キーボード配列の初期化をします。
キーボード配列は
.Pa /usr/share/misc/keycap.pcvt
ファイルに記述されています
.Xr ( pcvt 4
の keycap データベースの使用方法については、マニュアルページ
.Xr keycap 5
および
.Xr keycap 3
を参照し、各国キーボード配列の設定については
.Xr kcon 1
のオプション
.Fl m
を参照してください)。
.It Va pcvt_keydel
.Pq Vt 整数
デフォルトで
.Dq Li NO
に設定されます。
キーボードのキーリピート遅延値に使用されます。
正当な値は 0..3 の範囲であり、遅延値 250, 500, 750, 1000 msec です
.Xr ( kcon 1
マニュアルページも参照してください)。
.It Va pcvt_keyrate
.Pq Vt 整数
デフォルトで
.Dq Li NO
に設定されます。
キーボードのキーリピートレート値に使用されます。
正当な値は 0..31 の範囲であり、秒あたり 2..30 文字のリピート値です。
.It Va pcvt_keyrepeat
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、自動キーボードキーリピートを有効にします。
.It Va pcvt_force24
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、オリジナルの
.Tn VT220
端末との互換性のために (25 行モードで) 24 行のみを使用するよう
.Xr pcvt 4
に強制します。
.It Va pcvt_hpext
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、ファンクションキーラベル
.Tn ( Hewlett-Packard
の
.Tn HP2392A
や
.Tn HP700/92
のような端末の ANSI モードで見られるもの) の表示と機能を有効にします。
.It Va pcvt_lines
.Pq Vt 整数
デフォルトの
.Dq Li NO
は、値 25 になります。
画面の行数を設定するために使用します。
VGA ディスプレイでは、正当な値は 25, 28, 40, 50 行です
.Xr ( scon 1
マニュアルページも参照してください)。
.It Va pcvt_blanktime
.Pq Vt 整数
デフォルトで
.Dq Li NO
に設定されます。
0 より大きい値を使用することで、スクリーンセーバのタイムアウトを、
秒単位で指定します。
.It Va pcvt_cursorh
.Pq Vt 整数
デフォルトで
.Dq Li NO
に設定されます。
カーソルトップスキャンラインを設定するために使用されます
.Xr ( cursor 1
マニュアルページも参照してください)。
.It Va pcvt_cursorl
.Pq Vt 整数
デフォルトで
.Dq Li NO
に設定されます。
カーソルボトムスキャンラインを設定するために使用されます。
.It Va pcvt_monohigh
.Pq Vt ブール値
デフォルトで
.Dq Li NO
に設定されます。
.Dq Li YES
に設定すると、モノクロームモニタの輝度を高くします
(VGA パレット値の変更に関する更なる情報は、
.Xr scon 1
マニュアルページの
.Fl p
を参照してください)。
.It Va harvest_interrupt
.Pq Vt ブール値
.Dq Li YES
に設定すると、エントロピ源としてハードウェア割り込みを使用します。
更なる情報については
.Xr random 4
を参照してください。
.It Va harvest_ethernet
.Pq Vt ブール値
.Dq Li YES
に設定すると、エントロピ源として LAN トラフィックを使用します。
更なる情報については
.Xr random 4
を参照してください。
.It Va harvest_p_to_p
.Pq Vt ブール値
.Dq Li YES
に設定すると、エントロピ源としてシリアル線を使用します。
更なる情報については
.Xr random 4
を参照してください。
.It Va entropy_dir
.Pq Vt 文字列
.Dq Li NO
に設定すると、
.Xr cron 8
によるエントロピキャッシングを無効化します。
そうでない場合、エントロピファイルを格納するディレクトリを設定します。
.It Va entropy_file
.Pq Vt 文字列
.Dq Li NO
に設定すると、リブートを通じたエントロピキャッシングを無効化します。
そうでない場合、キャッシュしたエントロピを、
リブートの間に格納するために使用するファイル名を設定します。
このファイルはルートファイルシステムに置き、ブート処理のなるべく早期に
.Xr random 4
デバイスをシードするべきです。
.It Va entropy_save_sz
.Pq Vt 整数
.Nm save-entropy
により定期的に保存されるエントロピキャッシュファイルの大きさです。
.It Va entropy_save_num
.Pq Vt 整数
.Nm save-entropy
により定期的に保存されるエントロピキャッシュファイルの数です。
.It Va ipsec_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、起動時に
.Xr setkey 8
を
.Va ipsec_file
に対して実行します。
.It Va ipsec_file
.Pq Vt 文字列
.Xr setkey 8
の設定ファイルです。
.It Va dmesg_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、ブート時に
.Xr dmesg 8
を
.Pa /var/run/dmesg.boot
に保存します。
.It Va rcshutdown_timeout
.Pq Vt 整数
設定した場合、バックグラウンドでウォッチドッグタイマを起動し、
.Xr shutdown 8
が指定した時間 (秒単位) で完了しない場合には
.Pa rc.shutdown
を終了させます。
.It Va virecover_enable
.Pq Vt ブール値
.Dq Li NO
に設定すると、
正常終了しなかっった
.Xr vi 1
セッションを復旧しようと試みなくなります。
.It Va ugidfw_enable
システム初期化時に
.Xr mac_bsdextended 4
モジュールをロードし、デフォルトのルールセットファイルを読み込みます。
デフォルトは
.Dq Li NO
です。
.It Va bsdextended_script
.Xr mac_bsdextended 4
が読み込むデフォルトのルールセットファイルです。
デフォルトは
.Dq Pa /etc/rc.bsdextended
です。
.It Va swapoff
.Pq Vt ブール値
.Dq Li YES
に設定すると、
シャットダウン時に swap パーティションを削除します。
.It Va ramdisk_units
.Pq Vt 文字列
.Xr fstab 5
からマウントする際に、
.Xr mdconfig 8
と
.Xr newfs 8
を用いて設定する RAM ディスクユニットのリストです。
ここにリストされたユニット
.Ar X
のそれぞれは、少なくとも 1 つの型
.Ar type
を
.Va ramdisk_ Ns Ao Ar X Ac Ns Va _config
変数で指定しなければなりません。
.It Va ramdisk_ Ns Ao Ar X Ac Ns Va _config
.Pq Vt 文字列
RAM ディスク
.Ar X
について、
.Xr mdconfig 8
に渡す引数。
少なくとも
.Fl t Ar type
は指定しなければなりません。ここで、
.Ar type
とは、
.Cm malloc
または
.Cm swap
のいずれかです。
.It Va ramdisk_ Ns Ao Ar X Ac Ns Va _newfs
.Pq Vt 文字列
RAM ディスク
.Ar X
を初期化する際に、
.Xr newfs 8
に渡す引数。
.It Va ramdisk_ Ns Ao Ar X Ac Ns Va _owner
.Pq Vt 文字列
RAM ディスクユニット
.Ar X
がマウントされた後、
.Xr chown 8
に渡す所有権指定情報。
.Xr md 4
デバイスとマウントポイントの両方とも変更されます。
.It Va ramdisk_ Ns Ao Ar X Ac Ns Va _perms
.Pq Vt 文字列
RAM ディスクユニット
.Ar X
がマウントされた後、
.Xr chmod 1
に渡すファイルモード文字列。
.Xr md 4
デバイスとマウントポイントの両方とも変更されます。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/defaults/rc.conf" -compact
.It Pa /etc/defaults/rc.conf
.It Pa /etc/rc.conf
.It Pa /etc/rc.conf.local
.El
.Sh 関連項目
.Xr catman 1 ,
.Xr chmod 1 ,
.Xr gdb 1 ,
.Xr info 1 ,
.Xr kbdcontrol 1 ,
.Xr makewhatis 1 ,
.Xr vi 1 ,
.Xr vidcontrol 1 ,
.Xr ip 4 ,
.Xr kld 4 ,
.Xr tcp 4 ,
.Xr udp 4 ,
.Xr exports 5 ,
.Xr motd 5 ,
.Xr newsyslog.conf 5 ,
.Xr accton 8 ,
.Xr amd 8 ,
.Xr apm 8 ,
.Xr atm 8 ,
.Xr chown 8 ,
.Xr cron 8 ,
.Xr dhclient 8 ,
.Xr ifconfig 8 ,
.Xr inetd 8 ,
.Xr isdnd 8 ,
.Xr isdntrace 8 ,
.Xr kldxref 8 ,
.Xr lpd 8 ,
.Xr mdconfig 8 ,
.Xr mountd 8 ,
.Xr moused 8 ,
.Xr mrouted 8 ,
.Xr named 8 ,
.Xr newfs 8 ,
.Xr nfsd 8 ,
.Xr ntpd 8 ,
.Xr ntpdate 8 ,
.Xr pcnfsd 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8 ,
.Xr rc 8 ,
.Xr rc.sendmail 8 ,
.Xr route 8 ,
.Xr routed 8 ,
.Xr rpcbind 8 ,
.Xr rpc.lockd 8 ,
.Xr rpc.statd 8 ,
.Xr rwhod 8 ,
.Xr savecore 8 ,
.Xr sshd 8 ,
.Xr swapon 8 ,
.Xr sysctl 8 ,
.Xr syslogd 8 ,
.Xr timed 8 ,
.Xr usbd 8 ,
.Xr vinum 8 ,
.Xr yp 8 ,
.Xr ypbind 8 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh 歴史
.Nm
ファイルは
.Fx 2.2.2
で登場しました。
.Sh 作者
.An Jordan K. Hubbard .
