freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rcsfile.5
.\" jpman %Id: rcsfile.5,v 1.3 1998/06/17 07:53:51 kumano Stab %
.\" FreeBSD jpman project 訳語表
.\" WORD: phrase	句
.\" WORD: meta syntax	メタ文法
.\" WORD: altanatives	選言
.\" WORD: trunk		幹
.\" WORD: branch	枝
.\" WORD: branch point	分岐点
.\" WORD: numebr	(RCSのリビジョン番号1.1, 1.2.2.1等を意味する時は) 番号
.lf 1 ./rcsfile.5in
.\" Set p to 1 if your formatter can handle pic output.
.if t .nr p 1
.de Id
.ds Rv \\$3
.ds Dt \\$4
..
.Id %FreeBSD: src/gnu/usr.bin/rcs/rcs/rcsfile.5,v 1.5 1999/08/27 23:36:52 peter Exp %
.ds r \s-1RCS\s0
.if n .ds - \%--
.if t .ds - \(em
.TH RCSFILE 5 \*(Dt GNU
.SH 名称
rcsfile \- RCS ファイルの書式
.SH 解説
\*r ファイルの内容は以下の文法に基づき記述されます。
.PP
テキストはフリーフォーマットであり、
文字列中のスペース、バックスペース、
タブ、改行、垂直タブ、改頁、復帰 (まとめて
.IR "空白"
と呼びます) は意味を持ちません。
例外として、id, num, sym 内では空白があってはならず、
\*r ファイルは改行で終わらなければなりません。
.PP
文字列は
.BR @
で括られます。文字列が
.BR @
自身を含む場合、2 重化されなければならず、それ以外は任意の
バイナリデータを含むことができます。
.PP
以下、簡便のためにメタ文法を用います。
`|' (縦棒) は選言を分けます。
`{' と `}' は省略可能な句を括ります。
`{' と `}*' は 0 回以上繰り返される句を括ります。
`{' と `}+' は 1 回以上繰り返される句を括ります。
終端記号は
.BR 太字
で、非終端記号は
.IR 斜体
で表記します。
.LP
.nr w \w'\f3deltatext\fP '
.nr y \w'\f3newphrase\fP '
.if \nw<\ny .nr w \ny
.nr x \w'\f3branches\fP'
.nr y \w'{ \f3comment\fP'
.if \nx<\ny .nr x \ny
.nr y \w'\f3{ branch\fP'
.if \nx<\ny .nr x \ny
.ta \nwu +\w'::=  'u +\nxu+\w'  'u
.fc #
.nf
\f2rcstext\fP	::=	\f2admin\fP {\f2delta\fP}* \f2desc\fP {\f2deltatext\fP}*
.LP
\f2admin\fP	::=	\f3head\fP	{\f2num\fP}\f3;\fP
		{ \f3branch\fP	{\f2num\fP}\f3;\fP }
		\f3access\fP	{\f2id\fP}*\f3;\fP
		\f3symbols\fP	{\f2sym\fP \f3:\fP \f2num\fP}*\f3;\fP
		\f3locks\fP	{\f2id\fP \f3:\fP \f2num\fP}*\f3;\fP  {\f3strict  ;\fP}
		{ \f3comment\fP	{\f2string\fP}\f3;\fP }
		{ \f3expand\fP	{\f2string\fP}\f3;\fP }
		{ \f2newphrase\fP }*
.LP
\f2delta\fP	::=	\f2num\fP
		\f3date\fP	\f2num\fP\f3;\fP
		\f3author\fP	\f2id\fP\f3;\fP
		\f3state\fP	{\f2id\fP}\f3;\fP
		\f3branches\fP	{\f2num\fP}*\f3;\fP
		\f3next\fP	{\f2num\fP}\f3;\fP
		{ \f2newphrase\fP }*
.LP
\f2desc\fP	::=	\f3desc\fP	\f2string\fP
.LP
\f2deltatext\fP	::=	\f2num\fP
		\f3log\fP	\f2string\fP
		{ \f2newphrase\fP }*
		\f3text\fP	\f2string\fP
.LP
\f2num\fP	::=	{\f2digit\fP | \f3.\fP}+
.LP
\f2digit\fP	::=	\f30\fP | \f31\fP | \f32\fP | \f33\fP | \f34\fP | \f35\fP | \f36\fP | \f37\fP | \f38\fP | \f39\fP
.LP
\f2id\fP	::=	{\f2num\fP} \f2idchar\fP {\f2idchar\fP | \f2num\fP}*
.LP
\f2sym\fP	::=	{\f2digit\fP}* \f2idchar\fP {\f2idchar\fP | \f2digit\fP}*
.LP
\f2idchar\fP	::=	\f2special\fP を除く任意の可視文字 (visible graphic character)
.LP
\f2special\fP	::=	\f3$\fP | \f3,\fP | \f3.\fP | \f3:\fP | \f3;\fP | \f3@\fP
.LP
\f2string\fP	::=	\f3@\fP{任意の文字、ただし \f3@\fP は 2 重化される}*\f3@\fP
.LP
\f2newphrase\fP	::=	\f2id\fP \f2word\fP* \f3;\fP
.LP
\f2word\fP	::=	\f2id\fP | \f2num\fP | \f2string\fP | \f3:\fP
.fi
.PP
識別子は大文字小文字を区別します。
キーワードは小文字のみです。
キーワードと識別子の集合は重複可能です。
ほとんどの環境では、\*r は \s-1ISO\s0 8859/1 エンコーディングを用います。
このコードでは、可視文字のコードが 041\-176 と 240\-377 で、
空白文字のコードが 010\-015 と 040 です。
.PP
.B date
キーワードの後に現れる日時は
\f2Y\fP\f3.\fP\f2mm\fP\f3.\fP\f2dd\fP\f3.\fP\f2hh\fP\f3.\fP\f2mm\fP\f3.\fP\f2ss\fP
という書式で、それぞれ
.I Y
が年を、
.I mm
が月 (01\-12) を、
.I dd
が日 (01\-31) を、
.I hh
が時 (00\-23) を、
.I mm
が分 (00\-59) を、
.I ss
が秒 (00\-60) を表します。
.I Y
は 1900 年から 1999 年までは年の最後の 2 桁で表し、それ以降は
年のすべての桁で表します。
日付はグレゴリオ暦を用い、時刻は UTC (協定世界時) で表します。
.PP
文法中の
.I newphrase
は \*r ファイル書式の今後の拡張のために予約されています。 
すでに使われているキーワードでは
.I newphrase
は始まりません。
.PP
複数の
.I delta
ノードが集まって、木を形成します。
単一の組からなる番号のノード (例えば 2.3, 2.1, 1.3 など) は
すべて幹 (trunk) であり、降順で
.B next
フィールドを通してリンクされています。
.I admin
ノードの
.B head
フィールドは、このシーケンスの先頭 (head; すなわち最高位の組) を示します。
admin ノードの
.B branch
ノードは、
ほとんどの \*r 操作が利用するデフォルトの枝 (もしくはリビジョン) を示します。
もしこれが存在しなければ、幹の最高位の枝が用いられます。
.PP
.RI 2 n
個
.RI ( n \(>=2)
のフィールドからなる番号を持つ全
.I delta
ノード (例えば 3.1.1.1, 2.1.2.2 など) は、次のようにリンクされます。
すなわち、先頭の
.RI 2 n \-1
個のフィールドの番号が等しい全ノードは、昇順で
.B next
フィールドを通してリンクされます。
シーケンス中の delta ノードの番号の先頭
.RI 2 n \-2
個分と等しい番号を持つ
.I delta
ノードは、そのシーケンスの分岐点と呼ばれます。
ノードの
.B branches
フィールドは、
そのノードが分岐点となっている全シーケンスに対し、
最初のノード番号のリストを保持しています。
このリストは昇順で並べられています。
.LP
以下の図は \*r ファイルの構成の例を示しています。
.if !\np \{\
.nf
.vs 12
.ne 36
.cs 1 20
.eo

                           Head
                             |
                             |
                             v                        / \
                         ---------                   /   \
   / \          / \      |       |      / \         /     \
  /   \        /   \     |  2.1  |     /   \       /       \
 /     \      /     \    |       |    /     \     /         \
/1.2.1.3\    /1.3.1.1\   |       |   /1.2.2.2\   /1.2.2.1.1.1\
---------    ---------   ---------   ---------   -------------
    ^            ^           |           ^             ^
    |            |           |           |             |
    |            |           v           |             |
   / \           |       ---------      / \            |
  /   \          |       \  1.3  /     /   \           |
 /     \         ---------\     /     /     \-----------
/1.2.1.1\                  \   /     /1.2.2.1\
---------                   \ /      ---------
    ^                        |           ^
    |                        |           |
    |                        v           |
    |                    ---------       |
    |                    \  1.2  /       |
    ----------------------\     /---------
                           \   /
                            \ /
                             |
                             |
                             v
                         ---------
                         \  1.1  /
                          \     /
                           \   /
                            \ /

.ec
.cs 1
.vs
.fi
.\}
.if \np \{\
.lf 232
.PS 4.250i 3.812i
.\" -2.0625 -4.25 1.75 0
.\" 0.000i 4.250i 3.812i 0.000i
.nr 00 \n(.u
.nf
.nr 0x 1
\h'3.812i'
.sp -1
.lf 242
\h'2.062i-(\w'Head'u/2u)'\v'0.125i-(0v/2u)+0v+0.22m'Head
.sp -1
\h'2.062i'\v'0.250i'\D'l0.000i 0.500i'
.sp -1
\h'2.087i'\v'0.650i'\D'l-0.025i 0.100i'
.sp -1
\h'2.062i'\v'0.750i'\D'l-0.025i -0.100i'
.sp -1
\h'1.688i'\v'1.250i'\D'l0.750i 0.000i'
.sp -1
\h'2.438i'\v'1.250i'\D'l0.000i -0.500i'
.sp -1
\h'2.438i'\v'0.750i'\D'l-0.750i 0.000i'
.sp -1
\h'1.688i'\v'0.750i'\D'l0.000i 0.500i'
.sp -1
.lf 244
\h'2.062i-(\w'2.1'u/2u)'\v'1.000i-(0v/2u)+0v+0.22m'2.1
.sp -1
\h'2.062i'\v'1.250i'\D'l0.000i 0.500i'
.sp -1
\h'2.087i'\v'1.650i'\D'l-0.025i 0.100i'
.sp -1
\h'2.062i'\v'1.750i'\D'l-0.025i -0.100i'
.sp -1
.lf 246
\h'2.062i-(\w'1.3'u/2u)'\v'2.000i-(1v/2u)+0v+0.22m'1.3
.sp -1
\h'2.062i'\v'2.250i'\D'l-0.375i -0.500i'
.sp -1
\h'1.688i'\v'1.750i'\D'l0.750i 0.000i'
.sp -1
\h'2.438i'\v'1.750i'\D'l-0.375i 0.500i'
.sp -1
\h'1.875i'\v'2.000i'\D'~-0.500i 0.000i 0.000i -0.500i'
.sp -1
\h'1.350i'\v'1.600i'\D'l0.025i -0.100i'
.sp -1
\h'1.375i'\v'1.500i'\D'l0.025i 0.100i'
.sp -1
.lf 249
\h'1.375i-(\w'1.3.1.1'u/2u)'\v'1.250i-(1v/2u)+1v+0.22m'1.3.1.1
.sp -1
\h'1.375i'\v'1.000i'\D'l-0.375i 0.500i'
.sp -1
\h'1.000i'\v'1.500i'\D'l0.750i 0.000i'
.sp -1
\h'1.750i'\v'1.500i'\D'l-0.375i -0.500i'
.sp -1
\h'2.062i'\v'2.250i'\D'l0.000i 0.500i'
.sp -1
\h'2.087i'\v'2.650i'\D'l-0.025i 0.100i'
.sp -1
\h'2.062i'\v'2.750i'\D'l-0.025i -0.100i'
.sp -1
.lf 252
\h'2.062i-(\w'1.2'u/2u)'\v'3.000i-(1v/2u)+0v+0.22m'1.2
.sp -1
\h'2.062i'\v'3.250i'\D'l-0.375i -0.500i'
.sp -1
\h'1.688i'\v'2.750i'\D'l0.750i 0.000i'
.sp -1
\h'2.438i'\v'2.750i'\D'l-0.375i 0.500i'
.sp -1
\h'1.875i'\v'3.000i'\D'~-0.500i 0.000i -0.500i 0.000i -0.500i 0.000i 0.000i -0.500i'
.sp -1
\h'0.350i'\v'2.600i'\D'l0.025i -0.100i'
.sp -1
\h'0.375i'\v'2.500i'\D'l0.025i 0.100i'
.sp -1
.lf 255
\h'0.375i-(\w'1.2.1.1'u/2u)'\v'2.250i-(1v/2u)+1v+0.22m'1.2.1.1
.sp -1
\h'0.375i'\v'2.000i'\D'l-0.375i 0.500i'
.sp -1
\h'0.000i'\v'2.500i'\D'l0.750i 0.000i'
.sp -1
\h'0.750i'\v'2.500i'\D'l-0.375i -0.500i'
.sp -1
\h'0.375i'\v'2.000i'\D'l0.000i -0.500i'
.sp -1
\h'0.350i'\v'1.600i'\D'l0.025i -0.100i'
.sp -1
\h'0.375i'\v'1.500i'\D'l0.025i 0.100i'
.sp -1
.lf 257
\h'0.375i-(\w'1.2.1.3'u/2u)'\v'1.250i-(1v/2u)+1v+0.22m'1.2.1.3
.sp -1
\h'0.375i'\v'1.000i'\D'l-0.375i 0.500i'
.sp -1
\h'0.000i'\v'1.500i'\D'l0.750i 0.000i'
.sp -1
\h'0.750i'\v'1.500i'\D'l-0.375i -0.500i'
.sp -1
\h'2.250i'\v'3.000i'\D'~0.500i 0.000i 0.000i -0.500i'
.sp -1
\h'2.725i'\v'2.600i'\D'l0.025i -0.100i'
.sp -1
\h'2.750i'\v'2.500i'\D'l0.025i 0.100i'
.sp -1
.lf 261
\h'2.750i-(\w'1.2.2.1'u/2u)'\v'2.250i-(1v/2u)+1v+0.22m'1.2.2.1
.sp -1
\h'2.750i'\v'2.000i'\D'l-0.375i 0.500i'
.sp -1
\h'2.375i'\v'2.500i'\D'l0.750i 0.000i'
.sp -1
\h'3.125i'\v'2.500i'\D'l-0.375i -0.500i'
.sp -1
\h'2.938i'\v'2.250i'\D'~0.500i 0.000i 0.000i -0.500i 0.000i -0.500i'
.sp -1
\h'3.413i'\v'1.350i'\D'l0.025i -0.100i'
.sp -1
\h'3.438i'\v'1.250i'\D'l0.025i 0.100i'
.sp -1
.lf 264
\h'3.438i-(\w'\s-21.2.2.1.1.1\s0'u/2u)'\v'1.000i-(1v/2u)+1v+0.22m'\s-21.2.2.1.1.1\s0
.sp -1
\h'3.438i'\v'0.750i'\D'l-0.375i 0.500i'
.sp -1
\h'3.062i'\v'1.250i'\D'l0.750i 0.000i'
.sp -1
\h'3.812i'\v'1.250i'\D'l-0.375i -0.500i'
.sp -1
\h'2.750i'\v'2.000i'\D'l0.000i -0.500i'
.sp -1
\h'2.725i'\v'1.600i'\D'l0.025i -0.100i'
.sp -1
\h'2.750i'\v'1.500i'\D'l0.025i 0.100i'
.sp -1
.lf 267
\h'2.750i-(\w'1.2.2.2'u/2u)'\v'1.250i-(1v/2u)+1v+0.22m'1.2.2.2
.sp -1
\h'2.750i'\v'1.000i'\D'l-0.375i 0.500i'
.sp -1
\h'2.375i'\v'1.500i'\D'l0.750i 0.000i'
.sp -1
\h'3.125i'\v'1.500i'\D'l-0.375i -0.500i'
.sp -1
\h'2.062i'\v'3.250i'\D'l0.000i 0.500i'
.sp -1
\h'2.087i'\v'3.650i'\D'l-0.025i 0.100i'
.sp -1
\h'2.062i'\v'3.750i'\D'l-0.025i -0.100i'
.sp -1
.lf 270
\h'2.062i-(\w'1.1'u/2u)'\v'4.000i-(1v/2u)+0v+0.22m'1.1
.sp -1
\h'2.062i'\v'4.250i'\D'l-0.375i -0.500i'
.sp -1
\h'1.688i'\v'3.750i'\D'l0.750i 0.000i'
.sp -1
\h'2.438i'\v'3.750i'\D'l-0.375i 0.500i'
.sp -1
.sp 4.250i+1
.if \n(00 .fi
.br
.nr 0x 0
.lf 271
.PE
.lf 272
.\}
.PP
.SH 作者
.de VL
\\$2
..
Author: Walter F. Tichy,
Purdue University, West Lafayette, IN, 47907.
.br
Manual Page Revision: \*(Rv; Release Date: \*(Dt.
.br
Copyright \(co 1982, 1988, 1989 Walter F. Tichy.
.br
Copyright \(co 1990, 1991, 1992, 1993, 1994, 1995 Paul Eggert.
.SH 関連項目
rcsintro(1), ci(1), co(1), ident(1), rcs(1), rcsclean(1), rcsdiff(1),
rcsmerge(1), rlog(1)
.br
Walter F. Tichy,
\*r\*-A System for Version Control,
.I "Software\*-Practice & Experience"
.BR 15 ,
7 (July 1985), 637-654.
