freebsd/freebsd-doc/ja_JP.eucJP/man/man5/remote.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)remote.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/remote.5,v 1.16 2004/07/03 18:29:23 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd October 20, 2003
.Dt REMOTE 5
.Os
.Sh 名称
.Nm remote
.Nd リモートホスト記述ファイル
.Sh 解説
.Xr tip 1
によって知られるシステムとその属性は、
.Xr termcap 5
ファイルのような構造の
.Tn ASCII
ファイルに記録されます。
ファイルの各行は、1 つの
.Em システム
についての記述を提供します。
フィールドはコロン (``:'') で分けられています。
\e 文字の直後に改行がある行末は、次の行へ継続されます。
.Pp
最初のエントリはホストシステムの (複数の) 名称です。
システムの名称が 1 つ以上ある場合、名称は縦棒で区切られます。
システムの名称の後に記述フィールドが続きます。
`=' 記号が続くフィールド名は、文字列型を示します。
`#' 記号が続くフィールド名は、数値を示します。
.Pp
``tip*'' と ``cu*'' という名前が付いたエントリは、
.Xr tip 1
や、以下で述べるように
.Nm tip
に対するインタフェース
.Xr cu 1
でデフォルトのエントリとして使われます。
.Nm tip
が電話番号だけをつけて呼び出された時、 ``tip300'' の形式のエントリを探
します。
ここで、 300 は接続が張られたボーレートです。
.Nm cu
インタフェースが使われた時は、 ``cu300'' という形式のエントリが使わ
れます。
.Sh ケーパビリティ
ケーパビリティは、文字列 (str) ・数値 (num) ・ブーリアンフラグ (bool)
のいずれかです。
文字列ケーパビリティは
.Em capability Ns Ar = Ns Em value
のように指定されます。
例えば、 ``dv=/dev/harris'' のように指定します。
数値ケーパビリティは
.Em capability Ns Ar # Ns Em value
のように指定されます。
例えば、 ``xa#99'' のように指定します。
ブーリアンケーパビリティは単にケーパビリティを記述するだけで
指定されます。
.Bl -tag -width indent
.It Cm \&at
(str)
自動呼び出しユニットの形式です。
.It Cm \&br
(num)
シリアルポート上の通信に使用されるデータレート (秒毎のビット数)。
モデム使用時には、リモートモデムとの通信に使用されるデータレートは
このレートとは異なるかもしれません。
これは、10 進の数値です。
デフォルトのボーレートは 300 ボーです。
.It Cm \&cm
(str)
リモートホストに送られる初期接続メッセージです。
例えば、ホストにポート選択器を通して到達する場合、
ここにはホストに切り替えるために必要とされる適切なシーケンスが設定されて
いるべきです。
.It Cm \&cu
(str)
電話の呼び出しが行われる場合の呼び出しユニットです。
デフォルトは、 `dv' フィールドと同じです。
.It Cm \&di
(str)
ユーザによって切断が要求されている時にホストに送られる
切断メッセージです。
.It Cm \&du
(bool)
このホストはダイヤルアップ線上にあることを示します。
.It Cm \&dv
(str)
接続を確立するためにオープンする (複数の)
.Ux
デバイスです。このファイルが端末線を参照している場合、
.Xr tip 1
は、1 度に 1 ユーザだけがポートにアクセスすることを保証するために、
デバイスを排他的にオープンします。
.It Cm \&el
(str)
行末 (end-of-line) を示す文字です。
デフォルトでは
.Dv NULL
文字です。`el' 中の 1 文字もしくは復帰文字 (carriage return) の後の
`~' エスケープは
.Nm tip
だけで認識されます。
.It Cm \&fs
(str)
転送のためのフレームサイズです。
デフォルトフレームサイズは
.Dv BUFSIZ
と同じです。
.It Cm \&hd
(bool)
ホストが半 2 重通信を使い、ローカルエコーが行われることを示します。
.It Cm \&ie
(str)
入力のファイル終了 (end-of-file) マークです。
デフォルトは
.Dv NULL
です。
.It Cm \&oe
(str)
出力のファイル終了 (end-of-file) 文字列です。
デフォルトは
.Dv NULL
です。
.Nm tip
がファイルを転送している時、この文字列はファイル終了時に送られます。
.It Cm \&pa
(str)
データをホストに送っている時に使われるパリティの形式です。
これは ``even'', ``odd'', ``none'', ``zero'' (いつでも 8 ビット目を 0
に設定する), ``one'' (いつでも 8 ビット目を 1 に設定する)のいずれかです。
デフォルトではイーブンパリティです。
.It Cm \&pn
(str)
ホストに対する (複数の) 電話番号です。
電話番号フィールドが @ 符号を含んでいる場合、
.Nm tip
は電話番号の一覧を
.Pa /etc/phones
ファイルから検索します (
.Xr phones 5
参照)。
.It Cm \&tc
(str)
ケーパビリティのリストが、名前で与えられた記述に継続されることを示し
ます。これは主に共通のケーパビリティ情報を共有するために使われます。
.El
.Sh 使用例
ここで、ケーパビリティの継続機能の利用をしめす短い例をお見せしましょう。
この定義は、56k モデム接続、115200 bps の最初のシリアルポート、
パリティ無し、
標準の行編集文字とファイル終端文字付きの Hayes コマンド集合の使用を
定義しています。
arpavax エントリは、UNIX-57600 エントリのすべてを含み、
それに加えて arpavax 用の電話番号を含んでいます
(この場合は @ 文字であり、電話番号は環境変数から取得されます)。
.Bd -literal
UNIX-57600:\e
:dv=/dev/cuaa0:el=^D^U^C^S^Q^O@:oe=^D:du:at=hayes:br#115200:pa=none:
arpavax|ax:\e
:pn=\e@:tc=UNIX-57600
.Ed
.Sh 関連ファイル
.Bl -tag -width /etc/remote -compact
.It Pa /etc/remote
.Pa /etc
に置かれた
.Nm リモート
ホスト記述ファイル。
.El
.Sh 関連項目
.Xr cu 1 ,
.Xr tip 1 ,
.Xr phones 5
.Sh 歴史
.Nm
ファイル書式は
.Bx 4.2
から登場しました。
.Sh バグ
.Xr tip 1
ユーティリティは、シリアルポートのデータレートに、
シリアルポート用のシステムデフォルトではなく、
独自の表現を使用します。
