freebsd/freebsd-doc/ja_JP.eucJP/man/man5/resolver.5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)resolver.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/resolver.5,v 1.5.2.1 1999/08/29 16:46:50 peter Exp %
.\" jpman %Id: resolver.5,v 1.3 1998/07/22 02:40:21 issei Stab %
.\"
.Dd November 11, 1993
.Dt RESOLVER 5
.Os BSD 4
.Sh 名称
.Nm resolver
.Nd リゾルバ設定ファイル
.Sh 書式
.Nm resolv.conf
.Sh 解説
.Xr resolver 3
はインターネットドメインネームシステムへのアクセスを提供する
C ライブラリのルーチン群です。
リゾルバ設定ファイルは、はじめてリゾルバルーチンがプロセスによって呼び出
されたときに読み込まれる情報を含んでいます。
ファイルは人に可読なように設計されており、様々な種類のリゾルバ情報を
提供する、値を伴うキーワードのリストを含んでいます。
.Pp
普通に構成されたシステムでは、このファイルは必要ではありません。
問い合わせされる唯一のネームサーバはローカルマシン上にあり、ホスト名
からドメイン名が決定され、ドメインの検索パスがそのドメイン名から作成
されます。
.Pp
様々な設定オプションは以下の通りです。
.Bl -tag -width nameserver
.It Sy nameserver
リゾルバが問い合わせをするネームサーバのインターネットアドレス
(ドット表記)です。
キーワード毎に 1 つづつ、計
.Dv MAXNS
(現状では 3)台までのネームサーバが記述できます。
複数のサーバが記述されている場合、リゾルバライブラリは記述された順に
問い合わせを出します。
.Sy nameserver
エントリが記述されていない場合、デフォルトではローカルマシン上のネーム
サーバを使用します
(ここで使われるアルゴリズムは以下のようになります。まず、あるネーム
サーバに問い合わせを試みます。この問い合わせがタイムアウトになれば、
次のネームサーバに問い合わせを試み、これをネームサーバがなくなるまで
続けます。応答がない場合、この一連の問い合わせの試みをリトライ最大回
数に達するまで繰り返します)。
.It Sy domain
ローカルドメイン名。
そのドメイン内での名前の問い合わせのほとんどが、ローカルドメインにおける
短い名前を使用することができます。
.Sy domain
エントリが記述されていない場合、
.Xr gethostname 3
で得たローカルホスト名からドメインを決定します。
ドメイン部は最初の `.' 以降の全てとなります。
ホスト名がドメイン部を含んでいない場合、最終的にはルートドメインが使用されます。
.It Sy search
ホスト名調査のための検索リスト。
通常、検索リストはローカルドメイン名から決定されます。
デフォルトでは、ローカルドメイン名のみを含みます。
検索リストは、
.Sy search
キーワードの後にスペースまたはタブで区切られたドメイン検索パス名を羅列することで
変更できます。
ほとんどのリゾルバの問い合わせは、検索パスの各構成要素を一致するエントリが
見つかるまでまで順に試します。
記述されたドメインのサーバがローカルではない場合、この処理は低速で多くの
ネットワークトラフィックを発生させる可能性があることと、それらのいずれかの
ドメインに関して、使用可能なサーバが 1 つも存在しない場合には問い合わせが
タイムアウトすることに注意する必要があります。
.Pp
現在のところ、検索リストは 6 ドメイン、計 256 文字に制限されます。
.It Sy sortlist
sortlist を用いて gethostbyname により返されるアドレスをソートできます。
sortlist は IP アドレスとネットマスクの組で指定されます。
ネットマスクはオプションであり、
デフォルトのネットマスクはネットに対する自然なネットマスク (natural netmask)
です。
IP アドレスとオプションのネットマスクの組はスラッシュで区切ります。
10 組まで指定可能です。
.Pp
例 sortlist 130.155.160.0/255.255.240.0 130.155.0.0
.It Sy options
options によりリゾルバの内部変数を修正できます。
文法は
.Pp
\fBoptions\fP \fIoption\fP \fI...\fP
.Pp
であり、
.Sy option
は以下のいずれかです:
.Pp
.Bl -tag -width no_tld_query
.It Sy debug
_res.options の
.Dv RES_DEBUG
を設定します。
.It Sy ndots:n
.Em 最初の絶対問い合わせ
が行われる前に、
.Fn res_query
(
.Xr resolver 3
参照) に与えられる名前に含まれるべきドット数の閾値を設定します。
.Em n
のデフォルトは
.Dq 1
です。これは、名前中にドットがあれば、
.Em search list
要素が追加される前に、
その名前がまず絶対名として試されることを意味します。
.It Sy no_tld_query
リゾルバにトップレベルのドメイン名、すなわちドットを持たない名前を
解決しないようにさせます。
このオプションを使用しても、リゾルバが与えられた名前を使用して標準の
.Sy domain
と
.Sy search
のルールに従うことを防ぐことはできません。
.El
.Pp
options は
.Dv RES_OPTIONS
環境変数を使用して、空白またはタブ区切りのリストとして指定できます。
.El
.Pp
.Sy domain
と
.Sy search
キーワードは排他的です。
これらのキーワードが 1 つ以上記述されている場合、
最後のキーワードが有効になります。
.Pp
キーワードと値は同一行に存在する必要があり、キーワード
(例えば
.Sy nameserver )
は行の先頭にある必要があります。
値はキーワードに続いて空白で区切って記述します。
.Sh 関連ファイル
.Bl -tag -width /etc/resolv.conf -compact
.It Pa /etc/resolv.conf
.Nm resolv.conf
は
.Pa /etc
に存在します。
.El
.Sh 関連項目
.Xr gethostbyname 3 ,
.Xr resolver 3 ,
.Xr hostname 7 ,
.Xr named 8
.Rs
.%T "Name Server Operations Guide for BIND"
.Re
.Sh 歴史
.Nm resolv.conf
ファイルフォーマットは
.Bx 4.3
から登場しました。
