freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rpc.5
.\" %FreeBSD: src/lib/libc/rpc/rpc.5,v 1.6.2.1 2000/12/14 14:10:34 ru Exp %
.\" @(#)rpc.5	2.2 88/08/03 4.0 RPCSRC; from 1.4 87/11/27 SMI;
.\" jpman %Id: rpc.5,v 1.3 1998/06/25 08:44:57 jsakai Stab %
.Dd September 26, 1985
.Os
.Dt RPC 5
.Sh 名称
.Nm rpc
.Nd rpc プログラム番号データベース
.Sh 書式
/etc/rpc
.Sh 解説
.Pa /etc/rpc
ファイルには、rpc プログラム番号の代わりに使用可能な、
ユーザが可読な名前が記述されています。
各行は以下の情報から成ります。
.Pp
.Bl -bullet -compact
.It
rpc プログラムのサーバ名
.It
rpc プログラム番号
.It
別名
.El
.Pp
各項目は任意個の空白文字もしくはタブ文字で分けられます。
``#'' はコメントの開始を示します。
行末までの文字はファイルを検索するルーチンには解釈されません。
.Sh 関連ファイル
.Bl -tag -compact -width /etc/rpc
.Pa /etc/rpc
.El
.Sh "関連項目"
.Xr getrpcent 3
