freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rpc.5
.\" @(#)rpc.5	2.2 88/08/03 4.0 RPCSRC; from 1.4 87/11/27 SMI;
.\" jpman $Id: rpc.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.Dd "September 26, 1985"
.Dt RPC 5
.Sh 名称
.Nm rpc
.Nd rpc プログラム番号データベース
.Sh 書式
/etc/rpc
.Sh 解説
.Pa /etc/rpc
ファイルには、rpc プログラム番号の代わりに使用可能な、
ユーザが可読な名前が記述されています。
各行は以下の情報から成ります。
.Pp
.Bl -bullet -compact
.It
rpc プログラムのサーバ名
.It
rpc プログラム番号
.It
別名
.El
.Pp
各項目は任意個の空白文字もしくはタブ文字で分けられます。
``#'' はコメントの開始を示します。
行末までの文字はファイルを検索するルーチンには解釈されません。
.Sh 関連ファイル
.Bl -tag -compact -width /etc/rpc
.Pa /etc/rpc
.El
.Sh "関連項目"
.Xr getrpcent 3
