freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rpc.5
.\" $NetBSD: rpc.5,v 1.3 2000/06/15 20:05:54 fvdl Exp %
.\" %FreeBSD: src/lib/libc/rpc/rpc.5,v 1.10 2001/03/20 08:51:20 ru Exp %
.\" @(#)rpc.4 1.17 93/08/30 SMI; from SVr4
.\" Copyright 1989 AT&T
.\" $FreeBSD$
.Dd December 10, 1991
.Os
.Dt RPC 5
.Sh 名称
.Nm rpc
.Nd rpc プログラム番号データベース
.Sh 書式
.Pa /etc/rpc
.Sh 解説
.Nm
ファイルには、RPC プログラム番号の代わりに使用可能な、
ユーザが可読な名前が記述されています。
各 RPC プログラムに対し、以下の情報からなる 1 行が存在します。
.Pp
.Bl -enum -compact
.It
RPC プログラム名
.It
RPC プログラム番号
.It
別名
.El
.Pp
各項目は任意個の空白文字もしくはタブ文字で分けられます。
ハッシュ
.Pq Dq Li #
はコメントの開始を示します。
行末までの文字はファイルを検索するルーチンには解釈されません。
.Sh 使用例
以下は RPC データベースの例です。
.Bd -literal
#
#	rpc
#
rpcbind		100000	portmap	sunrpc portmapper
rusersd		100002	rusers
nfs		100003	nfsprog
mountd		100005	mount	showmount
walld		100008	rwall	shutdown
sprayd		100012	spray
llockmgr	100020
nlockmgr	100021
status		100024
bootparam	100026
keyserv		100029	keyserver
.Ed
.Sh 関連ファイル
.Bl -tag -width /etc/nsswitch.conf -compact
.It Pa /etc/nsswitch.conf
.El
.Sh "関連項目"
.Xr getrpcent 3
