freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rrenumd.conf.5
.\"	%KAME%
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %FreeBSD: src/usr.sbin/rrenumd/rrenumd.conf.5,v 1.4.2.1 2000/07/15 07:36:54 kris Exp %
.\"
.\" jpman %Id: rrenumd.conf.5,v 1.3 2000/04/26 12:31:00 takaha Stab %
.\" WORD: Full Qualified Domain Name	完全な形でのドメイン名 [rc.conf.5]
.Dd Nov 5, 1998
.Dt RRENUMD.CONF 5
.Os KAME
.Sh 名称
.\"
.Nm rrenumd.conf
.Nd ルータリナンバリングデーモンの設定ファイル
.\"
.Sh 解説
rrenumd 設定ファイルは、
どのようにルータリナンバリング (ルータの番号付け直し) パケットを構成するか、
そしてこのパケットをどの終点に送信するかを記述します。
このファイルは、セミコロン (`;') で終端される文の連続から成ります。
文は、空白で区切られるトークンから成ります。
空白は、ブランク、タブ、改行の任意の組み合わせから成ります。
この構造により、
設定中で互いに関連のある部分の識別が単純になります。
.Ql #
から開始する行はコメントです。
.\"
.Sh メタ文法
パーサが完全に合致することを期待するキーワードと特殊文字は、ボールド (
.Ic bold
) フォントで示します。
パラメータは下線 (
.Ar underline
) で示します。
角括弧 (`[' と `]') 中に示されるパラメータは、
省略可能なキーワードとパラメータを表現するために使用します。
垂直バー (`|') は、省略可能なパラメータからの選択を表現するために使用します。
カーリーブレース (`{' と `}') は、
必要時にキーワードとパラメータをグループ化するために使用します。
.\"
.Sh インタフェース指定
文によっては、インタフェースの指定が可能または指定が必要なものがあります。
インタフェースは、
.Ar lo0
や
.Ar ep1
のように、"名前 ユニット" の書式で指定します。
.\"
.Sh 設定文
.Bl -tag -width Ds
.\"
.It Ic debug on|off ;
設定ファイルのパーサのデバッギングを有効にします。
.Ic on
指定時にはデバッギングが有効になり、
.Ic off
指定時にはデバッギングが無効になります。
デフォルトでは無効です。
.\"
.It Ic dest Ar dest-list Op Ar retrycmd ;
ルータリナンバリングメッセージを送る終点を指定します。
.Ar dest-list
は、単一もしくは複数の、
数値指定の IPv6 アドレスまたは完全な形でのドメイン名の、任意の組み合わせです。
.Ar retrycmd
の文法は次の通りです。

.\"
.Bl -tag -width Ds -compact
.It Ic retry Ar retry-num
.Ar retry-num
は、何回繰り返してルータリナンバリングメッセージを送信するかを指定します。
.El
.It Op Ic add|change|setglobal
.Cm match-prefix Ar match-prefix-val
.Op /match-prefix-len
.Op Cm maxlen Ar maxlen-val
.Op Cm minlen Ar minlen-val
.Op Cm use-prefix Ar use-prefix-val
.Op /use-prefix-len
.Op Cm keeplen Ar keeplen-val
.Op Ar use-prefix-values ;
.Pp
seqnum 0 で送信する、ルータリナンバリングメッセージの内容を指定します。
.Cm add|change|setglobal
が指定されないと、
.Cm add
が仮定されます。
.Ar use-prefix-values
の文法は次の通りです。
.Pp
{
.Op Cm vltime Ar vltime-val
.Op Cm pltime Ar pltime-val
.Op Cm raf_onlink Cm on|off
.Op Cm raf_auto Cm on|off
.Op Cm rrf_decrprefd Cm on|off
.Op Cm rrf_decrvalid Cm on|off
}
.Pp
各値は次の意味を持ちます。
.Pp
.Bl -tag -width Ds -compact
.It Cm match-prefix Ar match-prefix-val Op /match-prefix-len
.Cm add|change|setglobal
コマンド適用対象の割り当て済みプレフィックスとのマッチングに使用される、
.Ar match-prefix-val
を指定します。
.Ar /match-prefix-len
は、割り当て済みプレフィックスとのマッチングに使用される
.Ar match-prefix-val
の開始部分を、10 進数のビット数で指定します。
.It Cm maxlen Ar maxlen-val
.Ar match-prefix-val
とマッチ可能なプレフィックスの最大長を、10 進数のビット数で指定します。
.It Cm minlen Ar minlen-val
.Ar match-prefix-val
とマッチ可能なプレフィックスの最短長を、10 進数のビット数で指定します。
.It Cm use-prefix Ar use-prefix-val Op /usr-prefix-len
.Cm add|change|setglobal
コマンドで追加されるプレフィックスとして使用される
.Ar use-prefix-val
を指定します。
.Ar /use-prefix-len
は、
.Cm add|change|setglobal
コマンドで追加されるプレフィックスの開始部分にコピーされる
.Ar use-prefix-val
の開始部分を、10 進数のビット数で指定します。
.It Cm keeplen Ar keeplen-val
.Ar use-prefix-val
において、
.Ar use-prefix-len
で指定された開始部分の直後の中間部分を、10 進数のビット数で指定します。
.Ar match-prefix-val
とマッチした既存プレフィックスでこれと同じビット位置の連続ビット部分が、
追加されるプレフィックスの同じビット位置にコピーされます。
.It Cm vltime Ar vmtime-val
追加されるプレフィックスのプレフィックス有効期間を、
.Ar time
に割り当てます。
.Ar time
に有効な値は、10 進数の秒数か、特殊フォーマット "d00h00m00s00" です。
ここで 00 は任意の 10 進数を取り、"d" は日数を、"h" は時間数を、"m" は
分数を、"s" は秒数を意味します。
また、特殊キーワード "infinity" も指定可能です。
.It Cm pltime Ar pltime-val
追加されるプレフィックスのプレフィックス推奨有効期間を、
.Ar time
に割り当てます。
.Ar time
に有効な値は、
.Ar vltime-val
と同じです。
.It Cm raf_onlink Cm on|off
追加されるプレフィックスが、
割り当てられるインタフェースに対し、
オンリンクまたはオフリンクのどちらかの属性を持たせます。
.Cm on
指定時には、
プレフィックスはオンリンク属性 (プレフィックスはリンクに属する) を持ちます。
.Cm off
指定時には、
プレフィックスはオフリンク属性 (プレフィックスはリンクに属さない) を持ちます。
.It Cm raf_auto Cm on|off
追加されるプレフィックスに対し、
自律的アドレス自動設定を有効化または無効化します。
.Cm on
指定時には、自律的アドレス自動設定が有効です。
.Cm off
指定時には、無効です。
.It Cm rrf_decrprefd Cm on|off
pltime の減算を有効化または無効化します。
.Cm on
指定時には、pltime の減算は有効です。
.Cm off
指定時には、pltime の減算は無効です。
.It Cm rrf_decrvalid Cm on|off
vltime の減算を有効化または無効化します。
.Cm on
指定時には、vltime の減算は有効です。
.Cm off
指定時には、vltime の減算は無効です。
.El
.\"
.It seqnum Ar seqnum-val { Ar rrenum-cmd } ;
特定の seqnum で送信するルータリナンバリングメッセージを指定します。
それぞれの
.Ar seqnum-val
が異なる場合には、この文を複数指定可能です。
.Ar rrenum-cmd
は、前述の add|change|setglobal 文のものとまったく同じ文法です。
.El
.\"
.Sh 使用例
以降に示す各設定ファイル例では、
fec0:0:0::/48 および各自のサブネット番号で開始する各自のプレフィックスを、
各 IPv6 サブネットが持つことを仮定しています
(この場合サブネット番号は、
プレフィックスの 7 番目と 8 番目のオクテット値です)。
.Pp
各サブネットに fec0:1:1::/48 から開始するプレフィックスを割り当てたい場合、
各ルータが IPv6 マルチキャストフォワーディングをサポートしていれば、
次の設定で十分でしょう。
サブネット番号は、既存の fec0:0:0::/48 プレフィックスと、
新規に割り当てられる fec0:1:1::/48 プレフィックスでは、同一です。
.\"
.Bd -literal -offset indent
dest ff05::2;

add match-prefix fec0:0:0:: /48 use-prefix fec0:1:1:: /48 keeplen 16;
.Ed
.\"

ルータが IPv6 マルチキャストフォワーディングをサポートしない場合、
.Cm dest
コマンドで各々の終点を指定する必要があります。
.\"
.Bd -literal -offset indent
dest fec0:0:0:1:260:8ff:fe24:fb3a fec0:0:0:2:200:eff:fe2e:dfe1 fec0:0:0:3:5254:ff:fedc:5217;

add match-prefix fec0:0:0:: /48 use-prefix fec0:1:1:: /48 keeplen 16;
.Ed
.\"

リナンバリングを行う場合、次の手順で行うのが自然です。
.Bl -enum -offset indent
.It
新規プレフィックスを割り当てます。
.It
古いプレフィックスの有効期間を、適切な移行期間長に設定します。
次の例では、有効期間として 1 週間を使用し、
推奨有効期間として 0 を使用しています。
また、古いプレフィックスに対し、有効期間の期限切れ機能を有効にします
(デフォルトでは、静的であり期限切れにはなりません)。
.It
移行期間後、古いプレフィックスは無効になるはずで、
除去されてしまったかもしれません。
除去されたことを確認するには、
マッチプレフィックスが古いプレフィックスで、使用プレフィックスを指定しない、
新規ルータリナンバリングメッセージを送ります。
.El
.\"
次の設定ファイルが 1 と 2 を行います。
.\"
.Bd -literal -offset indent
dest ff05::2;

seqnum 0 {
	add match-prefix fec0:0:0:: /48 use-prefix fec0:2:2:: /48 keeplen 16;
	};

seqnum 1 {
	change match-prefix fec0:1:1:: /48 use-prefix fec0:1:1:: /48 keeplen 16 vltime d7 pltime 0 rrf_decrvalid on rrf_decrprefd on;
	};
.Ed
.\"

次の設定ファイルが 3 を行います
(1 週間後にルータリナンバリングメッセージを送信するために使用します)。
.\"
.Bd -literal -offset indent
dest ff05::2;

change match-prefix fec0:1:1:: /48;
.Ed
.\"

前記の例では、
.Cm add
と
.Cm change
のコマンドのみを使用し、
.Cm setglobal
コマンドの例はありません。
.Cm setglobal
コマンドは、
.Cm change
コマンドとほとんど同じですが、
定義済みの IPv6 グローバルアドレスをすべて削除することが違います。

.Sh 関連項目
.Xr rrenumd 8 ,
.Xr prefix 8
.Sh 歴史
.Nm
設定ファイルは KAME IPv6 プロトコルスタックキットではじめて登場しました。
.\" .Sh BUGS
.\" (to be written)
