freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rtadvd.conf.5
.\"	%FreeBSD: src/usr.sbin/rtadvd/rtadvd.conf.5,v 1.1.2.5 2001/07/03 11:02:14 ume Exp %
.\"	$KAME: rtadvd.conf.5,v 1.35 2001/05/25 07:40:22 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/rtadvd.conf.5,v 1.7 2001/05/14 01:09:31 horikawa Exp $
.\"
.Dd May 17, 1998
.Dt RTADVD.CONF 5
.Os
.Sh 名称
.Nm rtadvd.conf
.Nd ルータ通知デーモンの設定ファイル
.Sh 解説
このファイルには各インタフェースに対して、
ルータ通知パケットをどのように組み立てなければならないかを記述します。
.Pp
.Xr rtadvd 8
の記述のように、特別な設定が必要で無い限りにおいては、
この設定ファイルを設定する必要はまったくありません。
このファイルがまったく存在しなくてかまいません。
この場合、
.Nm rtadvd
デーモンは、仕様で指定されるデフォルト値を仕様して、自己を自動設定します。
.Pp
記述方法は有名な
.Xr termcap 5
ファイルのフォーマットに従います。
ファイル中の各行にはネットワークインタフェースを記述します。
フィールドはコロン
.Pq \&:
により区切られ、
各フィールドは 1 つのケーパビリティの記述を含みます。
行は
.Sq \e
により次の行へ続けることができます。
コメントは
.Sq \&#
で始まります。
.Pp
.Sh ケーパビリティ
ケーパビリティは ICMPv6 ルータ通知メッセージを埋めるため、また
.Xr rtadvd 8
の振る舞いを制御するための値を記述します。
したがって、もしサンプルの定義ファイルを変更したいのであれば、
前述のように IETF 近隣探索文書を読むことが推奨されます。
.Pp
ほとんど全ての項目はデフォルト値を持っていることに
注意してください。
項目を省略すると、項目のデフォルト値が使用されます。
.Pp
ルータ通知を送信する間隔を制御するための 2 つの項目があります。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&maxinterval
(数値) 要請されていないマルチキャストルータ通知を送信する間隔の
最大時間です
.Pq 単位 : 秒
。デフォルト値は 600です。この値は 4 以上 1800 以下でなければなりません。
.It Cm \&mininterval
(数値) 要請されていないマルチキャストルータ通知を送信する間隔の
最小時間です
.Pq 単位 : 秒
。デフォルト値は
.Cm maxinterval
の 3 分の 1 の値です。
この値は 3 以上 .75 * 
.Cm maxinterval
の値以下でなければなりません。
.El
.Pp
以下の項目は ICMPv6 ルータ通知メッセージヘッダのためのものです。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&chlim
(数値) カレント中継限界数フィールドに対する値です。
デフォルト値は 64 です。
.It Cm \&raflags
(数値) ルータ通知メッセージヘッダのフラグフィールドです。
7 ビット目
.Po
.Li 0x80
.Pc
は 管理アドレス設定フラグのビットを意味します。
そして 6 ビット目
.Po
.Li 0x40
.Pc
はアザーステートフル設定フラグビットを意味します。
4 ビット目
.Po
.Li 0x10
.Pc
と 3 ビット目
.Po
.Li 0x08
.Pc
は、ルータの推奨度をコード化するために使用されます。
0x01 は高を、0x00 は中を、0x11 は低をそれぞれ意味します。
デフォルト値は 0 です。
.It Cm \&rltime
(数値) ルータ有効期間フィールドです
.Pq 単位 : 秒
。この値は 3600000 以下でなければなりません。
.Nm rtadvd
がホスト上で実行される場合、
.Xr rtadvd 8
で記述されているように、通知中の全インタフェース上で、
この値を明示的に 0 に設定する必要があります。
デフォルト値は 1800 です。
.It Cm \&rtime
(数値) 到達可能時間フィールドです
.Pq 単位 : ミリ秒
。デフォルト値は 0 であり、これはこのルータにより
指定されないことを意味しています。
.It Cm \&retrans
(数値) 再送タイマフィールドです。
.Pq 単位 : ミリ秒
。デフォルト値は 0 であり、これはこのルータにより
指定されないことを意味しています。
.El
.Pp
以下は ICMPv6 プレフィックス情報オプションに対する項目であり、
ルータ通知ヘッダに付与されます。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
は自動的に適切なプレフィックスをカーネルの経路表から取得して、
このプレフィックスをデフォルトパラメータと共に通知します。
.Bl -tag -width indent
.It Cm \&clockskew
(数値) リンク伝播遅延を調整するためのスキューであり、
リンク上のルータ間のクロックスキュー
.Pq 単位: 秒
。
この値は、ローカルに設定されたプレフィックスの有効期間と
通知されたプレフィックスの有効期間との無矛盾性の確認に使用されます。
この値が意味を持つのは、
ローカルルータが、リンク上のプレフィックスを、
実時間で減少する有効期付きで設定するときです。
値が 0 の場合、このようなプレフィックスに対する無矛盾性の確認は行われません。
デフォルト値は 0 です。
.It Cm \&addrs
(数値) プレフィックスの番号です。
デフォルトは 0 であり、
もし、何かプレフィックス情報オプションを指定したいのであれば、
明示的に正の値を設定しなければなりません。
もし値が 0 であれば、
.Xr rtadvd 8
はシステムの経路表を検索し、
対応するインタフェース経路のプレフィックスを通知します。
値が 1 より大きい場合、以下の各項目に対してプレフィックスの
インデックスを指定しなければなりません。
インデックスは N を
.Cm addrs
の値とすると、0 から N-1 までの値を取ります。
各インデックスは、
例えば
.Dq prefixlen2
のように、各項目の名前に続ける必要があります。
.It Cm \&prefixlen
(数値) プレフィックス長フィールドです。
デフォルト値は 64 です。
.It Cm \&pinfoflags
(数値) プレフィックス情報オプション中のフラグフィールドです。
7 ビット目
.Po
.Li 0x80
.Pc
は オンリンクフラグビットです。そして 6 ビット目
.Po
.Li 0x40
.Pc
は自律アドレス設定フラグビットです。
デフォルト値は 0xc0 であり、すなわち両方のビットが設定されています。
.It Cm \&addr
(文字列) プレフィックスフィールドに埋められるアドレスです。
.Xr termcap 5
ファイルフォーマットで、 IPv6 数値アドレスと同様に
.Dq \&:
が使われているために、フィールドはダブルクォート文字によって
クォートされなければなりません。
このフィールドは
.Cm addrs
の値が 0 より大きい場合、省略することができません。
.It Cm \&vltime
(数値) 正当な有効期間フィールドです
.Pq 単位 : 秒
。デフォルト値は 2592000 (30 日) です。
.It Cm \&vltimedecr
(ブール値) この項目は、
通知された有効期間が実時間で減らされることを意味します。
デフォルトで無効化されています。
.It Cm \&pltime
(数値) 推奨有効期間フィールドです
.Pq 単位 : 秒
。デフォルト値は 604800 (7 日) です。
.It Cm \&pltimedecr
(ブール値) この項目は、
通知された推奨有効期間が実時間で減らされることを意味します。
デフォルトで無効化されています。
.El
.Pp
以下は ICMPv6 MTU に対する項目であり、
ルータ通知ヘッダに付与されます。
この項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&mtu
(数値もしくは文字列) MTU (最大転送単位) フィールドです。
0 が指定された場合には、オプションは含まれません。
デフォルト値は 0 です。
もしこの項目に特別な文字列
.Dq auto
が指定された場合、MTU オプションは含まれ、
その値はインタフェースの MTU に自動的に設定されます。
.El
.Pp
以下は ICMPv6 始点データリンク層アドレスオプションを制御するための項目であり、
ルータ通知ヘッダに付与されます。
前述のように、この項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&nolladdr
(ブール値) デフォルトでは
.Po
もし
.Cm \&nolladdr
が指定されない場合
.Pc 、
.Xr rtadvd 8
は、インタフェースに対するデータリンク層アドレスを
カーネルから取得しようと試み、
それを始点データリンク層アドレスオプションに付与します。
もしこのケーパビリティが存在する場合、
.Xr rtadvd 8
はルータ通知パケットに、始点データリンク層アドレスオプションを付与しません。
.El
.Pp
以下は ICMPv6 ホームエージェント情報オプションを制御するための項目であり、
モバイル IPv6 サポートで定義されています。
このオプションは、他のオプション同様、ルータ通知ヘッダに付与されます。
.Bl -tag -width indent
.It Cm \&hapref
(数値) ホームエージェントの推奨を設定します。
非 0 に設定する場合、
.Cm \&hatime
もまた存在する必要があります。
.It Cm \&hatime
(数値) ホームエージェントの有効期間を指定します。
.El
.Pp
.Xr rtadvd 8
でモバイル IPv6 サポートを有効にすると、
.Cm \&maxinterval
を明示的に構成することにより、
通知間隔オプションがルータ通知パケットに付加されます。
.Pp
以下は ICMPv6 経路情報オプションを制御するための項目であり、
ルータ通知ヘッダに付与されます。
これらの項目はオプションです。
.Bl -tag -width indent
.It Cm \&routes
(数値) 経路数。
デフォルト値は 0 です。
経路情報オプションを指定したい場合には、
明示的に正の値を設定する必要があります。
この値が 0 の場合、経路情報は送信されません。
この値が 1 より大きい場合、以下の項目に対し、
経路のインデックスを指定する必要があります。
インデックスは 0 から N-1 までで、N は
.Cm routes
の数です。
インデックスは各項目の名前の後に続き、例えば
.Dq rtrplen2
となります。
.It Cm \&rtrplen
(数値) 経路情報オプション中の、プレフィックス長。
デフォルト値は 64 です。
.It Cm \&rtrflags
(数値) 経路情報オプション中の、フラグ欄。
ビット 4
.Po
.Li 0x10
.Pc
とビット 3
.Po
.Li 0x08
.Pc
が、経路の推奨度をコード化するために使用されます。
デフォルト値は 0x00 であり、中間の推奨度の経路です。
.It Cm \&rtrprefix
(文字列) 経路情報オプション中の、プレフィックス欄に埋められるプレフィックス。
.Xr termcap 5
ファイルフォーマットで、 IPv6 数値アドレスと同様に
.Dq \&:
が使われているために、フィールドはダブルクォート文字によって
クォートされなければなりません。
.Cm addrs
が 0 より大の場合、この欄は省略不可です。
.It Cm \&rtrltime
(数値) 経路情報オプション中の、経路の有効期間欄。
.Pq 単位: 秒
。
デフォルト値は 2592000 (30 日)
(現在 draft-draves-router-selection-01.txt には指定されていません)。
.El
また
.Cm tc
ケーパビリティを用いることで、他の行を参照することができます。
このケーパビリティの詳細に関しては
.Xr termcap 5
を参照してください。
.Sh 使用例
前述のように、通知される全パラメータは仕様で定義されるデフォルト値があります。
よって、特別な非デフォルト値を使用したいので無い限りにおいては手動
で設定する必要はありません。
誤った設定パラメータを使用すると、相互操作の問題が生じ得ます。
.Pp
設定パラメータを変えるには、パラメータだけを指定すれば良いです。
次の設定では、
.Xr rtadvd 8
は
.Li ne0
インタフェースのルータ有効期間パラメータを変えます。
.Bd -literal -offset
ne0:\\
	:rltime#0:
.Ed
.Pp
次の例は、
.Li ef0
インタフェースから通知されるプレフィックスを手動で設定します。
この設定は、
.Fl s
オプション付きの
.Xr rtadvd 8
で使用することが必要です。
.Bd -literal -offset
ef0:\\
	:addrs#1:addr="3ffe:501:ffff:1000::":prefixlen#64:
.Ed
.Pp
次の例は、明示的な方法でデフォルト値を示しています。
この設定は、単に参照のためだけに提供されています。
あなた自身が設定する必要はまったくありません。
.Bd -literal -offset
default:\\
	:chlim#64:raflags#0:rltime#1800:rtime#0:retrans#0:\\
	:pinfoflags#192:vltime#2592000:pltime#604800:mtu#0:
ef0:\\
	:addrs#1:addr="3ffe:501:ffff:1000::":prefixlen#64:tc=default:
.Ed
.Sh 関連項目
.Xr termcap 5 ,
.Xr rtadvd 8 ,
.Xr rtsol 8
.Pp
Thomas Narten, Erik Nordmark and W. A. Simpson,
.Do
Neighbor Discovery for IP version 6 (IPv6)
.Dc ,
RFC 2461
.Pp
Richard Draves,
.Do
Default Router Preferences and More-Specific Routes
.Dc ,
draft-ietf-ipngwg-router-selection-01.txt
.Sh 歴史
.Xr rtadvd 8
と設定ファイル
.Nm
はWIDE Hydrangea IPv6 プロトコルスタックキットではじめて登場しました。
.\" .Sh BUGS
.\" (to be written)
