freebsd/freebsd-doc/ja_JP.eucJP/man/man5/rtadvd.conf.5
.\"	$KAME: rtadvd.conf.5,v 1.8 2000/10/25 05:37:43 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/rtadvd/rtadvd.conf.5,v 1.1.2.2 2000/10/30 17:39:46 ume Exp %
.\" jpman %Id: rtadvd.conf.5,v 1.3 2000/05/01 16:07:12 yt-kage Stab %
.\"
.Dd May 17, 1998
.Dt RTADVD.CONF 5
.Os
.Sh 名称
.Nm rtadvd.conf
.Nd ルータ通知デーモンの設定ファイル
.Sh 解説
このファイルには各インタフェースに対して、
ルータ通知パケットをどのように組み立てなければならないかを記述します。
.Xr rtadvd 8
の記述のように、特別な設定が必要で無い限りにおいては、
この設定ファイルを設定する必要はまったくありません。
このファイルの作成すら、しなくてかまいません。
この場合、
.Nm rtadvd
デーモンは、仕様で指定されるデフォルト値を仕様して、自己を自動設定します。
.Pp
記述方法は有名な
.Xr termcap 5
ファイルのフォーマットに従います。
ファイル中の各行にはネットワークインタフェースを記述します。
フィールドはコロン
.Pq \&:
により区切られ、
各フィールドは 1 つのケーパビリティの記述を含みます。
行は
.Sq \e
により次の行へ続けることができます。
コメントは
.Sq \&#
で始まります。
.Pp
.Sh ケーパビリティ
ケーパビリティは ICMPv6 ルータ通知メッセージを埋めるため、また
.Xr rtadvd 8
の振る舞いを制御するための値を記述します。
したがって、もしサンプルの定義ファイルを変更したいのであれば、
前述のように IETF 近隣探索文書を読むことが推奨されます。
.Pp
ほとんど全ての項目はデフォルト値を持っていることに
注意してください。
項目を省略すると、項目のデフォルト値が使用されます。
.Pp
ルータ通知を送信する間隔を制御するための 2 つの項目があります。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&maxinterval
(数値) 要請されていないマルチキャストルータ通知を送信する間隔の
最大時間です
.Pq 単位 : 秒
。デフォルト値は 600です。この値は 4 以上 1800 以下でなければなりません。
.It Cm \&mininterval
(数値) 要請されていないマルチキャストルータ通知を送信する間隔の
最小時間です
.Pq 単位 : 秒
。デフォルト値は
.Ic maxinterval
の 3 分の 1 の値です。
この値は 3 以上 .75 * 
.Ic maxinterval
の値以下でなければなりません。
.El
.Pp
以下の項目は ICMPv6 ルータ通知メッセージヘッダのためのものです。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&chlim
(数値) カレント中継限界数フィールドに対する値です。
デフォルト値は 64 です。
.It Cm \&raflags
(数値) ルータ通知メッセージヘッダのフラグフィールドです。
7 ビット目
.Po
.Li 0x80
.Pc
は 管理アドレス設定フラグのビットを意味します。
そして 6 ビット目
.Po
.Li 0x40
.Pc
はアザーステートフル設定フラグビットを意味します。
デフォルト値は 0 です。
.It Cm \&rltime
(数値) ルータ有効期間フィールドです
.Pq 単位 : 秒
。この値は 3600000 以下でなければなりません。
デフォルト値は 1800 です。
.It Cm \&rtime
(数値) 到達可能時間フィールドです
.Pq 単位 : ミリ秒
。デフォルト値は 0 であり、これはこのルータにより
指定されないことを意味しています。
.It Cm \&retrans
(数値) 再送タイマフィールドです。
.Pq 単位 : ミリ秒
。デフォルト値は 0 であり、これはこのルータにより
指定されないことを意味しています。
.El
.Pp
以下は ICMPv6 プレフィックス情報オプションに対する項目であり、
ルータ通知ヘッダに付与されます。
これらの項目は省略可能であり、この場合には
.Nm rtadvd
は自動的に適切なプレフィックスをカーネルの経路表から取得して、
このプレフィックスをデフォルトパラメータと共に通知します。
.Bl -tag -width indent
.It Cm \&addrs
(数値) プレフィックスの番号です。
デフォルトは 0 であり、
もし、何かプレフィックス情報オプションを指定したいのであれば、
明示的に正の値を設定しなければなりません。
もし値が 0 であれば、
.Xr rtadvd 8
はシステムの経路表を検索し、
対応するインタフェース経路のプレフィックスを通知します。
値が 1 より大きい場合、以下の各項目に対してプレフィックスの
インデックスを指定しなければなりません。
インデックスは N を
.Ic addrs
の値とすると、0 から N-1 までの値を取ります。
各インデックスは、
例えば
.Dq prefixlen2
のように、各項目の名前に続ける必要があります。
.It Cm \&prefixlen
(数値) プレフィックス長フィールドです。
デフォルト値は 64 です。
.It Cm \&pinfoflags
(数値) プレフィックス情報オプション中のフラグフィールドです。
7 ビット目
.Po
.Li 0x80
.Pc
は オンリンクフラグビットです。そして 6 ビット目
.Po
.Li 0x40
.Pc
は自律アドレス設定フラグビットです。
デフォルト値は 0xc0 であり、すなわち両方のビットが設定されています。
.It Cm \&addr
(文字列) プレフィックスフィールドに埋められるアドレスです。
.Xr termcap 5
ファイルフォーマットで、 IPv6 数値アドレスと同様に
.Dq \&:
が使われているために、フィールドはダブルクォート文字によって
クォートされなければなりません。
このフィールドは
.Ic addrs
の値が 0 より大きい場合、省略することができません。
.It Cm \&vltime
(数値) 正当な有効期間フィールドです
.Pq 単位 : 秒
。デフォルト値は 2592000(30 日) です。
.It Cm \&pltime
(数値) 推奨有効期間フィールドです
.Pq 単位 : 秒
。デフォルト値は 604800(7 日) です。
.El
.Pp
以下は ICMPv6 MTU に対する項目であり、
ルータ通知ヘッダに付与されます。
この項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&mtu
(数値もしくは文字列) MTU (最大転送単位) フィールドです。
0 が指定された場合には、オプションは含まれません。
デフォルト値は 0 です。
もしこの項目に特別な文字列
.Dq auto
が指定された場合、MTU オプションは含まれ、
その値はインタフェースの MTU に自動的に設定されます。
.El
.Pp
以下は ICMPv6 始点データリンク層アドレスオプションを制御するたの項目であり、
ルータ通知ヘッダに付与されます。
前述のように、この項目は省略可能であり、この場合には
.Nm rtadvd
はデフォルト値を使用します。
.Bl -tag -width indent
.It Cm \&nolladdr
(ブール値) デフォルトでは
.Po
もし
.Cm \&nolladdr
が指定されない場合
.Pc 、
.Xr rtadvd 8
は、インタフェースに対するデータリンク層アドレスを
カーネルから取得しようと試み、
それを始点データリンク層アドレスオプションに付与します。
もしこのケーパビリティが存在する場合、
.Xr rtadvd 8
はルータ通知パケットに、始点データリンク層アドレスオプションを付与しません。
.El
.Pp
また
.Cm tc
ケーパビリティを用いることで、他の行を参照することができます。
このケーパビリティの詳細に関しては
.Xr termcap 5
を参照してください。
.Sh 使用例
.Bd -literal -offset
#
# 共通の定義
#
# 注: 以下のパラメータはすべて仕様で指定されるデフォルト値であり、
#     特別な非デフォルト値を使用したいので無い限りにおいては手動
#     で設定する必要はありません。
#
#     設定ファイルを作成する必要すらありません。 rtadvd は、通常、
#     設定ファイル無しでもうまく動作します。
#     rtadvd(8) も見てください。

#default:\\
#	:chlim#64:raflags#0:rltime#1800:rtime#30000:retrans#1000:\\
#	:pinfoflags#192:vltime#3600000:pltime#3600000:mtu#1500:
#ether:\\
#	:mtu#1500:tc=default:

# インタフェース毎の定義。
#   主に IPv6 プレフィックスがこの部分で設定されます。しかしながら、
#   rtadvd は自動的に適切なプレフィックスを kernel の経路表から取得
#   してこのプレフィックスを通知しますので、この部分を設定する必要も
#   ありません。
#   自動的な通知を好まない場合には、rtadvd を -s オプション付で起動
#   して、この部分を手動で設定してください。
 
#ef0:\\
#	:addrs#1:addr="3ffe:501:4819:1000::":prefixlen#64:tc=ether:

.Ed
.Sh 関連項目
.Xr termcap 5 ,
.Xr rtadvd 8 ,
.Xr rtsol 8
.Pp
Thomas Narten, Erik Nordmark and W. A. Simpson,
.Do
Neighbor Discovery for IP version 6 (IPv6)
.Dc ,
RFC 2461
.Sh 歴史
.Xr rtadvd 8
と設定ファイル
.Nm
はWIDE Hydrangea IPv6 プロトコルスタックキットではじめて登場しました。
.\" .Sh BUGS
.\" (to be written)
