freebsd/freebsd-doc/ja_JP.eucJP/man/man5/shells.5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)shells.5	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man5/shells.5,v 1.3.2.1 2000/12/08 14:59:16 ru Exp %
.\" jpman %Id: shells.5,v 1.3 1998/06/25 08:44:02 jsakai Stab %
.\"
.Dd June 5, 1993
.Dt SHELLS 5
.Os BSD 4.2
.Sh 名称
.Nm shells
.Nd シェルデータベース
.Sh 解説
.Nm
ファイルはシステム上のシェルのリストを格納します。
各シェルごとに 1 行ずつ、ルートからの相対でシェルのパスを記述します。
.Pp
ハッシュマーク (``#'') はコメントの開始を意味します。
それ以降行末までの文字列はファイルを検索するルーチンには解釈されません。
空行もまた無視されます。
.Sh 関連ファイル
.Bl -tag -width /etc/shells -compact
.It Pa /etc/shells
.Nm
ファイルは
.Pa /etc
にあります。
.El
.Sh 関連項目
.Xr getusershell 3
.Sh 歴史
.Nm
ファイルフォーマットは
.Bx 4.3 tahoe
から登場しました。
