freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ssh_config.5
.\"  -*- nroff -*-
.\"
.\" Author: Tatu Ylonen <ylo@cs.hut.fi>
.\" Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi>, Espoo, Finland
.\"                    All rights reserved
.\"
.\" As far as I am concerned, the code I have written for this software
.\" can be used freely for any purpose.  Any derived versions of this
.\" software must be clearly marked as such, and if the derived work is
.\" incompatible with the protocol description in the RFC file, it must be
.\" called by a name other than "ssh" or "Secure Shell".
.\"
.\" Copyright (c) 1999,2000 Markus Friedl.  All rights reserved.
.\" Copyright (c) 1999 Aaron Campbell.  All rights reserved.
.\" Copyright (c) 1999 Theo de Raadt.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $OpenBSD: ssh_config.5,v 1.1 2002/06/20 19:56:07 stevesk Exp $
.\" Japanese translation: $Id: ssh_config.5,v 1.1 2002-08-19 02:24:45 horikawa Exp $
.\" by Yusuke Shinyama <yusuke @ cs . nyu . edu>
.\"
.\" %FreeBSD: src/crypto/openssh/ssh_config.5,v 1.4.2.2 2002/07/25 16:03:44 fanf Exp %
.\" $FreeBSD$
.Dd September 25, 1999
.Dt SSH_CONFIG 5
.Os
.Sh 名称
.Nm ssh_config
.Nd OpenSSH SSH クライアント 設定ファイル
.Sh 書式
.Bl -tag -width Ds -compact
.It Pa $HOME/.ssh/config
.It Pa /etc/ssh/ssh_config
.El
.Sh 解説
.Nm ssh
は以下のものから (この順序で) 設定情報を取得します: 
コマンドラインオプション、
ユーザの設定ファイル
.Pq Pa $HOME/.ssh/config
、そしてシステム全体での設定ファイル
.Pq Pa /etc/ssh/ssh_config
。
.Pp
各設定項目にはそれそれ最初に見つかったものが使われます。
設定ファイルはいくつかのセクションに分かれており、これらは
.Dq Host
キーワードにより区切られています。あるセクションの設定が
適用されるのは、コマンドラインから与えられたホスト名が、
このキーワードで指定されているパターンのどれかにマッチするときだけです。
.Pp
各設定項目で最初に見つかった値が使われるので、ホストに特化した
宣言をファイルの先頭近くに置くようにし、一般的なものを後に置くのが
よいでしょう。
.Pp
設定ファイルは以下のような形式になっています:
.Pp
空行、および
.Ql #
で始まる行は、コメントとみなされます。
.Pp
それ以外の場合、この行は
.Dq キーワード 引数 .
という形式になっています。
キーワードと引数は、空白またはひとつの
.Ql = ;
(間に空白を含んでいてもよい) によって区切られます。
後者の形式は、
.Nm ssh ,
.Nm scp
および
.Nm sftp
などで
.Fl o
オプションを使って設定項目を指定するときに、
空白をクォートする必要がないようにするためです。
.Pp
とりうるキーワードとその意味は以下のとおりです 
(キーワードは大文字小文字どちらでもかまいませんが、
その引数は大文字小文字が区別されることに注意してください) :
.Bl -tag -width Ds
.It Cm Host (ホスト)
これ以後の (次の
.Cm Host
キーワードが現れるまでの) 設定項目を、ここで
指定されたパターンのどれかにマッチするホストだけに
制限します。パターン中では
.Ql \&*
と
.Ql ?
がワイルドカードとして使えます。単独の
.Ql \&*
は、すべてのホストに対するデフォルトとして使えます。
ここでいうホストとは、コマンドライン引数で与えられた
.Ar ホスト名
そのもののことです
(つまり、ホスト名はマッチングの前に正規化されたりしません)。
.It Cm AFSTokenPassing (AFS トークンパス)
リモートホストに AFS トークンを渡すかどうかを指定します。
この引数がとりうる値は
.Dq yes
あるいは
.Dq no
のどちらかになります。
このオプションはプロトコル バージョン 1 でのみ有効です。
.It Cm BatchMode (バッチ処理モード)
これが
.Dq yes
に設定されていると、パスフレーズおよびパスワードの
入力を求めないようになります。このオプションはスクリプトなどにおける
バッチ処理中で、パスワードを打ち込むユーザがいない場合に便利です。
引数の値は 
.Dq yes
あるいは
.Dq no
です。
デフォルトは
.Dq no (パスワードあるいはパスフレーズの入力を求める)
です。
.It Cm BindAddress (bind するアドレス)
複数のインターフェイスあるいはエイリアスされたアドレスを
もっているマシンで、通信に使うインターフェイスを指定します。
このオプションは
.Cm UsePrivilegedPort
項目が
.Dq yes
になってるときは機能しないので注意してください。
.It Cm ChallengeResponseAuthentication (チャレンジ・レスポンス認証)
チャレンジ・レスポンス認証をおこなうかどうかを指定します。
この引数がとりうる値は
.Dq yes
あるいは
.Dq no
です。デフォルトでは
.Dq yes (チャレンジ・レスポンス認証をおこなう)
になっています。
.It Cm CheckHostIP (ホスト IP の検査)
このオプションが
.Dq yes
に設定されていると、ssh は接続先ホスト名の IP アドレスが
.Pa known_hosts
に書かれている同一ホスト名 IP アドレスと同じかどうか
検査するようになります。
これによって、DNS 詐称によりホスト鍵が変えられたことを
検出できます。このオプションが
.Dq no
に設定されている場合は、この検査はおこなわれません。
デフォルトでは、これは
.Dq no (ホスト IP アドレスの検査をおこなわない)
になっています。
.It Cm Cipher (暗号化アルゴリズム)
プロトコル バージョン 1 のセッションで使う暗号化の
アルゴリズムを指定します。現在のところ
Currently,
.Dq blowfish 
.Dq 3des
および
.Dq des
がサポートされており、デフォルトは
.Dq 3des
です。
.Ar des
は、
.Ar 3des
暗号をサポートしていない、もはや古くなったプロトコル 1 の実装と
相互運用するためにのみサポートされています。
この暗号は弱いため、使用はおすすめしません。
.It Cm Ciphers (複数の暗号化アルゴリズム)
プロトコル バージョン 2 で使う暗号化アルゴリズムの
優先順位を指定します。複数の暗号化アルゴリズムを
カンマで区切って指定します。
デフォルトは
.Pp
.Bd -literal
  ``aes128-cbc,3des-cbc,blowfish-cbc,cast128-cbc,arcfour,
    aes192-cbc,aes256-cbc''
.Ed
の順になっています。
.It Cm ClearAllForwardings (すべてのポート転送をキャンセル)
設定ファイルあるいはコマンドラインで指定された、
ローカル、リモートおよびダイナミックなポート転送をすべて
キャンセルします。このオプションは設定ファイルで指定されている
ポート転送を
.Nm ssh
のコマンドラインで打ち消すためにあり、
.Xr scp 1
や
.Xr sftp 1
で自動的に使われます。この引数の値は
.Dq yes
あるいは
.Dq no
です。デフォルトでは
.Dq no
になっています。
.It Cm Compression (圧縮)
データ圧縮をおこなうかどうかを指定します。
引数の値は
.Dq yes
あるいは
.Dq no
です。
デフォルトでは
.Dq no (圧縮をおこなわない)
になっています。
.It Cm CompressionLevel (圧縮レベル)
圧縮をおこなうさいの圧縮レベルを指定します。
この引数がとる値は
整数の 1 (速い) から 9 (遅い、高圧縮率) までです。
デフォルトの値は 6 で、ほとんどのアプリケーションにはこれで充分です。
この値の意味は
.Xr gzip 1
と同じです。
このオプションはプロトコル バージョン 1 のみに適用されることに
注意してください。
.It Cm ConnectionAttempts (接続試行回数)
接続を試みる回数 (1秒に一回) を指定します。これを越えると
ssh は終了してしまいます。この値は整数で
なければなりません。これは、ときどき接続に失敗する環境での
スクリプトなどに便利です。
デフォルトは 1回です。
.It Cm DynamicForward (動的なポート転送)
暗号化された通信路を経由して、ローカルホスト側の TCP/IP ポートを
転送するよう指定します。このとき、どのリモートホストから
接続するかを決定するためにアプリケーションレベルのプロトコルが
使われます。このオプションの引数はポート番号である必要があります。
今のところ SOCKS4 プロトコルが使われており、
.Nm ssh
は SOCKS4 サーバのようにふるまいます。
複数のポート転送も指定でき、コマンドラインからこれを追加することも
できます。特権ポートを転送できるのは root だけです。
.It Cm EscapeChar (エスケープ文字)
エスケープ文字を設定します (デフォルトは
.Ql ~ 
)。エスケープ文字はコマンドラインからも指定できます。
この引数には 1つの文字か、
.Ql ^
に1文字を付けたもの、あるいはエスケープ文字の使用をすべて禁止するなら
.Dq none
を指定します (これはその接続を、バイナリ
データに対して透過にすることになります)。
.It Cm ForwardAgent (エージェント転送)
認証エージェントへの接続を、(それが存在する時は) リモートマシン上に
転送するかどうかを指定します。この引数の値は
.Dq yes
あるいは
.Dq no
でなければならず、デフォルトは
.Dq no (エージェント転送をおこなわない)
です。
.It Cm ForwardX11 (X11 転送)
X11 接続を自動的に安全な通信路へリダイレクトし、
.Ev DISPLAY
を設定するかどうかを指定します。この引数の値は
.Dq yes
あるいは
.Dq no
でなければならず、デフォルトは
.Dq no (X11 接続を転送しない)
です。
.It Cm GatewayPorts (ポート転送の中継)
ローカルからリモートへ転送されている (リモート→ローカルのポート転送)
ポートに、他ホストからの接続を許すかどうかを指定します。
デフォルトでは、
.Nm ssh
は転送されたローカルポートをループバックアドレス (127.0.0.1) に
bind します。このため他の (訳注: サーバ以外の) ホストが
転送されたポートに接続することはできません。
.Cm GatewayPorts
を使うと、
.Nm ssh
は転送されたローカルポートをワイルドカードアドレス (0.0.0.0) に
bind するようになります。これは他のホストもその転送されたポートに
接続できるということです。
この引数の値は
.Dq yes
または
.Dq no
で、デフォルトは
.Dq no (転送されているポートに他ホストからの接続を許可しない)
に設定されています。
.It Cm GlobalKnownHostsFile (大域的 known_host ファイル)
そのホスト全体で
.Pa /etc/ssh/ssh_known_hosts
のかわりに使用するホスト鍵データベースファイルを指定します。
.It Cm HostbasedAuthentication (ホストベース認証)
ホスト間認証を使った rhosts ベースの認証をおこなうかどうかを指定します。
とりうる引数の値は
.Dq yes
または
.Dq no
で、デフォルトは
.Dq no (ホストベース認証を試みない)
になっています。
このオプションはプロトコル バージョン 2 のみに適用され、
.Cm RhostsRSAAuthentication
と似ています。
.It Cm HostKeyAlgorithms (ホスト間認証のアルゴリズム)
プロトコル バージョン 2 において、ホスト間認証で使われる
アルゴリズムを指定します。クライアントはここで指定された
優先順位のアルゴリズムを使って認証を試みます。
このオプションのデフォルトは
.Dq ssh-rsa,ssh-dss
です。
.It Cm HostKeyAlias (ホスト鍵のエイリアス)
ホスト鍵データベースからホスト鍵を検索するとき、あるいは
データベースにホスト鍵を保存するときに、実際のホスト名のかわりに
使われる名前を指定します。
このオプションは ssh 接続をトンネリングしているときや、
単一のホスト上で複数の sshd サーバを動かしているときなどに
便利です。
.It Cm HostName (実際のホスト名)
実際にログインするホスト名を指定します。デフォルトでは
.Nm
はコマンドラインで与えられたホスト名に接続しますが、
これを使うと、ホストのニックネームや省略形を使用することができます。
数字の IP アドレスでもかまいません
(コマンドライン、
.Cm HostName
キーワードの両方とも)。
.It Cm IdentityFile (identity ファイル)
ユーザの RSA または DSA 認証用 identity (秘密鍵) を
読むファイルを指定します
(デフォルトは、プロトコル バージョン 1 の場合
ユーザのホームディレクトリにある
.Pa $HOME/.ssh/identity
ファイルが、プロトコル バージョン 2 の場合は
.Pa $HOME/.ssh/id_rsa
および
.Pa $HOME/.ssh/id_dsa
が使われます)。
これに加えて、認証エージェントによって現れる identity も使われます。
ユーザのホームディレクトリを表すのにチルダ表記を使うこともできます。
設定ファイルでは複数の identity を指定することもでき、
この場合すべての identity が順に試されます。
.It Cm KeepAlive (接続を生かしておく)
システムが相手のマシンに TCP keepalive メッセージを送るかどうかを
指定します。これが送られると、接続の異常終了や相手マシンの
クラッシュが正しく通知されるようになります。
しかしこれを使うと、たとえ経路が一時的にダウンしていても
接続が死んでいるということになってしまい、これが邪魔になる場合もあります。
.Pp
デフォルトは
.Dq yes (keepalive を送る)
です。そのため
クライアントはネットワークがダウンするか、
リモートホストが落ちると通知してきます。
これはスクリプト中では重要であり、多くのユーザもこれを望んでいます。
.Pp
Keepalive を禁止するには、この値を
.Dq no
にする必要があります。
.It Cm KerberosAuthentication (Kerberos 認証)
Kerberos 認証をおこなうかどうか指定します。この引数の値は
.Dq yes
あるいは 
.Dq no
です。
.It Cm KerberosTgtPassing (Kerberos TGT パス)
Kerberos TGT がサーバを転送するかどうかを指定します。これは
その Kerberos サーバが実際に AFS kaserver であるときのみ
機能します。この引数の値は
.Dq yes
あるいは
.Dq no
です。
.It Cm LocalForward (ローカル→リモート転送)
ローカルマシンの TCP/IP ポートを、安全な通信路を経由して
リモートマシン上から与えられた host:port に転送するよう指示します
(訳注: -L オプションと同じ)。
最初の引数は転送するローカルホストのポートを、2番目の引数には転送先を
.Ar host:port 
の形で指定します。
IPv6 アドレスはこれとは別の
.Ar host/port
という形式で指定します。ポート転送は複数指定することができ、
コマンドラインから追加指定することもできます。
特権ポートを転送できるのはスーパーユーザだけです。
.It Cm LogLevel (ログレベル)
.Nm
が出力するログの冗長性のレベルを指定します。
とりうる値は次のとおりです:
QUIET, FATAL, ERROR, INFO, VERBOSE, DEBUG, DEBUG1, DEBUG2
および DEBUG3。
デフォルトでは INFO になっています。DEBUG と DEBUG1 は等価です。
DEBUG2、DEBUG3 はそれぞれさらに冗長なログになります。
.It Cm MACs (メッセージ認証コード)
使用する MAC (メッセージ認証コード) アルゴリズムの優先順位を指定します。
MAC アルゴリズムはプロトコル バージョン 2 で使われる、
データの改竄を防ぐ機構 (data integrity protection) です。
複数のアルゴリズムをカンマで区切って指定します。
デフォルトは
.Dq hmac-md5,hmac-sha1,hmac-ripemd160,hmac-sha1-96,hmac-md5-96
の順になっています。
.It Cm NoHostAuthenticationForLocalhost (localhostでのホスト認証を抑制)
このオプションはホームディレクトリがマシン間で共有されているときに
使います。このような状況ではそれぞれ別々のマシンで localhost のさす
ホストが異なっているため、ユーザはホスト鍵が変わったという警告を
受けてしまいます (訳注: 別々のホスト鍵をもつマシンで同一の localhost 
ホスト鍵が共有されているため)。このオプションを使うと、相手が
localhost のときにはホスト間認証を抑制することができます。
この引数がとりうる値は
.Dq yes
あるいは
.Dq no
です。
デフォルトでは、yes (相手が localhost でも鍵をチェックする) になっています。
.It Cm NumberOfPasswordPrompts (パスワード試行回数)
パスワードを最高何回まで訊くかを指定します。
この回数を超えると認証は失敗します。
このキーワードには整数を指定する必要があります。
デフォルト値は 3 です。
.It Cm PasswordAuthentication (パスワード認証)
パスワード認証をおこなうかどうかを指定します。この引数の値は
.Dq yes
または
.Dq no
です。デフォルトでは
.Dq yes (パスワード認証をおこなう)
になっています。
.It Cm Port (ポート番号)
リモートホストに接続するときのポート番号を指定します。
デフォルトは 22 です。
.It Cm PreferredAuthentications (認証の優先順位)
プロトコル 2 で試される認証の優先順位を指定します。
これによって、クライアントは特定の認証 (
.Cm keyboard-interactive 
など) をそれ以外の認証 (
.Cm password 
など) よりも優先して選ぶことができます。
このオプションのデフォルトは
.Dq hostbased,publickey,keyboard-interactive,password
の順になっています。
.It Cm Protocol (プロトコル)
.Nm ssh
がサポートすべきプロトコルのバージョンの優先順位を指定します。
とりうる値は
.Dq 1
と
.Dq 2
です。
複数のバージョンを
指定するときはカンマで区切ってください。
デフォルト値は
.Dq 2,1
です。これは
.Nm ssh
がまず始めにバージョン 2 がサポートされているかどうかを調べ、
サーバがそれをサポートしていなかった場合に
バージョン 1 を使用することを指示しています
(訳注: もしサーバ側がバージョン 2 の認証をサポートしていた場合、
バージョン 2 での認証に失敗すると ssh は
そこで終了します。バージョン 1 の認証は *おこなわない* ため、
注意してください)
.It Cm ProxyCommand (プロキシ コマンド)
サーバに接続するのに使用するコマンドを指定します。
コマンド文字列はこのキーワード以後、行末まで書くことができます。
コマンド文字列は
.Pa /bin/sh
によって実行されます。
コマンド文字列では、
.Ql %h
は接続するホスト名に置換され、
.Ql %p
はポート番号に置換されます。
コマンドは基本的に何でもよいのですが、標準入力から読み込み、
標準出力に書き込むようなものである必要があります。
これは最終的にサーバマシン上で動いている
.Xr sshd 8
に接続するか、どこか別の場所で
.Ic sshd -i
を起動させるようにします。
ホスト鍵の管理は接続されているホストの
HostName を使っておこなわれます (デフォルトでは、これはユーザが
タイプした名前になります)。プロキシ コマンドを使うと、
.Cm CheckHostIP (ホスト IP アドレスの検査)
は使用できませんので注意してください。
.Pp
.It Cm PubkeyAuthentication (公開鍵認証)
公開鍵認証をおこなうかどうかを指定します。
このキーワードの引数は
.Dq yes
か
.Dq no
のどちらかです。
デフォルトでは
.Dq yes (公開鍵認証をおこなう)
になっています。
このオプションはプロトコル バージョン 2 のみに適用されます。
.It Cm RemoteForward (リモート→ローカル転送)
リモートマシン上の TCP/IP ポートを、安全な通信路を経由して
ローカルマシン上から与えられた host:post に転送するよう指示します
(訳注: -R オプションと同じ)。
最初の引数は転送するリモートホストのポートを、
2番目の引数には転送先を
.Ar host:port
の形で指定します。
IPv6 アドレスはこれとは別の
.Ar host/port
という形式で指定します。ポート転送は複数指定することができ、
コマンドラインから追加指定することもできます。
特権ポートを転送できるのはスーパーユーザだけです。
.It Cm RhostsAuthentication (rhosts 認証)
Rhosts ベースの認証をおこなうかどうかを指定します。この宣言は
クライアント側にのみ影響し、セキュリティ的にまったくなんの
効果もないことに注意してください。
ほとんどのサーバでは RhostsAuthentication は
安全でないという理由で許可されていません (
RhostsRSAAuthentication
を参照のこと)。
この引数の値は
.Dq yes
または 
.Dq no
です。
デフォルトでは
.Dq no (rhosts 認証をおこなわない)
になっています。
このオプションはプロトコル バージョン 1 のみに適用されます。
.It Cm RhostsRSAAuthentication (rhosts-RSA 認証)
RSA ホスト認証を使った Rhosts ベースの認証を試みるかどうかを
指定します。
この引数の値は
.Dq yes
または
.Dq no
です。
デフォルトの値は
.Dq no (rhosts-RSA 認証をおこなわない)
です。
このオプションはプロトコル バージョン 1 のみに適用され、
これを使うには
.Nm ssh
を setuid root にしておくことが必要です。
.It Cm RSAAuthentication (RSA 認証)
RSA 認証を使うかどうかを指定します。
この引数の値は
.Dq yes
または
.Dq no
です。RSA 認証は identity ファイルが存在するときか、
認証エージェントが動いているときのみ使用されます。
デフォルトは
.Dq yes (RSA 認証をおこなう)
です。
このオプションは
プロトコル バージョン 1 にしか適用されないので注意してください。
.It Cm SmartcardDevice (スマートカード・デバイス)
使用するスマートカードのデバイスを指定します。
この引数には
.Nm ssh
がスマートカードと通信するときに使うデバイスを指定します。
スマートカードはユーザの RSA 秘密鍵を格納するのに使われます。
デフォルトではデバイスは何も指定されておらず、スマートカードの使用は
有効になっていません。
.It Cm StrictHostKeyChecking (厳格なホスト鍵チェック)
このオプションが
.Dq yes
に設定されている場合、
.Nm ssh
は決して
.Pa $HOME/.ssh/known_hosts
ファイルに自動的にホスト認証鍵を追加しません。
鍵が変更されているホストへの接続は拒否されます。
これはトロイの木馬攻撃に対する最大の防御となりますが、
.Pa /etc/ssh/ssh_known_hosts
ファイルをきちんと更新していなかったり、新規のホストに頻繁に
接続するような状況だと邪魔になるかもしれません。
このオプションを使うとユーザは手で新しいホストの鍵を
追加しなければならなくなります。
このオプションが
.Dq no
に設定されている場合、
.Nm ssh
は新しいホスト鍵をユーザの known_hosts ファイルに
自動的に追加します。
このオプションが
.Dq ask
に設定されていると、
新しいホスト鍵が追加されるのは、ユーザが
本当にそれを望んでいると確認できたときだけになります。
ホスト鍵が変更されているホストへの接続は拒否されます。
known_hosts ファイルに含まれているホスト鍵は
いかなる場合でも自動的に検査されます。
このオプションがとりうる値は
.Dq yes
、
.Dq no
あるいは
.Dq ask
で、デフォルトは
.Dq ask
です。
.It Cm UsePrivilegedPort (特権ポートを使用する)
外に向けての接続をおこなうときに、
特権ポートを使用するかどうかを指定します。この引数の値は
.Dq yes
または
.Dq no
で、デフォルトは
.Dq no
になっています。
注意:
旧式の sshd に対して
.Cm RhostsAuthentication
あるいは
.Cm RhostsRSAAuthentication
の認証が必要な場合は、このオプションを
.Dq yes
にする必要があります。
.It Cm User (ユーザ)
ログインするユーザ名を指定します。これは異なるマシン上で
異なるユーザ名が使われている場合に便利です。
これでコマンドラインからわざわざユーザ名を与えなくてもすみます。
.It Cm UserKnownHostsFile (個人用 known_hosts ファイル)
ホスト鍵データベースとして
.Pa $HOME/.ssh/known_hosts
以外のファイルを使うときに指定します。
.It Cm VersionAddendum (バージョンに付加するもの)
OS もしくはサイトに特化した修正を示すために、通常のバージョン文字列に
付け加える文字列を指定します。
.It Cm XAuthLocation (xauth の位置)
.Xr xauth 1
プログラムの場所を指定します。デフォルトは
.Pa /usr/X11R6/bin/xauth
です。
.El
.Sh 関連ファイル
.Bl -tag -width Ds
.It Pa $HOME/.ssh/config
ユーザごとの個人用設定ファイルです。
ファイル形式は上で説明されています。
このファイルは
.Nm ssh
クライアントによって使われます。
このファイルはふつう特に秘密の情報は含んでいませんが、
しかし望ましいパーミッションとしては、そのユーザからは
読み/書き可能で、他人からはアクセス不可能にしておくのがよいでしょう。
.It Pa /etc/ssh/ssh_config
システム全体にわたる設定ファイルです。このファイルはユーザの設定
ファイルでは指定されなかった値を提供し、また設定ファイルを
持たないユーザのためのデフォルトにもなります。このファイルは
誰にでも読み込み可能でなければいけません。
.El
.Sh 作者
OpenSSH は Tatu Ylonen による、フリーな
オリジナル版 ssh 1.2.12 リリースから派生したものです。
Aaron Campbell、 Bob Beck、 Markus Friedl、 Niels Provos、
Theo de Raadt および Dug Song が多くのバグをとり除き、
新しい機能をふたたび追加して OpenSSH をつくりました。
SSH プロトコル バージョン 1.5 および 2.0 のサポートは
Markus Friedl の貢献によるものです。
.Sh 日本語訳
新山 祐介 (yusuke @ cs . nyu . edu) 2002/6/24 (for 3.3p1)
.Pp
当マニュアルページは氏のご好意により
.Fx
日本語マニュアルに収録させていただいています。
翻訳についてのご意見、ご指摘がありましたら新山氏
(yusuke at cs . nyu . edu)、および
.Fx
jpman プロジェクト <man-jp@jp.FreeBSD.org> までお送りください。
.Sh 関連項目
.Xr ssh 1
