freebsd/freebsd-doc/ja_JP.eucJP/man/man5/sysctl.conf.5
.\" Copyright (c) 1999 Chris Costello <chris@FreeBSD.org>
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" %FreeBSD: src/share/man/man5/sysctl.conf.5,v 1.3 2000/01/16 18:12:42 chris Exp %
.\" 
.Dd December 30, 1999
.Dt SYSCTL.CONF 5
.Os FreeBSD
.Sh 名称
.Nm sysctl.conf
.Nd カーネルの状態のデフォルト
.Sh 解説
.Pa /etc/sysctl.conf
ファイルは、カーネルのデフォルト設定のために、
システムがマルチユーザモードになるときに読み込まれます。
.Pa /etc/sysctl.conf
は
.Dq "sysctl -w"
コマンドの書式であり、すなわち次のようなものです。
.Bd -literal -offset indent
sysctl_mib=value
.Ed
.Pp
コメントは、行頭に
.Dq #
を付けることで記述します。
コメントは行末にも付けられます。
後述の
.Sx 使用例
を見てください。
.Sh 関連ファイル
.Bl -tag -width /etc/sysctl.conf -compact
.It Pa /etc/sysctl.conf
.Xr sysctl 8
の初期設定。
.Sh 使用例
致命的なシグナルにより終了したプログラムのロギングを無効にし、
Linux プログラムに対して FreeBSD 3.4-STABLE で実行していると通知するには、
次のような設定を使用します:
.Bd -literal -offset indent
# Configure logging and Linux execution.
kern.logsigexit=0	# Do not log fatal signal exits (e.g. sig 11)
compat.linux.osname=FreeBSD
compat.linux.osrelease=3.4-STABLE
.Ed
.Sh 関連項目
.Xr rc.conf 5 ,
.Xr rc 8 ,
.Xr sysctl 8
