freebsd/freebsd-doc/ja_JP.eucJP/man/man5/tacplus.conf.5
.\" Copyright 1998 Juniper Networks, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$FreeBSD: src/lib/libtacplus/tacplus.conf.5,v 1.1.1.1 1998/11/13 00:54:26 jdp Exp $
.\"
.\" jpman %Id: tacplus.conf.5,v 1.2 1999/01/27 12:32:37 horikawa Stab %
.\" WORD: sensitive	(情報を)極めて慎重に扱うべき[radius.5 tacplus.conf.5]
.Dd July 29, 1998
.Dt TACPLUS.CONF 5
.Os FreeBSD
.Sh 名称
.Nm tacplus.conf
.Nd TACACS+ クライアントの設定ファイル
.Sh 書式
.Pa /etc/tacplus.conf
.Sh DESCRIPTION
.Nm
は、TACACS+ クライアントライブラリの設定に必要な情報を含みます。
本ファイルは
.Xr tac_config 3
が解釈します。
本ファイルは 1 行以上のテキスト行を含み、
各行は、ライブラリが使用する単一の TACACS+ サーバについて記述します。
先行する空白は、空行および、コメントのみの行と同様、無視されます。
.Pp
1 つの TACACS+ サーバは、2 から 4 フィールドからなる 1 行により表現されます。
フィールドは空白によって区切られます。
フィールドの先頭にある
.Ql #
文字はコメントを開始し、行末まで続きます。
フィールドはダブルクォートで括ることができ、
この場合空白を含んだり、
.Ql #
文字で開始することができます。
クォートされた文字列中では、ダブルクォート文字は
.Ql \e\&"
で表現可能であり、バックスラッシュは
.Ql \e\e
で表現可能です。
他のエスケープシーケンスはサポートされません。
.Pp
最初のフィールドはサーバホストを指定します。
完全な形でのドメイン名でもかまいませんし、
ドット付き 4 つ組の IP アドレスでもかまいません。
ホストの後には
.Ql \&:
と数値によるポート番号を続けることができます。間に空白を狭んではなりません。
ポートを指定しない場合、
標準の TACACS+ ポート 49 になります。
.Pp
第 2 フィールドには共有鍵が置かれ、
クライアントとサーバホスト以外には知られてはなりません。
共有鍵は任意の文字列ですが、
空白を含む場合や空の場合はダブルクォートで括る必要があります。
共有鍵を空にすると、通常の暗号化機構が無効化され、
ネットワークを行き来する全データはクリアテキストになります。
.Pp
第 3 フィールドは、
サーバとの通信時のタイムアウト秒数であり、
10 進数で指定します。
タイムアウトは、接続・書き込み・読み込みの各操作に別々に適用されます。
このフィールドを省略すると、デフォルトの 3 秒になります。
.Pp
省略可能な第 4 フィールドは、文字列
.Ql single-connection
を含んでかまいません。
これを指定されると、ライブラリはサーバと交渉して、
複数のセッション用に TCP 接続をオープンしたままにしようとします。
古い TACACS+ サーバには、本オプションを指定すると混乱するものがあります。
.Pp
10 個の TACACS+ サーバまで指定可能です。
サーバは指定した順序で試され、有効な返答が返されるか、
リストが終わるまで続けられます。
.Pp
このファイルの標準的な置き場所は
.Pa /etc/tacplus.conf
です。しかし、
.Xr tac_config 3
を呼び出すときに別のパス名を指定できます。
共有鍵という形で極めて慎重に扱うべき情報を格納するファイルですから、
root 以外には読めないようにすべきです。
.Sh 関連ファイル
.Pa /etc/tacplus.conf
.Sh 使用例
.Bd -literal
# 全部デフォルトである単純なエントリ:
tacserver.domain.com	OurLittleSecret

# サーバは標準ではないポートを使用しており、
# タイムアウトを増加し、"single-connection" オプションを指定しています。
auth.domain.com:4333	"Don't tell!!"	15	single-connection

# サーバを IP アドレスで指定:
192.168.27.81		$X*#..38947ax-+=
.Ed
.Sh 関連ファイル
.Xr libtacplus 3
.Sh 作者
この文書を
.An John Polstra
が書き、Juniper Networks, Inc. が FreeBSD プロジェクトに寄贈しました。
