freebsd/freebsd-doc/ja_JP.eucJP/man/man5/texinfo.5
.\" texinfo(5)
.\" %Id: texinfo.5,v 1.3 1999/03/25 21:28:25 karl Exp %
.\" jpman %Id: texinfo.5,v 1.3 2000/04/19 02:38:52 horikawa Stab %
.\"
.\" Copyright (C) 1998, 99 Free Software Foundation, Inc.
.\"
.\" Permission is granted to make and distribute verbatim copies of this
.\" manual provided the copyright notice and this permission notice are
.\" preserved on all copies.
.\"
.\" Permission is granted to copy and distribute modified versions of
.\" this manual under the conditions for verbatim copying, provided that
.\" the entire resulting derived work is distributed under the terms of a
.\" permission notice identical to this one.
.\"
.\" Permission is granted to copy and distribute translations of this
.\" manual into another language, under the above conditions for modified
.\" versions, except that this permission notice may be stated in a
.\" translation approved by the Foundation.
.\"
.TH TEXINFO 5 "GNU Texinfo" "FSF"
.SH 名称
Texinfo \- ソフトウェアのドキュメンテーションシステム
.SH 説明
Texinfo は単一のソースファイルを使用して、オンライン情報とプリント用の
出力の両方を生成するドキュメンテーションシステムです。これはもともと
ソフトウェアのマニュアルを書くために設計されたものです。
.PP
Texinfo の言語および関連のあるツールに関しての説明文の全体が必要なときは、
Texinfo マニュアルを参照してください (このマニュアル自体も Texinfo で
書かれています)。
もっともありふれた場合では、シェルから次のコマンドを実行します :
.RS
.I info texinfo
.RE
あるいは、Emacs 内部から次のキーシーケンスを実行します :
.RS
.I M-x info RET m texinfo RET
.RE
こうすると、Texinfo マニュアルにたどり着けるでしょう。
.SH 入手性
ftp://ftp.gnu.org/gnu/texinfo/
.br
あるいは、GNU ミラーサイトから入手できます。
.SH バグレポート
バグレポートは bug-texinfo@gnu.org へ電子メールで送ってください。
一般的な質問や議論は help-texinfo@gnu.org へお願いします。
.SH 関連項目
info(1), install-info(1), makeinfo(1), texi2dvi(1), texindex(1).
.br
emacs(1), tex(1).
.br
info(5)
