freebsd/freebsd-doc/ja_JP.eucJP/man/man5/ttys.5
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" WORD: line	回線
.\"
.\"     from: @(#)ttys.5	8.1 (Berkeley) 6/4/93
.\" %FreeBSD: src/libexec/getty/ttys.5,v 1.11 1999/12/06 09:07:12 sheldonh Exp %
.\" jpman %Id: ttys.5,v 1.3 1998/06/17 07:52:43 kumano Stab %
.\" "
.Dd November 17, 1996
.Dt TTYS 5
.Os
.Sh 名称
.Nm ttys
.Nd 端末初期設定情報
.Sh 解説
ファイル
.Nm
は端末特殊ファイルを初期化したり制御するあらゆるルーチンが使用する
情報を含んでいます。
この情報は
.Xr getttyent 3
ライブラリルーチンで読まれます。
.Nm
ファイルの中には 1 つのスペシャルデバイスファイルにつき 1 行の記述が
あります。
フィールドはタブやスペースにより区切られます。
1 語以上からなるフィールドはダブルクォート (``"'') で括られていなければ
なりません。
空行やコメントはファイル中のどこに現れても構いません。
コメントはハッシュ記号 (``#'') および改行によって区切られます。
指定されていないフィールドはデフォルトでナルです。
.Pp
最初のフィールドは、通常は端末特殊ファイルの名前であり、
.Pa /dev
にあるようなものです。
しかしながら、関連付けられたコマンドが tty に無関係である場合、
任意の文字列にできます。
.Pp
2 番目のフィールドはその回線に対して実行するコマンドで、
通常
.Xr getty 8
です。これは回線を初期化して開くプログラムで、スピードを設定したり、
ユーザ名を待ったり
.Xr login 1
プログラムを実行します。
しかしながら、それはどんな希望するコマンド、例えばウィンドウシステム
の端末エミュレータやデーモンプロセスの起動コマンドでも構いません。
そして、もしクォートで括られているのなら複数語を含む事もできます。
.Pp
3 番目のフィールドは通常その tty 回線に接続される端末のタイプで、普通
.Xr termcap 5
データベースファイル中に収められています。
環境変数
.Ev TERM
は
.Xr getty 8
または
.Xr login 1
による値に初期化されます。
.Pp
残りのフィールドは
.Fa ty_status
エントリ
.Xr (getttyent 3
参照) 中のフラグを指定したり、その端末回線に対して
.Xr init 8
が維持するウィンドウシステムのプロセスを指定したり、
オプションで tty のタイプ
(ダイヤルインか、ネットワークか、またはそれ以外か) を決定したり、
またログインクラスのデータベース
.Xr (login.conf 5
参照) が多くの tty をグループとして参照できるような
tty グループ名を指定します。
これはグループとして tty に対して選択的にアクセスを許可または
拒否したりアカウンティング機能を可能または不可能にするためです。
.Pp
フラグの値としては、文字列 ``on'' と ``off'' は
.Xr init 8
が 2 番目のフィールドで与えられるコマンドを実行するか(しないか)を
指定します。一方 ``secure'' は ( ``on'' も与えられていれば) uid が
0 のユーザがこの回線にログインすることを許可します。
フラグ ``dialin'' は tty エントリがダイヤルイン回線であることを
示しており、 ``network'' は tty エントリがネットワーク接続で
あることを示しています。
端末タイプのフィールドには、これらの文字列のどちらかが指定できます。
文字列 ``window='' の後には
.Xr init 8
が 2 番目のフィールドで指定されるコマンドを開始する
.Em 前
に実行するコマンド列をクォートで括って続けます。
.Pp
文字列 ``group='' の後には、
多くの tty 回線をアクセスの許可/拒否やアカウンティング機能の
可能/不可能を決めるためのグループとして参照するために
.Xr login.conf 5
で使われる、文字・数字のグループ名を続けます。
何のグループも指定されなかった場合、ttyはグループ "none" に属するように
なります。
以前との互換性のために、 ``group='' は行の最後に、任意のコメントのすぐ前
に現れなければなりません。
.Pp
第 2 フィールドと ``window='' で指定されるコマンドは、語に分解され、
.Xr execve 2
を使用して実行されます。
語は、タブとスペースの任意の組み合わせで区切られます。
空白を含む引数は、シングルクォート
.Pq '
で区切るべきです。
シェルスタイルのグロブや他の変数置換は、行われません。
.Sh 使用例
.Bd -literal
# 1200 ボーでコンソール、root でのログイン可
console	"/usr/libexec/getty std.1200"	vt100	on secure
# 1200 ボーでダイヤルアップ、root でのログイン不可
ttyd0	"/usr/libexec/getty d1200"	dialup	on group=dialup	# 555-1234
# Mike の端末: hp2621
ttyh0	"/usr/libexec/getty std.9600"	hp2621-nl	on group=dialup	# 457 Evans
# John の端末: vt100
ttyh1	"/usr/libexec/getty std.9600"	vt100	on group=dialup		# 459 Evans
# 端末エミュレート/ウィンドウシステム
ttyv0	"/usr/new/xterm -L :0"		vs100	on window="/usr/new/Xvs100 0"
# ネットワーク仮想 tty -- getty は使用しません
ttyp0	none	network 	group=pty
ttyp1	none	network	off	group=pty
.Ed
.\" 「使用例」1行目 `root login on ...'
.\" 3行目の `no root logins' との対比であるから、
.\" 3行目の訳と対比させて「root でのログイン可」と訳した。
.\" (98/06/17 kumano@jp.freebsd.org)
.Sh 関連ファイル
.Bl -tag -width /etc/ttys -compact
.It Pa /etc/ttys
.El
.Sh 関連項目
.Xr login 1 ,
.Xr getttyent 3 ,
.Xr ttyslot 3 ,
.Xr gettytab 5 ,
.Xr login.conf 5 ,
.Xr termcap 5 ,
.Xr getty 8 ,
.Xr init 8
.\".Xr init 8 ,
.\".Xr ttyflags 8
.Sh 歴史
.Nm
ファイルは
.At v6
で登場しました。
