freebsd/freebsd-doc/ja_JP.eucJP/man/man5/tzfile.5
.\" %FreeBSD: src/lib/libc/stdtime/tzfile.5,v 1.8 2000/01/19 13:27:03 sheldonh Exp %
.Dd September 13, 1994
.\" jpman %Id: tzfile.5,v 1.3 1998/06/22 10:44:36 kumano Stab %
.Dt TZFILE 5
.Os FreeBSD 3.0
.Sh 名称
.Nm tzfile
.Nd タイムゾーンの情報
.Sh 書式
.Fd #include \&"/usr/src/lib/libc/stdtime/tzfile.h\&"
.Sh 解説
.Xr tzset 3
が使用するタイムゾーン情報ファイルは、
タイムゾーン情報ファイルであることを識別するマジック文字列
.Dq Li TZif
から始まり、 
将来の使用のために予約された 16 バイトが続き、
4 つの 4 バイト値が続きます。
これは ``標準'' バイトオーダ (上位バイトを最初に格納) で格納されます。
これらの値を順序に従い、以下に示します。
.Pp
.Bl -tag -compact -width tzh_ttisstdcnt
.It Va tzh_ttisgmtcnt
ファイルに格納された、UTC/ローカル指示子の数。
.It Va tzh_ttisstdcnt
ファイルに格納された、標準/ウォール指示子の数。
.It Va tzh_leapcnt
ファイルに格納された、閏秒データの数。
.It Va tzh_timecnt
ファイルに格納された ``遷移時刻'' データの数。
.It Va tzh_typecnt
ファイルに格納された ``ローカルタイム型'' データの数 (0 であってはなりません)。
.It Va tzh_charcnt
ファイルに格納された ``タイムゾーン省略形文字列'' の文字数。
.El
.Pp
上記のヘッダに続いて、
4 バイト
.Fa long
型の値が
.Va tzh_timecnt
個、昇順に並びます。
値は ``標準'' バイトオーダで格納されます。
それぞれ、ローカルタイム計算方法が変わる遷移時刻 (
.Xr time 3
で返される形式) として使用されます。
続いて、1 バイト
.Fa "unsigned char"
型の値が
.Va tzh_timecnt
個続きます。
このそれぞれは、同一インデックスの遷移時刻に、
ファイル中のどの ``ローカルタイム'' 型が対応するかを示します。
値は、このファイル中で後続する
.Fa ttinfo
構造体の配列に対するインデックスです。
.\" つまり struct ttinfo が tzh_typecnt 個あるということ
.\" See src/lib/libc/stdtime/tzfile.h
.\" 1998/05/01 horikawa@jp.freebsd.org
この構造体の定義を以下に示します。
.Pp
.Bd -literal -offset indent
struct ttinfo {
	long	tt_gmtoff;
	int	tt_isdst;
	unsigned int	tt_abbrind;
};
.Ed
.Pp
各構造体は、
標準バイトオーダの 4 バイト
.Fa long
型の値
.Va tt_gmtoff
、それに続く 1 バイトの値
.Va tt_isdst
、そして 1 バイトの値
.Va tt_abbrind
の順に格納されます。
.Va tt_gmtoff
は UTC に加えるべき秒数を、
.Va tt_isdst
は
.Va tm_isdst
が
.Xr localtime 3
により設定されるべきかどうかを、
.Va tt_abbrind
はタイムゾーン省略文字列の配列に対するインデックスを意味します。
タイムゾーン省略文字列の配列は、同一ファイル中の
.Li ttinfo
構造体に後続しています。
.Pp
その後には標準バイトオーダで格納される 4 バイト値のペアが
.Va tzh_leapcnt
個格納されています。
各ペアの最初の値は、閏秒が発生する時刻 (
.Xr time 3 
で返される形式) です。
2 番目の値は、
指定された時刻以降に適用される閏秒の
.Em 総計
です。
値のペアは時刻の昇順で格納されます。
.Pp
その後に、1 バイト値の標準/ウォールの指示子が
.Va tzh_ttisstdcnt
個格納されています。
これらは、ローカルタイム型に関する遷移時刻が
標準時刻で指定されているのか、
それともウォールクロックの時刻で指定されているのかを示します。
この情報は、POSIX スタイルのタイムゾーン環境変数を扱う際に、
タイムゾーンファイルを使用するときに使用します。
.Pp
最後に、複数の
.Va tzh_ttisgmtcnt
UTC/ローカル指示子があり、それぞれ 1 バイト値として格納されます。
これらは、ローカル時刻タイプと関連付けられた遷移時刻が
UTC とローカル時刻のどちらで指定されているかを示し、
タイムゾーンファイルが POSIX スタイルタイムゾーン環境変数を扱うときに
使用されます。
.Pp
.Li tzh_timecnt
が 0 の場合もしくは時刻引数がファイル中の最初の遷移時刻以前の場合、
.Nm localtime
は、ファイル中の最初の標準時間の
.Li ttinfo
構造体を使用します
(標準時間の構造体が無い場合には、単に最初の
.Li ttinfo
構造体を使用します)。
.Sh 関連項目
.Xr ctime 3 ,
.Xr time2posix 3 ,
.Xr zic 8
.\" @(#)tzfile.5	7.2
.\" This file is in the public domain, so clarified as of
.\" 1996-06-05 by Arthur David Olson (arthur_david_olson@nih.gov).
