freebsd/freebsd-doc/ja_JP.eucJP/man/man5/usbd.conf.5
.\"
.\" Copyright (c) 1999 Nick Hibma.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/usbd/usbd.conf.5,v 1.6.2.1 2000/07/03 09:14:17 n_hibma Exp %
.\"
.\" Many parts of this manual have been snarfed from the pccard.conf (5) man
.\" page, copyright by Andrew McRae.
.\"
.\" jpman %Id: usbd.conf.5,v 1.3 2000/04/26 12:34:59 takaha Stab %
.Dd November 19, 1999
.Dt USBD.CONF 5
.Os FreeBSD
.Sh 名称
.Nm usbd.conf
.Nd
.Xr usbd 8
の設定ファイル
.Sh 解説
.Nm
ファイルは、
.Xr usbd 8
デーモン用の設定ファイルです。
カーネルの
.Xr usb 4
サブシステムが報告したイベントに対応するユーザランドコマンドを
実行可能とするために、情報を提供します。
現在のところ、イベントはデバイスの接続と切り離しのみですが、
将来的には電源制御機能も含めて拡張可能です。
.Pp
設定ファイルは、ソートされたエントリリストから成ります。
各エントリは、事象コマンドの集合を記述します。
イベント発生時には、事象がチェックされ合致すると、
このイベントに対応するコマンドがシェルを通じて実行されます。
リストは、ソートされて、先頭から末尾まで走査されます。
最初にマッチしたエントリが、イベントに対して使用されます。
.Pp
各エントリはいくつかのフィールドから成ります。
フィールドには 3 種類あり、
記述フィールドと、選択事象と、イベント発生時に実行するコマンドです。
フィールド名には大文字小文字の区別があり、すべて小文字であるべきです。
各フィールドは 1 個以上の引数を取り得ます。
.Pp
次のフィールドを使用可能です:
.Bl -tag -width devicename\ <Id>
.It device Ar string
新規エントリを開始します。
.Ar string
は任意の文字列であり、綺麗に表示するために使用されます。
.It product Ar id
プロダクト Id。
.It vendor Ar id
ベンダ Id。
.It release Ar id
リリース Id。リビジョン Id と呼ばれることもあります。
.It class Ar id
デバイスクラス。
.It subclass Ar id
デバイスサブクラス。
.It protocol Ar id
デバイスプロトコル。
.It devname Ar string
デバイス名であり、例えば umass2 や ums0 です。
これらのデバイス名には、正規表現を含み得ます。
.Xr regex 3
と
.Xr re_format 7
を参照してください。
マッチしたデバイス名は、${DEVNAME} を文字列中のどこかに追加することで、
後述のコマンドにおいて使用可能です。
.El
.Pp
文字列引数は括ることができます。
文字列引数に空白やタブ文字を含む場合には、
文字列引数をシングルクォートまたはダブルクォートで括る必要があります。
引数にシングルクォートまたはダブルクォートを含む場合、
それぞれダブルクォートまたはシングルクォートで括る必要があります。
後述の使用例を参照してください。
.Pp
数値引数は、10 進数 (42)、8 進数 (052)、16 進数 (0x2a) の
いずれでも指定可能です。
.Pp
フィールド
.Li product , vendor , release, class , subclass ,
.Li protocol
に対する値は、
.Nm usbd
デーモンを殺してから
.Fl d
と
.Fl v
のフラグを付けて起動することにより取得可能です。
.Pp
アクションがマッチした場合に実行するコマンド:
.Bl -tag -width devicename\ <Id>
.It attach Ar string
デバイスが接続されたときに実行されるシェルコマンド。
.It detach Ar string
デバイスが切り離されたときに実行されるシェルコマンド。
.Sh 使用例
.Tn "Iomega USB Zip Drive"
の接続に際して、SCSI バスを再スキャンするサンプルエントリ:
.Bd -literal
   device "USB Zip drive"
      product 0x0001
      vendor  0x059b
      release 0x0100
      attach "/usr/bin/camcontrol rescan bus 0"
.Ed
.Pp
新規に接続されたマウスに対して moused を起動するには:
.Bd -literal
   device "Mouse"
      devname "ums[0-9]+"
      attach "/usr/sbin/moused -p /dev/${DEVNAME} -I /var/run/moused.${DEVNAME}.pid"
.El
.Sh 関連ファイル
.Bl -tag -width /etc/pccard.conf -compact
.It Pa /etc/usbd.conf
.Nm usbd
の設定ファイル
.El
.Sh 関連項目
.Xr usb 4 ,
.Xr usbd 8 ,
.Xr usbdevs 8
.Sh バグ
現在のところ、選択項目を複数回使用できません。
例えば、複数個のベンダ ID を指定できません。
.Sh 作者
usbd の設定ファイルのマニュアルページは
.An Nick Hibma Aq n_hibma@freebsd.org
が記述しました。
