freebsd/freebsd-doc/ja_JP.eucJP/man/man5/uuencode.format.5
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)uuencode.format.5	8.2 (Berkeley) 1/12/94
.\" %FreeBSD: src/usr.bin/uuencode/uuencode.format.5,v 1.8.2.1 2000/12/08 15:14:15 ru Exp %
.\" $FreeBSD$
.\"
.\" WORD: trailer	トレーラ
.\"
.Dd January 12, 1994
.Dt UUENCODE 5
.Os BSD 4
.Sh 名称
.Nm uuencode
.Nd uuencode ファイルのフォーマット
.Sh 解説
.Xr uuencode 1
によって出力されるファイルは、ヘッダ行、それに続く本体の行、
およびトレーラ行から構成されています。
.Xr uudecode 1
コマンドはヘッダ行の前やトレーラ行の後ろにある行を無視します。
ヘッダの前にある行は、当然ヘッダのようには見えてはいけません。
.Pp
ヘッダ行は行の先頭にある 6 文字
.Dq begin\ \&
(最後の空白に注意) によって識別されます。
.Em begin
の後ろには (8 進数の) モード、そしてリモートファイルの名前を指定する
文字列が続きます。
空白がヘッダ行中の 3 つの要素を分けています。
.Pp
本体は、それぞれが最大 62 文字 (行末の改行を含みます) の行から
構成されています。これらは文字カウント、それに続く符号化された文字、
それに続く改行からなります。
文字カウントは印刷可能な 1 文字で、その行の残りのバイト数を整数で表して
います。
その整数は常に 1 から 45 または 64 の範囲にあり、その文字から空白文字
(8 進数で 40) を引く事によって決定可能です。文字 64 は 0 のカウントを
表しています。
.Pp
3 バイトのグループが 4 文字に
(訳注: 3 バイト (24 ビット) を 1 グループとしこれを 4 つに分けて 4 文字に)
.\" 上記訳注は、原文の理解を助けるために追加しました。
.\" 2.2.6-RELEASE 対象
.\" By kumano@jp.freebsd.org (Jun 27 1998)
、つまり 6 ビットが 1 文字に蓄えられます。
すべての文字はいつも 1 から 64 の範囲にあり印刷可能な文字にするために
空白文字 (8 進数で 40) でかさあげされます。
文字 64 は 0 のカウントを表します。
最後の行は通常の 45 バイトより短くてもかまいません。
もしサイズが 3 の倍数でない場合、
そのことは最終行のカウントの値を見ればわかります。
文字カウントを 4 の倍数にするために、余分なゴミが含まれる事があります。
本体は、0 のカウントを持つ行で終了します。
この行は
.Tn ASCII
バッククォート (8 進数で 140) の 1 文字からなります。
.Pp
トレーラ行は
.Dq end
だけの行からなります。
.Sh 関連項目
.Xr mail 1 ,
.Xr uucp 1 ,
.Xr uudecode 1 ,
.Xr uuencode 1
.Sh 歴史
.Nm
ファイルフォーマットは
.Bx 4.0
から登場しました。
.\" It was named uuencode.5 prior to 4.3
