Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-questions/*.po
Languages: es_es, pt_br

source: Often you will want to send in additional information to a question you have already sent. The best way to do this is to reply to your original message. This has three advantages:
es_es: A menudo, deseará enviar información adicional a una pregunta que ya haya enviado. La mejor manera de hacerlo es responder a su mensaje original. Esto tiene tres ventajas:
pt_br: Algumas vezes você vai querer mandar informação adicional para uma questão que você já enviou. A melhor maneira de fazer isso é responder a sua própria mensagem original. Isto tem três vantagens:

source: You include the original message text, so people will know what you are talking about. Do not forget to trim unnecessary text out, though.
es_es: Incluye el texto del mensaje original, para que la gente sepa de qué está hablando. Sin embargo, no olvide recortar el texto innecesario.
pt_br: Você inclui o texto da mensagem original, assim as pessoas saberão do que você está falando. Não esqueça de retirar texto desnecessário.

source: The text in the subject line stays the same (you did remember to put one in, did you not?). Many mailers will sort messages by subject. This helps group messages together.
es_es: El texto en el asunto sigue siendo el mismo (recordó poner uno, ¿no es así?). Muchos servicios de correo ordenarán los mensajes por asunto. Esto ayuda a agrupar los mensajes.
pt_br: O texto no campo do assunto permanece o mesmo (você lembrou de colocar o assunto, não foi?). Muitos aplicativos ordenarão as mensagens pelo assunto. Isto ajuda o agrupamento de mensagens.

source: The message reference numbers in the header will refer to the previous message. Some mailers, such as <link xlink:href="http://www.mutt.org/">mutt</link>, can <emphasis>thread</emphasis> messages, showing the exact relationships between the messages.
es_es: Los números de referencia del mensaje en el encabezado se refieren al mensaje anterior. Algunos gestores de correo, como <link xlink:href="http://www.mutt.org/">mutt</link>, pueden agrupar los mensajes en <emphasis>hilos</emphasis>, mostrando las relaciones exactas entre los mensajes.
pt_br: Os números de referência da mensagem no cabeçalho se referem à mensagem anterior. Alguns mailers, como o <link xlink:href="http://www.mutt.org/">mutt</link>, podem agrupar as mensagens em <emphasis>thread</emphasis>, mostrando as relações exatas entre as mensagens.

source: How to answer a question
es_es: Cómo responder a una pregunta
pt_br: Como responder uma pergunta

source: Before you answer a question to FreeBSD-questions, consider:
es_es: Antes de responder una pregunta en FreeBSD-questions, considere:
pt_br: Antes de responder uma pergunta na FreeBSD-questions, considere:

source: A lot of the points on submitting questions also apply to answering questions. Read them.
es_es: Muchas de las directrices utilizadas cuando se está escribiendo una pregunta también son válidas para responderlas. Léalas.
pt_br: Muitas das diretivas usadas quando se está para escrever uma questão também são válidas para respondê-las. Leia-as.

source: Has somebody already answered the question? The easiest way to check this is to sort your incoming mail by subject: then (hopefully) you will see the question followed by any answers, all together.
es_es: ¿Alguien ha respondido ya la pregunta? La forma más fácil de verificar esto es ordenar su correo entrante por asunto: luego (con suerte) verá la pregunta seguida de las respuestas, todas juntas.
pt_br: Alguém já respondeu à pergunta? A maneira mais fácil de conferir isto é ordenando as mensagens recebidas pelo assunto: então (esperançosamente) você verá a pergunta seguida pelas respectivas respostas, todas juntas.

source: If somebody has already answered it, it does not automatically mean that you should not send another answer. But it makes sense to read all the other answers first.
es_es: Si alguien ha respondido, esto no significa que automáticamente usted no deba enviar otra respuesta. Pero tiene sentido leer las otras respuestas primero.
pt_br: Se alguém já respondeu, isso não significa automaticamente que você não deve enviar outra resposta. Mas faz sentido ler todas as outras respostas primeiro.

source: Do you have something to contribute beyond what has already been said? In general, <quote>Yeah, me too</quote> answers do not help much, although there are exceptions, like when somebody is describing a problem they are having, and they do not know whether it is their fault or whether there is something wrong with the hardware or software. If you do send a <quote>me too</quote> answer, you should also include any further relevant information.
es_es: ¿Tiene algo que aportar más allá de lo que ya se ha dicho? En general, las respuestas del tipo <quote>Sí, yo también</quote> no ayudan mucho, aunque hay excepciones, como cuando alguien está describiendo un problema que está teniendo, y no sabe si es culpa suya o si hay algo mal con el hardware o software. Si va a enviar una respuesta de tipo <quote>yo también</quote>, debe incluir otra información relevante.
pt_br: Você tem algo para contribuir além do que já foi dito? Em geral, as respostas do tipo <quote>Sim, eu também</quote> não ajudam muito, embora haja exceções, como quando alguém está descrevendo um problema que está tendo, e não sabe se é culpa dela ou se existe algo de errado com o hardware ou software. Se você for enviar uma resposta do tipo <quote>eu também</quote>, você também deverá incluir outras informações relevantes.

source: Are you sure you understand the question? Very frequently, the person who asks the question is confused or does not express themselves very well. Even with the best understanding of the system, it is easy to send a reply which does not answer the question. This does not help: you will leave the person who submitted the question more frustrated or confused than ever. If nobody else answers, and you are not too sure either, you can always ask for more information.
es_es: ¿Seguro que entiende la pregunta? Con mucha frecuencia, la persona que hace la pregunta está confundida o no se expresa muy bien. Incluso con la mejor comprensión del sistema, es fácil enviar una respuesta que no responde la pregunta. Esto no ayuda: dejará a la persona que formuló la pregunta más frustrada o confundida que nunca. Si nadie más responde y usted tampoco está seguro, siempre puede pedir más información.
pt_br: Tem certeza de que entendeu a pergunta? Muito freqüentemente, a pessoa que faz a pergunta é confusa ou não se expressa muito bem. Mesmo com o melhor entendimento do sistema, é fácil enviar uma resposta que não responde à pergunta. Isso não ajuda: você deixará a pessoa que enviou a pergunta ainda mais frustrada ou confusa do que nunca. Se ninguém mais responder e você também não tiver certeza, você sempre poderá pedir mais informações.

source: Are you sure your answer is correct? If not, wait a day or so. If nobody else comes up with a better answer, you can still reply and say, for example, <quote>I do not know if this is correct, but since nobody else has replied, why don't you try replacing your ATAPI CDROM with a frog?</quote>.
es_es: ¿Está seguro de que su respuesta es correcta? Si no, espere un día o así. Si a nadie más se le ocurre una respuesta mejor, aún puede responder y decir, por ejemplo, <quote>No sé si esto es correcto, pero como nadie más ha respondido, ¿por qué no intenta reemplazar su CDROM ATAPI con una rana?</quote>.
pt_br: Tem certeza de que sua resposta está correta? Se não, espere um dia ou mais. Se ninguém mais aparecer com uma resposta melhor, você ainda pode responder e dizer, por exemplo, <quote>Eu não sei se isso está correto, mas como ninguém mais respondeu, por que você não tenta substituir seu CDROM ATAPI com por sapo?</quote>.

source: Unless there is a good reason to do otherwise, reply to the sender and to FreeBSD-questions. Many people on the FreeBSD-questions are <quote>lurkers</quote>: they learn by reading messages sent and replied to by others. If you take a message which is of general interest off the list, you are depriving these people of their information. Be careful with group replies; lots of people send messages with hundreds of CCs. If this is the case, be sure to trim the Cc: lines appropriately.
es_es: A menos que haya una buena razón para hacer lo contrario, responda al remitente y a FreeBSD-questions. Muchas personas en FreeBSD-questions son <quote>lurkers</quote>: aprenden leyendo mensajes enviados y respondidos por otras personas. Si quita de la lista un mensaje que es de interés general, está privando a estas personas de su información. Tenga cuidado con las respuestas grupales; mucha gente envía mensajes con cientos de CC. Si es así, asegúrese de reducir las líneas Cc: apropiadamente.
pt_br: A menos que haja uma boa razão para fazer o contrário, responda ao remetente e para a FreeBSD-questions. Muitas pessoas na FreeBSD-questions são <quote>lurkers</quote>: elas aprendem lendo mensagens enviadas e respondidas por outras pessoas. Se você tirar uma mensagem que é de interesse geral da lista, você está privando essas pessoas de suas informações. Tenha cuidado com as respostas para grupo; Muitas pessoas enviam mensagens com centenas de CCs. Se este for o caso, certifique-se de reduzir as linhas Cc: apropriadamente.

source: Include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
es_es: Incluya texto relevante del mensaje original. Reduzca al mínimo, pero no exagere. El contenido original restante todavía debería permitir a alguien que no leyó el mensaje original entender de lo que usted está hablando.
pt_br: Incluir texto relevante da mensagem original. Reduza ao mínimo, mas não exagere. O conteúdo original remanescente ainda deve possibilitar à alguém que não leu a mensagem original entender do que você está falando.

source: Use some technique to identify which text came from the original message, and which text you add. I personally find that prepending <quote><literal>&gt; </literal></quote> to the original message works best. Leaving white space after the <quote><literal>&gt; </literal></quote> and leave empty lines between your text and the original text both make the result more readable.
es_es: Use alguna técnica para identificar qué texto proviene del mensaje original y qué texto agrega. Personalmente encuentro que anteponer <quote><literal>&gt; </literal></quote> al mensaje original funciona mejor. Dejando espacios en blanco después de <quote><literal>&gt; </literal></quote> y deje líneas vacías entre el texto y el texto original para que el resultado sea más legible.
pt_br: Use alguma técnica para identificar qual texto veio da mensagem original e qual texto você adicionou. Eu pessoalmente acho que a adição do <quote><literal>&gt;</literal></quote> no inicio da mensagem original funciona bem. Deixando espaço em branco após o <quote><literal>&gt;</literal></quote> e deixar linhas vazias entre o seu texto e o texto original, ambos tornam o resultado mais legível.

source: Put your response in the correct place (after the text to which it replies). It is very difficult to read a thread of responses where each reply comes before the text to which it replies.
es_es: Coloque su respuesta en el lugar correcto (después del texto al que responde). Es muy difícil leer un hilo de respuestas donde cada respuesta aparece antes del texto al que responde.
pt_br: Coloque sua resposta no lugar correto (após o texto ao qual ela se refere). É muito difícil ler um encadeamento de respostas em que cada resposta vem antes do texto ao qual ela se refere.

source: Most mailers change the subject line on a reply by prepending a text such as <quote>Re: </quote>. If your mailer does not do it automatically, you should do it manually.
es_es: La mayoría de los programas de correo electrónico cambian la línea del asunto en una respuesta, agregando al principio de este un texto del tipo <quote>Re: </quote>. Si su programa no lo hace automáticamente, debe hacerlo manualmente.
pt_br: A maioria dos programas de email mudam a linha do assunto em um resposta , adicionando no início desta um texto do tipo <quote>Re:</quote>. Se seu programa não faz isso automaticamente, você deve fazer manualmente.

source: If the submitter did not abide by format conventions (lines too long, inappropriate subject line), <emphasis>please</emphasis> fix it. In the case of an incorrect subject line (such as <quote>HELP!!??</quote>), change the subject line to (say) <quote>Re: Difficulties with sync PPP (was: HELP!!??)</quote>. That way other people trying to follow the thread will have less difficulty following it.
es_es: Si el remitente no cumplió con las convenciones de formato (líneas demasiado largas, asunto inapropiado), <emphasis>por favor</emphasis>, corríjalo. En caso de un asunto incorrecto (como <quote>¿¿¡¡AYUDA!!??</quote>), cambie el asunto a (por ejemplo) <quote>Re: Dificultades con la sincronización de PPP (was: ¿¿¡¡AYUDA!!??)</quote>. De esa manera, otras personas que intenten seguir el hilo tendrán menos dificultad para seguirlo.
pt_br: Se o remetente não respeitar as convenções de formato (linhas muito longas, linha de assunto imprópria), <emphasis>por favor</emphasis> conserte-o. No caso de uma linha de assunto incorreta (como <quote> HELP !! ?? </quote>), mude a linha de assunto para (digamos) <quote>Re: Dificuldades com a sincronização PPP (era: HELP !! ??)</quote>. Dessa forma, outras pessoas que tentam seguir o tópico terão menos dificuldade em segui-lo.

source: In such cases, it is appropriate to say what you did and why you did it, but try not to be rude. If you find you can not answer without being rude, do not answer.
es_es: En tales casos, es apropiado decir lo que hizo y por qué lo hizo, pero trate de no ser grosero. Si no puede responder sin ser grosero, no conteste.
pt_br: Nesses casos, é apropriado falar o que você fez e porque o fez, mas tente fazê-lo de forma a não ser rude. Se você notar que não consegue responder de uma forma que não seja rude, não responda.

source: If you just want to reply to a message because of its bad format, just reply to the submitter, not to the list. You can just send him this message in reply, if you like.
es_es: Si solo desea responder a un mensaje debido a su formato incorrecto, solo responda al remitente, no a la lista. Puede simplemente enviarle este mensaje como respuesta, si lo desea.
pt_br: Se você quer responder a uma mensagem somente pelo seu formato inadequado, responda-a somente para quem a enviou, não à lista. Você pode simplesmente enviar esta mensagem em resposta, se quiser.
