Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-questions/*.po
Languages: es_es, pt_br

source: Read the manual pages, and the FreeBSD documentation (either installed in <filename>/usr/doc</filename> or accessible via WWW at <uri xlink:href="http://www.FreeBSD.org">http://www.FreeBSD.org</uri>), especially the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">handbook</link> and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</link>.
es_es: Lea las páginas del manual y la documentación de FreeBSD (ya sea la instalada en <filename>/usr/doc</filename> o accesible a través de WWW en <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/index.html">http://www.FreeBSD.org</link>), especialmente el manual y las <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/index.html">FAQ</link>.
pt_br: Leia as páginas dos manuais, e a documentação do FreeBSD (tanto a instalada em <filename>/usr/doc</filename> ou a versão acessível via Web em <uri xlink:href="http://www.FreeBSD.org">http://www.FreeBSD.org</uri>), especialmente o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">handbook</link> e o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</link>.

source: Browse and/or search the archives for the mailing list, to see if your question or a similar one has been asked (and possibly answered) on the list. You can browse and/or search the mailing list archives at <uri xlink:href="https://www.FreeBSD.org/mail">https://www.FreeBSD.org/mail</uri> and <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">https://www.FreeBSD.org/search/search.html#mailinglists</uri> respectively. This can be done at other WWW sites as well, for example at <uri xlink:href="http://marc.theaimsgroup.com">http://marc.theaimsgroup.com</uri>.
es_es: Navegue y/o busque en los archivos de la lista de correo, para ver si su pregunta o una similar ya ha sido preguntada (y posiblemente contestada) en la lista. Puede navegar y/o buscar en los archivos de las listas de correo en <uri xlink:href="https://www.FreeBSD.org/mail">https://www.FreeBSD.org/mail</uri> y <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">https://www.FreeBSD.org/search/search.html#mailinglists</uri> respectivamente. También se puede hacer en otros sitios Web, por ejemplo en <uri xlink:href="http://marc.theaimsgroup.com">http://marc.theaimsgroup.com</uri>.
pt_br: Procure e/ou pesquise nos arquivos da lista de discussão, para verificar se a sua pergunta ou uma pergunta semelhante já foi feita (e possivelmente respondida) antes na lista. Você pode navegar e/ou pesquisar os arquivos da lista de discussão em <uri xlink:href="https://www.FreeBSD.org/mail">https://www.FreeBSD.org/mail</uri> e <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">https://www.FreeBSD.org/search/search.html#mailinglists</uri>, respectivamente. Isso pode ser feito em outros sites da Web, como por exemplo, em <uri xlink:href="http://marc.theaimsgroup.com">http://marc.theaimsgroup.com</uri>.

source: Use a search engine such as <link xlink:href="http://www.google.com">Google</link> or <link xlink:href="http://www.yahoo.com">Yahoo</link> to find answers to your question.
es_es: Use un motor de búsqueda como <link xlink:href="http://www.google.com">Google</link> o <link xlink:href="http://www.yahoo.com">Yahoo</link> para encontrar respuestas a su pregunta.

source: How to submit a question
es_es: Cómo enviar una pregunta
pt_br: Como enviar uma pergunta

source: When submitting a question to FreeBSD-questions, consider the following points:
es_es: Al enviar una pregunta a FreeBSD-questions, tenga en cuenta los siguientes puntos:
pt_br: Quando for enviar uma pergunta para a lista FreeBSD-questions, considere as seguintes diretivas:

source: Remember that nobody gets paid for answering a FreeBSD question. They do it of their own free will. You can influence this free will positively by submitting a well-formulated question supplying as much relevant information as possible. You can influence this free will negatively by submitting an incomplete, illegible, or rude question. It is perfectly possible to send a message to FreeBSD-questions and not get an answer even if you follow these rules. It is much more possible to not get an answer if you do not. In the rest of this document, we will look at how to get the most out of your question to FreeBSD-questions.
es_es: Recuerde que a nadie le pagan por responder una pregunta de FreeBSD. Lo hacen por su propia voluntad. Puede influir positivamente enviando una pregunta bien formulada y con la mayor cantidad de información relevante posible. Puede influir negativamente si envía una pregunta incompleta, ilegible o grosera. Es posible enviar un mensaje a FreeBSD-questions y no obtener una respuesta incluso siguiendo estas reglas. Y es muy posible no obtener respuesta si no las sigue. En el resto de este documento, veremos cómo sacar el máximo provecho de una pregunta a FreeBSD-questions.
pt_br: Lembre-se que ninguém é pago por responder uma pergunta sobre o FreeBSD. Eles fazem isso por vontade própria. Você pode influenciar positivamente esse livre arbítrio enviando uma pergunta bem formulada, fornecendo o máximo possível de informações relevantes. Você pode influenciar esse livre arbítrio negativamente enviando uma pergunta incompleta, ilegível ou grosseira. É perfeitamente possível enviar uma mensagem para a lista FreeBSD-questions e não obter uma resposta, mesmo que você siga estas regras. É muito mais fácil não obter uma resposta se você não o fizer. No restante deste documento, veremos como tirar o máximo proveito de uma pergunta para a FreeBSD-questions.

source: Not everybody who answers FreeBSD questions reads every message: they look at the subject line and decide whether it interests them. Clearly, it is in your interest to specify a subject. <quote>FreeBSD problem</quote> or <quote>Help</quote> are not enough. If you provide no subject at all, many people will not bother reading it. If your subject is not specific enough, the people who can answer it may not read it.
es_es: No todos los que responden a las preguntas de FreeBSD leen todos los mensajes: miran la línea del asunto y deciden si les interesa. Obviamente, le interesa especificar un asunto. <quote>Problema en FreeBSD</quote> o <quote>Ayuda</quote> no son suficientes. Si no proporciona ningún asunto, muchas personas no se molestarán ni en leerlo. Si su asunto no es lo suficientemente específico, las personas que puedan responderlo podrían no leerlo.
pt_br: Nem todo mundo que responde as perguntas sobre o FreeBSD lê todas as mensagens: eles olham para o assunto e decidem se isso lhes interessa. Claramente, é do seu interesse especificar um assunto. Assuntos como <quote>Problema do FreeBSD</quote> ou <quote>Ajuda</quote> não são suficientes. Se você não fornecer nenhum assunto, muitas pessoas não se incomodarão em lê-lo. Se o seu assunto não for específico o suficiente, as pessoas que podem responder sua pergunta podem não ler sua mensagem.

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. We appreciate that a lot of people do not speak English as their first language, and we try to make allowances for that, but it is really painful to try to read a message written full of typos or without any line breaks.
es_es: ¡Formatee su mensaje para que sea legible y, POR FAVOR, NO GRITE!!!!!. Somos conscientes de que muchas personas no hablan inglés como primer idioma, y damos un margen, pero es realmente doloroso tratar de leer un mensaje lleno de errores tipográficos o sin saltos de línea.
pt_br: Formate a sua mensagem para que ela fique legível e, POR FAVOR, NÃO GRITE !!!!! Nós apreciamos que muitas pessoas não falam inglês como sua primeira língua, e tentamos fazer concessões para isso, mas é realmente doloroso tentar ler uma mensagem escrita com erros de digitação ou sem quebras de linha.

source: Do not underestimate the effect that a poorly formatted mail message has, not just on the FreeBSD-questions mailing list. Your mail message is all people see of you, and if it is poorly formatted, one line per paragraph, badly spelt, or full of errors, it will give people a poor impression of you.
es_es: No subestime el efecto que un mensaje de correo mal formateado tiene, no sólo en la lista de correo FreeBSD-questions. Su mensaje de correo electrónico es lo que todas las personas ven de usted, y si está mal formateado, una línea por párrafo, mal escrito o lleno de errores, esto dará a la gente una mala impresión de usted.
pt_br: Não subestime o efeito que uma mensagem de correio mal formatada tem, não apenas na lista de discussão FreeBSD-questions. Sua mensagem de e-mail é o que todas as pessoas vêem de você, e se estiver mal formatada, uma linha por parágrafo, mal grafada ou cheia de erros, isso dará às pessoas uma má impressão sobre você.

source: A lot of badly formatted messages come from <link xlink:href="http://www.lemis.com/email.html">bad mailers or badly configured mailers</link>. The following mailers are known to send out badly formatted messages without you finding out about them:
es_es: Muchos mensajes mal formateados provienen de <link xlink:href="http://www.lemis.com/email.html">servicios de correo incorrectos o mal configurados</link>. Se sabe que los siguientes servicios de correo envían mensajes mal formateados sin que usted se entere de ello:
pt_br: Muitas mensagens mal formatadas vêm de <link xlink:href="http://www.lemis.com/email.html">clientes de email ruins ou mal-configurados</link>. Os seguintes clientes de email são conhecidos por enviar mensagens mal formatadas sem que você saiba sobre elas:

source: Try not to use <acronym>MIME</acronym>: a lot of people use mailers which do not get on very well with <acronym>MIME</acronym>.
es_es: Trate de no usar <acronym>MIME</acronym>: muchas personas usan correos que no se llevan muy bien con <acronym>MIME</acronym>.
pt_br: Tente não usar <acronym>MIME</acronym>: muitas pessoas usam clientes de email que não se dão muito bem com <acronym>MIME</acronym>.

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people you are trying to reach get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume they missed it and not bother to look.
es_es: Asegúrese de que su hora y zona horaria están configuradas correctamente. Esto puede parecer un poco tonto, ya que su mensaje sigue llegando, pero muchas de las personas a las que envía el mensaje reciben varios cientos de mensajes al día. Con frecuencia ordenan los mensajes entrantes por asunto y por fecha, y si su mensaje no llega antes de la primera respuesta, pueden asumir que lo perdieron y no se molestarán en mirar.
pt_br: Verifique se seu horário e fuso horário estão definidos corretamente. Isso pode parecer um pouco bobo, já que sua mensagem ainda será distribuída, mas muitas das pessoas que você está tentando alcançar recebem várias centenas de mensagens por dia. Eles frequentemente classificam as mensagens recebidas por assunto e por data, e se a sua mensagem não vem antes da primeira resposta, eles podem assumir que eles perderam e não se darão ao trabalho de procurar.

source: Do not include unrelated questions in the same message. Firstly, a long message tends to scare people off, and secondly, it is more difficult to get all the people who can answer all the questions to read the message.
es_es: No incluya preguntas que no están relacionadas en el mismo mensaje. En primer lugar, un mensaje largo tiende a asustar a la gente y, en segundo lugar, es más difícil conseguir que todas las personas que puedan responder a la pregunta lean el mensaje.
pt_br: Não inclua perguntas não relacionadas na mesma mensagem. Em primeiro lugar, uma mensagem longa tende a assustar as pessoas e, em segundo lugar, é mais difícil conseguir que todas as pessoas que podem responder a todas as perguntas leiam a mensagem.

source: Specify as much information as possible. This is a difficult area, and we need to expand on what information you need to submit, but here is a start:
es_es: Especifique la mayor cantidad de información posible. Es un área difícil, y necesitamos ampliar la información que necesita enviar, pero aquí un comienzo:
pt_br: Especifique o máximo de informação possível. Essa é uma área difícil, precisamos expandir e detalhar melhor quais informações você precisa enviar, mas aqui está um começo:

source: In nearly every case, it is important to know the version of FreeBSD you are running. This is particularly the case for FreeBSD-CURRENT, where you should also specify the date of the sources, though of course you should not be sending questions about -CURRENT to FreeBSD-questions.
es_es: En casi todos los casos, es importante conocer la versión de FreeBSD que se está ejecutando. En el caso particular de FreeBSD-CURRENT, también debe especificar la fecha del código fuente, aunque, obviamente, usted no debe enviar preguntas sobre -CURRENT a FreeBSD-questions.
pt_br: Em quase todos os casos, é importante conhecer a versão do FreeBSD que você está executando. Este é particularmente o caso do FreeBSD-CURRENT, onde você também deve especificar a data do código fonte, embora, obviamente, você não deva enviar perguntas sobre -CURRENT para a FreeBSD-questions.

source: With any problem which <emphasis>could</emphasis> be hardware related, tell us about your hardware. In case of doubt, assume it is possible that it is hardware. What kind of CPU are you using? How fast? What motherboard? How much memory? What peripherals?
es_es: Con cualquier problema que <emphasis>pueda</emphasis> estar relacionado con el hardware, infórmenos sobre su hardware. En caso de duda, supongamos que es posible que sea el hardware. ¿Qué tipo de CPU está utilizando? ¿Cómo de rápida? ¿Qué placa base? ¿Cuánta memoria? ¿Qué periféricos?
pt_br: Com qualquer problema que <emphasis>possa</emphasis> ser relacionado a hardware, informe-nos sobre o seu hardware. Em caso de dúvida, suponha que seja possível que seja hardware. Que tipo de CPU você está usando? Quão rápido? Qual placa-mãe? Quanta memória? Quais periféricos?

source: There is a judgement call here, of course, but the output of the <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> command can frequently be very useful, since it tells not just what hardware you are running, but what version of FreeBSD as well.
es_es: Se trata de una opinión personal, desde luego, pero la salida del comando <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> con frecuencia puede ser muy útil, ya que no solo indica qué hardware está ejecutando, sino también qué versión de FreeBSD.
pt_br: Há uma chamada de julgamento aqui, é claro, mas a saída do comando <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> frequentemente pode ser muito útil, já que não apenas informa qual hardware você está executando, mas qual a versão do FreeBSD também.

source: If you get error messages, do not say <quote>I get error messages</quote>, say (for example) <quote>I get the error message 'No route to host'</quote>.
es_es: Si recibe mensajes de error, no diga <quote>Recibo mensajes de error</quote>, diga (por ejemplo) <quote>Me aparece el mensaje de error 'No route to host'</quote>.
pt_br: Se você receber mensagens de erro, não diga <quote>eu recebo mensagens de erro</quote>, diga (por exemplo) <quote> eu recebo a mensagem de erro 'No route to host'</quote>.

source: If your system panics, do not say <quote>My system panicked</quote>, say (for example) <quote>my system panicked with the message 'free vnode isn't'</quote>.
es_es: Si su sistema entra en <quote>panic</quote>, no diga <quote>Mi sistema entró en panic</quote>, diga (por ejemplo) <quote>Mi sistema entró en panic con el mensaje 'free vnode isn't'</quote>.
pt_br: Se o seu sistema entrar em panic, não diga <quote>Meu sistema entrou em panic</quote>, diga (por exemplo) <quote>meu sistema entrou em panic com a mensagem 'free vnode isn't'</quote>.

source: If you have difficulty installing FreeBSD, please tell us what hardware you have. In particular, it is important to know the IRQs and I/O addresses of the boards installed in your machine.
es_es: Si tiene dificultades para instalar FreeBSD, díganos qué hardware tiene. En particular, es importante conocer las IRQ y las direcciones de I/O de las tarjetas instaladas en su máquina.
pt_br: Se você tiver dificuldades em instalar o FreeBSD, por favor, nos diga qual hardware você possui. Em particular, é importante conhecer os IRQs e os endereços de I/O das placas instaladas em sua máquina.

source: If you have difficulty getting PPP to run, describe the configuration. Which version of PPP do you use? What kind of authentication do you have? Do you have a static or dynamic IP address? What kind of messages do you get in the log file?
es_es: Si tiene dificultades para ejecutar PPP, describa la configuración. ¿Qué versión de PPP usa? ¿Qué tipo de autenticación tiene? ¿Tiene una dirección IP estática o dinámica? ¿Qué tipo de mensajes recibe en el archivo de log?
pt_br: Se você tiver dificuldade em executar o PPP, descreva a configuração. Qual versão do PPP você usa? Que tipo de autenticação você tem? Você tem um endereço IP estático ou dinâmico? Que tipo de mensagens você recebe no arquivo de log?

source: A lot of the information you need to supply is the output of programs, such as <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, or console messages, which usually appear in <filename>/var/log/messages</filename>. Do not try to copy this information by typing it in again; it is a real pain, and you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, redirect the output to a file and include that. For example,
es_es: Mucha de la información que debe proporcionar es la salida de programas, como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> o mensajes de consola, que generalmente aparecen en <filename>/var/log/messages</filename>. No intente copiar esa información escribiéndola de nuevo; es un suplicio, y cometerá un error. Para enviar el contenido del log, haga una copia del archivo y use un editor para recortar la información que sea relevante, o corte y pegue en su mensaje. Para la salida de programas como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, redirija la salida a un archivo e inclúyalo. Por ejemplo,
pt_br: Muitas das informações que você precisa fornecer são a saída de programas, como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, ou mensagens do console, que geralmente aparecem em <filename>/var/log/messages</filename>. Não tente copiar essa informação digitando-a novamente; é um sofrimento real e você está fadado a cometer um erro. Para enviar o conteúdo do arquivo de log, faça uma cópia do arquivo e use um editor para reduzir as informações apenas ao que for relevantes ou copie e cole na sua mensagem. Para a saída de programas como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, redirecione a saída para um arquivo e inclua-o. Por exemplo,

source: This redirects the information to the file <filename>/tmp/dmesg.out</filename>.
es_es: Esto redirige la información al archivo <filename>/tmp/dmesg.out</filename>.
pt_br: Isto redireciona a informação para o arquivo <filename>/tmp/dmesg.out</filename>.

source: If you do all this, and you still do not get an answer, there could be other reasons. For example, the problem is so complicated that nobody knows the answer, or the person who does know the answer was offline. If you do not get an answer after, say, a week, it might help to re-send the message. If you do not get an answer to your second message, though, you are probably not going to get one from this forum. Resending the same message again and again will only make you unpopular.
es_es: Si hace todo esto y no obtiene una respuesta, puede haber otras razones. Por ejemplo, el problema es tan complicado que nadie sabe la respuesta, o la persona que sabía la respuesta estaba offline. Si no obtiene respuesta después de, por ejemplo, una semana, puede ser útil reenviar el mensaje. Sin embargo, si no recibe respuesta a su segundo mensaje, es probable que no reciba respuesta de este foro. Reenviar el mismo mensaje una y otra vez solo le hará impopular.
pt_br: Se você fizer tudo isso e ainda não obtiver uma resposta, pode haver outras razões. Por exemplo, o problema é tão complicado que ninguém sabe a resposta, ou a pessoa que sabe a resposta estava offline. Se você não obtiver uma resposta depois de, digamos, uma semana, pode ajudar se você reenviar a mensagem. Se você não obtiver uma resposta para sua segunda mensagem, provavelmente não obterá uma deste fórum. Reenviar a mesma mensagem de novo e de novo só o tornará impopular.

source: To summarize, let's assume you know the answer to the following question (yes, it is the same one in each case). You choose which of these two questions you would be more prepared to answer:
es_es: Para resumir, supongamos que conoce la respuesta a la siguiente pregunta (sí, es la misma en cada caso). Usted elija cuál de estas dos preguntas estaría más preparado para responder:
pt_br: Para resumir, vamos supor que você saiba a resposta para a seguinte pergunta (sim, é a mesma em cada caso). Você escolhe qual destas duas perguntas você estaria mais preparado para responder:

source: Message 1
es_es: Mensaje 1
pt_br: Mensagem 1

source: Subject: HELP!!?!?? I just can't get hits damn silly FereBSD system to workd, and Im really good at this tsuff, but I have never seen anythign sho difficult to install, it jst wont work whatever I try so why don't you guys tell me what I doing wrong.
es_es: Asunto: ¿¿¡¿¡¡AYUDA!!?!?? No puedo conseguir que el maldito sistema FereBSD funcioned y soi realmente bueno en sto, pero nunca he visto nada tan dificil de instlar, simplmente no funciona intente lo que intente, así que, por qué no me dicen que estoy haciendo mal

source: Message 2
es_es: Mensaje 2
pt_br: Mensagem 2

source: Subject: Problems installing FreeBSD I've just got the FreeBSD 2.1.5 CDROM from Walnut Creek, and I'm having a lot of difficulty installing it. I have a 66 MHz 486 with 16 MB of memory and an Adaptec 1540A SCSI board, a 1.2GB Quantum Fireball disk and a Toshiba 3501XA CDROM drive. The installation works just fine, but when I try to reboot the system, I get the message <quote>Missing Operating System</quote>.
es_es: Asunto: Problemas al instalar FreeBSD Acabo de recibir el CDROM FreeBSD 2.1.5 de Walnut Creek y tengo muchas dificultades para instalarlo. Tengo un 486 con 66 MHz, 16 MB de memoria y una placa SCSI 1540A Adaptec, un disco Quantum Fireball de 1.2GB y una unidad de CDROM Toshiba 3501XA. La instalación funciona bien, pero cuando intento reiniciar el sistema, aparece el mensaje <quote>Missing Operating System</quote>.

source: How to follow up to a question
es_es: Cómo dar seguimiento a una pregunta
pt_br: Como acompanhar uma pergunta
