Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-questions/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: How to get best results from the FreeBSD-questions mailing list
es_es: Cómo obtener los mejores resultados de la lista de correo FreeBSD-questions
pt_br: Como obter os melhores resultados da lista de email FreeBSD-questions

source: This document provides useful information for people looking to prepare an e-mail to the FreeBSD-questions mailing list. Advice and hints are given that will maximize the chance that the reader will receive useful replies.
es_es: Este documento proporciona información útil para las personas que buscan preparar un correo electrónico para la lista de correo FreeBSD-questions. Se dan consejos y sugerencias que maximizarán la posibilidad de que el lector reciba respuestas útiles.
pt_br: Este documento provê informação para pessoas que desejam mandar um email para a lista de discussão FreeBSD-questions. Avisos e dicas são disponibilizados para maximizar a chance do leitor de receber respostas úteis.

source: This document is regularly posted to the FreeBSD-questions mailing list.
es_es: Este documento se publica regularmente en la lista de correo FreeBSD-questions.
pt_br: Esse documento é regularmente postado na lista de email FreeBSD-questions.

source: Introduction
es_es: Introducción
pt_br: Introdução

source: <literal>FreeBSD-questions</literal> is a mailing list maintained by the FreeBSD project to help people who have questions about the normal use of FreeBSD. Another group, <literal>FreeBSD-hackers</literal>, discusses more advanced questions such as future development work.
es_es: <literal>FreeBSD-questions</literal> es una lista de correo mantenida por el proyecto FreeBSD para ayudar a las personas que tienen preguntas sobre el uso cotidiano de FreeBSD. Otro grupo, <literal>FreeBSD-hackers</literal>, discute preguntas más avanzadas, como el trabajo a desarrollar en el futuro.
pt_br: A <literal>FreeBSD-questions</literal> é uma lista de emails mantida pelo Projeto FreeBSD para ajudar pessoas que tenham questões sobre o uso normal do FreeBSD. Outra lista, a <literal>FreeBSD-hackers</literal>, aborda questões mais avançadas tais como desenvolvimentos futuros.

source: The term <quote>hacker</quote> has nothing to do with breaking into other people's computers. The correct term for the latter activity is <quote>cracker</quote>, but the popular press has not found out yet. The FreeBSD hackers disapprove strongly of cracking security, and have nothing to do with it. For a longer description of hackers, see Eric Raymond's <link xlink:href="http://www.catb.org/~esr/faqs/hacker-howto.html">How To Become A Hacker</link>
es_es: El término <quote>hacker</quote> no tiene nada que ver con irrumpir en los ordenadores de otras personas. El término correcto para esta actividad es <quote>cracker</quote>, pero la prensa popular todavía no es conocedora. Los hackers de FreeBSD desaprueban enérgicamente las actividades de craqueo y no se involucran en este tipo de actividades. Para obtener una descripción más amplia de los hackers, consulte <link xlink:href="http://www.catb.org/~esr/faqs/hacker-howto.html">Cómo convertirse en un hacker</link> de Eric Raymond
pt_br: O termo <quote>hacker</quote> não tem nada a ver com invasão de computadores alheios.O termo correto para este tipo de atividade é <quote>cracker</quote>, mas a mídia popular e a imprensa não tomou conhecimento deste fato ainda. Os hackers do FreeBSD fortemente desaprovam a atividade de cracking e não se envolvem neste tipo de atividades. Para uma descrição mais abrangente sobre hackers, veja o link de Eric Raymond's <link xlink:href="http://www.catb.org/~esr/faqs/hacker-howto.html">How To Become A Hacker</link>

source: This is a regular posting aimed to help both those seeking advice from FreeBSD-questions (the <quote>newcomers</quote>), and also those who answer the questions (the <quote>hackers</quote>).
es_es: Esta es una publicación regular destinada a ayudar tanto a aquellos que buscan consejos en la lista FreeBSD-questions (los <quote>recién llegados</quote>), como a aquellos que responden a las preguntas (los <quote>hackers</quote>).
pt_br: Esta é uma mensagem padrão com vistas a ajudar tanto quem busca ajuda na lista FreeBSD-questions (os <quote>novatos</quote>), quanto quem responde às questões (os <quote>hackers</quote>).

source: Inevitably there is some friction, which stems from the different viewpoints of the two groups. The newcomers accuse the hackers of being arrogant, stuck-up, and unhelpful, while the hackers accuse the newcomers of being stupid, unable to read plain English, and expecting everything to be handed to them on a silver platter. Of course, there is an element of truth in both these claims, but for the most part these viewpoints come from a sense of frustration.
es_es: Inevitablemente hay cierta fricción, que se deriva de los diferentes puntos de vista de los dos grupos. Los recién llegados acusan a los hackers de ser arrogantes, malhumorados y de poca ayuda, mientras que los hackers acusan a los recién llegados de ser estúpidos, incapaces de leer textos sencillos en español y esperar que todo les sea entregado en bandeja de plata. Por supuesto, hay cierta verdad en ambas afirmaciones, pero en su mayor parte estos puntos de vista provienen de un sentimiento de frustración.
pt_br: Inevitavelmente sempre existe algum atrito, o qual deriva dos diferentes pontos de vista dos dois grupos. Os novatos acusam os hackers de serem arrogantes, orgulhosos e não ajudarem, enquanto os hackers acusam os novatos de serem burros, incapazes de lerem textos em simples Português, e esperarem que tudo seja dado a eles em uma bandeja de prata. Claro que há algum elemento de verdade em cada um dos discursos, mas normalmente estes pontos de vista são frutos de algum tipo de frustração.

source: In this document, I would like to do something to relieve this frustration and help everybody get better results from FreeBSD-questions. In the following section, I recommend how to submit a question; after that, we will look at how to answer one.
es_es: En este documento, me gustaría hacer algo para aliviar esta frustración y ayudar a todos a obtener mejores resultados de FreeBSD-questions. En la siguiente sección, recomendaré cómo enviar una pregunta; después, veremos cómo responderla.
pt_br: Nesse documento, eu desejo fazer algo para aliviar essa frustração e ajudar todos a obterem melhores resultados da FreeBSD-questions. Na próxima seção, eu recomendo como enviar uma pergunta; depois disso, veremos como responder a uma.

source: How to subscribe to FreeBSD-questions
es_es: Cómo suscribirse a FreeBSD-questions
pt_br: Como se inscrever na FreeBSD-questions

source: FreeBSD-questions is a mailing list, so you need mail access. Point your WWW browser to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">information page of the FreeBSD-questions mailing list</link>. In the section titled <quote>Subscribing to freebsd-questions</quote> fill in the <quote>Your email address</quote> field; the other fields are optional.
es_es: FreeBSD-questions es una lista de correo, por lo que necesita una cuenta de correo electrónico. Acceda con su navegador web a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">página de información de la lista FreeBSD-questions</link>. En la sección titulada <quote>Suscribirse a freebsd-questions</quote> rellena el campo <quote>Su dirección de correo electrónico</quote>; los demás campos son opcionales.
pt_br: A FreeBSD-questions é uma lista de email, então você precisa de uma conta de email. Aponte o seu navegador Web para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">página de informações da lista FreeBSD-questions</link>. Na seção entitulada <quote>Inscrevendo-se na freebsd-questions</quote> preencha o campo <quote>Seu endereço de email</quote>; os demais campos são opcionais.

source: The password fields in the subscription form provide only mild security, but should prevent others from messing with your subscription. <emphasis>Do not use a valuable password</emphasis> as it will occasionally be emailed back to you in cleartext.
es_es: El campo contraseña en el formulario de suscripción solo proporciona una seguridad moderada, pero debería evitar que otros accedan con su suscripción. <emphasis>No use una contraseña valiosa</emphasis> ya que de manera ocasional se le enviará por correo electrónico en texto plano.
pt_br: O campo para senha no formulário de inscrição proporciona somente uma segurança moderada, mas deve evitar que outros enviem mensagens usando sua conta. <emphasis>Não use uma senha importante para você</emphasis> pois ela eventualmente poderá ser enviada para você por email em texto plano.

source: You will receive a confirmation message from <application>mailman</application>; follow the included instructions to complete your subscription.
es_es: Recibirá un mensaje de confirmación de <application>mailman</application>; siga las instrucciones incluidas en el mensaje para completar su suscripción.
pt_br: Você receberá uma mensagem de confirmação do <application>mailman</application>; siga as instruções incluídas na mensagem para completar sua inscrição.

source: Finally, when you get the <quote>Welcome</quote> message from <application>mailman</application> telling you the details of the list and subscription area password, <emphasis>please save it</emphasis>. If you ever should want to leave the list, you will need the information there. See the next section for more details.
es_es: Finalmente, cuando reciba el mensaje de <quote>Bienvenida</quote> de <application>mailman</application> informando los detalles de la lista y la contraseña para acceder al área restringida, <emphasis>por favor guárdelo</emphasis>. Si algún día desea salir de la lista, necesitará la información contenida en este mensaje. Vea la siguiente sección para más detalles.
pt_br: Finalmente, quando você receber a mensagem de <quote>Boas-vindas</quote> do <application>mailman</application> informando os detalhes da lista e a senha para acesso à área restrita, <emphasis>por favor salve-a</emphasis>. Se você algum dia desejar sair da lista, você necessitará das informações contidas nesta mensagem. Veja a próxima seção para mais detalhes.

source: How to unsubscribe from FreeBSD-questions
es_es: Cómo darse de baja de FreeBSD-questions
pt_br: Como sair da lista FreeBSD-questions

source: When you subscribed to FreeBSD-questions, you got a welcome message from <application>mailman</application>. In this message, amongst other things, it told you how to unsubscribe. Here is a typical message:
es_es: Cuando se subscribió a FreeBSD-Questions, recibió un mensaje de bienvenida de <application>mailman</application>. En este mensaje, entre otras cosas, le indicaba cómo darse de baja. Un mensaje típico:
pt_br: Quando você se inscreve na lista FreeBSD-questions, você recebe uma mensagem de boas-vindas do <application>mailman</application>. Nessa mensagem, dentre outras coisas, é informado como sair da lista. Segue um exemplo desta mensagem:

source: Welcome to the freebsd-questions@freebsd.org mailing list! To post to this list, send your email to: freebsd-questions@freebsd.org General information about the mailing list is at: https://lists.freebsd.org/mailman/listinfo/freebsd-questions If you ever want to unsubscribe or change your options (e.g., switch to or from digest mode, change your password, etc.), visit your subscription page at: https://lists.freebsd.org/mailman/options/freebsd-questions/grog%40lemsi.de You can also make such adjustments via email by sending a message to: freebsd-questions-request@freebsd.org with the word `help' in the subject or body (don't include the quotes), and you will get back a message with instructions. You must know your password to change your options (including changing the password, itself) or to unsubscribe. It is: 12345 Normally, Mailman will remind you of your freebsd.org mailing list passwords once every month, although you can disable this if you prefer. This reminder will also include instructions on how to unsubscribe or change your account options. There is also a button on your options page that will email your current password to you.
es_es: ¡Bienvenido a la lista de correo de freebsd-questions@freebsd.org! Para mandar un mensaje a esta lista, envíelo a: freebsd-questions@freebsd.org Puede obtener información general sobre la lista en: https://lists.freebsd.org/mailman/listinfo/freebsd-questions Si alguna vez desea anular su subscripción o cambiar las opciones de la misma (p.ej.: cambiarse a modo resumido o no, cambiar su clave, etc.), consulte la página de su subscripción en: https://lists.freebsd.org/mailman/options/freebsd-questions/grog%40lemsi.de También puede realizar estos cambios por medio de correo electrónico, enviando un mensaje a: freebsd-questions-request@freebsd.org indicando la palabra "help" en el asunto (no ponga las comillas) o en el cuerpo del mensaje. Se le devolverá un mensaje con instrucciones. Tiene que saber su clave para poder cambiar sus opciones (incluido el cambio de la propia clave) o para anular su subscripción. Su clave es: 12345 Normalmente, Mailman le recordará mensualmente las claves que tenga en las listas de distribución de freebsd.org, aunque si lo prefiere, puede inhabilitar este comportamiento. El recordatorio también incluirá instrucciones sobre cómo anular su subscripción o cómo cambiar los parámetros de subscripción. En la página de opciones hay un botón que le enviará un mensaje de correo electrónico con su clave.
pt_br: Bem-vindo à lista de discussão freebsd-questions@freebsd.org! Para enviar uma mensagem para esta lista, mande seu email para: freebsd-questions@freebsd.org Informações gerais sobre a lista estão em: https://lists.freebsd.org/mailman/listinfo/freebsd-questions Se você eventualmente desejar sair da lista ou alterar suas opções (ex. mudar para o modo resumo diário ou para sair dele, mudar senha, etc.) visite sua página de inscrição em: https://lists.freebsd.org/mailman/options/freebsd-questions/grog%40lemsi.de Você pode também fazer estes ajustes por email, enviando uma mensagem para: freebsd-questions-request@freebsd.org com a palavra `help` no campo Assunto ou no corpo (não inclua as aspas), e você receberá uma mensagem com instruções. Você precisa saber sua senha para alterar as opções (incluindo alterar a própria senha) ou para sair da lista. Ela é: 12345 Normalmente, Mailman lembrará você de sua senha na lista do freebsd.org uma vez por mês, mas você pode desabilitar isto se assim desejar. Este lembrete também incluirá instruções de como sair da lista ou alterar suas preferências de conta. Há também um botão na sua página de opções que enviará sua senha atual para você.

source: From the URL specified in your <quote>Welcome</quote> message you may visit the <quote>Account management page</quote> and enter a request to <quote>Unsubscribe</quote> you from FreeBSD-questions mailing list.
es_es: Desde la dirección URL que aparece en el mensaje de <quote>Bienvenida</quote>, puede visitar la <quote>Página de administración de su cuenta</quote> y hacer una solicitud para <quote>Darse de baja</quote> de la lista FreeBSD-questions.
pt_br: A partir da URL informada na sua mensagem de <quote>Boas-vindas</quote> você pode visitar a <quote>Página de gerenciamento da sua conta</quote> e fazer uma requisição para <quote>Sair</quote> da lista FreeBSD-questions.

source: A confirmation message will be sent to you from <application>mailman</application>; follow the included instructions to finish unsubscribing.
es_es: Se le enviará un mensaje de confirmación de <application>mailman</application>; siga las instrucciones incluidas para terminar de darse de baja.
pt_br: Uma mensagem de confirmação será enviada para você pelo <application>mailman</application>; siga as instruções contidas na mensagem para finalizar o desligamento da lista.

source: If you have done this, and you still can not figure out what is going on, send a message to <email>freebsd-questions-request@FreeBSD.org</email>, and they will sort things out for you. <emphasis>Do not</emphasis> send a message to FreeBSD-questions: they can not help you.
es_es: Si ya lo ha hecho, y aún no ha podido entender lo que está ocurriendo, envíe un mensaje a <email>freebsd-questions-request@FreeBSD.org</email>, y lo resolverán por usted. <emphasis>No envíe</emphasis> un mensaje a FreeBSD-questions: no pueden ayudarle.
pt_br: Se você já fez isso, e ainda não conseguiu entender o que está havendo, mande uma mensagem para <email>freebsd-questions-request@FreeBSD.org</email>, e eles irão resolver as coisas para você. <emphasis>Não envie</emphasis> uma mensagem para a FreeBSD-questions: eles não podem ajudá-lo.

source: Should I ask <literal>-questions</literal> or <literal>-hackers</literal>?
es_es: ¿Debo preguntar en <literal>-questions</literal> o en <literal>-hackers</literal>?
pt_br: Devo perguntar na lista <literal>-questions</literal> ou na <literal>-hackers</literal>?

source: Two mailing lists handle general questions about FreeBSD, <literal>FreeBSD-questions</literal> and <literal>FreeBSD-hackers</literal>. In some cases, it is not really clear which group you should ask. The following criteria should help for 99% of all questions, however:
es_es: Dos listas de correo manejan las preguntas generales sobre FreeBSD, <literal>FreeBSD-questions</literal> y <literal>FreeBSD-hackers</literal>. En algunos casos, no está realmente claro a qué grupo debe preguntar. Sin embargo, los siguientes criterios deberían ayudar en el 99% de los casos:
pt_br: Duas listas de discussão abordam questões gerais sobre o FreeBSD, <literal>FreeBSD-questions</literal> e <literal>FreeBSD-hackers</literal>. Em alguns casos, não é realmente claro para qual lista você deve enviar sua pergunta. Entretanto, os seguintes critérios devem ajudar em 99% de todas as perguntas:

source: If the question is of a general nature, ask <literal>FreeBSD-questions</literal>. Examples might be questions about installing FreeBSD or the use of a particular <trademark class="registered">UNIX</trademark> utility.
es_es: Si la pregunta es de carácter general, pregunte en <literal>FreeBSD-questions</literal>. Como ejemplos podrían ser preguntas sobre la instalación de FreeBSD o el uso de una utilidad particular de <trademark class="registered">UNIX</trademark>.
pt_br: Se a questão é genérica, pergunte na <literal>FreeBSD-questions</literal>. Como exemplo temos questões sobre a instalação do FreeBSD ou o uso de uma ferramenta do<trademark class="registered">UNIX</trademark>.

source: If you think the question relates to a bug, but you are not sure, or you do not know how to look for it, send the message to <literal>FreeBSD-questions</literal>.
es_es: Si usted cree que la pregunta está relacionada con un error, pero no está seguro de ello, o no sabe cómo buscarlo, envíe el mensaje a <literal>FreeBSD-questions</literal>.
pt_br: Se você acredita que a pergunta está relacionada a um bug, mas não tem certeza disso, ou você não sabe como pesquisar sobre isso, mande a mensagem para a lista <literal>FreeBSD-questions</literal>.

source: If the question relates to a bug, and you are <emphasis>sure</emphasis> that it is a bug (for example, you can pinpoint the place in the code where it happens, and you maybe have a fix), then send the message to <literal>FreeBSD-hackers</literal>.
es_es: Si la pregunta está relacionada con un error, y está <emphasis>seguro</emphasis> de que se trata de un error (por ejemplo, puede ubicar el lugar en el código donde ocurre, y quizás tenga una solución), envíe el mensaje a <literal>FreeBSD-hackers</literal>.
pt_br: Se você acredita que a pergunta está relacionada com um bug, e você tem <emphasis>certeza</emphasis> que é um bug (por exemplo, você pode apontar o lugar do código onde isso acontece, e você poder ter uma correção para o problema), então envie a mensagem para a lista <literal>FreeBSD-hackers</literal>.

source: If the question relates to enhancements to FreeBSD, and you can make suggestions about how to implement them, then send the message to <literal>FreeBSD-hackers</literal>.
es_es: Si la pregunta está relacionada con mejoras en FreeBSD, y puede sugerir cómo implementarlas, envíe el mensaje a <literal>FreeBSD-hackers</literal>.
pt_br: Se a questão envolve melhoramentos no FreeBSD, e você pode sugerir em como isto pode ser implementado, então mande a menssagem para a lista <literal>FreeBSD-hackers</literal>.

source: There are also a number of other <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-mail.html">specialized mailing lists</link>, which caters to more specific interests. The criteria above still apply, and it is in your interest to stick to them, since you are more likely to get good results that way.
es_es: También hay una serie de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-mail.html">listas de correo especializadas</link>, que atienden a intereses más específicos. Los criterios anteriores se aplican, y es de su interés atenerse a ellos, ya que es más probable que obtenga buenos resultados de esa manera.
pt_br: Há também uma boa quantidade de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources-mail.html">listas de email especializadas</link>, que atendem interesses mais específicos. O critério acima ainda se aplica, e é interessante que você o siga, pois há mais chance de você obter melhores resultados desta forma.

source: Before submitting a question
es_es: Antes de enviar una pregunta
pt_br: Antes de enviar uma pergunta

source: You can (and should) do some things yourself before asking a question on one of the mailing lists:
es_es: Usted puede (y debe) hacer algunas cosas antes de realizar una pregunta en una de las listas de correo:
pt_br: Você pode (e deve) fazer algumas coisas você mesmo antes de fazer uma pergunta em uma das listas de discussão:

source: Try solving the problem on your own. If you post a question which shows that you have tried to solve the problem, your question will generally attract more positive attention from people reading it. Trying to solve the problem yourself will also enhance your understanding of FreeBSD, and will eventually let you use your knowledge to help others by answering questions posted to the mailing lists.
es_es: Intente resolver el problema por su cuenta. Si publica una pregunta que demuestra que ha intentado resolver el problema, generalmente atraerá una atención más positiva de las personas que la lean. Tratar de resolver el problema por sí mismo también mejorará su comprensión de FreeBSD y, eventualmente, le permitirá utilizar su conocimiento para ayudar a otros respondiendo las preguntas publicadas en las listas de correo.
pt_br: Tente resolver o problema sozinho. Se você enviar uma pergunta que demonstre que você tentou resolver o problema, sua mensagem vai normalmente atrair mais atenção de uma forma positiva das pessoas que a leram. Tentar resolver o problema sozinho também vai aumentar seu entendimento do FreeBSD, e eventualmente vai proporcionar conhecimento para você poder responder perguntas de outros usuários das listas e também ajudar.
