freebsd/freebsd-doc/ru_RU.KOI8-R/man/man1/hostname.1
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hostname.1	8.2 (Berkeley) 4/28/95
.\" %FreeBSD: src/bin/hostname/hostname.1,v 1.21 2006/12/08 07:47:08 kientzle Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/hostname.1,v 1.6 2007/11/20 07:08:32 ru Exp $
.\" $FreeBSD$
.\"
.Dd 7 декабря 2006
.Dt HOSTNAME 1
.Os
.Sh НАЗВАНИЕ
.Nm hostname
.Nd установить или вывести имя текущего хоста
.Sh СИНТАКСИС
.Nm
.Op Fl fs
.Op Ar имя-хоста
.Sh ОПИСАНИЕ
Утилита
.Nm
выводит имя текущего хоста.
Суперпользователь может
установить имя хоста, указав его в аргументе; обычно это делается
из командного сценария инициализации
.Pa /etc/rc.d/hostname ,
во время начальной загрузки системы.
Этот сценарий использует переменную
.Va hostname
из
.Pa /etc/rc.conf .
.Pp
Опции:
.Bl -tag -width flag
.It Fl f
Показывать доменную часть имени.
Это поведение по умолчанию.
.It Fl s
Не показывать доменную часть имени.
.El
.Sh СМОТРИ ТАКЖЕ
.Xr gethostname 3 ,
.Xr rc.conf 5
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Bx 4.2 .
