freebsd/freebsd-doc/ru_RU.KOI8-R/man/man1/kbdmap.1
.\" Copyright (c) March 1995 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kbdmap/kbdmap.1,v 1.34 2006/12/25 18:36:53 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/kbdmap.1,v 1.1 2006/12/25 18:43:40 ru Exp $
.\" $FreeBSD$
.Dd 3 июля 2002
.Dt KBDMAP 1
.Os
.Sh НАЗВАНИЕ
.Nm kbdmap ,
.Nm vidfont
.Nd интерфейсная часть для syscons
.Sh СИНТАКСИС
.Nm
.Op Fl K
.Op Fl V
.Op Fl d | default
.Op Fl h | help
.Op Fl l | lang Ar язык
.Op Fl p | print
.Op Fl r | restore
.Op Fl s | show
.Op Fl v | verbose
.Sh ОПИСАНИЕ
Утилита
.Nm
производит упрощённую настройку раскладки клавиатуры (keymap) из перечня
доступных.
Команда
.Nm vidfont
обеспечивает настройку шрифтов.
Обе просматривают базу данных на наличие раскладок и шрифтов.
По умолчанию описание даётся на английском языке, но также может быть и на
других языках.
Эти программы являются интерактивными и предназначены для запуска в терминале
для получения требуемых входных данных (например, выбора раскладки клавиатуры)
от пользователя.
.Pp
Настоятельно не рекомендуется выбирать раскладку клавиатуры и шрифты из кодовой
страницы
.Tn MSDOS .
Используйте версию стандарта
.Tn ISO ,
если таковая доступна!
.Tn X11
не поддерживает кодовую страницу
.Tn MSDOS .
.Pp
Имеются следующие опции:
.Bl -tag -width indent
.It Fl K
Запустить в качестве команды
.Nm .
.It Fl V
Запустить в качестве команды
.Nm vidfont .
.It Fl d , default
Использовать язык по умолчанию.
Игнорировать переменную окружения
.Ev LANG .
.It Fl h , help
Вывести доступные опции и выйти.
.It Fl l , lang Ar язык
Использовать
.Ar язык
в описании и меню.
.It Fl p , print
Вывести описание доступных раскладок и шрифтов на стандартный вывод
и выйти.
.It Fl r , restore
Загрузить шрифт по умолчанию из
.Pa /etc/rc.conf .
.It Fl s , show
Показать поддерживаемые в настоящий момент языки и выйти.
.It Fl v , verbose
Больше предупреждений.
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width LANG -compact
.It Ev LANG
предпочитаемый язык
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /usr/share/syscons/keymaps/INDEX.keymaps" -compact
.It Pa /usr/share/syscons/keymaps/INDEX.keymaps
база данных раскладок
.It Pa /usr/share/syscons/fonts/INDEX.fonts
база данных шрифтов
.It Pa /etc/rc.conf
шрифт по умолчанию
.It Pa /usr/X11/lib/X11/locale/locale.alias
описывает основные значения
.Ev LANG
.El
.Sh СМОТРИ ТАКЖЕ
.Xr dialog 1 ,
.Xr kbdcontrol 1 ,
.Xr vidcontrol 1 ,
.Xr kbdmap 5 ,
.Xr rc.conf 5
.Sh ИСТОРИЯ
Команды
.Nm
и
.Nm vidfont
появились во
.Fx 2.1 .
.Sh АВТОРЫ
.An -nosplit
.An Wolfram Schneider
.Aq wosch@FreeBSD.org
написал оригинальную версию на Perl.
.An Jonathan Belson
.Aq jon@witchspace.com
является автором текущей версии, переписанной на C для
.Fx 5.0 .
.Sh ПРОБЛЕМЫ
.\" .Nm kbdmap/vidfont
.\" does not know which font is in use. E.g. if the current font
.\" is iso-8859-1 and you chose lang 'ru' (for Russian)
.\" you get funny latin1 characters and not russkij shrift.
.\"
Утилиты
.Nm
и
.Nm vidfont
работают только в (виртуальной) консоли, но не в
.Tn X11 .
