freebsd/freebsd-doc/documentation/manual-pages/fr/man4/amd.4
.\"
.\" Copyright (c) 1999 Alexey Zelkin
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\" $Id: amd.4,v 1.1 2002-09-29 16:08:34 blackend Exp $
.\" Original revision: 1.6
.\"
.Dd December 13, 1999
.Dt AMD 4
.Os
.Sh NAME
.Nm amd
.Nd Pilote pour circuit SCSI PCI amd53c974
.Sh SYNOPSIS
.Cd "device amd"
.Sh DESCRIPTION
Le pilote
.Nm
fournit le support pour les cartes SCSI basées sur le circuit
.Tn amd53c974 ,
comme la Tekram DC390 ou la Tekram DC390T.
.Sh VOIR AUSSI
.Xr cd 4 ,
.Xr ch 4 ,
.Xr da 4 ,
.Xr intro 4 ,
.Xr sa 4 ,
.Xr scsi 4
.Sh AUTHORS
Le pilote
.Nm
a été écrit et soumis à
.Fx
par Tekram, Inc.
