freebsd/freebsd-doc/documentation/manual-pages/fr/man4/spic.4
.\"
.\" Copyright (c) 2002 Will Andrews
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\" $Id: spic.4,v 1.1 2002-09-29 20:39:12 blackend Exp $
.\" Original revision: 1.2
.\"
.Dd May 20, 2002
.Dt SPIC 4
.Os
.Sh NAME
.Nm spic
.Nd Pilote de périphérique du contrôleur d'E/S programmable Sony
.Sh SYNOPSIS
.Cd "device spic"
.Sh DESCRIPTION
Le pilote
.Nm
permet l'utilisation de
.Xr moused 8
pour contrôler le périphérique Vaio Jogdial de Sony présent sur
plusieurs modèles de Vaio Sony.  Il fonctionne en faisant correspondre
les entrées avancée, retour, haut, et bas avec
.Dq l ,
.Dq r ,
.Dq u ,
et
.Dq d ,
respectivement.
A partir de ceal un programme lisant le Jogdial peut décidé que faire.
Certaines actions pourront inclure le défilement, l'imitation du
fonctionnement de la souris, le lancement d'applications, ou d'autres
choses utiles.
.Sh HISTORIQUE
Le pilote de périphérique
.Nm
est apparu pour la première fois sous
.Fx 4.6 .
.Sh VOIR AUSSI
.Xr moused 8
.Sh AUTEURS
.An Nick Sayer Aq nsayer@FreeBSD.org
.An Will Andrews Aq will@FreeBSD.org
