Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/rc-scripting/_index.po
Languages: es, pt_br, ru

source: A little consideration before starting `$EDITOR` will not hurt. To write a well-tempered [.filename]#rc.d# script for a system service, we should be able to answer the following questions first:
ru: Немного размышлений перед запуском `$EDITOR` не повредит. Чтобы написать хорошо продуманный скрипт [.filename]#rc.d# для системной службы, сначала нужно ответить на следующие вопросы:

source: Is the service mandatory or optional?
es: ¿El servicio es obligatorio u opcional?
pt_br: O serviço é obrigatório ou opcional?
ru: Является ли служба обязательной или опциональной?

source: Will the script serve a single program, e.g., a daemon, or perform more complex actions?
es: ¿El script servirá a un solo programa, por ejemplo, un demonio, o realizará acciones más complejas?
pt_br: O script servirá um único programa, por exemplo, um daemon, ou realizará ações mais complexas?
ru: Будет ли скрипт обслуживать одну программу, например, демон, или выполнять более сложные действия?

source: Which other services will our service depend on, and vice versa?
es: ¿De qué otros servicios dependerá nuestro servicio y viceversa?
pt_br: De quais outros serviços nosso serviço dependerá e vice-versa?
ru: От каких других служб зависит наша служба, и наоборот?

source: From the examples that follow we will see why it is important to know the answers to these questions.
es: De los ejemplos que siguen veremos por qué es importante conocer las respuestas a estas preguntas.
pt_br: A partir dos exemplos que se seguem, veremos o porque é importante conhecer as respostas a essas perguntas.
ru: Из следующих примеров мы увидим, почему важно знать ответы на эти вопросы.

source: A dummy script
es: Un guión ficticio
pt_br: Um script fictício
ru: Примитивный скрипт

source: The following script just emits a message each time the system boots up:
es: El siguiente script simplemente emite un mensaje cada vez que se inicia el sistema:
pt_br: O script a seguir apenas emite uma mensagem toda vez que o sistema é inicializado:
ru: Следующий скрипт просто выводит сообщение каждый раз при загрузке системы:

source: Things to note are:
es: Las cosas a tener en cuenta son:
pt_br: Os pontos a serem observados são:
ru: Вот что следует учитывать:

source: &#10122; An interpreted script should begin with the magic "shebang" line. That line specifies the interpreter program for the script. Due to the shebang line, the script can be invoked exactly like a binary program provided that it has the execute bit set. (See man:chmod[1].) For example, a system admin can run our script manually, from the command line:
es: &#10122; Un script interpretado debería empezar con la línea mágica "shebang". Esa línea especifica el programa intérprete para el script. Gracias a la línea shebang, el script se puede invocar exactamente igual que un programa binario si se ha establecido el bit de ejecución. (Consulta man:chmod[1].) Por ejemplo, un administrador puede ejecutar nuestro script de forma manual, desde la línea de comando:
pt_br: &#10122; Um script interpretado deve começar com a linha mágica "shebang". Essa linha especifica o programa interpretador para o script. Devido à linha shebang, o script pode ser invocado exatamente como um programa binário, desde que tenha o bit de execução definido. (Veja man:chmod[1].) Por exemplo, um administrador do sistema pode executar nosso script manualmente, a partir da linha de comando:
ru: &#10122; Интерпретируемый скрипт должен начинаться с "волшебной" строки shebang. Эта строка указывает программу-интерпретатор для скрипта. Благодаря строке shebang скрипт может быть запущен точно так же, как бинарная программа, при условии что у него установлен бит выполнения. (См. man:chmod[1].) Например, системный администратор может запустить наш скрипт вручную из командной строки:

source: To be properly managed by the [.filename]#rc.d# framework, its scripts need to be written in the man:sh[1] language. If you have a service or port that uses a binary control utility or a startup routine written in another language, install that element in [.filename]#/usr/sbin# (for the system) or [.filename]#/usr/local/sbin# (for ports) and call it from a man:sh[1] script in the appropriate [.filename]#rc.d# directory.
ru: Для корректного управления в рамках [.filename]#rc.d# скрипты должны быть написаны на языке man:sh[1]. Если у вас есть служба или порт, который использует двоичную утилиту управления или процедуру запуска, написанную на другом языке, установите этот компонент в [.filename]#/usr/sbin# (для системы) или [.filename]#/usr/local/sbin# (для портов) и вызовите его из man:sh[1] скрипта в соответствующем каталоге [.filename]#rc.d#.

source: If you would like to learn the details of why [.filename]#rc.d# scripts must be written in the man:sh[1] language, see how [.filename]#/etc/rc# invokes them by means of `run_rc_script`, then study the implementation of `run_rc_script` in [.filename]#/etc/rc.subr#.
es: Si quieres conocer los detalles acerca de por qué los scripts de [.filename]#rc.d# se tienen que escribir en lenguaje man:sh[1], consulta cómo [.filename]#/etc/rc# los invoca mediante `run_rc_script`, luego estudia la implementación de `run_rc_script` en [.filename]#/etc/rc.subr#.
pt_br: Se você gostaria de aprender os detalhes de por que os scripts [.filename]#rc.d# devem ser escritos na linguagem man:sh[1], veja como o [.filename]#/etc/rc# os invoca por meio de `run_rc_script` e, em seguida, estude a implementação de `run_rc_script` em [.filename]#/etc/rc.subr#.
ru: Если вы хотите узнать подробности о том, почему скрипты [.filename]#rc.d# должны быть написаны на языке man:sh[1], изучите, как [.filename]#/etc/rc# вызывает их с помощью `run_rc_script`, а затем изучите реализацию `run_rc_script` в [.filename]#/etc/rc.subr#.

source: &#10123; In [.filename]#/etc/rc.subr#, a number of man:sh[1] functions are defined for an [.filename]#rc.d# script to use. The functions are documented in man:rc.subr[8]. While it is theoretically possible to write an [.filename]#rc.d# script without ever using man:rc.subr[8], its functions prove extremely handy and make the job an order of magnitude easier. So it is no surprise that everybody resorts to man:rc.subr[8] in [.filename]#rc.d# scripts. We are not going to be an exception.
es: &#10123; En [.filename]#/etc/rc.subr#, se definen un número de funciones man:sh[1] para que las use el script [.filename]#rc.d#. Las funciones están documentadas en man:rc.subr[8]. Aunque es teóricamente posible escribir un script [.filename]#rc.d# sin llegar a usar man:rc.subr[8], sus funciones han demostrado ser extremadamente útiles y hacen el trabajo un orden de magnitud más fácil. Así que no es una sorpresa que todo el mundo recurra a man:rc.subr[8] en los scripts de [.filename]#rc.d#. Nosotros no vamos a ser una excepción.
pt_br: &#10123; Em [.filename]#/etc/rc.subr#, uma série de funções man:sh[1] estão definidas para serem utilizadas por um script [.filename]#rc.d#. As funções estão documentadas em man:rc.subr[8]. Embora seja teoricamente possível escrever um script [.filename]#rc.d# sem nunca usar o man:rc.subr[8], suas funções provam ser extremamente úteis e tornam o trabalho uma ordem de magnitude mais fácil. Portanto, não é surpresa que todo mundo recorra ao man:rc.subr[8] em scripts [.filename]#rc.d#. Não seremos uma exceção.
ru: &#10123; В файле [.filename]#/etc/rc.subr# определено несколько функций man:sh[1], которые могут использоваться скриптами [.filename]#rc.d#. Эти функции описаны в man:rc.subr[8]. Хотя теоретически возможно написать скрипт [.filename]#rc.d# без использования man:rc.subr[8], его функции оказываются чрезвычайно полезными и значительно упрощают задачу. Поэтому неудивительно, что все используют man:rc.subr[8] в скриптах [.filename]#rc.d#. Мы не будем исключением.

source: An [.filename]#rc.d# script must "source"[.filename]#/etc/rc.subr# (include it using "`.`") _before_ it calls man:rc.subr[8] functions so that man:sh[1] has an opportunity to learn the functions. The preferred style is to source [.filename]#/etc/rc.subr# first of all.
es: Un script [.filename]#rc.d# debe incluir [.filename]#/etc/rc.subr# (utilizando "`.`") _antes_ de llamar a funciones de man:rc.subr[8] de forma que man:sh[1] tenga una oportunidad para saber acerca de las funciones. El estilo preferido es hacer "source" de [.filename]#/etc/rc.subr# antes de nada.
pt_br: Um script [.filename]#rc.d# deve fazer o "source" do [.filename]#/etc/rc.subr# (inclua-o usando "`.`") _antes_ de chamar as funções man:rc.subr[8] para que o man:sh[1] tenha a oportunidade de aprender as funções. O estilo preferido é incluir o [.filename]#/etc/rc.subr# antes de tudo.
ru: Файл [.filename]#rc.d# должен "подгрузить" ([.filename]#/etc/rc.subr#, включить его с помощью "`.`") _до_ вызова функций man:rc.subr[8], чтобы у man:sh[1] была возможность знать об этих функциях заранее. Предпочтительный стиль — подгружать [.filename]#/etc/rc.subr# в самом начале.

source: Some useful functions related to networking are provided by another include file, [.filename]#/etc/network.subr#.
es: Algunas funciones útiles relacionadas con redes son proporcionadas por otro archivo de inclusión, [.filename]#/etc/network.subr#.
pt_br: Algumas funções úteis relacionadas à rede são fornecidas por outro arquivo de inclusão, o [.filename]#/etc/network.subr#.
ru: Некоторые полезные функции, связанные с сетью, предоставляются другим включаемым файлом — [.filename]#/etc/network.subr#.

source: &#10124; [[name-var]]The mandatory variable `name` specifies the name of our script. It is required by man:rc.subr[8]. That is, each [.filename]#rc.d# script _must_ set `name` before it calls man:rc.subr[8] functions.
es: &#10124; [[name-var]] La variable obligatoria `name` especifica el nombre de nuestro script. Es un requisito de man:rc.subr[8]. Es decir, cada script [.filename]#rc.d# _debe establecer_ `name` antes de llamar a las funciones de man:rc.subr[8].
pt_br: &#10124; A variável obrigatória `name` especifica o nome do nosso script. Ela é exigida pelo man:rc.subr[8]. Isso significa que cada script [.filename]#rc.d# _deve_ definir `name` antes de chamar funções do man:rc.subr[8].
ru: &#10124; [[name-var]]Обязательная переменная `name` определяет имя нашего скрипта. Она требуется man:rc.subr[8]. То есть, каждый скрипт в [.filename]#rc.d# _должен_ установить `name` перед вызовом функций man:rc.subr[8].

source: Now it is the right time to choose a unique name for our script once and for all. We will use it in a number of places while developing the script. The content of the name variable needs to match the script name, some parts of FreeBSD (e.g., crossref:rc-scripting[rcng-service-jails, service jails] and the cpuset feature of the rc framework) depend upon this. As such the filename shall also not contain characters which may be troublesome in scripting (e.g., do not use a hyphen "-" and others).
ru: Теперь самое время раз и навсегда выбрать уникальное имя для нашего скрипта. Мы будем использовать его в нескольких местах при разработке скрипта. Содержимое переменной name должно соответствовать имени скрипта, так как некоторые части FreeBSD (например, crossref:rc-scripting[rcng-service-jails, сервисные клетки (jail)] и функция cpuset в rc framework) зависят от этого. Таким образом, имя файла также не должно содержать символов, которые могут вызвать проблемы в скриптах (например, не используйте дефис "-" и другие).

source: The current style of [.filename]#rc.d# scripting is to enclose values assigned to variables in double quotes. Keep in mind that it is just a style issue that may not always be applicable. You can safely omit quotes from around simple words without man:sh[1] metacharacters in them, while in certain cases you will need single quotes to prevent any interpretation of the value by man:sh[1]. A programmer should be able to tell the language syntax from style conventions and use both of them wisely.
es: El estilo actual de los scripts [.filename]#rc.d# es englobar los valores asignados a variables entre comillas dobles. Ten en cuenta que esto es sólo una cuestión de estilo y que podría no ser aplicable siempre. Puedes omitir las comillas de forma segura alrededor de palabras sencillas que no contengan metacaracteres de man:sh[1], mientras que en ciertos casos necesitarás comillas simples para evitar cualquier interpretación del valor por parte de man:sh[1]. Un programador debería ser capaz de distinguir la sintaxis del lenguaje de las convenciones de estilo y aplicar ambas de forma apropiada.
pt_br: O estilo atual de escrita de scripts [.filename]#rc.d# é envolver os valores atribuídos às variáveis em aspas duplas. Tenha em mente que isso é apenas uma questão de estilo que nem sempre é aplicável. Você pode seguramente omitir as aspas ao redor de palavras simples sem metacaracteres man:sh[1], enquanto em certos casos você precisará de aspas simples para evitar qualquer interpretação do valor por man:sh[1]. Um programador deve ser capaz de distinguir a sintaxe da linguagem das convenções de estilo e usá-las sabiamente.
ru: Текущий стиль написания скриптов в [.filename]#rc.d# заключается в заключении значений, присваиваемых переменным, в двойные кавычки. Имейте в виду, что это всего лишь вопрос стиля, который может быть не всегда применим. Вы можете безопасно опустить кавычки вокруг простых слов без метасимволов man:sh[1], тогда как в некоторых случаях вам понадобятся одинарные кавычки, чтобы предотвратить интерпретацию значения man:sh[1]. Программист должен уметь отличать синтаксис языка от стилевых соглашений и разумно использовать и то, и другое.

source: &#10125; The main idea behind man:rc.subr[8] is that an [.filename]#rc.d# script provides handlers, or methods, for man:rc.subr[8] to invoke. In particular, `start`, `stop`, and other arguments to an [.filename]#rc.d# script are handled this way. A method is a man:sh[1] expression stored in a variable named `argument_cmd`, where _argument_ corresponds to what can be specified on the script's command line. We will see later how man:rc.subr[8] provides default methods for the standard arguments.
es: &#10125; La idea principal detrás de man:rc.subr[8] es que un script [.filename]#rc.d# proporciona manejadores, o métodos, para que los invoque man:rc.subr[8]. En particular, `start`, `stop`, y otros argumentos pasados a un script [.filename]#rc.d# se manejan de esta forma. Un método es una expresión man:sh[1] que se almacena en una variable llamada `argument_cmd`, donde _argument_ corresponde a lo que se puede especificar en la línea de comando del script. Luego veremos cómo man:rc.subr[8] proporciona métodos por defecto para los argumentos estándar.
pt_br: &#10125; Cada script [.filename]#rc.d# fornece manipuladores, ou métodos, para o man:rc.subr[8] invocar. Em particular, `start`, `stop`, e outros argumentos para um script [.filename]#rc.d# são manipulados desta forma. Um método é uma expressão man:sh[1] armazenada em uma variável chamada `argument_cmd`, onde _argument_ corresponde ao que pode ser especificado na linha de comando do script. Veremos mais tarde como o man:rc.subr[8] fornece métodos padrão para os argumentos padrão.
ru: &#10125; Основная идея man:rc.subr[8] заключается в том, что скрипт [.filename]#rc.d# предоставляет обработчики (или методы) для вызова man:rc.subr[8]. В частности, аргументы `start`, `stop` и другие, передаваемые в скрипт [.filename]#rc.d#, обрабатываются таким образом. Метод представляет собой выражение man:sh[1], сохранённое в переменной с именем `argument_cmd`, где _argument_ соответствует тому, что может быть указано в командной строке скрипта. Далее мы увидим, как man:rc.subr[8] предоставляет стандартные методы для типовых аргументов.

source: To make the code in [.filename]#rc.d# more uniform, it is common to use `${name}` wherever appropriate. Thus a number of lines can be just copied from one script to another.
es: Para hacer el código en [.filename]#rc.d# más uniforme, es común usar `${name}` donde sea apropiado. Por tanto, es posible simplemente copiar varias líneas de un script a otro.
pt_br: Para tornar o código em [.filename]#rc.d# mais uniforme, é comum usar `${name}` sempre que apropriado. Assim, várias linhas podem ser simplesmente copiadas de um script para outro.
ru: Чтобы сделать код в [.filename]#rc.d# более единообразным, обычно используют `${name}` везде, где это уместно. Таким образом, множество строк можно просто копировать из одного скрипта в другой.

source: &#10126; We should keep in mind that man:rc.subr[8] provides default methods for the standard arguments. Consequently, we must override a standard method with a no-op man:sh[1] expression if we want it to do nothing.
es: &#10126; Deberíamos tener en cuenta que man:rc.subr[8] proporciona métodos por defecto para los argumentos estándar. Consecuentemente, debemos sobrescribir un método con una expresión no-op de man:sh[1] si queremos que no haga nada.
pt_br: &#10126; Devemos ter em mente que o man:rc.subr[8] fornece métodos padrões para os argumentos padrões. Consequentemente, devemos substituir um método padrão por uma expressão man:sh[1] sem efeito se quisermos que ele não faça nada.
ru: &#10126; Следует помнить, что man:rc.subr[8] предоставляет методы по умолчанию для стандартных аргументов. Следовательно, если мы хотим, чтобы стандартный метод ничего не делал, мы должны переопределить его с помощью no-op man:sh[1] выражения.

source: &#10127; The body of a sophisticated method can be implemented as a function. It is a good idea to make the function name meaningful.
es: &#10127; El cuerpo de un método sofisticado se puede implementar como una función. Es una buena idea que el nombre de la función tenga un significado.
pt_br: &#10127; O corpo de um método sofisticado pode ser implementado como uma função. É uma boa ideia dar um nome significativo à função.
ru: &#10127; Тело сложного метода может быть реализовано в виде функции. Хорошей практикой является использование осмысленного имени функции.

source: It is strongly recommended to add the prefix `${name}` to the names of all functions defined in our script so they never clash with the functions from man:rc.subr[8] or another common include file.
es: Se recomienda encarecidamente añadir el prefijo `${name}` a los nombres de todas las funciones definidas en nuestro script de forma que nunca colisionen con funciones de man:rc.subr[8] o cualquier otro fichero que se incluya de forma habitual.
pt_br: Recomenda-se fortemente adicionar o prefixo `${name}` aos nomes de todas as funções definidas no nosso script para que nunca entrem em conflito com as funções de man:rc.subr[8] ou outro arquivo de inclusão comum.
ru: Настоятельно рекомендуется добавлять префикс `${name}` к именам всех функций, определенных в нашем скрипте, чтобы они никогда не конфликтовали с функциями из man:rc.subr[8] или другого общего включаемого файла.

source: &#10128; This call to man:rc.subr[8] loads man:rc.conf[5] variables. Our script makes no use of them yet, but it still is recommended to load man:rc.conf[5] because there can be man:rc.conf[5] variables controlling man:rc.subr[8] itself.
es: &#10128; Esta llamada a man:rc.subr[8] carga las variables de man:rc.conf[5]. Nuestro script no las utiliza todavía, pero aún así se recomienda cargar man:rc.conf[5] porque puede haber variables de man:rc.conf[5] controlando al propio man:rc.subr[8].
pt_br: &#10128; Essa chamada para o man:rc.subr[8] carrega as variáveis do man:rc.conf[5]. Nosso script ainda não as usa, mas ainda é recomendável carregar o man:rc.conf[5] porque pode haver variáveis do man:rc.conf[5] controlando o man:rc.subr[8] em si.
ru: &#10128; Этот вызов man:rc.subr[8] загружает переменные man:rc.conf[5]. Наш скрипт пока их не использует, но всё равно рекомендуется загружать man:rc.conf[5], потому что могут быть переменные man:rc.conf[5], управляющие самим man:rc.subr[8].

source: &#10129; Usually this is the last command in an [.filename]#rc.d# script. It invokes the man:rc.subr[8] machinery to perform the requested action using the variables and methods our script has provided.
es: &#10129; Normalmente este es el último comando en un script [.filename]#rc.d#. Invoca la maquinaria de man:rc.subr[8] para realizar la acción solicitada utilizando las variables y métodos que ha proporcionado nuestro script.
pt_br: &#10129; Geralmente, esse é o último comando em um script [.filename]#rc.d#. Ele invoca a maquinaria do man:rc.subr[8] para realizar a ação solicitada usando as variáveis e métodos que o nosso script forneceu.
ru: &#10129; Обычно это последняя команда в скрипте [.filename]#rc.d#. Она вызывает механизм man:rc.subr[8] для выполнения запрошенного действия, используя переменные и методы, предоставленные нашим скриптом.

source: A configurable dummy script
es: Un script ficticio configurable
pt_br: Um script fictício configurável
ru: Настраиваемый фиктивный скрипт

source: Now let us add some controls to our dummy script. As you may know, [.filename]#rc.d# scripts are controlled with man:rc.conf[5]. Fortunately, man:rc.subr[8] hides all the complications from us. The following script uses man:rc.conf[5] via man:rc.subr[8] to see whether it is enabled in the first place, and to fetch a message to show at boot time. These two tasks in fact are independent. On the one hand, an [.filename]#rc.d# script can just support enabling and disabling its service. On the other hand, a mandatory [.filename]#rc.d# script can have configuration variables. We will do both things in the same script though:
es: Ahora añadamos algunos controles a nuestro script de prueba. Como sabes, los scripts [.filename]#rc.d# están controlados por man:rc.conf[5]. Afortunadamente, man:rc.subr[8] nos oculta todas las complicaciones. El siguiente script usa man:rc.conf[5] mediante man:rc.subr[8] para ver en primer lugar si está habilitado, y para obtener un mensaje que mostrar en el momento del arranque. Estas dos tareas son de hecho independientes. En un lado, un script [.filename]#rc.d# puede simplemente soportar la activación y desactivación de su servicio. Por otro lado, un script [.filename]#rc.d# obligatorio puede tener las variables de configuración. Sin embargo, nosotros haremos ambas cosas en el mismo script:
pt_br: Agora vamos adicionar alguns controles ao nosso script fictício. Como você deve saber, scripts [.filename]#rc.d# são controlados com o man:rc.conf[5]. Felizmente, o man:rc.subr[8] oculta todas as complicações para nós. O script a seguir usa o man:rc.conf[5] por meio do man:rc.subr[8] para verificar se está habilitado em primeiro lugar e para buscar uma mensagem para ser exibida na inicialização. Essas duas tarefas, na verdade, são independentes. Por um lado, um script [.filename]#rc.d# pode apenas suportar a habilitação e desabilitação do seu serviço. Por outro lado, um script [.filename]#rc.d# obrigatório pode ter variáveis de configuração. No entanto, faremos as duas coisas no mesmo script:
ru: Теперь добавим некоторые элементы управления в наш тестовый скрипт. Как вам может быть известно, скрипты [.filename]#rc.d# управляются с помощью man:rc.conf[5]. К счастью, man:rc.subr[8] скрывает от нас все сложности. Следующий скрипт использует man:rc.conf[5] через man:rc.subr[8], чтобы проверить, включен ли он вообще, и получить сообщение для отображения во время загрузки. Эти две задачи на самом деле независимы. С одной стороны, скрипт [.filename]#rc.d# может просто поддерживать включение и выключение своего сервиса. С другой стороны, обязательный скрипт [.filename]#rc.d# может иметь переменные конфигурации. Однако мы реализуем обе возможности в одном скрипте:

source: What changed in this example?
es: ¿Qué cambió en este ejemplo?
pt_br: O que mudou neste exemplo?
ru: Что изменилось в этом примере?
