Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/preface/_index.po
Languages: ru

source: Preface about the FreeBSD Documentation Project
ru: Предисловие о проекте документации FreeBSD

source: Preface
ru: Предисловие

source: Shell Prompts
ru: Приглашения командной оболочки

source: This table shows the default system prompt and superuser prompt. The examples use these prompts to indicate which type of user is running the example.
ru: В этой таблице показаны приглашения системы по умолчанию и приглашение суперпользователя. В примерах используются эти приглашения, чтобы указать, от какого типа пользователя выполняется пример.

source: User
ru: Пользователь

source: Prompt
ru: Приглашение

source: Normal user
ru: Обычный пользователь

source: Typographic Conventions
ru: Типографические соглашения

source: This table describes the typographic conventions used in this book.
ru: Эта таблица описывает типографские соглашения, используемые в этой книге.

source: Meaning
ru: Значение

source: Examples
ru: Примеры

source: The names of commands.
ru: Имена команд.

source: Use `ls -l` to list all files.
ru: Используйте `ls -l` для вывода списка всех файлов.

source: The names of files.
ru: Имена файлов.

source: Edit [.filename]#.login#.
ru: Измените файл [.filename]#.login#.

source: On-screen computer output.
ru: Вывод компьютера на экран.

source: [source,shell] .... You have mail. ....
ru: [source,shell] .... У вас есть почта. ....

source: What the user types, contrasted with on-screen computer output.
ru: Что вводит пользователь, в отличие от выводимого компьютером на экран.

source: [source,shell] .... % date +"The time is %H:%M" The time is 09:18 ....
ru: [source,shell] .... % date +"Время: %H:%M" Время: 09:18 ....

source: Manual page references.
ru: Ссылки на руководства.

source: Use man:su[1] to change user identity.
ru: Используйте man:su[1] для смены пользователя.

source: User and group names.
ru: Имена пользователей и групп.

source: Only `root` can do this.
ru: Только `root` может это сделать.

source: Emphasis.
ru: Выделение текста.

source: The user _must_ do this.
ru: Пользователь _обязан_ сделать это.

source: Text that the user is expected to replace with the actual text.
ru: Текст, который пользователь должен заменить на фактический текст.

source: To search for a keyword in the manual pages, type `man -k _keyword_`
ru: Для поиска ключевого слова в руководствах введите `man -k _ключевое_слово_`

source: Environment variables.
ru: Переменные окружения.

source: `$HOME` is set to the user's home directory.
ru: `$HOME` устанавливается в домашний каталог пользователя.

source: Notes, Tips, Important Information, Warnings, and Examples
ru: Примечания, Советы, Важная информация, Предупреждения и Примеры

source: Notes, warnings, and examples appear within the text.
ru: Заметки, предупреждения и примеры выделены в тексте.

source: Notes are represented like this, and contain information to take note of, as it may affect what the user does.
ru: Заметки представлены следующим образом и содержат информацию, на которую следует обратить внимание, так как она может повлиять на действия пользователя.

source: Tips are represented like this, and contain information helpful to the user, such as showing an easier way to do something.
ru: Советы представлены таким образом и содержат полезную для пользователя информацию, например, показывая более простой способ выполнения чего-либо.

source: Important information is represented like this. Typically, these show extra steps the user may need to take.
ru: Важная информация представлена таким образом. Обычно это дополнительные шаги, которые может потребоваться выполнить пользователю.

source: Warnings are represented like this, and contain information warning about possible damage if the instructions are not followed. This damage may be physical, to the hardware or the user, or it may be non-physical, such as the inadvertent deletion of important files.
ru: Предупреждения выглядят так и содержат информацию о возможном ущербе, если инструкции не будут соблюдены. Этот ущерб может быть физическим — для оборудования или пользователя — или нефизическим, например, случайным удалением важных файлов.

source: A Sample Example
ru: Пример примера

source: Examples are represented like this, and typically contain examples showing a walkthrough, or the results of a particular action.
ru: Примеры представлены следующим образом и обычно содержат пошаговые инструкции или результаты выполнения определённых действий.

source: Acknowledgments
ru: Благодарности

source: My thanks to Sue Blake, Patrick Durusau, Jon Hamilton, Peter Flynn, and Christopher Maden, who took the time to read early drafts of this document and offer many valuable comments and criticisms.
ru: Моя благодарность Сью Блейк, Патрику Дурусо, Джону Гамильтону, Питеру Флинну и Кристоферу Мэдену, которые нашли время прочитать ранние черновики этого документа и предоставили множество ценных замечаний и критики.
