freebsd/freebsd-doc/documentation/manual-pages/ja/man7/term.7
.\"***************************************************************************
.\" Copyright (c) 1998-2000,2002 Free Software Foundation, Inc.              *
.\"                                                                          *
.\" Permission is hereby granted, free of charge, to any person obtaining a  *
.\" copy of this software and associated documentation files (the            *
.\" "Software"), to deal in the Software without restriction, including      *
.\" without limitation the rights to use, copy, modify, merge, publish,      *
.\" distribute, distribute with modifications, sublicense, and/or sell       *
.\" copies of the Software, and to permit persons to whom the Software is    *
.\" furnished to do so, subject to the following conditions:                 *
.\"                                                                          *
.\" The above copyright notice and this permission notice shall be included  *
.\" in all copies or substantial portions of the Software.                   *
.\"                                                                          *
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS  *
.\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               *
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   *
.\" IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   *
.\" DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    *
.\" OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    *
.\" THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               *
.\"                                                                          *
.\" Except as contained in this notice, the name(s) of the above copyright   *
.\" holders shall not be used in advertising or otherwise to promote the     *
.\" sale, use or other dealings in this Software without prior written       *
.\" authorization.                                                           *
.\"***************************************************************************
.\"
.\" $Id: term.7,v 1.6 2002-12-09 03:41:44 horikawa Exp $
.\" $FreeBSD$
.TH TERM 7
.ds n 5
.ds d /usr/share/misc/terminfo
.SH 名称
term \- 端末タイプの命名規則
.SH 解説
.PP
環境変数 \fBTERM\fR は通常、
あなたが使用中の端末・コンソール・ディスプレイデバイスの
いずれかのタイプ名を含むはずです。
この情報は、エディタやメーラを含む、画面指向プログラムには非常に重要です。
.PP
デフォルトの \fBTERM\fR の値は、
\fB/etc/inittab\fR (Linux や System V 系の UNIX) または
\fB/etc/ttys\fR (BSD UNIX) を使って、各回線毎に設定されます。
ワークステーションやマイクロコンピュータについては、
ほとんどの場合これで十分です。
.PP
ダイヤルアップ回線を使用する場合には、
回線に接続されるデバイスのタイプには色々なものがありえます。
古めの UNIX システムでは、ダイヤルアップ回線に
`dumb' や `dialup' というような正にダム端末タイプをあらかじめ設定します。
新しめの UNIX システムでは、
DEC VT100 互換の端末やパーソナルコンピュータでのエミュレータの普及を反映して、
`vt100' に設定するかもしれません。
.PP
近年の telnet は、ローカル側の \fBTERM\fR 環境変数をリモート側に渡します。
あなたの端末タイプについて、
リモートの terminfo エントリや termcap エントリの互換性が無い場合は
問題が発生し得ますが、このような状況は稀であり、
明示的に `vt100' をエクスポートすることによりほぼ常に問題が避けられるでしょう
(実際に VT100 上位互換のコンソール・端末・端末エミュレータを
使用していることを仮定しています)。
.PP
どのような場合でも、シェルプロファイルを使用することにより、
システムの \fBTERM\fR 設定を無視して好きなように設定することができます。
\fBtset\fP(1) ユーティリティが助けとなることもあります。
該当する tty デバイスとボーレートを基にして
端末タイプを推定したり要求したりするためのルールセットを
このコマンドへ与えることができます。
.PP
回線に対するシステムのデフォルトタイプを無視したくなるような、
(可視ベルや反転のような) オプションを組み込んだ
カスタムエントリを持っている場合には、
独自の \fBTERM\fR の値を設定するというのもよいでしょう。
.PP
端末タイプの記述は、
\*d の下に、ケーパビリティデータのファイルとして格納されています。
システムが認識する全端末名を閲覧するには、シェルから

	toe | more

としてください。
これらのケーパビリティファイルは、
取り出し速度の向上のために
(置き換えられた、古いテキストベースの \fBtermcap\fR とは異なって)
バイナリフォーマットとなっています。
エントリを調べるには、\fBinfocmp\fR(1) コマンドを使う必要があります。
これは次のように起動します:

	infocmp \fIentry-name\fR

ここで \fIentry-name\fR は調べようとするタイプの名称です
(そしてこれはケーパビリティファイルの名称であり、
名前の先頭の文字の名前を持った \*d のサブディレクトリにあります)。
このコマンドは、\fBterminfo\fR(\*n) に記述されている書式で、
ケーパビリティファイルをダンプします。
.PP
\fBterminfo\fR(\*n) 記述の最初の行は、
terminfo が端末を認識するために使用する名称を与えます。
名称は `|' (パイプバー) 文字で区切られ、
最後の名称フィールドはコンマで終ります。
最初の名称フィールドは、このタイプの\fI第一名称\fR であり、
\fBTERM\fR 設定時に使用するものです。
最後の名称フィールドは (最初のものと違う場合は)、
端末タイプの本当の記述です
(これは空白を含めることができます。他の名称は単一語であることが必要です)。
最初と最後のものの間にある名称フィールドは (もしあれば)、
端末の別名であり、通常は、互換性のために保持されている歴史的な名前です。
.PP
端末の第一名称の選択には、
第一名称を情報があって固有なものにするのに役立つような約束事があります。
以下に、端末命名のための段階的なガイドを示し、
また、端末名称をどのように解釈するのかも示します:
.PP
最初に、ルート名称を選びます。
ルート名称は、
1 個の小文字に、
最大 7 文字までの小文字または数字が続きます。
区切り文字はルート名称に使うことを避けなければなりません。
なぜなら、これらはファイル名として使われたり解釈されるからです。
また、シェルのメタ文字 (!, $, *, ? 等) がそれらに含まれると、
奇妙で分り難い挙動を引き起こすかもしれないからです。
スラッシュ (/) や、ファイルシステムが解釈する可能性のある他の文字
(\e, $, [, ]) は特に危険です
(terminfo はプラットフォームに依存しません。
特殊文字を含む名前を選ぶと、
将来移植されたシステム上のユーザが苦労することになるかもしれません)。
ドット (.) 文字は、ルート名称に 1 個までである限りは、比較的安全です。
歴史的な terminfo 名称には、ドットを使用しているものがあります。
.PP
ほぼ常に、端末やワークステーションコンソールタイプのルート名称は、
ベンダの接頭辞 (Hewlett-Packard では \fBhp\fR、
Wyse では \fBwy\fR、AT&T 端末では \fBatt\fR 等) が付くか、
端末回線の共通名称 (DEC の VT シリーズ端末では \fBvt\fR、
Sun Microsystems のワークステーションコンソールでは \fBsun\fR、
ADDS Regent シリーズでは \fBregent\fR) であるべきです。
terminfo ツリーを列挙すれば、
どの接頭辞が既に一般的に使用されているかが分かります。
ルート名称の接頭辞には、適切な場合にはモデル番号が続き、
\fBvt100\fR, \fBhp2621\fR, \fBwy50\fR となります。
.PP
PC-Unix コンソールタイプのルート名称は、OS 名称、
すなわち \fBlinux\fR, \fBbsdos\fR, \fBfreebsd\fR, \fBnetbsd\fR
であるべきです。
決して \fBconsole\fR やその他の総称的なものであってはなりません。
なぜなら、マルチプラットフォーム環境では混乱の原因となるからです!
モデル番号が続く場合、
OS のリリースレベルかコンソールドライバのリリースレベルを示すべきです。
.PP
端末エミュレータ
(ANSI 標準か vt100 タイプのどれにも適合していないとみなされる場合には)
のルート名称は、
プログラム名称か、容易に認識可能な省略名称であるべきです
(すなわち \fBversaterm\fR, \fBctrm\fR)。
.PP
ルート名称に続き、
ハイフンで区切った適当な数の機能を表す接尾辞を追加することが可能です。
.TP 5
2p
メモリを 2 ページ持ちます。同様に 4p, 8p 等。
.TP 5
mc
マジッククッキー。
端末によっては (特に古い Wyse)、
バグか故障のために (lossage)
複数属性をサポートするときにマジッククッキーを使ってしまいます。
(訳注: モードを変更したときにマジッククッキーと呼ばれる
1つか複数のスペースを表示してしまう端末があったらしい)
.\" lossage - The result of a bug or malfunction (from Jargon)
.\" <horikawa@jp.FreeBSD.org> Feb 26, 2000
このような端末が基とするエントリは、たいてい
この接尾辞を持ち、
複数の属性をサポートするためにマジッククッキーを使用する
他のエントリとペアになります。
.TP 5
-am
自動マージンを有効にします (右マージンは回り込みます)
.TP 5
-m
単色モード - カラーサポートを抑制します
.TP 5
-na
矢印キー無し - termcap は、端末に付属する矢印キーを無視するので、
ユーザが矢印キーをローカルに使用可能となります
.TP 5
-nam
自動マージン無し - am ケーパビリティを抑制します
.TP 5
-nl
ラベル無し - ソフトラベルを抑制します
.TP 5
-nsl
状態行無し - 状態行を抑制します
.TP 5
-pp
使用できるプリンタポートがあります
.TP 5
-rv
反転モードの端末 (白地に黒)
.TP 5
-s
状態行の有効化
.TP 5
-vb
ビープではなく可視ベル (フラッシュ) を使用
.TP 5
-w
幅広; 端末は 132 桁モード
.PP
伝統的には、端末タイプが行数を指定することを目的とした変形タイプである場合、
行数のサフィックスを先に書きます。
例えば FuBarCo モデル 2317 端末の 30 行モードの反転ビデオ用では、
最適な書式は \fBfubar-30-rv\fR となります (`fubar-rv-30' ではありません)。
.PP
スタンドアロンエントリとしてではなく、
\fBuse\fP ケーパビリティを使用して他のエントリに挿入される部品として
書かれた端末タイプは、
ダッシュの代わりにプラス記号が埋め込まれて区別されます。
.PP
表示制御に端末タイプを使用するコマンドは、
しばしば、端末名引数を取る -T オプションを受け付けます。
このようなプログラムでは、-T オプションを指定しないときは、
\fBTERM\fR 環境変数を使用するべきです。
.SH 移植性
古い System V UNIX との最大の互換性を維持するために、
名前と別名は最初の 14 文字で区別可能とすべきです。
.SH 関連ファイル
.TP 5
\*d/?/*
コンパイルされた端末ケーパビリティデータベース
.TP 5
/etc/inittab
tty 回線初期化 (AT&T 系の UNIX)
.TP 5
/etc/ttys
tty 回線初期化 (BSD 系の UNIX)
.SH 関連項目
\fBcurses\fR(3X), \fBterminfo\fR(\*n), \fBterm\fR(\*n)
.\"#
.\"# The following sets edit modes for GNU EMACS
.\"# Local Variables:
.\"# mode:nroff
.\"# fill-column:79
.\"# End:
