Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/developers-handbook/testing/_index.po
Languages: ru

source: Summaries and logs from the official build servers are available online at http://tinderbox.FreeBSD.org[http://tinderbox.FreeBSD.org], hosted by {des} and set up as follows:
ru: Сводки и журналы с официальных серверов сборки доступны в сети по адресу http://tinderbox.FreeBSD.org[http://tinderbox.FreeBSD.org], размещены на {des} и настроены следующим образом:

source: A man:cron[8] job checks the build servers at regular intervals and downloads any new log files using man:rsync[1].
ru: Задание man:cron[8] проверяет серверы сборки через регулярные интервалы и загружает все новые файлы журналов с помощью man:rsync[1].

source: Apache is set up to use [.filename]#index.cgi# as `DirectoryIndex`.
ru: Apache настроен на использование [.filename]#index.cgi# в качестве `DirectoryIndex`.
